{"title":"MindNode Pro 1.9","uid":7485230,"size":6081227,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:0012bc59927989625a135883f9fb33f468a867c1&amp;dn=MindNode+Pro+1.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"openarena","files":-1,"time":1343520951,"description":"MindNode Pro is an elegant and simple-to-use mindmapping application for the Macintosh that help to\nCollect, classify and structure ideas.\nOrganize, study andproblems.\n\nMind maps can be used for many different tasks - including to-do lists, brainstorming, holiday planning, research, writing, project management - and in many different- school, meetings, workspace.\n\nFeatures:\nNode Well. New nodes are created by simply dragging them out of the node wells. There is no need to access the toolbar or the application menu.\nImage andFile Links. MindNode Pro 1.5 adds the ability to add images to nodes andthe content of a linked file directly on the\nCross Connections. Cross Connections are secondary connections and unrelated to normal branches. They allow toa relationship between any two nodes on the mind map, which are otherwise unrelated.\nFolding. Collapsing a sub-branch is as easy as creating a new node in MindNode Pro. Simply press the option key, and the node well turns into the folding icon, allowing you to fold a sub-branch.\nSharing. Import and export documents directly from MindNode (touch).\nMultiple Mind Maps. The ability to create multiple mind maps on onemakes MindNode Pro an ideal tool for brainstorming sessions.\nConstrain node width and resize nodes. MindNode allows to automatically constrain the width of a node and to resize the node directly on the\n\n\n\nWhat's New\n1.9:\n\nMindNode Pro 1.9 now requires Mac OS 10.7.3 and later. Pleasethat yourof OS X is up to date!\n\nDue to restrictions enforced by Apple, iCloud is only supported in the Mac App Storeof MindNode Pro!\n\nRefreshedDesign\n\nCompletely redesigned toolbar icons to better integrate with the new OS Xstyle.\nFull support for retina screens on Mountain Lion.\n\nOther new features:\n\nShare Sheets to easily share documents using Mail, Messages and AirDrop\nAdopts the new system gestures for QuickLook on Mountain Lion\nNew zoom control for Lion and Mountain Lion.\nUnified node drawing and Smart Layouton Mac and iOS.\nOther noteworthy changes:\n\nMindNode now requires Lion or Mountain Lion.\niChat Theater is no longer supported.\nThe default file format is now a file bundle instead of a zip file.\n\nRequirements\nIntel, Mac OS X 10.6 or later.","torrent":{"xt":"urn:btih:0012bc59927989625a135883f9fb33f468a867c1","amp;dn":"MindNode+Pro+1.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0012bc59927989625a135883f9fb33f468a867c1","infoHashBuffer":{"type":"Buffer","data":[0,18,188,89,146,121,137,98,90,19,88,131,249,251,51,244,104,168,103,193]},"announce":[],"urlList":[]}}