{"title":"The Life of Emile Zola (1937) Paul Muni Eng","uid":4899164,"size":733434255,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00287b307aaaf9baf00c394e00db3af077500eda&amp;dn=The+Life+of+Emile+Zola+%281937%29+Paul+Muni+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"johnefp","files":-1,"time":1242512839,"description":"Plot Synopsis  \tby Hal Erickson\n\nThe second of Paul Muni's biographical films for Warner Bros., the Oscar-winning The Life of Emile Zola is by far the best, even allowing for the dramatic license taken with the material. When first we meet French novelist and essayist Zola, he is starving in a Parisian garret with his painter friend, Paul Cezanne. Each time Zola attempts to write &quot;the truth,&quot; he is stymied by governmental censors. Still, he is able to achieve both fame and fortune with the publication of &quot;Nana,&quot; an unardorned and best-selling tale of a prostitute (whom we can safely assume was not quite as likeable or attractive as Erin O'Brien-Moore, who plays the novel's &quot;role model&quot;). The lion's share of the film is devoted to Zola's attempts to clear the reputation of Army captain Alfred Dreyfus (Joseph Schildkraut), who has been framed on a charge of treason by his superiors and condemned to Devil's Island. Publishing his famous manifesto &quot;J'accuse,&quot; Zola leaves himself wide open for public condemnation and criminal prosecution. Though he delivers a brilliant self-defense in court, Zola is found guilty. Forced to flee to England, he continues railing against the unjust, corrupt military establishment, eventually forcing a retrial and exoneration of Dreyfus. Alas, Zola is killed in a freak accident at home before he can meet the liberated Dreyfus. At his funeral, Emile Zola is eulogized by Anatole France (Morris Carnovsky), who refers to the fallen crusader as &quot;a moment of the conscience of man.&quot; For various reasons -- some dramatic, some legal -- the actual facts of &quot;L'affaire Dreyfus&quot; are altered by the Norman Reilly Raine/Heinz Herald/Geza Herczeg screenplay.\n\nThe fact that Dreyfus was railroaded because he was Jewish is obscured; in fact, except for a very brief visual reference, the word &quot;Jew&quot; is never mentioned. Only those villains whose names were a matter of public record (Major Dort, Major Esterhazy) are specifically identified. Others are referred to as the Chief of Staff, the Minister of War, etc. to avoid lawsuits from their descendants (remember that the events depicted in the film, most of which take place between 1894 and 1902, were still within living memory in 1937). As for Dreyfus himself, he was not freed and restored to rank in 1902, the year of Zola's death, but in 1906-after being found guilty again in an 1899 retrial (Dreyfus died in 1935, outliving everyone else involved in the case). These historical gaffes can be forgiven in the light of the film's overall message: that a single small, clear voice can fight City Hall. If for nothing else, The Life of Emile Zola deserves classic status due to Paul Muni's towering performance, most notably in the unforgettable summation scene: &quot;By all that I have done for France, by my works -- by all that I have written, I swear to you that Dreyfus is innocent. May all that melt away -- may my name be forgotten, if Dreyfus is not innocent. He is innocent.&quot; \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0029146/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0029146/&lt;/a&gt;\n\n\nSubtitles:\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/imdbid-29146/sublanguageid-all&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/imdbid-29146/sublanguageid-all&lt;/a&gt;\n\n\nDirector:\nWilliam Dieterle\n\n\n\n\tPaul Muni\t... \tEmile Zola\n\tGale Sondergaard\t... \tLucie Dreyfus\n\tJoseph Schildkraut\t... \tCapt. Alfred Dreyfus\n\tGloria Holden\t... \tAlexandrine Zola\n\tDonald Crisp\t... \tMaitre Labori\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:56:06\nMovie complete : Yes\n\n[Video]\nResolution : 512x384\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 770 Kbps\nQuality Factor : 0.17 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 1\nSample Rate : 48000 Hz\nBitRate : 73 Kbps","torrent":{"xt":"urn:btih:00287b307aaaf9baf00c394e00db3af077500eda","amp;dn":"The+Life+of+Emile+Zola+%281937%29+Paul+Muni+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00287b307aaaf9baf00c394e00db3af077500eda","infoHashBuffer":{"type":"Buffer","data":[0,40,123,48,122,170,249,186,240,12,57,78,0,219,58,240,119,80,14,218]},"announce":[],"urlList":[]}}