{"title":"Naguib Mahfouz - Nobel Prize in Literature, 1988 (35 books)","uid":11720585,"size":62176879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0063758f03c0df9672658381e9a00cc1e6dfd783&amp;dn=Naguib+Mahfouz+-+Nobel+Prize+in+Literature%2C+1988+%2835+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"workerbee","files":72,"time":1424797623,"description":"\n         * * This is an revised and enlarged version of an earlier torrent * *\n\n\nNAGUIB MAHFOUZ (1911-2006) was an Egyptian novelist, playwright and screenwriter.  In 1988 he became the first writer in Arabic to be awarded the Nobel Prize for Literature in 1988.  The prize citation praised Mahfouz &quot;who, through works rich in nuance -- now clear-sightedly realistic, now evocatively ambiguous -- has formed an Arabian narrative art that applies to all mankind.&quot;\n\nMahfouz is regarded as one of the first contemporary writers of Arabic literature, along with Tawfiq el-Hakim, to explore themes of existentialism.  He published 34 novels, over 350 short stories, dozens of movie scripts, and five plays over a 70-year career.  Many of his works have been made into Egyptian and foreign films.  A student of philosophy and an avid reader, his works range from reimaginings of ancient myths to subtle commentaries on contemporary Egyptian politics and culture.  Mahfouz's stories are almost always set in the heavily populated urban quarters of Cairo, where his characters, mostly ordinary people, try to cope with the modernization of society and the temptations of Western values.\n\nHis most famous work, the epic Cairo Trilogy, traces three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence.  PALACE WALK (1956) introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons -- the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal.  Al-Sayyid Ahmad's rebellious children struggle to move beyond his domination in PALACE OF DESIRE (1957), as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s.  SUGAR STREET (1957) brings Mahfouz's vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.\n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n* ADRIFT ON THE NILE (Anchor, 1994).  Translated by Frances Liardet. -- ePUB\n\n* AKHENATEN: Dweller in Truth (Anchor, 2000).  Translated by Tagreid Abu-Hassabo. -- ePUB\n\n* AUTUMN QUAIL (American University in Cairo, 1985).  Translated by Roger Allen; revised by John Rodenbeck. -- PDF\n\n* BEFORE THE THRONE: Dialogues with Egypt's Great from Menes to Anwar Sadat (Anchor, 2009).  Translated by Raymond Stock. -- ePUB\n\n* THE BEGGAR (Doubleday, 1990).  Translated by Kristin Walker Henry and Nariman Khales Naili al-Warraki. -- PDF\n\n* CAIRO MODERN (Anchor, 2009).  Translated by William H. Hutchins. -- ePUB\n\n* CHILDREN OF GEBELAAWI (Passeggiata, 1995).  Revised Augmented Edition translated by Philip Stewart.  Scanned and reproduced here with the kind permission of @pharmakate. -- PDF\n\n* CHILDREN OF THE ALLEY (Doubleday, 1996).  Translated by Peter Theroux. -- PDF\n\n* THE DAY THE LEADER WAS KILLED (American University in Cairo, 1997 / Anchor Books, 2000).  Translated by Malak Hashe. -- PDF + ePUB\n\n* THE DREAMS (Anchor, 2009).  Translated by Raymond Stock. -- ePUB\n\n* ECHOES OF AN AUTOBIOGRAPHY (Doubleday, 1997).  Translated by Denys Johnson-Davies. -- PDF\n\n* THE FINAL HOUR (American University in Cairo, 2010).  Translated by Roger Allen. -- PDF\n\n* FOUNTAIN AND TOMB (Three Continents, 1988).  Translated by Soad Sobhy, Essam Fattouh, and James Kenneson. -- PDF\n\n* THE HARAFISH (Doubleday, 1994).  Translated by Catherine Cobham. -- PDF\n\n* HEART OF THE NIGHT (American University in Cairo, 2013).  Translated by Aida A. Bamia. -- ePUB\n\n* IN THE TIME OF LOVE (American University in Cairo, 2010).  Translated by Kay Heikkinen. -- PDF\n\n* KARNAK CAFÃ‰ (Anchor, 2008).  Translated by Roger Allen. -- ePUB\n\n* KHAN AL-KHALILI (Anchor, 2011).  Translated by Roger Allen. -- ePUB\n\n* LOVE IN THE RAIN (American University in Cairo, 2011).  Translated by Nancy Roberts. -- PDF\n\n* MIDAQ ALLEY (Anchor, 1991).  Translated by Trevor La Gassick. -- ePUB\n\n* THE MIRAGE (Anchor, 2012).  Translated by Nancy Roberts. -- ePUB\n\n* MIRAMAR (Three Continents, 1990).  Translated by Fatma Moussa-Mahmoud, with original 1978 Introduction by John Fowles, and a New Critical Preface by Trevor Le Gassick. -- PDF\n\n* MORNING AND EVENING TALK (Anchor, 2007).  Translated by Christina Phillips. -- ePUB\n\n* PALACE OF DESIRE [Cairo Trilogy II] (Doubleday, 1991).  Translated by William Maynard Hutchins, Lorne M. Kenny, and Olive E. Kenny. -- PDF\n\n* PALACE WALK [Cairo Trilogy I] (Doubleday, 1990).  Translated by William Maynard Hutchins and Olive E. Kenny. -- PDF\n\n* RESPECTED SIR (Anchor, 1990).  Translated by Dr. Rasheed El-Enany. -- PDF\n\n* RHADOPIS OF NUBIA (Anchor, 2005).  Translated by Anthony Calderbank. -- ePUB\n\n* THE SEARCH (American University in Cairo, 1987).  Translated by Mohamed Islam; edited by Magdi Wahba. -- PDF\n\n* THE SEVENTH HEAVEN: Stories of the Supernatural (Anchor, 2006).  Translated by Raymond Stock. -- ePUB\n\n* SUGAR STREET [Cairo Trilogy III] (Doubleday, 1992).  Translated by William Maynard Hutchins and Angele Botros Samaan. -- PDF\n\n* THEBES AT WAR (Anchor, 2005).  Translated by Humphrey Davies.\n\n* THE TIME AND THE PLACE &amp; OTHER STORIES (Doubleday, 1991).  Selected and translated by Denys Johnson-Davies. -- PDF\n\n* THREE NOVELS OF ANCIENT EGYPT: KHUFU'S WISDOM, RHADOPIS OF NUBIA, THEBES AT WAR (Everyman's Library, 2007).   Translated by Raymond Stock, Anthony Calderbank and Humphrey Davies. -- ePUB\n\n* VOICES FROM THE OTHER WORLD: Ancient Egyptian Tales (Anchor, 2004).  Translated by Raymond Stock. -- ePUB\n\n* WEDDING SONG (Doubleday, 1989).  Translated by Olive E. Kenny; edited and revised by Mursi Saad El Din and John Rodenbeck. -- PDF\n\n_____________________________________________________________________________\n\n\nNOTE: SuprBay, the forum for TPB, has now been restored at a new address and I can be contacted there with comments, suggestions, requests, error reports, etc. (you will need to register an account):\n                                                    &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:0063758f03c0df9672658381e9a00cc1e6dfd783","amp;dn":"Naguib+Mahfouz+-+Nobel+Prize+in+Literature%2C+1988+%2835+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0063758f03c0df9672658381e9a00cc1e6dfd783","infoHashBuffer":{"type":"Buffer","data":[0,99,117,143,3,192,223,150,114,101,131,129,233,160,12,193,230,223,215,131]},"announce":[],"urlList":[]}}