{"title":"Dr. Warren Farrell - The Myth of Male Power [Epub] { KT }","uid":11460695,"size":1238046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:006aa8f3c1492cbc4522bc6dec3be613d41676ad&amp;dn=Dr.+Warren+Farrell+-+The+Myth+of+Male+Power+%5BEpub%5D+%7B+KT+%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"krystine","files":-1,"time":1415983854,"description":"The Myth of Male Power\nAuthor: Warren Farrell\n\n\n\nDr. Warren Farrell has embarked upon an extraordinary mission that concerns us all - to bring the sexes back together. Backed by a stunning array of facts, The Myth of Male Power shatters the singular assumption that most keeps men and women apart - the belief that men have the power. This myth, says Dr. Farrell, hurts everyone - by making women feel oppressed and angry and men feel unloved and unappreciated. It has fueled hate between the sexes at a point in history that would otherwise have the greatest potential for love between the sexes. It has done this by keeping us ignorant of male powerlessness. This courageous book, filled with staggering facts gathered from numerous reliable sources, will empower both sexes to ask the questions we need to begin a genuine dialogue, such as: If men are the powerful sex why are they the suicide sex? (Why are we unaware that our grandfathers are 1350 percent more likely to commit suicide than our grandmothers?) Why did men live one year less than women in 1920 but live seven years less than women in 1990? Why are our dads about as likely to die of prostate cancer as our mothers are of breast cancer while breast cancer receives 660 percent more funding? Why do men make more money but have lower net worths? As the only man ever elected three times to the Board of the National Organization for Women (NOW) in New York City, Dr. Farrell has been listening to both sexes for a quarter of a century and is uniquely able to write in a way that both articulates men's feelings and helps women feel more love for the men in their lives. As a man who has taught in numerous disciplines, he takes us throughout history, across cultures, and into our psyches today.He helps us understand why feminism helped us see that God could be a she but not that the devil could also be a she; why the political parties are keeping women dependent in exchange for votes; why conservatives, liberals, and feminists are all unconsciously undermining genuine \n\n\nGenre: Non Fiction | Politics | Psychology","torrent":{"xt":"urn:btih:006aa8f3c1492cbc4522bc6dec3be613d41676ad","amp;dn":"Dr.+Warren+Farrell+-+The+Myth+of+Male+Power+%5BEpub%5D+%7B+KT+%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006aa8f3c1492cbc4522bc6dec3be613d41676ad","infoHashBuffer":{"type":"Buffer","data":[0,106,168,243,193,73,44,188,69,34,188,109,236,59,230,19,212,22,118,173]},"announce":[],"urlList":[]}}