{"title":"[SoM]Blade Runner[Dvdrip-Xvid-Ita-AC3]","uid":4404367,"size":1463859200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00ce6feac22184d8ed9900db57330f5225bdc18d&amp;dn=%5BSoM%5DBlade+Runner%5BDvdrip-Xvid-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"mitimex","files":2,"time":1221865699,"description":"Rick Deckard vive in una megalopoli ed ÃƒÂ¨ un &quot;blade runner&quot;, un identificatore e sterminatore di replicanti, esseri umani confezionati per essere utilizzati nelle colonie spaziali. La polizia cerca Deckard, ormai stanco di uccidere e lo trova: ÃƒÂ¨ l&amp;#039;unico &quot;blade runner&quot; capace di &quot;ritirare dalla circolazione&quot; i quattro replicanti tipo Nexus 6 tornati clandestinamente sulla Terra a chiedere conto al loro creatore di una vita limitata: quattro anni. Il capitano Bryant minaccia di eliminarlo se non accetta l&amp;#039;incarico. Deckard fa alzare in volo il suo spinner e va da Tyrrel, il geniale creatore di Nexus 6. Il test Voight-Kampff ÃƒÂ¨ il solo sistema che permette di distinguere un replicante da un umano: Deckard ÃƒÂ¨ uno dei pochi a conoscerlo. Lo usa con Rachael, la segretaria di Tyrrel: ÃƒÂ¨ una replicante. La prima preda si chiama Zhora, ÃƒÂ¨ bellissima e danza in mezzo ai serpenti in un night club. Dopo una lunga camminata nella notte di una cittÃƒÂ  degradata e sovrappopolata, misera e sgargiante, Deckard scova Zhora, ma lei capisce chi ÃƒÂ¨, lo sorprende e fugge sotto la pioggia battente. Comincia l&amp;#039;inseguimento tra la folla: Zhora corre veloce, Deckard anche. Fin quando lui non prenderÃƒÂ  la mira e sparerÃƒÂ  con il suo blaster, uccidendola. Eliminata Zhora, Deckard viene attaccato da Leon, un replicante che ha giÃƒÂ  commesso un omicidio, e sta per essere ucciso quando Rachael spara a Leon salvando cosÃƒÂ¬ il &quot;blade runner&quot;. Tra Rachael e Deckard nasce l&amp;#039;amore. Pris ÃƒÂ¨ la terza preda di Deckard che verrÃƒÂ  abbattuta nonostante la sua strenua lotta. Non resta ora che Batty, il capo dei replicanti ribelli, il quale dopo aver ucciso Tyrrel si mette in cerca di Deckard per vendicare i suo compagni. La lotta finale ÃƒÂ¨ all&amp;#039;ultimo sangue. Deckard, battuto, sta precipitando nel vuoto ma Batty, ormai vicino alla fine, gli tende una mano e lo salva: l&amp;#039;uomo artificiale consegnerÃƒÂ  all&amp;#039;uomo vero un messaggio di vita. Deckar e Rachael lasciano la cittÃƒÂ  verso una nuova vita.","torrent":{"xt":"urn:btih:00ce6feac22184d8ed9900db57330f5225bdc18d","amp;dn":"%5BSoM%5DBlade+Runner%5BDvdrip-Xvid-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ce6feac22184d8ed9900db57330f5225bdc18d","infoHashBuffer":{"type":"Buffer","data":[0,206,111,234,194,33,132,216,237,153,0,219,87,51,15,82,37,189,193,141]},"announce":[],"urlList":[]}}