{"title":"Webcam Motion Detector 1.5 Software + Reg Key[EDGE]","uid":7361302,"size":16939604,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:01d0048454fedf7ec714ee0f9864ceb473ed2f48&amp;dn=Webcam+Motion+Detector+1.5+Software+%2B+Reg+Key%5BEDGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Edge316","files":2,"time":1339965949,"description":"Webcam Motion Detector is designed for motion detection and webcam monitoring. It features video surveillance with multiple IP cameras and video capture devices. For each video frame, if motion is detected, the Alarm event occurs, that returns a global motion ratio, depending of the number of cells in which motion has been detected, and the level of motion in each cell. A sensitivity grid is applied on video frames. You can adjust the sensitivity of the detection, and mask out areas of the camera view to avoid false alarms. When the camera captures video frames in a dark environment, it is possible that the electrical background noise of the CCD video cell creates fake motion detection events. It is possible to reduce the sensitivity of to the video noise by enabling the Reduce Video Noise option. When an alarm condition is detected, the program can sound an audible alarm, or send you an email with a photo. Automatically capture photos, or record video in compressed files. Webcam Motion Detector includes an advanced player that allows playing video clips, capturing video frames, and performing frame overlay. Each camera has its own individual monitoring and recording settings.\n","torrent":{"xt":"urn:btih:01d0048454fedf7ec714ee0f9864ceb473ed2f48","amp;dn":"Webcam+Motion+Detector+1.5+Software+%2B+Reg+Key%5BEDGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d0048454fedf7ec714ee0f9864ceb473ed2f48","infoHashBuffer":{"type":"Buffer","data":[1,208,4,132,84,254,223,126,199,20,238,15,152,100,206,180,115,237,47,72]},"announce":[],"urlList":[]}}