{"title":"Isaiah Berlin - Philosophical Works (17 books)","uid":12034579,"size":79856652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0240b0e65a7b684290ef4b95d8e5f19c2bb16def&amp;dn=Isaiah+Berlin+-+Philosophical+Works+%2817+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":45,"time":1434668561,"description":"\nSir ISAIAH BERLIN (1909-1997) was a British philosopher, historian of ideas, political theorist, educator and essayist.  For much of his life he was renowned for his conversational brilliance, his defence of liberalism, his attacks on political extremism and intellectual fanaticism, and his accessible, coruscating writings on the history of ideas.  His essay &quot;Two Concepts of Liberty&quot; (1958) contributed to a revival of interest in political theory in the English-speaking world, and remains one of the most influential and widely discussed texts in that field: admirers and critics agree that Berlin's distinction between positive and negative liberty remains, for better or worse, a basic starting-point for theoretical discussions of the meaning and value of political freedom. \n\nIn its obituary of the scholar, the Independent stated that &quot;Berlin was often described, especially in his old age, by means of superlatives: the world's greatest talker, the century's most inspired reader, one of the finest minds of our time...  [T]here is no doubt that he showed in more than one direction the unexpectedly large possibilities open to us at the top end of the range of human potential.&quot;\n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n* AGAINST THE CURRENT: Essays in the History of Ideas (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by Mark Lilla. -- PDF + ePUB\n\n* CONCEPTS AND CATEGORIES: Philosophical Essays (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by Alasdair MacIntyre. -- PDF + ePUB\n\n* THE CROOKED TIMBER OF HUMANITY: Chapters in the History of Ideas (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by John Banville. -- PDF + ePUB\n\n* ENLIGHTENING: Letters 1946-1960 (Chatto &amp; Windus, 2009).  Edited by Henry Hardy and Jennifer Holmes. -- ePUB\n\n* FREEDOM AND ITS BETRAYAL: Six Enemies of Human Liberty (Princeton UP, 2014).  Second Edition.  Edited by Henry Hardy, with a Foreword by Enrique Krauze. -- PDF + ePUB\n\n* THE HEDGEHOG AND THE FOX: An Essay on Tolstoy's View of History (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by Michael Ignatieff. -- PDF + ePUB\n\n* KARL MARX (Princeton UP, 2013).  Fifth Edition.  Edited by Henry Hardy, with a Foreword by Alan Ryan . -- PDF + ePUB\n\n* LIBERTY: Incorporating &quot;Four Essays on Liberty&quot; (Oxford UP, 2002).  Edited by Henry Hardy. -- PDF\n\n* PERSONAL IMPRESSIONS (Princeton UP, 2014).  Third Edition.  Edited by Henry Hardy, with a Foreword by Hermione Lee. -- PDF + ePUB\n\n* POLITICAL IDEAS IN THE ROMANTIC AGE: Their Rise and Influence on Modern Thought (Princeton UP, 2014).  Second Edition.  Edited by Henry Hardy, with a Foreword by William A. Galston. -- PDF + ePUB\n\n* THE POWER OF IDEAS (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by Avishai Margalit. -- PDF + ePUB\n\n* THE PROPER STUDY OF MANKIND: An Anthology of Essays (Chatto &amp; Windus, 1997).  Edited by Henry Hardy and Roger Hausheer. -- PDF\n\n* THE ROOTS OF ROMANTICISM (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by John Gray. -- PDF + ePUB\n\n* RUSSIAN THINKERS (Penguin, 1994).  Edited by Henry Hardy and Aileen Kelly. -- PDF\n\n* THE SENSE OF REALITY: Studies in Ideas and their History (FSG, 1997).  Edited by Henry Hardy, with an Introduction by Patrick Gardiner. -- PDF\n\n* THE SOVIET MIND: Russian Culture Under Communism (Brookings Institution, 2003).  Edited by Henry Hardy, with a Foreword by Strobe Talbott. -- PDF\n\n* THREE CRITICS OF THE ENLIGHTENMENT: Vico, Hamann, Herder (Princeton UP, 2013).  Second Edition.  Edited by Henry Hardy, with a Foreword by Jonathan Israel. -- PDF + ePUB\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:0240b0e65a7b684290ef4b95d8e5f19c2bb16def","amp;dn":"Isaiah+Berlin+-+Philosophical+Works+%2817+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0240b0e65a7b684290ef4b95d8e5f19c2bb16def","infoHashBuffer":{"type":"Buffer","data":[2,64,176,230,90,123,104,66,144,239,75,149,216,229,241,156,43,177,109,239]},"announce":[],"urlList":[]}}