{"title":"Peter Matthiessen - In Paradise &amp; other works (8 books)","uid":9919947,"size":29969714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:027b3da52d6bcb340e68dadd2ba4745e2be11ce2&amp;dn=Peter+Matthiessen+-+In+Paradise+%26amp%3B+other+works+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":-1,"time":1396994580,"description":"\nPETER MATTHIESSEN (1927-2014) was an American novelist, naturalist, and wilderness writer.  A co-founder of the literary magazine The Paris Review and a three-time National Book Award-winner, he was also a prominent environmental activist.\n\nAT PLAY IN THE FIELDS OF THE LORD (1965) is a gripping novel about a group of American missionaries and their encounter with a South American indigenous tribe.  The book was later adapted into a film of the same name in 1991.\n\nIn 2008, Matthiessen revised his acclaimed trilogy of novels set in frontier Florida -- &quot;Killing Mr. Watson&quot; (1990), &quot;Lost Man's River&quot; (1997) and &quot;Bone by Bone&quot; (1999) -- and edited them into the single-volume SHADOW COUNTRY.  It won the National Book Award for Fiction in 2008 and the William Dean Howells Medal in 2010.  Critic Michael Dirda lavished praise on the work, writing: &quot;In every way, Shadow Country is a bravura performance, at once history, fiction, and myth -- as well as the capstone to the career of one of the most admired and admirable writers of our time.&quot;\n\nHis last novel, IN PARADISE (2014), was published only 3 days after his death in April 2014.  It recounts a two-week pilgrimage to Nazi Germany's most notorious death camps, some half-century after liberation, by a disparate collection of surviving relatives, academics, clergy, nuns, historians, the children of Nazi soldiers.\n\nMatthiessen's non-fiction earned him an important place among conservationists worldwide.  His writing encompassed nature and travel, and its spiritual insights about nature, man, and himself, turned him into a sort of new-age guru.  Even the careful craftsmanship of his fiction reflected an approach to writing that echoed the Zen Buddhism he practised.  This collection features several important non-fiction works, notably THE SNOW LEOPARD (1978), Matthiessen's account of his two-month search for the snow leopard with naturalist George Schaller in the Dolpo region on the Tibetan Plateau in the Himalayas.  It won  both the 1979 National Book Award in the category Contemporary Thought and the 1980 National Book Award for Nonfiction.\n\nRounding out this collection: THE CLOUD FOREST (1961) is an incisive, wry report of his expedition into the South American wilderness, from the Amazon rain forests to Machu Picchu, high in the Andes, down to Tierra del Fuego and back.  MEN'S LIVES (1986) is an eloquent portrayal of a disappearing way of life of the Long Island fishermen whose voices -- humorous, bitter and bewildered -- are as clear as the threatened beauty of their once quiet shore.  Finally, AFRICAN SILENCES (1991) is a powerful and sobering account of the cataclysmic depredation of the African landscape and its wildlife.\n\n\nThe following books are in retail ePUB format unless otherwise noted:\n\n* AFRICAN SILENCES (Random House, 1991)\n\n* AT PLAY IN THE FIELDS OF THE LORD (Random House, 1965)\n\n* THE CLOUD FOREST: A Chronicle of the South American Wilderness (Harvill, 1988)\n\n* FAR TORTUGA (Random House, 1975)\n\n* IN PARADISE (Riverhead, 2014)\n\n* MEN'S LIVES: The Surfmen and Baymen of the South Fork (Random House, 1986)\n\n* SHADOW COUNTRY: A New Rendering of the Watson Legend (Modern Library, 2008).  One-volume edition of &quot;Killing Mr. Watson&quot; (1990), &quot;Lost Man's River&quot; (1997), and &quot;Bone by Bone&quot; (1999).\n\n* THE SNOW LEOPARD (Viking, 1978) -- PDF\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n              &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:027b3da52d6bcb340e68dadd2ba4745e2be11ce2","amp;dn":"Peter+Matthiessen+-+In+Paradise+%26amp%3B+other+works+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027b3da52d6bcb340e68dadd2ba4745e2be11ce2","infoHashBuffer":{"type":"Buffer","data":[2,123,61,165,45,107,203,52,14,104,218,221,43,164,116,94,43,225,28,226]},"announce":[],"urlList":[]}}