{"title":"Battleheart Legacy v1.2.3 Android","uid":11365197,"size":375083053,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:028445c93a0bd92bb59582cda33d9ab91408706d&amp;dn=Battleheart+Legacy+v1.2.3+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":".BONE.","files":-1,"time":1415036649,"description":"In Battleheart Legacy, you will explore a rich and detailed fantasy world, customize your unique hero with dozens of powerful skills and items, do battle with hordes of enemies, encounter quirky characters and discover the stories of a troubled realm. Will you become a powerful wizard, or a notorious rogue? A noble knight, or a savage barbarian? How will you forge your legacy?\n\nFeatures:\nA refined real-time combat system, based on the award-winning &quot;Battleheart&quot;. Move your character or attack your foes through simple taps, and unleash powerful special moves at the right moment to turn the tide of battle! \nUnparalleled animation and VFX make every battle a visual feast! \nAn astounding 150+ unique skills across 12 classes to customize your character with. Poison your foes, crush them with giant two-handed weapons, put them to sleep with a song, or simply blow them up with a meteor strike. And with our unique multi-classing system, it's possible to combine classes into a nearly limitless number of combinations. \nOver 200 unique pieces of equipment to further tailor your character's play style. \nIncredible boss battles that will put your hero to the test!\nWhat's in this version : (Updated : Oct 31, 2014)\nFixed an issue which could cause the &quot;delete save&quot; command to incorrectly delete the wrong save slot.\nRequired Android O/S : 4.1+","torrent":{"xt":"urn:btih:028445c93a0bd92bb59582cda33d9ab91408706d","amp;dn":"Battleheart+Legacy+v1.2.3+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028445c93a0bd92bb59582cda33d9ab91408706d","infoHashBuffer":{"type":"Buffer","data":[2,132,69,201,58,11,217,43,181,149,130,205,163,61,154,185,20,8,112,109]},"announce":[],"urlList":[]}}