{"title":"The Little Big Book of New York (History Society Art Ebook).pdf","uid":10016530,"size":111477434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:028cdf1c3f7e09fe147c27a237b08a5dddb6432d&amp;dn=The+Little+Big+Book+of+New+York+%28History+Society+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1398152809,"description":"The Little Big Book Of New York\nNatasha Tabori Fried, Lena Tabori | 2004 | HQ PDF | ISBN: 1932183027 | 340 pages | 106 Mb\n\nThe Little Big Book of New York is full of everything that makes New York, well, New York. There are the defining recipes, songs, poetry, and literature, of course. But there's also the history of all sorts of different aspects of the Empire state, from Immigration to the Mob, and facts that will wow even the most &quot;been there, done that&quot; New Yorkers. For example, did you know that some 80 odd years ago there were twice as many people riding the subways as there are today? Hard to believe, but true! Never before has the Greatest City in the World been distilled down into one, hefty little package. Illustrated with vintage postcards, linens and ephemera, this book brings back to life the New York of Old, while remaining true to energy and grandeur that is alive and well in the Big Apple today.\nIt will include:\nSHORT STORIES AND EXCERPTS from Caleb Carr, F. Scott Fitzgerald, Edith Wharton, Truman Capote, Henry James, Toni Morrison, Betty Smith, Mary McCarthy, and E.L. Doctorow, among others.\nPOEMS by Sara Teasdale, E.E. cummings, Hart Crane, Emma Lazarus, Langston Hughes, W.H. Auden, Walt Whitman, Frank O'Hara, Ezra Pound, Audre Lorde, and many more.\nFACT SPREADS including Famous New Yorkers, Books and Movies set in New York, The Hudson River, Moments in History, Skyscrapers, and Sports.","torrent":{"xt":"urn:btih:028cdf1c3f7e09fe147c27a237b08a5dddb6432d","amp;dn":"The+Little+Big+Book+of+New+York+%28History+Society+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028cdf1c3f7e09fe147c27a237b08a5dddb6432d","infoHashBuffer":{"type":"Buffer","data":[2,140,223,28,63,126,9,254,20,124,39,162,55,176,138,93,221,182,67,45]},"announce":[],"urlList":[]}}