{"title":"World Without End, by Ken Follett. (Ebook - English)","uid":3910043,"size":3220810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:029ad08a8af88df7ffb2329d876caa3efe41a8c2&amp;dn=World+Without+End%2C+by+Ken+Follett.+%28Ebook+-+English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"adanyeva2","files":1,"time":1196094405,"description":"Ken Follett has 90 million readers worldwide. The Pillars of the Earth is his bestselling book of all time. Now, eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the most-anticipated sequel of the year, World Without End.\n\nIn 1989 Ken Follett astonished the literary world with The Pillars of the Earth, a sweeping epic novel set in twelfth-century England centered on the building of a cathedral and many of the hundreds of lives it affected. Critics were overwhelmed--&quot;it will hold you, fascinate you, surround you&quot; (Chicago Tribune)--and readers everywhere hoped for a sequel.\n\nWorld Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time the men and women of an extraordinary cast of characters find themselves at a crossroad of new ideas--about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race--the Black Death.\n\nThree years in the writing, and nearly eighteen years since its predecessor, World Without End breathes new life into the epic historical novel and once again shows that Ken Follett is a masterful author writing at the top of his craft.","torrent":{"xt":"urn:btih:029ad08a8af88df7ffb2329d876caa3efe41a8c2","amp;dn":"World+Without+End%2C+by+Ken+Follett.+%28Ebook+-+English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"029ad08a8af88df7ffb2329d876caa3efe41a8c2","infoHashBuffer":{"type":"Buffer","data":[2,154,208,138,138,248,141,247,255,178,50,157,135,108,170,62,254,65,168,194]},"announce":[],"urlList":[]}}