{"title":"The Life and Work of Jalal-ud-din Rumi (e-book, PDF)","uid":6367837,"size":10943750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:031add876e19efe68e49d692e11c778fe22550e1&amp;dn=The+Life+and+Work+of+Jalal-ud-din+Rumi+%28e-book%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"inst23","files":-1,"time":1304572447,"description":"The Life and Work of Jalal-ud-din Rumi\nby Afzal Iqbal (Author)\n\nPakistan National Council of the Arts | 1991 (6th edition) | ISBN: 9694500508 | 330 pages | PDF | English\n\nAmazon: http://www.amazon.com/life-work-Jalal-ud-din-Rumi/dp/9694500508/\n\n\n\nDescription:\n\nRumi is perhaps the only example in world literature of a devoted prose writer who suddenly burst forth into poetry during middle age to become a truly great mystical poet for all time. This book, a long-overdue reckoning of his life and work, begins with a description and examination of the living conditions in 13th-century Persia. Building on this context, Afzal Iqbal proceeds to fully analyze the formative period of Rumi's life leading up to 1261--when he began the monumental work of writing the Mathnawi. Toward the end of the book, Iqbal more generally investigates Rumi's thought and includes translations of those portions of the Mathnawi that have been hitherto unavailable in English. Combining an unparalleled familiarity with the source material, a total and critical understanding of the subject, and a powerful and readable prose style, this is an extraordinary study of a truly remarkable poet and mystic.\n\n\n\nReviews:\n\nCompulsory reading for those seriously interested in Rumi.\n\nThere has been a glut of books on Rumi in the past few years, many of them of dubious authenticity or quality; this assessment applies especially to the &quot;free&quot; translations of his poetry which have been such a big hit in the West! I think those poetical translations are not doing justice to the message of Rumi since they are so far removed from many of the original Persian poems.\n\nThis book then is a welcome change. It is quite an old book but its republishing is an important event in the world of Rumi studies, in my opinion.\n\nFor a start this book, though perfectly accessible to the lay person, is primarily a scholarly endeavour and as such much more concerned about relaying the events of Rumi's life and his message as accurately as possible than in selling copies!\n\nIt is unique of all the books I have read on Rumi to date in that it tries to look, in depth, at his early life and how that affected him later when he met Shams Tabrizi and was moved by Divine Love to compose ecstatic poetry.\n\nThus we have a detailed chapter on the political conditions of the area (Afghanistan) in which he lived; then we have an exposition about his father (who himself was a very famous Muslim scholar and jurisprudent as well as a Sufi) who, as this book shows, had a major influence on Rumi's development and later ideas. We also then are introduced to the other people who influenced Rumi in one way or another, his teachers and his family and friends.\n\nThe sections on Rumi's life are detailed too: his life is divided into three sections: his birth, childhood, migration to Konya and early training as an Islamic scholar under his father and other famous teachers; his period following his father's demise as a prominent scholar, and Sufi teacher himself (he was an heir to his father's position); and then the period of his meeting with Shams and afterwards for the remainder of his life. This latter period is also further sub-divided based on his various works and mystical states as evidenced by his poetical output. Most other works on Rumi tend just to concentrate on this last period of his life.\n\nAfter this the major poetical works of Rumi are discussed in, more or less, chronological order of writing. Thus the Divan-e-Shams-e-Tabrizi, his great collection of ecstatic lyrical poems in praise of Shams is dealt with first followed then by an explanation of his magnus opus, the Masnavi. Then the author discusses Rumi's overall message. The final section looks at sections of the Masnavi which RE Nicholson, in his great translation of the Masnavi, decided to translate into Latin as he believed them (erronously) to be of a pornographic nature. In fact, when one reads the English translations here, one sees that Rumi simply uses examples of human sexual behaviour to underline an important teaching point of Sufism.\n\nFor those who are interested in Rumi's message and life in earnest, and not in the suspicious &quot;New-Age&quot; fad which the spurious translations of his works seem to have started (and which he, being a pious Muslim, would no doubt be horrified by!), this book is a must.\n\nDr. Iqbal needs to be congratulated for trying to bring Rumi's message across as it is!","torrent":{"xt":"urn:btih:031add876e19efe68e49d692e11c778fe22550e1","amp;dn":"The+Life+and+Work+of+Jalal-ud-din+Rumi+%28e-book%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031add876e19efe68e49d692e11c778fe22550e1","infoHashBuffer":{"type":"Buffer","data":[3,26,221,135,110,25,239,230,142,73,214,146,225,28,119,143,226,37,80,225]},"announce":[],"urlList":[]}}