{"title":"Jaroslav Seifert - Nobel Prize in Literature, 1984 (3 books)","uid":14872029,"size":3594573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0335ecbb017eec8cbd446b25202f4df36e02c814&amp;dn=Jaroslav+Seifert+-+Nobel+Prize+in+Literature%2C+1984+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":8,"time":1465581298,"description":"\nJAROSLAV SEIFERT (1901-1986) was a Czechoslovak writer, poet and journalist.  He was awarded the 1984 Nobel Prize in Literature &quot;for his poetry which endowed with freshness, sensuality, and rich inventiveness provides a liberating image of the indomitable spirit and versatility of man.&quot;  The Nobel Committee added: &quot;He conjures up another world than that of tyranny and desolation -- a world that exists both here and now . . . one that exists in our dreams and our will and our art.&quot;\r\n\r\nThe history and other aspects of Czechoslovakia were the most common subjects of his poetry.  Although Seifert lived through the many historic turns of his homeland, his was not especially a political poetry, except in its constant expression of love for his country, its beauties and its values.  He was the great poet of Prague, of love, of the senses.  His work was unpretentious, lyrical yet irreverent, earthy, charming.  In 1966 he was named Poet of the Nation, and he was one of several writers, later silenced, who condemned the Soviet invasion of Czechoslovakia in 1968.\r\n\r\n\r\nThe following books are in PDF or ePub/Mobi format as indicated:\r\n\r\n* The Early Poetry of Jaroslav Seifert (Northwestern UP, 1997).  Translated by Dana Loewy. -- PDF\r\n\r\n* On the Pathetic and Lyrical State of Mind: The Nobel Lecture (Nobel Lectures, 1993). -- PDF\r\n\r\n* The Poetry of Jaroslav Seifert (Catbird, 1998).  Translated by Edward Osers; edited and with prose translations by George Gibian. -- ePUB / Mobi\r\n\r\n* The Casting of Bells (Spirit That Moves Us Press, 1984).  Translated by Paul Jagasich &amp; Tom O'Grady. -- PDF\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                                \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:0335ecbb017eec8cbd446b25202f4df36e02c814","amp;dn":"Jaroslav+Seifert+-+Nobel+Prize+in+Literature%2C+1984+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0335ecbb017eec8cbd446b25202f4df36e02c814","infoHashBuffer":{"type":"Buffer","data":[3,53,236,187,1,126,236,140,189,68,107,37,32,47,77,243,110,2,200,20]},"announce":[],"urlList":[]}}