{"title":"Learn Boogie Woogie Piano - Colin Davey - CD Included","uid":3582848,"size":131589253,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:03924dd310c8b5cc6b6c5526ae5e43c617cdd68d&amp;dn=Learn+Boogie+Woogie+Piano+-+Colin+Davey+-+CD+Included&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1166918811,"description":"Learn Boogie Woogie Piano - Colin Davey - CD Included\n\n\nLearn to play authentic Boogie Woogie piano in the styles of its three pioneers - Albert Ammons, Pete Johnson and Meade &quot;Lux&quot; Lewis. This thorough guide will teach you to play, improvise, and compose dynamic, authentic Boogie Woogie piano. Starting with bass lines, it leads you step-by-step through the techniques you need for the style, from rhythmic chords in the right hand to turnarounds, sixths, tremolos and other devices.\n\nLearn Boogie Woogie Piano is for piano players who want to learn to play, improvise, and compose dynamic, authentic boogie woogie piano. It is geared towards players who can read music and do any one of the following on the piano:\n\n- Play along with a blues, folk, or early rock-and-roll song\n- Play a jazz standard\n- Play a Bach two-part invention or a classical piece of equivalent difficulty\n\nHighly motivated less experienced piano players can use this book as well.\n\nEar players can learn from the CD of the exercises and examples.\n\nPiano players with a classical background only will find the boogie woogie style an excellent way to transition towards improvising popular music styles.\n\nWith this book, jazz, blues, rock-and-roll, and boogie woogie players can learn to play in the authentic, roots boogie woogie style of the Boogie Woogie Trio.\n\nPiano Teachers will find this a great text book for use with their students.\n\n\n\n","torrent":{"xt":"urn:btih:03924dd310c8b5cc6b6c5526ae5e43c617cdd68d","amp;dn":"Learn+Boogie+Woogie+Piano+-+Colin+Davey+-+CD+Included","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03924dd310c8b5cc6b6c5526ae5e43c617cdd68d","infoHashBuffer":{"type":"Buffer","data":[3,146,77,211,16,200,181,204,107,108,85,38,174,94,67,198,23,205,214,141]},"announce":[],"urlList":[]}}