{"title":"Sonja i Bik 2012 DVDRip","uid":8373247,"size":837563070,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:03c1b1e35f99739a068ec6de751663e0f5f21f9d&amp;dn=Sonja+i+Bik+2012+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"icasad","files":-1,"time":1365977170,"description":"Sonja i bik 2012\n\nEspecially from HRT ...\n\nThe film has a very good picture quality, but the sound - it's a completely different story, sound spoils the experience of each second of the movie.\n\nThe story begins interestingly, continues a little bit off-road, but at the middle of the storyline story is lost on a off-road rally race - goes to something that has nothing to do with either Sonja or with the bull, but with inconsistent characters who are trying to complement the duration of the movie.\n\nThe film offers a couple of interesting characters, such as the butcher, but most of them are poorly characterized.\n\nAs for the miser humor in the film: it's cheap and inadequate. Watching Sonja and the bull is more like watching a social drama with elements of comedy, than watching a comedy. In fact, humor appears as much as unnecessary nudity.\n\nIn short, the film offers a one-time &quot;entertainment&quot; for a Sunday afternoon.\n\nNote to parents: keep in mind that the film contains EXPLICIT CONTENT, so first watch the movie by yourselves in order to assess how much the movie could be interesting to your children.","torrent":{"xt":"urn:btih:03c1b1e35f99739a068ec6de751663e0f5f21f9d","amp;dn":"Sonja+i+Bik+2012+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03c1b1e35f99739a068ec6de751663e0f5f21f9d","infoHashBuffer":{"type":"Buffer","data":[3,193,177,227,95,153,115,154,6,142,198,222,117,22,99,224,245,242,31,157]},"announce":[],"urlList":[]}}