{"title":"Vikings S01E07 XviD [JKS]","uid":8374531,"size":469088496,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:03e0348db701aff0e0553bdd116c9cd94147e55f&amp;dn=Vikings+S01E07+XviD+%5BJKS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"jksADIDAS","files":9,"time":1366009801,"description":"Vikings Season 01 Episode 07\n\nXviD \nEncode Information\nResolution....: 720x404\nVideo : XviD (.avi)\nAudio : MP3 2ch 128khz\nFrame Rate : 29.97 fps\n\nIMDb: http://www.imdb.com/title/tt2306299/\nWiki: http://en.wikipedia.org/wiki/Vikings_(TV_series)\nOfficial Site: http://www.history.com/shows/vikings\n\nVikings is a Canadian-Irish historical drama television series, written and created by Michael Hirst for the television channel History in Canada.  It premiered on March 3, 2013.\nFilmed in Ireland, Vikings is inspired by the tales about the Viking Ragnar Lodbrok, one of the best-known Norse heroes and notorious as the scourge of France and Britain. It portrays Ragnar as a Viking farmer who pioneers the first daring raids into Britain with the support of fellow warriors, his brother, and his wife, the shieldmaiden Lagertha.\nOn April 5, 2013, History renewed Vikings for a ten-episode second season.\n\nTITLE: A king's Ransom  DIRECTED BY:  Ken Girotti   WRITTEN BY: Michael Hirst   ORIGINAL AIR DATE: April 714 2013  FILE FORMAT: xvid(.avi)\n\nThree Viking ships sail upriver towards the Royal Villa of King Aelle. The Northmen kidnap the king's brother whom is sent to deal with them. Ragnar Lothbrok has meets with the king and tells him for 2000 pounds of gold and silver he will return his brother and leave their kingdom in peace. The king agrees on the condition that one member of Ragnar's group be baptized as a Christian. Rollo agrees to let himself be baptized into the English faith. However, King Aelle betrays Ragnar and sends empty boxes to lure the northmen out. After a short battle Ragnar sends the king his brother back dead and the king gives them the gold to leave his country. While back in their homeland Lagertha deals with the their peoples needs. She shows mercy and takes Siggy and her daughter in under her protection.  One morning Siggy approaches Lagertha to find her bleeding heavily and a possibly miscarriage  of her unborn child.\n","torrent":{"xt":"urn:btih:03e0348db701aff0e0553bdd116c9cd94147e55f","amp;dn":"Vikings+S01E07+XviD+%5BJKS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e0348db701aff0e0553bdd116c9cd94147e55f","infoHashBuffer":{"type":"Buffer","data":[3,224,52,141,183,1,175,240,224,85,59,221,17,108,156,217,65,71,229,95]},"announce":[],"urlList":[]}}