{"title":"Howler - World of Joy (2014) [FLAC]","uid":9831026,"size":192350975,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0401961c81761d7a8810b1f273a6d52eaa738a25&amp;dn=Howler+-+World+of+Joy+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"politux","files":-1,"time":1395840974,"description":"\n  Howler - World of Joy (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Al's Corral\n  02 Drip \n  03 Don't Wanna \n  04 Yacht Boys \n  05 In the Red \n  06 World of Joy \n  07 Louise \n  08 Here's the Itch That Creeps Through My Skull \n  09 Indictment \n  10 Aphorismic Wasteland Blues\n\n  On World of Joy, the rowdy fun Howler strove for on America Give Up is more easily in their reach. That they wrote their second album as a band -- including new drummer Rory MacMurdo -- instead of merely fleshing out Jordan Gatesmith's ideas like they did last time, gives these songs more personality, as well as more of rock &amp; roll's trashy glamour and grand gestures: witness &quot;Indictment&quot;'s showy, slowed-down bridge and plummeting breakdown, or the chugging and charging &quot;In the Red.&quot; Envisioning the album as a jukebox full of songs inspired by their favorite artists, Gatesmith and company touch on '80s punk and college rock. Considering that many of their peers skipped straight from new wave and synth-pop to grunge when it came to borrowing from the past, Howler sounds relatively fresh, if not original. \n\n  Their hometown's heroes, the Replacements, provide the template for the brash opener &quot;Al's Corral&quot; as well as &quot;Don't Wanna&quot;'s open-hearted strumming, over which Gatesmith snarls &quot;you don't have to listen to the Smiths if you don't wanna&quot; (though &quot;Here's the Itch That Creeps Through My Skull&quot;'s wordy title certainly owes something to Moz and Marr). Deerhunter explored a similar kind of so-simple-it's-iconic, leather jacket rock on Monomania; while Howler's approach may not be as ambitious, World of Joy boasts some touches that take it beyond basic. The swarming guitars on &quot;Yacht Boys&quot;' choruses flirt with chaos and oblivion, and the band adds some ominous oddness to &quot;Drip&quot;'s revved-up riffs and Saturday nights. World of Joy's second half isn't quite as cohesive as its first: the title track's whispery danger and the crooned punk-pop of &quot;Louise&quot; sound like they were recorded by a different band than the rest of the album (and from each other). Still, the best moments find Howler sounding more mature and also more brattily rock than ever before -- which is no mean feat.","torrent":{"xt":"urn:btih:0401961c81761d7a8810b1f273a6d52eaa738a25","amp;dn":"Howler+-+World+of+Joy+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0401961c81761d7a8810b1f273a6d52eaa738a25","infoHashBuffer":{"type":"Buffer","data":[4,1,150,28,129,118,29,122,136,16,177,242,115,166,213,46,170,115,138,37]},"announce":[],"urlList":[]}}