{"title":"Sexually Broken--All natural newbie Katrina Jade fucked hard by ","uid":10431904,"size":577678013,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0458e0ce589f5351fefb558c6c1963fc23921a72&amp;dn=Sexually+Broken--All+natural+newbie+Katrina+Jade+fucked+hard+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"merzedes","files":-1,"time":1403809743,"description":"All natural newbie Katrina Jade fucked hard by two dicks while in strict device bondage, creampied! | Katrina Jade | Matt Williams \n\nJune 25, 2014\n\n\nHigh MP4 only.\n\n\nPretty pale Katrina Jade has high cheekbones and huge all natural breasts. She is good looking enough to be a model, but her kinky desires led her down a different path. In this case, that path leads to her getting bolted down into immovable bondage and fucked hard and without mercy from both ends by big dick until her brains melt right out of her ears. Today we crack open that pretty package and reveal the wanton slut writhing beneath.\n\nBound and bolted down in a custom made wooden bondage device that binds her in a classic &quot;fuck me&quot; position, both ends of Katrina are deliciously, completely exposed. Her perfect shaved pussy reads &quot;Daddy's girl&quot;. Her mouth hole is ripe and ready. We love Daddy's girls here at Sexuallybroken, they are the most fun to fuck. The metal shackles and wooden beam keep her smooth limbs locked firmly in place. She can not escape or wiggle away from the sensation. All she can do is surrender to the sensation as the cocks own her holes utterly.\n\nWe walk right up and make full use of this slut. The cocks chinese finger trap her down to her very soul. Katrina adjusts to her new purpose, to be a bag of holes for our cocks. we never let up or never slow down as we reshape her flesh until it is custom fitted. Katrina cums, hard, over and over, as the hard dicks rip out orgasms out of that shaved cunt. She gasps and moans on the BBC as all 10 inches of it slide down towards her belly. Her eyes glaze over from the overwhelming sensation of cock, bondage and orgasms.\n\nThose big eyes and tight pussy are just too compelling, and we give her a slut's deepest desire: a load of hot cum deposited deep inside her. It is the reward Katrina was craving, and she sags in her bondage, radiating contentment as the cum runs down her flawless ass.  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_25kjade2/SexuallyBroken--All-natural-newbie-Katrina-Jade-fucked-hard-by-two-dicks-while-in-strict-device-bondage-creampied.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_25kjade2/SexuallyBroken--All-natural-newbie-Katrina-Jade-fucked-hard-by-two-dicks-while-in-strict-device-bondage-creampied.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:0458e0ce589f5351fefb558c6c1963fc23921a72","amp;dn":"Sexually+Broken--All+natural+newbie+Katrina+Jade+fucked+hard+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0458e0ce589f5351fefb558c6c1963fc23921a72","infoHashBuffer":{"type":"Buffer","data":[4,88,224,206,88,159,83,81,254,251,85,140,108,25,99,252,35,146,26,114]},"announce":[],"urlList":[]}}