{"title":"Charles L. Adler - Wizards, Aliens, and Starships. Physics and M","uid":10307494,"size":6447714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:047ba0ef345f63b670abd293dfb032e803baa4f7&amp;dn=Charles+L.+Adler+-+Wizards%2C+Aliens%2C+and+Starships.+Physics+and+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":-1,"time":1402150901,"description":"Description\nProduct Details\nBook Title: Wizards, Aliens, and Starships: Physics and Math in Fantasy and Science Fiction\t\nBook Author: Charles L. Adler\nHardcover: 392 pages\nPublisher: Princeton University Press (February 2, 2014)\nLanguage: English\nISBN-10: 0691147159\nISBN-13: 978-0691147154\n\n===================================================================================\nBook Description\nPublication Date: February 2, 2014 | ISBN-10: 0691147159 | ISBN-13: 978-0691147154\nFrom teleportation and space elevators to alien contact and interstellar travel, science fiction and fantasy writers have come up with some brilliant and innovative ideas. Yet how plausible are these ideas--for instance, could Mr. Weasley's flying car in the Harry Potter books really exist? Which concepts might actually happen, and which ones wouldn't work at all? Wizards, Aliens, and Starships delves into the most extraordinary details in science fiction and fantasy--such as time warps, shape changing, rocket launches, and illumination by floating candle--and shows readers the physics and math behind the phenomena.\nWith simple mathematical models, and in most cases using no more than high school algebra, Charles Adler ranges across a plethora of remarkable imaginings, from the works of Ursula K. Le Guin to Star Trek and Avatar, to explore what might become reality. Adler explains why fantasy in the Harry Potter and Dresden Files novels cannot adhere strictly to scientific laws, and when magic might make scientific sense in the muggle world. He examines space travel and wonders why it isn't cheaper and more common today. Adler also discusses exoplanets and how the search for alien life has shifted from radio communications to space-based telescopes. He concludes by investigating the future survival of humanity and other intelligent races. Throughout, he cites an abundance of science fiction and fantasy authors, and includes concise descriptions of stories as well as an appendix on Newton's laws of motion.\nWizards, Aliens, and Starships will speak to anyone wanting to know about the correct--and incorrect--science of science fiction and fantasy.\n\n===================================================================================\nReviews\n&quot;Whether as a text for a course or as a vehicle for self-study, this book makes for interesting, educational and thought-provoking reading.&quot;--Mark Hunacek, MAA Reviews\n\n&quot;Adler does a grand job of showing just how powerful even basic maths and physics can be. If you're a budding back-of-the-envelope boffin not afraid of a bit of algebra, you'll love this book.&quot;--Robert Matthews, BBC Focus Magazine\n\n&quot;I can't work out whether I love or hate this book. I love it because its analysis of the physics behind numerous accounts of magic and space exploration in fantasy and science fiction writing is fascinating. I hate it because it reveals why I will never be able to realise my dream of saying 'Beam me up, Scotty' before being teleported; or so Charles Adler has convinced me. . . . The physics is well explained and Adler offers entertaining examples.&quot;--Noel-Ann Bradshaw, Times Higher Education\n\n&quot;Wizards, Aliens, and Starships is a great book by itself or as a starting point for exploring the physics of space exploration as well as the classics in science fiction.&quot;--Robert Schaefer, New York Journal of Books\n\n&quot;For those who want to learn the hard facts about the realities of space travel or the chances for alien life, and as an engaging supplemental text for physics and astronomy courses, Wizards, Aliens, and Starships would be an admirable choice.&quot;--Sidney Perkowitz, Scientists' Bookshelf\n\n&quot;[A] rewarding and thought-provoking read.&quot;--Paul Sutherland, BBC Sky at Night\n\n&quot;[T]his book offers a lot, not only to SF authors but to any of you who want to see the real science in operation because this supplies most of the answers you need. Make sure your copy gets a serious read and well-thumbed.&quot;--G.F. Willmetts, SFCrowsnest\n\n&quot;This book will speak to anyone wanting to know about the correct--and incorrect--science of science fiction and fantasy.&quot;--Lunar and Planetary Information Bulletin\n\n&quot;[T]his is an interesting, well-written book, and Adler has put a lot of work into it. It should be invaluable for anyone wanting to write really accurate science fiction.&quot;--Popular Science\n\n===================================================================================\nFrom the Inside Flap\n&quot;To only call Wizards, Aliens, and Starships engaging would be a real understatement--it is a delightful, funny, and immensely interesting romp through science and fiction. From candlepower to teleportation, all the way to the fate of the cosmos in the span of a googol years, this is a cornucopia of teachable material. It is also a reminder of the simple thrill of applying science to the world around us, real or imagined. A new classic.&quot;--Caleb Scharf, author of Gravity's Engines and The Copernicus Complex\n\n&quot;This terrific book analyzes the romantic ideas of science fiction using the hard-nosed reality of the laws of physics. It will interest all readers, from Star Trek enthusiasts to astrophysicists.&quot;--Paul Nahin, author of The Logician and the Engineer\n\n&quot;Wizards, Aliens, and Starships rigorously applies the principles of physics to concepts, plot devices, and other features of science fiction and fantasy books, films, and television series. Readers who follow Adler's carefully developed analyses will learn a great deal about familiar science fiction tropes, physics, and how scientists think about the world. An exceptional book.&quot;--A. Bowdoin Van Riper, author of Science in Popular Culture\n\n===================================================================================\nAbout the Author\nCharles L. Adler is professor of physics at St. Mary's College of Maryland.\n===================================================================================","torrent":{"xt":"urn:btih:047ba0ef345f63b670abd293dfb032e803baa4f7","amp;dn":"Charles+L.+Adler+-+Wizards%2C+Aliens%2C+and+Starships.+Physics+and+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047ba0ef345f63b670abd293dfb032e803baa4f7","infoHashBuffer":{"type":"Buffer","data":[4,123,160,239,52,95,99,182,112,171,210,147,223,176,50,232,3,186,164,247]},"announce":[],"urlList":[]}}