{"title":"Just Listen - Mark Goulston.epub","uid":9577230,"size":417624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04cff8ab6632dc2936f1079583e7cb2068682d0a&amp;dn=Just+Listen+-+Mark+Goulston.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391719929,"description":"Foreword by Keith Ferrazzi, author of &quot;Never Eat Alone&quot; and &quot;Who's Got Your Back&quot; The first make-or-break step in persuading anyone to do any thing is getting them to hear you out. Whether the person is a harried colleague, a stressed-out client, or an insecure spouse, things will go from bad to worse if you can't break through emotional barricades. Drawing on his experience as a psychiatrist, business consultant, and coach, and backed by the latest scientific research, author Mark Goulston shares simple but powerful techniques readers can use to really get through to people--whether they're coworkers, friends, strangers, or enemies. &quot;Just Listen&quot; reveals how to: - Make a powerful and positive first impression - Listen effectively - Make even a total stranger--a potential client, perhaps--feel &quot;felt&quot; - Talk an angry or aggressive person away from an instinctual, unproductive reaction and toward a more rational mindset - Achieve buy-in, the linchpin of all persuasion, negotiation, sales, and more Getting through is a fine art but a critical one. With the help of this groundbreaking book readers will be able to turn the &quot;impossible&quot; and &quot;unreachable&quot; people in their lives into allies, devoted customers, loyal colleagues, and lifetime friends.","torrent":{"xt":"urn:btih:04cff8ab6632dc2936f1079583e7cb2068682d0a","amp;dn":"Just+Listen+-+Mark+Goulston.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04cff8ab6632dc2936f1079583e7cb2068682d0a","infoHashBuffer":{"type":"Buffer","data":[4,207,248,171,102,50,220,41,54,241,7,149,131,231,203,32,104,104,45,10]},"announce":[],"urlList":[]}}