{"title":"Climate Shock - The Economic Consequences of a Hotter Planet","uid":11944436,"size":6149302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04e4381371da767f222e3c850618179fe55e81f7&amp;dn=Climate+Shock+-+The+Economic+Consequences+of+a+Hotter+Planet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"santicaz","files":4,"time":1432030451,"description":"Climate Shock: The Economic Consequences of a Hotter Planet\nby Gernot Wagner, Martin L Weitzman\n\n\nIf you had a 10 percent chance of having a fatal car accident, you'd take necessary precautions. If your finances had a 10 percent chance of suffering a severe loss, you'd reevaluate your assets. So if we know the world is warming and there's a 10 percent chance this might eventually lead to a catastrophe beyond anything we could imagine, why aren't we doing more about climate change right now? We insure our lives against an uncertain future--why not our planet?\n\nIn &quot;Climate Shock,&quot; Gernot Wagner and Martin Weitzman explore in lively, clear terms the likely repercussions of a hotter planet, drawing on and expanding from work previously unavailable to general audiences. They show that the longer we wait to act, the more likely an extreme event will happen. A city might go underwater. A rogue nation might shoot particles into the Earth's atmosphere, geoengineering cooler temperatures. Zeroing in on the unknown extreme risks that may yet dwarf all else, the authors look at how economic forces that make sensible climate policies difficult to enact, make radical would-be fixes like geoengineering all the more probable. What we know about climate change is alarming enough. What we don't know about the extreme risks could be far more dangerous. Wagner and Weitzman help readers understand that we need to think about climate change in the same way that we think about insurance--as a risk management problem, only here on a global scale.\n\nDemonstrating that climate change can and should be dealt with--and what could happen if we don't do so--&quot;Climate Shock&quot; tackles the defining environmental and public policy issue of our time","torrent":{"xt":"urn:btih:04e4381371da767f222e3c850618179fe55e81f7","amp;dn":"Climate+Shock+-+The+Economic+Consequences+of+a+Hotter+Planet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e4381371da767f222e3c850618179fe55e81f7","infoHashBuffer":{"type":"Buffer","data":[4,228,56,19,113,218,118,127,34,46,60,133,6,24,23,159,229,94,129,247]},"announce":[],"urlList":[]}}