{"title":"Snap! - 3 albums 1992 - 1996 [FLAC] - Kitlope","uid":6607326,"size":999963165,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04fad0b3bc7558149ef5dcf1ef320b79df576e12&amp;dn=Snap%21+-+3+albums+1992+-+1996+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Kitlope","files":40,"time":1313453994,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 04FAD0B3BC7558149EF5DCF1EF320B79DF576E12\nFile Size: 953.63 MB\nLabel: Logic Records, Arista, Hard To Beat Records \n\n\n\nAlbums, Years &amp; Catalog # in This Torrent: \n\n\nThe Madman's Return 1992 07822-18693-2 *\nWelcome To Tomorrow 1995 (not my rip)\nSnap Attack: The Best Of Snap! 1996 (not my rip)\n\n\n* Denotes My Rip\n\n\n\n\n I would like to thank the original uploaders for Welcome To Tomorrow &amp; The Best of Snap but I don't know who originally upped these since they disappeared from torrent network. If anyone has the 1990 album &quot;World Power&quot; please do make available! Or any other Snap! for that matter. Audiochecker Log is included for the rips that are not mine. Thanks!\n\n\nKit \n\n\n\n\n\n\nPlease help seed these FLACs! \n\n\n\nFrom Wiki:\n\n\nSnap! is a German Eurodance project formed in 1989 by Frankfurt-based producers Michael MÃƒÂ¼nzing and Luca Anzilotti. The act has been through a number of line-up changes over the years, but was most successful when fronted by rapper Turbo B, who performed on the UK number 1 singles &quot;The Power&quot; and &quot;Rhythm Is a Dancer&quot;.\n\nMichael MÃƒÂ¼nzing and Luca Anzilotti formed Snap! in 1989 under the aliases Benito Benites and John &quot;Virgo&quot; Garrett III, as they thought that the public had negative preconceived ideas of German music.[1] Their first hit &quot;The Power&quot;, a combination of house and hip hop elements, contained a number of unauthorised samples, taking the drum loop from &quot;King of the Beats&quot; by Mantronix,[2] the rap from &quot;Let the Words Flow&quot; by Chill Rob G and the classic line &quot;I've got the power&quot; from &quot;Love's Gonna Get You&quot; by Jocelyn Brown. It was initially released in the United States through Wild Pitch Records, but after Chill Rob G threatened legal action, the rap was re-recorded by Turbo B (born Durron Maurice Butler, April 30, 1967 in Pittsburgh, Pennsylvania[3]), and additional vocals were recorded by Penny Ford (though the woman in the video is Jackie Harris), Jocelyn Brown's vocals were replaced by a female studio singer in 1999. The single rocketed to number 2 in Germany in March 1990, and spent two weeks at number 1 in the United Kingdom, becoming the first rap single to top the chart. It later reached number 2 on the Billboard Hot 100, and was certified platinum.\n\nJackie left the group shortly afterwards and Penny became its full-time lead singer, recording the second single &quot;Ooops Up&quot;, a re-working of &quot;I Don't Believe You Want to Get Up and Dance (Oops!)&quot;, a 1980 hit by The Gap Band, with which Penny was a former backing singer. With drum samples from &quot;Paid in Full&quot; by Eric B &amp; Rakim, it was another number 2 hit in Germany and charted at number 5 in the UK. Further hits followed with the oriental-sounding &quot;Cult of Snap&quot;, which charted at number 8 in the UK and number 3 in Germany, and &quot;Mary Had a Little Boy&quot;, which also charted at number 8 in the UK, and reached number 4 in Germany. It was based on the nursery rhyme &quot;Mary Had a Little Lamb&quot;. Their first album World Power reached #10 in the UK where it was certified platinum, #30 in the U.S. where it was also certified platinum, sold in excess of 7 million copies worldwide, and to this day remains one of the best-selling dance albums of all time.\n\nIn 1991, Thea Austin joined the line-up and helped to write &quot;Rhythm Is a Dancer&quot;, which was planned to be the lead single from the second album. However, Turbo B hated the track (particularly the famous line &quot;I'm as serious as cancer when I say rhythm is a dancer&quot;) and protested that &quot;Colour Of Love&quot; should be the first single cut from the album.[4] He got his way and it was released in December 1991. It appeared to get lost in the Christmas rush, limping to number 54 in the UK, though it did fare better in Germany, climbing to number 9, as well as making it to number 6 in France and Sweden. The two producers insisted that they now go with &quot;Rhythm Is a Dancer&quot; and it was released as the second single in July 1992. With a backing-track inspired by &quot;Automan&quot; by early-80s electronic hip-hop band Newcleus, it went on to become their biggest hit yet, spending six weeks at number 1 in the UK, also topping the charts in France, Germany, Netherlands and Italy, and peaking at number 5 in the U.S. in early 1993.\n\nThe second album The Madman's Return was another multi-million seller but Turbo B, who continued arguing with the act's producers, decided to leave the group shortly after its release to pursue a solo career. Both Penny Ford and Thea Austin followed suit, but Snap! was far from over. The third single &quot;Exterminate!&quot;, with vocals by Michigan-born Niki Haris, formerly a backing singer for Madonna, soared to number 2 in the UK in January 1993, and &quot;Do You See the Light (Looking For)&quot; reached number 10 in June.\n\nNow that all former members of the group had moved on, MÃƒÂ¼nzing and Anzilotti recruited Washington DC-born singer Summer to front the act for the third album. Born Paula Brown, she had previously worked as a dancer in the TV series Fame and the Spike Lee movie School Daze.[5] Snap! moved towards a progressive house sound and a new single called &quot;Welcome to Tomorrow (Are You Ready?)&quot; was released in September 1994. After a slow start, it peaked at number 6 in the UK and was followed by the album, also titled Welcome to Tomorrow. The second single &quot;The First The Last Eternity (Till The End)&quot; was a moderate hit but &quot;World in My Hands&quot; and &quot;Rame&quot; (featuring Rukmani and performed in Hindi) struggled to attract airplay due to their less commercial sound.\n\nOn New Years Day 1994, Snap! performed the first of 3 essential mixes for UK's BBC Radio 1.\n\nIn 1996 the group was officially disbanded, with a greatest hits compilation called Snap! Attack: The Best of Snap! released, preceded by a new version of their first hit &quot;The Power&quot;. However they made a surprise return in 2000 with &quot;Gimme A Thrill&quot;, complete with a rap from Turbo B and vocal from the band's newest addition Maxayn. However, it failed to chart and a proposed album called One Day on Earth was never released.\n\nA new version of &quot;Do You See the Light&quot; remixed by Plaything was released in 2002, peaking at number 14 in the UK. The following year, a new remix album called The Cult of Snap! was released and further singles were issued, updating them for a new generation of clubbers. &quot;Rhythm Is a Dancer&quot; was another UK top 20 hit with a new mix by CJ Stone, a new bhangra mix by Motivo of &quot;The Power&quot; also sold well, and a collaboration of Swedish girlgroup NG3 on &quot;Ooops Up&quot; rounded the project up at the end of 2003. &quot;The Power&quot;, which had already been used in countless commercials and movie soundtracks over the years, was also introduced into trailers and the soundtrack of the Jim Carrey film &quot;Bruce Almighty&quot; in this year.\n\nBuoyed by the success of the remixes, MÃƒÂ¼nzing and Anzilotti went back into the studio with male singer Damien Behanan, also known as Loc, and released the single &quot;Beauty Queen&quot; in September 2005 through Luma Music, but once again it failed to make the charts. &quot;Excited&quot; and &quot;We Want Your Soul&quot; were both released on vinyl in July 2006.[6]\n\nIn May 2008, Brains from the programme Thunderbirds appeared in a TV commercial in the UK for Drench spring water. He is shown dancing around a room to &quot;Rhythm Is a Dancer&quot;. Its regular TV airings prompted thousands of downloads of the original album mix of the song, and it has so far peaked at number 23 in the official UK singles chart. A brand new version of the song with added vocals from Loc was released as a CD single in the UK on June 16, 2008.\n\nIn August 2008, they released a new single called &quot;Jumping&quot;. Recently the group have signed to Hard2Beat records.[7]\n\nOn Sunday 27 June 2010 Snap! performed at Glastonbury Festival, UK, in the WOW! tent. Original lead vocalist Penny Ford was joined by rapper Benjamin Lowe to do a 30mins Live PA show. Festival-goers flocked to see Snap! and numbers far outstretched the tent's capacity. Some were left disappointed when the famous rap 'I'm serious as cancer when I say rhythm is a dancer' was omitted from the track.\n\nThe latest performance by Snap! was at Penn Festival in South Buckinghamshire on 9 July 2011. Snap! headlined the the first evening of the inaugural Penn Festival along with Dodgy, held at the Big Park on the Penn Estate.\n\n\n\n\n\n\nThe Madman's Return 1992\n\n\nThe Madman's Return is Snap!'s second studio album and contains the hit &quot;Rhythm Is a Dancer&quot;, which reached #1 in France, Ireland, Italy, the Netherlands, Germany and the United Kingdom and peaked at #5 in the US. Despite having such a huge hit (which is an RIAA-certified gold single[2]), the album performed dismally, only reaching #121 on the US Billboard 200[3].\n\n\nTracks: \n\n\nMadman's Return\nColour Of Love (Massive Version)\nBelieve In It\nWho Stole it?\nRhythm Is A Dancer\nEX-Terminator\nDon't Be Shy\nMoney\nSee The Light\n\n\n\n\n\n\n\n\nWelcome To Tomorrow 1995\n\n\n\nTracks:\n\n\nGreen Grass Grows (Earth Follows)\nIt's A Miracle (People Need To Love One Another)\nRame (Beloved) \nDream On The Moon\nWelcome To Tomorrow (Are You Ready)\nThe world Is In My Hands (We Are One)\nThe First The Last Eternity (Till The End)\nWaves\nWhere Are The Boys, Where Are The Girls\nIt's Not Over\n\n\n\n\n\n\n\nSnap! Attack: The Best of Snap! 1996\n\n\n\nTracks:\n\n\nPower (7 Version)\nOoops Up (7 edit)\nCult of Snap (World Power Radio Mix)\nMary Had A Little Boy (Radio Edit)\nColour of Love (Massive 7)\nRhythm Is A Dancer (7 edit)\nExterminate (Endzeit 7)\nDo You See The Light (Looking For) (7)\nWelcome To Tomorrow (Are You Ready) (feat. Summer)\nThe First The Last Eternity (Till The End) (7 edit) (feat. Summer)\nWorld In My Hands (7 Mix)\nRame (Original Version) (feat. Rukmani)\nMegamix (7 edit) Ooops Up The Power Cult of Snap Mary Had A Little Boy\n\n\n\n\n\nEnjoy Snap!\n","torrent":{"xt":"urn:btih:04fad0b3bc7558149ef5dcf1ef320b79df576e12","amp;dn":"Snap%21+-+3+albums+1992+-+1996+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04fad0b3bc7558149ef5dcf1ef320b79df576e12","infoHashBuffer":{"type":"Buffer","data":[4,250,208,179,188,117,88,20,158,245,220,241,239,50,11,121,223,87,110,18]},"announce":[],"urlList":[]}}