{"title":"TTC - Philosophy of Science","uid":3644736,"size":792218660,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:054f10e3c0554d4e5c5bfcd3802c6441a404c6b6&amp;dn=TTC+-+Philosophy+of+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"BhangWalla","files":37,"time":1174559909,"description":"The Teaching Company\n\nPhilosophy of Science \n(36 lectures, 30 minutes/lecture)\nCourse No. 4100 \n\nTaught by Jeffrey L. Kasser\nNorth Carolina State University\nPh.D., University of Michigan, Ann Arbor \n\n&quot;Science can&amp;#039;t be free of philosophy any more than baseball can be free of physics.&quot; With this bold intellectual swing for the fences, philosopher Jeffrey L. Kasser launches an ambitious and exciting inquiry into what makes science science, using the tools of philosophy to ask: \n\nWhy is science so successful? \nIs there such a thing as the scientific method? \nHow do we distinguish science from pseudoscience? \nIs science rational, cumulative, and progressive? \nFocusing his investigation on the vigorous debate over the nature of science that unfolded during the past 100 years, Professor Kasser covers important philosophers such as Karl Popper, W. V. Quine, Thomas Kuhn, Paul Feyerabend, Imre Lakatos, Carl Hempel, Nelson Goodman, and Bas van Fraassen. \n\nAll of these thinkers responded in one way or another to logical positivism, the dominant movement influencing the philosophy of science during the first half of the 20 th century. Logical positivism attempted to ground science exclusively in what could be known through direct experience and logic. \n\nIt sounds reasonable, but logical positivism proved to be riddled with serious problems, and its eventual demise is an object lesson in how truly difficult it is?perhaps impossible?to secure the logical foundations of a subject that seems so unassailably logical: science. \n\nA Surprisingly Practical Field \n\nThe philosophy of science can be abstract and theoretical, but it is also surprisingly practical. Assumptions about the nature of science affect such contemporary debates as: \n\nWhich research gets funded \nWhat topics qualify as science in elementary and high school classrooms \nWhat is considered legitimate and ethical medical care \nWhat and whether treatments are reimbursed by insurance companies. \nScience plays a pivotal role in our society, and a rigorous study of its philosophical foundations sheds light on the ideas, methods, institutions, and habits of mind that have so astonishingly and successfully transformed our world. \n\nPhilosophy Made Accessible \n\nIn 36 half-hour lectures, Dr. Kasser takes you step by step through a host of philosophical arguments that illuminate important aspects of science. His goal is &quot;to leave you puzzled in articulate and productive ways&quot;?a mission at which he has compiled an impressive track record, as evidenced by such honors as the prestigious Senior Class Charles Bassett Teaching Award at Colby College. \n\nIn reporting this award, Colby Magazine cited the following testimonial from a student: &quot;Jeff makes difficult material accessible better than anyone else from whom I&amp;#039;ve taken a class. After one of Jeff&amp;#039;s classes, students feel as though they have conducted a complete study, not just a survey of scattered ideas.&quot; \n\nSlaying Philosophical Dragons?or Wounding Them? \n\nOne example of how even the most promising approach to science is beset with unforeseeable problems involves the favorite philosopher of many working scientists: Karl Popper. People from all walks of life are familiar with Popper&amp;#039;s rule of thumb for separating pseudoscience from science: If a theory can&amp;#039;t be &quot;falsified&quot;?if there is no way to disprove it?then it doesn&amp;#039;t qualify as science. \n\nEarly in the course, you will learn that Popper came up with this formulation in the 1930s in response to his disillusionment with Marxist political theory and Freudian psychology. Neither discipline appeared to have the self-confidence of, for example, Einstein&amp;#039;s relativity theory, which could unequivocally state the kinds of observations that would disprove, or falsify, it. \n\nBy contrast, Marxists and Freudians tended to argue away all apparently disconfirming evidence, rendering their theories immune to falsification. Spurred by this realization, Popper proposed that true science is engaged in a ceaseless attempt, not to prove theories (something that can never be done definitively), but to falsify them, and having done so, to move ahead to improved theories. These, in turn, undergo a new round of tests until falsified, and so on. \n\nAs you will learn, Popper&amp;#039;s demarcation criteria seemed to slay some prominent philosophical dragons, including the notorious problem of induction, first proposed by the Scottish philosopher David Hume in the 18th century. Hume argued that there is no justification for making the inductive inference that the future will resemble the past, which is a linchpin of scientific reasoning. \n\nFor Popper, this was not a problem because his falsification criteria made no appeal to induction. Professor Kasser quips that Popper is like a mutual fund manager who warns that past performance is not only no guarantee of future performance; it&amp;#039;s no evidence at all for future performance. \n\nBut consider these cases: \n\nContrary to Popper&amp;#039;s model, at some point we stop testing our theories and start taking them for granted. Ask yourself how much sense it makes to get on an airplane if you don&amp;#039;t think past performance is any indicator at all of future performance. \nFrom reading Popper, you might expect that early 19th-century scientists would have been anxious to reject Newtonian physics when the planet Uranus did not have the orbit that Newtonian physics predicted. Instead, they kept Newtonian physics and posited an as-yet-unobserved planet that turned out to be Neptune. \nAstrology is the poster child of alleged pseudosciences. But advocates of this view often say in one breath that astrology makes false predictions and in another that it&amp;#039;s unfalsifiable and hence, unscientific. But making false predictions is just one outcome of making testable ones. You can&amp;#039;t simultaneously reject a theory as false and unscientific, especially if your criterion for science is falsifiability. \nPopper&amp;#039;s criteria admit virtually all competitors into the race to survive falsification. But &quot;nobody would watch the Olympics if everybody got to compete,&quot; says Professor Kasser. &quot;We have to find some way of distinguishing views that should be taken seriously, that should receive our resources, from views that shouldn&amp;#039;t.&quot; \nPopper is not the only thinker to get the philosophical third degree in this manner. If you already hold views about the nature of science or if you simply have strong instincts about what sounds right, you will find your convictions tested repeatedly in this course. \n\nTrack list:\n01 - Science and Philosophy.mp3\n02 - Popper and the Problem of Demarcation.mp3\n03 - Further Thoughts on Demarcation.mp3\n04 - Einstein, Measurement, and Meaning.mp3\n05 - Classical Empiricism.mp3\n06 - Logical Positivism and Verifiability.mp3\n07 - Logical Positivism, Science, and Meaning.mp3\n08 - Holism.mp3\n09 - Discovery and Justification.mp3\n10 - Induction as Illegitimate.mp3\n11 - Some Solutions and a New Riddle.mp3\n12 - Instances and Consequences.mp3\n13 - Kuhn and the Challenge of History.mp3\n14 - Revolutions and Rationality.mp3\n15 - Assessment of Kuhn.mp3\n16 - For and Against Method.mp3\n17 - Sociology, Postmodernism, and Science Wars.mp3\n18 - (How) Does Science Explain.mp3\n19 - Putting the Cause Back in &amp;#039;Because&amp;#039;.mp3\n20 - Probability, Pragmatics, and Unification.mp3\n21 - Laws and Regularities.mp3\n22 - Laws and Necessity.mp3\n23 - Reduction and Progress.mp3\n24 - Reduction and Physicalism.mp3\n25 - New Views of Meaning and Reference.mp3\n26 - Scientific Realism.mp3\n27 - Success, Experience, and Explanation.mp3\n28 - Realism and Naturalism.mp3\n29 - Values and Objectivity.mp3\n30 - Probability.mp3\n31 - Bayesianism.mp3\n32 - Problems with Bayesianism.mp3\n33 - Entropy and Explanation.mp3\n34 - Species and Reality.mp3\n35 - The Elimination of Persons.mp3\n36 - Philosophy and Science.mp3\n\nGuidebook included.\n\nMore related material: &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;","torrent":{"xt":"urn:btih:054f10e3c0554d4e5c5bfcd3802c6441a404c6b6","amp;dn":"TTC+-+Philosophy+of+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054f10e3c0554d4e5c5bfcd3802c6441a404c6b6","infoHashBuffer":{"type":"Buffer","data":[5,79,16,227,192,85,77,78,92,91,252,211,128,44,100,65,164,4,198,182]},"announce":[],"urlList":[]}}