{"title":"Try Not to Breathe by Holly Seddon (ePub, Mobi)","uid":13682961,"size":3714206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:059a0f4fd17c52a66b4ac29fefc5beddf8d5a4bb&amp;dn=Try+Not+to+Breathe+by+Holly+Seddon+%28ePub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Bookz-BB","files":3,"time":1456508756,"description":"Try Not to Breathe by Holly Seddon\r\n\r\n------------\r\n\r\nFor fans of Lianne Moriarty, Paula Hawkins, and Tana French, an arresting debut novel of psychological suspense: a young journalist struggles to keep the demons of her alcoholism at bay as she finds her purpose again in tackling the mystery of a shocking headline-making crime, still unsolved after fifteen years.\r\n\r\nAmy Stevenson was the biggest news story of 1995. Only fifteen years old, Amy disappeared walking home from school one day and was found in a coma three days later. Her attacker was never identified and her angelic face was plastered across every paper and nightly news segment.\r\n\r\nFifteen years later, Amy lies in the hospital, surrounded by 90’s Britpop posters, forgotten by the world until reporter Alex Dale stumbles across her while researching a routine story on vegetative patients.\r\n\r\nRemembering Amy’s story like it was yesterday, she feels compelled to solve the long-cold case.\r\n\r\nThe only problem is, Alex is just as lost as Amy—her alcoholism has cost her everything including her marriage and her professional reputation.\r\n\r\nIn the hopes that finding Amy’s attacker will be her own salvation as well, Alex embarks on a dangerous investigation, suspecting someone close to Amy.\r\n\r\nTold in the present by an increasingly fragile Alex and in dream-like flashbacks by Amy as she floats in a fog of memories, dreams, and music from 1995, Try Not to Breathe unfolds layer by layer to a breathtaking conclusion","torrent":{"xt":"urn:btih:059a0f4fd17c52a66b4ac29fefc5beddf8d5a4bb","amp;dn":"Try+Not+to+Breathe+by+Holly+Seddon+%28ePub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"059a0f4fd17c52a66b4ac29fefc5beddf8d5a4bb","infoHashBuffer":{"type":"Buffer","data":[5,154,15,79,209,124,82,166,107,74,194,159,239,197,190,221,248,213,164,187]},"announce":[],"urlList":[]}}