{"title":"Exiles (Marvel)","uid":5126450,"size":1974700484,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:05a023f6545bd07d66c35e0c93979aed78469bb6&amp;dn=Exiles+%28Marvel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"brodahisou","files":-1,"time":1255647616,"description":"The Exiles are a group of Marvel Comics characters from different dimensions, or realities, which have been removed from time and space in order to correct problems in various alternate worlds and divergent timelines in the Marvel Multiverse.\n\nExiles was created by Mike Marts, Mike Raicht, Judd Winick and also artists Mike McKone and Jim Calafiore. Exiles was created after a period of development aimed at creating a new What If? book for Marvel. In an interview Raicht speaks of the Exiles' early origins: &quot;We were eventually going to visit some alternate realities and flesh out some stories. We were attempting to give the readers a What If? X-Men book. Eventually that idea shifted into a Quantum Leap type thing where Blink, Morph, and maybe Sabretooth from the Age of Apocalypse would join some other heroes, most likely from the Millennial Visions books, to form a reality hopping super team that righted wrongs.&quot;\n\nExiles features a revolving team roster with new characters introduced and others replaced when they are killed or returned to his or her home reality.  The series is notable for the number of characters who stay dead, in contrast to the frequent resurrections that occur in the main Marvel and DC continuities.  It often features familiar characters or settings from previous Marvel storylines such as the Age of Apocalypse and the House of M.\n\nThe first volume of Exiles ran for 100 issues, ending after a cross over with the members of Excalibur in X-Men: Die by the Sword and the one-shot Exiles: Days of Then and Now.  New Exiles began in March 2008 with Chris Claremont and artist Tom Grummett at the helm.  New Exiles lasted 18 issues.   Writer Jeff Parker and artist Salvador Espin relaunched the series with a new #1 in April 2009, but the book was canceled as of the sixth issue.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:05a023f6545bd07d66c35e0c93979aed78469bb6","amp;dn":"Exiles+%28Marvel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05a023f6545bd07d66c35e0c93979aed78469bb6","infoHashBuffer":{"type":"Buffer","data":[5,160,35,246,84,91,208,125,102,195,94,12,147,151,154,237,120,70,155,182]},"announce":[],"urlList":[]}}