{"title":"Robert Hughes - The Shock of the New: A History of Modern Art","uid":9201648,"size":48781042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05f740a07658079daa1976e92148f1f497056413&amp;dn=Robert+Hughes+-+The+Shock+of+the+New%3A+A+History+of+Modern+Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":-1,"time":1384561684,"description":"\nRobert Hughes - The Shock of the New: The Hundred-Year History of Modern Art -- Its Rise, Its Dazzling Achievement, Its Fall (Knopf, 1991).\n\nISBN: 9780679728764 | 448 pages | EPUB\n\n\nTHE SHOCK OF THE NEW is a beautifully illustrated hundred-year history of modern art, from cubism to pop and avant-guard, and features more than 250 color photos.  It was written to accompany the eight-part television series of the same name in 1980.  Its combination of insight, wit and accessibility are still widely praised.\n\nAbout the author: Robert Hughes (1938Â - 2012) was an Australian-born art critic, writer, and producer of television documentaries.  He was described by Robert Boynton of The New York Times as &quot;the most famous art critic in the world.&quot;  Known for his contentious critiques of art and artists, Hughes was generally conservative in his tastes, although he did not belong to a particular philosophical camp.\n\n\nReviews\n\n&quot;The author of The Fatal Shore and Time magazine's art critic here presents a greatly expanded version of a PBS television series on modern art, and includes some 270 color illustrations.  Although he frequently deals in generalities, choice anecdotes, telling characterizations, and witty observations flow from his pen. . . Chapters bristle with apt insights.&quot; -- Publishers Weekly\n\n&quot;Agree or disagree, you will not be bored.  Mr. Hughes has a disarming way of being provocative.&quot; -- John O'Connor, The New York Times\n","torrent":{"xt":"urn:btih:05f740a07658079daa1976e92148f1f497056413","amp;dn":"Robert+Hughes+-+The+Shock+of+the+New%3A+A+History+of+Modern+Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f740a07658079daa1976e92148f1f497056413","infoHashBuffer":{"type":"Buffer","data":[5,247,64,160,118,88,7,157,170,25,118,233,33,72,241,244,151,5,100,19]},"announce":[],"urlList":[]}}