{"title":"The Stray Cats albums","uid":4880392,"size":1280818100,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:069b92df9bb5dbc2d250133d6714ba8d5bbbdf93&amp;dn=The+Stray+Cats+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"SecondOpinion","files":-1,"time":1241361442,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nThe Stray Cats are a rockabilly band formed in 1979 by guitarist/vocalist Brian Setzer (Bloodless Pharaohs/Brian Setzer Orchestra) with school friends Lee Rocker and Slim Jim Phantom in the Long Island town of Massapequa, New York. The group had several hit singles in the UK and the U.S. during the early 1980s.\nThe group, whose style was based upon the sounds of Sun Records artists from the 1950s and heavily influenced by Bill Haley &amp; His Comets, had little initial success in the New York music scene. When Setzer heard that there was a revival of the 1950s Teddy Boy youth subculture in England, the band moved to the UK. The band found themselves in the midst of a nascent rockabilly revival, with youth wearing drape jackets, brothel creepers and updating the 1950s look by using hairspray instead of grease to style their hair and by wearing bright, &quot;loud&quot; colours.\nAfter a gig in London, Stray Cats met producer Dave Edmunds, well known as a roots rock enthusiast for his work with Rockpile and as a solo artist. Edmunds offered to work with the group, and they entered the studio to record their self-titled debut album, Stray Cats, released in England in 1981 on Arista Records. They had three hits that year with &quot;Runaway Boys&quot;, &quot;Rock This Town,&quot; and &quot;Stray Cat Strut.&quot; The UK follow-up to Stray Cats, Gonna Ball, was not as well-received, providing no hits. But the combined sales of their first two albums was enough to convince EMI America to compile the best tracks from the two UK albums and issue an album (Built for Speed) in the U.S. in 1982\n\n","torrent":{"xt":"urn:btih:069b92df9bb5dbc2d250133d6714ba8d5bbbdf93","amp;dn":"The+Stray+Cats+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"069b92df9bb5dbc2d250133d6714ba8d5bbbdf93","infoHashBuffer":{"type":"Buffer","data":[6,155,146,223,155,181,219,194,210,80,19,61,103,20,186,141,91,187,223,147]},"announce":[],"urlList":[]}}