{"title":"The White Countess (2005) Natasha Richardson Eng","uid":5872593,"size":943841898,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06a60c5ef1e5cb0f64127bcd9511d2f06ae63109&amp;dn=The+White+Countess+%282005%29+Natasha+Richardson+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"johnefp","files":-1,"time":1286509683,"description":"James Ivory directed this historical drama of a man who has shut himself away from a world he cannot change. Todd Jackson (Ralph Fiennes) is an American expatriate living in Shanghai in the late '30s. While Jackson was once an American diplomat who came to Shanghai with great optimism about China's future, the bitter political squabbling and military violence that are a part of daily life in China caused him to become bitterly disillusioned. Jackson also lost most of his sight, and he has retreated into Shanghai's decadent underworld of bars and brothels rather than face the world. When a wager on a horse race wins Jackson a small fortune, he decides to indulge a long-time fancy and build the perfect Shanghai bar, one that would ideally reflect that corrupt beauty of the city, and he is joined in his project by Matsuda (Hiroyuki Sanada), a Japanese man with a mysterious past and an appreciation for Shanghai's underbelly. While assembling his pet project, Jackson meets Sofia (Natasha Richardson), a Russian countess who fled her home during the revolution and now lives in Shanghai, supporting her family as a dance-hall girl and occasional prostitute. In Sofia, Jackson discovers a fusion of beauty and tragedy that fascinates him, and he asks her to become the hostess at his new bar. As Jackson becomes closer to Sofia, his cynicism begins to wear away and he develops a deep concern for Sofia and her family. The White Countess also co-stars Vanessa Redgrave, and Lynn Redgrave -- respectively Natasha Richardson's mother and aunt. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0384686/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0384686/&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:10:20\nMovie complete : Yes\n\n[Video]\nResolution : 720x400  1.80:1\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 838 Kbps\nQuality Factor : 0,12 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\n","torrent":{"xt":"urn:btih:06a60c5ef1e5cb0f64127bcd9511d2f06ae63109","amp;dn":"The+White+Countess+%282005%29+Natasha+Richardson+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06a60c5ef1e5cb0f64127bcd9511d2f06ae63109","infoHashBuffer":{"type":"Buffer","data":[6,166,12,94,241,229,203,15,100,18,123,205,149,17,210,240,106,230,49,9]},"announce":[],"urlList":[]}}