{"title":"Brad Thor - Foreign Agent (Scot Harvath #15)","uid":14918270,"size":317110245,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:06d1bd36d902ecf2f96316ef054b00dddce5a77e&amp;dn=Brad+Thor+-+Foreign+Agent+%28Scot+Harvath+%2315%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Cybotage","files":11,"time":1465912325,"description":"From #1 New York Times bestselling author Brad Thor comes Foreign Agent—a thriller as current as tomorrow’s headlines.\r\n\r\nIn a safe house near the Syrian border, a clandestine American operations team readies to launch a dramatic mission months in the making. Their target: the director of Social Media for ISIS, Abu Muslim al-Naser.\r\n\r\nMultiple analysts, as well as a senior Congresswoman, are in the country to monitor the raid, but before the team can launch, the safe house is attacked.\r\n\r\nWhat unfolds in the bloody aftermath is a political and public relations nightmare. As horrific videos of the Americans are published on the Internet, the blame-storming back in Washington goes into full swing, focusing on how the intel for the raid was developed and how it might have leaked.\r\n\r\nAs the search for answers mounts, half spy, half covert counterterrorism operative, Scot Harvath quickly finds himself at the center of the storm. Working for a private intelligence agency contracted by both the CIA and the DoD, it was Harvath who pinpointed al-Naser. But how could ISIS have known the Americans were coming, much less where they would be staying? There has to be more to it; something everyone—especially the politicians—is missing.\r\n\r\nWith the weight of the attack on his shoulders and several powerful members of Congress calling for his head, Harvath is forced to launch his own operation to unravel what went wrong and exact revenge.\r\n\r\nBut as he nears the truth and the deadly puzzle pieces begin to fall into place, Harvath will uncover another actor—a rogue player hell-bent on forcing America’s hand and drawing it into a plot more dangerous than anyone in Washington could have imagined.\r\n\r\n\r\n\r\n\r\n\r\nRead by Armand Schulz\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:06d1bd36d902ecf2f96316ef054b00dddce5a77e","amp;dn":"Brad+Thor+-+Foreign+Agent+%28Scot+Harvath+%2315%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d1bd36d902ecf2f96316ef054b00dddce5a77e","infoHashBuffer":{"type":"Buffer","data":[6,209,189,54,217,2,236,242,249,99,22,239,5,75,0,221,220,229,167,126]},"announce":[],"urlList":[]}}