{"title":"Starship - Knee Deep In The Hoopla [1985][2007][320 KBPS]","uid":10304847,"size":105290652,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:079371ea37cc55f7bc9cf0ef2655815f075d5b1d&amp;dn=Starship+-+Knee+Deep+In+The+Hoopla+%5B1985%5D%5B2007%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"LameDuck69","files":12,"time":1402024285,"description":"Starship - Knee Deep In The Hoopla [1985][2007]\n\n\n\n\n01. We Built This City   \n02. Sara   \n03. Tomorrow Doesn't Matter Tonight   \n04. Rock Myself To Sleep    \n05. Desperate Heart   \n06. Private Room   \n07. Before I Go    \n08. Hearts Of The World (Will Understand)  \n09. Love Rusts \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nStarship is an American rock band established in 1984. Although a continuation of Jefferson Starship, its change in musical direction, loss of key Jefferson Starship personnel, and name change sparked a new identity.\n\n-----------------------------------------------------------------------------------\n\nHistory:\n\nIn June 1984, Paul Kantner, the last remaining founding member of Jefferson Airplane, left Jefferson Starship, and then took legal action over the Jefferson Starship name against his former bandmates. Kantner settled out of court and signed an agreement that neither party would use the names &quot;Jefferson&quot; or &quot;Airplane&quot; unless all members of Jefferson Airplane, Inc. (Bill Thompson, Paul Kantner, Grace Slick, Jorma Kaukonen, Jack Casady) agreed. The band briefly changed its name to Jefferson Starship while legal proceedings occurred, but ultimately the name was reduced to Starship. David Freiberg stayed with the band after the lawsuit and attended the first studio sessions for the next album. He became frustrated with the sessions because all the keyboard work in the studio was being done by Peter Wolf (who had played on the sessions for Nuclear Furniture and briefly joined the band on the road for the follow-up tour) and that was the instrument Freiberg was supposed to be playing. He left the band and the next album was finished with the five remaining members. In 1984, Gabriel Katona (who had previously played in Rare Earth and Player) joined the band to play keyboards and saxophone on the road with them through the end of 1986.\n\nThe next album, Knee Deep in the Hoopla was released in October 1985 and scored two No. 1 hits. The first was &quot;We Built This City&quot;, written by Bernie Taupin, Martin Page, Dennis Lambert, and Peter Wolf and was engineered by Grammy-winning producer Bill Bottrell and arranged by Bottrell and Jasun Martz; the second was &quot;Sara&quot;. The album itself reached No. 7, went platinum, and spawned two more singles: &quot;Tomorrow Doesn't Matter Tonight&quot; (#26), and &quot;Before I Go&quot; (#68). The band had not had a No. 1 hit record since the original Jefferson Starship released Red Octopus in 1975.\n\nIn early 1987, &quot;Nothing's Gonna Stop Us Now&quot; was featured in the film Mannequin and hit No. 1, although only Slick and Mickey Thomas (plus Craig Chaquico's guitar solo) appeared on it. At that time, the song made Slick the oldest female vocalist to sing on a number-one Billboard Hot 100 hit, at the age of 47 (she held this record until Cher broke it at the age of 52, in 1999 with &quot;Believe&quot;). The following year, the band's song &quot;Wild Again&quot; (which reached No. 73 on the Billboard singles chart) was used in the movie Cocktail.\n\nBy the time No Protection was released, bassist and keyboardist Pete Sears had left the band. Sears went on to play keyboards with former Jefferson Airplane members Jorma Kaukonen and Jack Casady in Hot Tuna for ten years. Starship's No Protection was not released until well after &quot;Nothing's Gonna Stop Us Now&quot; (its most popular single) had peaked on the charts, and went gold; in addition to &quot;Nothing's Gonna Stop Us Now&quot; (#1), it featured the singles &quot;It's Not Over ('Til It's Over)&quot; (#9), and &quot;Beat Patrol&quot; (#46). The last song on the album, &quot;Set the Night to Music&quot;, would later become a huge hit when re-recorded as a duet between Roberta Flack and Maxi Priest. For the No Protection tour, Brett Bloomfield was brought in to replace Sears and Mark Morgan was their new stage keyboardist.\n\nGrace Slick left Starship in 1988, going on to join the reformed Jefferson Airplane, for one album in 1989, before announcing that she was retiring from music. As Kantner, Sears and Freiberg had left the band, all the new and remaining members were more than a decade younger than she was. To this day Slick maintains that old(er) people &quot;don't belong on a rock and roll stage&quot;.\n\nWith Thomas the sole lead singer, the revamped lineup released Love Among the Cannibals in August 1989 and went on another tour to support the album. On September 24, 1989, while the band was in Scranton, Pennsylvania, for a show, Donny Baldwin and Mickey Thomas got into an altercation during which Thomas was injured. Shortly after, Baldwin left the band to pursue other career interests. The remainder of the tour was postponed until a replacement drummer could be found.\n\n-----------------------------------------------------------------------------------\n\nBreakup:\n\nAfter Thomas was well enough to tour, the band continued to tour in support of Cannibals. A replacement drummer, Kenny Stayripolous, was found and two female backup singers, Christina Marie Saxton and Melisa Kary, were recruited after Grace's departure. After the Cannibals tour wound up in 1990, Chaquico, the last remaining original Jefferson Starship member, handed in his notice. Thomas attributes the comparative lack of commercial success of the last album to the interruption of the tour, among other factors. Cannibals remains his personal favorite Starship album.\n\n \nStarship featuring Mickey Thomas in concert, 2010Early the following year, RCA assembled a greatest hits album, Greatest Hits (Ten Years and Change 1979-1991), which featured two new tracks, one with Thomas &amp; Chaquico (recorded before Craig had left) and the other featuring only Thomas and session players. For a brief period it was thought that Thomas would continue forward as Starship, but manager Bill Thompson then decided it was over and told RCA that the band was done making records. Thomas revived Starship in 1992 as &quot;Mickey Thomas' Starship&quot; before settling on Starship featuring Mickey Thomas with different personnel and has toured steadily ever since.\n\nIn November 2010, Mickey Thomas announced on his website that a new Starship album, Loveless Fascination, would be released in the summer or fall of 2011. The album was eventually released on 17 September 2013.\n\nGuitarist Mark Abrahamian, 46, died from a heart attack following a concert on September 2, 2012. He had been on tour with the group since 2000. He was replaced by John Roth.\n\n-----------------------------------------------------------------------------------\n\nKnee Deep in the Hoopla is the first release by Starship in 1985, the successor band to Jefferson Airplane and later Jefferson Starship.The album's title comes from a line in the song We Built This City. It was certified platinum by the RIAA, and is best remembered for spawning the No. 1 hits &quot;We Built This City&quot; and &quot;Sara&quot;.\n\n&quot;We Built This City&quot; was written by Bernie Taupin (Elton John's longtime collaborator), Martin Page, Dennis Lambert, and Peter Wolf. A line in this song is the basis of the album's title.\n\nThe track &quot;Desperate Heart&quot;, written by Michael Bolton and Randy Goodrum, also appears on Bolton's album Everybody's Crazy, released the same year.\n\n-----------------------------------------------------------------------------------\n\nPersonnel:\n\n\nDonny Baldwin: drums, electronic drums, vocals\n\nGrace Slick: vocals\n\nMickey Thomas: vocals\n\nCraig Chaquico: guitars\n\nPete Sears: bass, synth bass\n\n\n\n\nAdditional Personnel: \n\n\nPeter Wolf: keyboards\n\nLes Garland: DJ voice on &quot;We Built This City&quot;\n\nPeter Beckett, J. C. Crowley, Siedah Garrett, Ina Wolf: additional background vocals on &quot;Tomorrow Doesn't Matter Tonight&quot; and &quot;Love Rusts&quot;\n\nKevin Dubrow: additional vocal on &quot;Rock Myself to Sleep&quot;\n\nDave Jenkins: additional background vocal on &quot;Desperate Heart&quot;\n\nSimon Climie, Lorraine Devon, Phillip Ingram, Martin Page, Chris Sutton, Oren Waters: additional background vocals on &quot;Love Rusts&quot;\n","torrent":{"xt":"urn:btih:079371ea37cc55f7bc9cf0ef2655815f075d5b1d","amp;dn":"Starship+-+Knee+Deep+In+The+Hoopla+%5B1985%5D%5B2007%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079371ea37cc55f7bc9cf0ef2655815f075d5b1d","infoHashBuffer":{"type":"Buffer","data":[7,147,113,234,55,204,85,247,188,156,240,239,38,85,129,95,7,93,91,29]},"announce":[],"urlList":[]}}