{"title":"Surviving Off  Off - Grid: Decolonizing the Industrial Mind","uid":8093257,"size":521725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07d5359b5e966e5a67285455f2f4cdd3592ac666&amp;dn=Surviving+Off++Off+-+Grid%3A+Decolonizing+the+Industrial+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"DaRule762","files":-1,"time":1359768265,"description":"Western Society is in confusion, the industrial world is teetering on collapse, and it looks like things could get worse. Agrarian Blogger, historian, and &quot;plain&quot; preacher Michael Bunker has been living off of the grid for many years, and he has some advice for those living in the industrial/consumerist economy ...living an off off-grid life is achievable. It has been done for thousands of years, and it can be done today... It is quite possible that many people who have relied on a failing system for their means of survival will very soon find that they have made a mistake of historic proportions. Historic, because every major &quot;classical&quot; culture went down the same road our society is on today. This book is about the lessons we should have learned, and what you can do to survive what history tells us must come next.\n***Warning*** In the increasingly fascistic and politically correct environment, many people are easily offended by any opinions with which they do not already agree.  The author has studied and learned from many different people and books from many different religious backgrounds and was able to gather from them what good he could without feeling the need to attack those with differing opinions and worldviews.  Unhappily, in today's society, there are those who believe that books or materials that they do not agree with should have a badge or marking stating that God is mentioned in the book.  Surviving Off Off-Grid was written by a Christian man and his faith informs his worldview and ideas.  He mentions God in the book.  If you are offended by ideas that you don't already hold, or by anyone who dares mention that there is a God in the public square, then this book is not for you.","torrent":{"xt":"urn:btih:07d5359b5e966e5a67285455f2f4cdd3592ac666","amp;dn":"Surviving+Off++Off+-+Grid%3A+Decolonizing+the+Industrial+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07d5359b5e966e5a67285455f2f4cdd3592ac666","infoHashBuffer":{"type":"Buffer","data":[7,213,53,155,94,150,110,90,103,40,84,85,242,244,205,211,89,42,198,102]},"announce":[],"urlList":[]}}