{"title":"John Reader - Africa_ A Biography of the Continent.mobi","uid":11720458,"size":2031126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07df5e3310d51bf81eadf12dcb87c33a9a312e37&amp;dn=John+Reader+-+Africa_+A+Biography+of+the+Continent.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Papushi","files":1,"time":1424793766,"description":"[Uploader's Note: This isn't a retail copy and is mostly a jury-rigged conversion of a pdf version. It contains a small number of typos, nothing too distracting. I've uploaded it because it is the best book on Africa I've read and one of the best books I've ever read. Wholeheartedly recommended.]\n\n&quot;Awe-inspiring . . . a masterly synthesis.&quot;\n--The New York Times Book Review\n\n&quot;Deeply penetrating, intensely thought-provoking and thoroughly informed . . . one of the most important general surveys of Africa that has been produced in the last decade.&quot; --The Washington Post\n\nIn 1978, paleontologists in East Africa discovered the earliest evidence of our divergence from the apes: three pre-human footprints, striding away from a volcano, were preserved in the petrified surface of a mudpan over three million years ago. Out of Africa, the world's most ancient and stable landmass, Homo sapiens dispersed across the globe.  And yet the continent that gave birth to human history has long been woefully misunderstood and mistreated by the rest of the world.\n\nIn a book as splendid in its wealth of information as it is breathtaking in scope, British writer and photojournalist John Reader brings to light Africa's geology and evolution, the majestic array of its landforms and environments, the rich diversity of its peoples and their ways of life, the devastating legacies of slavery and colonialism as well as recent political troubles and triumphs. Written in simple, elegant prose and illustrated with Reader's own photographs, Africa: A Biography of the Continent is an unforgettable book that will delight the general reader and expert alike.  \n\n&quot;Breathtaking in its scope and detail.&quot; --San Francisco Chronicle","torrent":{"xt":"urn:btih:07df5e3310d51bf81eadf12dcb87c33a9a312e37","amp;dn":"John+Reader+-+Africa_+A+Biography+of+the+Continent.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07df5e3310d51bf81eadf12dcb87c33a9a312e37","infoHashBuffer":{"type":"Buffer","data":[7,223,94,51,16,213,27,248,30,173,241,45,203,135,195,58,154,49,46,55]},"announce":[],"urlList":[]}}