{"title":"The Paleo Cookbook by Rockridge Press","uid":9660912,"size":10733716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08007952be3a16af6a2ab196bef05937e5f40969&amp;dn=The+Paleo+Cookbook+by+Rockridge+Press&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"PirateBook","files":1,"time":1393278322,"description":"\nSimply put, the Paleo diet is the diet that humans were intended to eat. The Paleo Cookbook will make it easy to start your Paleo journey.\n\nLow carb, high protein, and full of wholesome, natural foods, the Paleo diet has gained rapid popularity for those who truly savor good cooking, but no longer want to be weighed down by processed or unhealthy food. \n\nTHE PALEO COOKBOOK simplifies the transition into the Paleo lifestyle. This comprehensive Paleo cookbook has 300 mouthwatering recipes for every meal and occasion, all gluten free and full of whole, unprocessed ingredients.\n\nThe Paleo Cookbook will make it easier to start feeling better and get fit with:\nÂ· 300 recipes for every meal from The Paleo Cookbook\n\nÂ· Comfort foods to please the entire family, like Paleo Lasagna or Caveman Chicken Nuggets\n\nÂ· Paleo Cookbook versions of your favorite international dishes such as Teriyaki Beef, Chicken Cacciatore, and Caveman Fajitas\n\nÂ· Dozens of vegetarian options for non meat-eaters\n\nÂ· Amazing Paleo Cookbook desserts such as Chocolate Cake, and Paleo Chocolate Chip\nCookies\n\nWith The Paleo Cookbook you'll finally be able to create Paleo meals that are delicious for the whole family!\n\nGenre: Non-Fiction, Cooking","torrent":{"xt":"urn:btih:08007952be3a16af6a2ab196bef05937e5f40969","amp;dn":"The+Paleo+Cookbook+by+Rockridge+Press","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08007952be3a16af6a2ab196bef05937e5f40969","infoHashBuffer":{"type":"Buffer","data":[8,0,121,82,190,58,22,175,106,42,177,150,190,240,89,55,229,244,9,105]},"announce":[],"urlList":[]}}