{"title":"Captain America (UPDATED)","uid":8970471,"size":11240333446,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:080199a1f192962bba183d266ea7d13272f4b7c9&amp;dn=Captain+America+%28UPDATED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":9,"uploader":"Zlenny","files":772,"time":1380323721,"description":"Captain America is an American fictional character, a superhero who appears in comic books published by Marvel Comics. The character first appeared in Captain America Comics #1 (cover-dated March 1941),[1][2][3][4][5] from Marvel Comics' 1940s predecessor, Timely Comics, and was created by Joe Simon and Jack Kirby. As of 2007, an estimated 210 million copies of &quot;Captain America&quot; comic books had been sold in 75 countries.[6] For nearly all of the character's publication history, Captain America has been the alter ego of Steve Rogers, a frail young man who was enhanced to the peak of human perfection by an experimental serum, in order to aid the United States government's efforts to win World War II. Captain America wears a costume that bears an American flag motif, and is armed with an indestructible, boomerang-like shield that can both be thrown as a weapon and used to defend against others' weapons.[7]\n\nAn intentionally patriotic creation who was often depicted fighting the Axis powers of World War II, Captain America was Timely Comics' most popular character during the 1940s wartime period. After the war ended, the character's popularity waned and the comic had been discontinued by 1950 aside from an ill-fated 1953 revival. Captain America was re-introduced by Marvel Comics during the Silver Age of comics, as an M.I.A soldier retrieved from an iceberg and awakened from suspended animation by the superhero team the Avengers in The Avengers #4 (March 1964). Since then, Captain America has often led the team, as well as starring in his own series.\n\nSteve Rogers was purportedly assassinated in Captain America vol. 5, #25 (March 2007), although he was later revealed to be alive. The comic-book series Captain America continued to be published,[8] with Rogers' former sidekick, James &quot;Bucky&quot; Barnes, having taken up the mantle until Rogers eventually again assumed the role.\n\nThis Torrent includes:\n\n. The Publication history of Captain America (1941 - 2013) \n. Variant covers (if available)\n. In English and in CBR and/or CBZ format\n. Tie-ins included \n\nIf you appreciate the torrent and work, leave a comment. \t","torrent":{"xt":"urn:btih:080199a1f192962bba183d266ea7d13272f4b7c9","amp;dn":"Captain+America+%28UPDATED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"080199a1f192962bba183d266ea7d13272f4b7c9","infoHashBuffer":{"type":"Buffer","data":[8,1,153,161,241,146,150,43,186,24,61,38,110,167,209,50,114,244,183,201]},"announce":[],"urlList":[]}}