{"title":"Writers' Workshops - Richard P. Gabriel.pdf","uid":10534662,"size":3162829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:082e4b81f0b9252ea3f32c2998461f431a1e64a5&amp;dn=Writers%27+Workshops+-+Richard+P.+Gabriel.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1405148068,"description":"For more than 100 years, Writers' Workshops have offered writers deep and generous insights into their own work: insights that have helped them improve, and often inspired them to take their work in exciting new directions. Recently, technical, scientific, and business professionals have also discovered the immense value of the Writers' Workshop format in solving their creative problems. Now, an experienced leader and participant shows how Writers' Workshops work -- and how they can help everyone from poets to software architects. Richard P. Gabriel considers the Writers' Workshop as process, ritual, and experience. He explains what conditions are required to make it work, how to run one, how to participate in one, how to survive one -- and how to use it to further your own work. In the first section of the book, Gabriel introduces a model of writing and the writing process, illuminating the commonalities between writing and other forms of creative expression, such as software development. Next, he draws on the experiences of participants to illuminate every aspect of the Writers' Workshop, including preparation and setting, the author's reading, shepherding, summarization, positive feedback, suggestions for improvement, clarification, and revisions. Work in Progress introduces the Writers' Workshop to a wide new audience, including: new writers who want to improve fast; veteran workshoppers; technical people and scientists; businesspeople seeking to improve collateral material and presentations; and software","torrent":{"xt":"urn:btih:082e4b81f0b9252ea3f32c2998461f431a1e64a5","amp;dn":"Writers%27+Workshops+-+Richard+P.+Gabriel.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082e4b81f0b9252ea3f32c2998461f431a1e64a5","infoHashBuffer":{"type":"Buffer","data":[8,46,75,129,240,185,37,46,163,243,44,41,152,70,31,67,26,30,100,165]},"announce":[],"urlList":[]}}