{"title":"The Crusaders [Jazz], a nice collection of 46 tracks","uid":4196600,"size":255350152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08305e97aee9a6a649da0c49d085afce69feda30&amp;dn=The+Crusaders+%5BJazz%5D%2C+a+nice+collection+of+46+tracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"petarv","files":46,"time":1211256157,"description":"Back in 1954, Houston pianist Joe Sample teamed up with high school friends tenor saxophonist Wilton Felder and drummer Stix Hooper to form the Swingsters. Within a short time, they were joined by trombonist Wayne Henderson, flutist Hubert Laws, and bassist Henry Wilson and the group became the Modern Jazz Sextet. With the move of Sample, Felder, Hooper, and Henderson to Los Angeles in 1960, the band (a quintet with the bass spot constantly changing) took on the name of the Jazz Crusaders. The following year they made their first recordings for Pacific Jazz and throughout the 1960s the group was a popular attraction, mixing together R&amp;B and Memphis soul elements with hard bop; its trombone/tenor frontline became a trademark. By 1971, when all of the musicians were also busy with their own projects, it was decided to call the group simply the Crusaders so it would not be restricted to only playing jazz. After a few excellent albums during the early part of the decade (with guitarist Larry Carlton a strong asset), the group began to decline in quality. In 1975, the band&amp;#039;s sound radically changed when Henderson departed to become a full-time producer. 1979&amp;#039;s &quot;Street Life&quot; was a hit, but also a last hurrah. \n\nBe sure to give &quot;Soul shadows&quot; and &quot;Carnival of the night&quot;  a listen.","torrent":{"xt":"urn:btih:08305e97aee9a6a649da0c49d085afce69feda30","amp;dn":"The+Crusaders+%5BJazz%5D%2C+a+nice+collection+of+46+tracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08305e97aee9a6a649da0c49d085afce69feda30","infoHashBuffer":{"type":"Buffer","data":[8,48,94,151,174,233,166,166,73,218,12,73,208,133,175,206,105,254,218,48]},"announce":[],"urlList":[]}}