{"title":"NI Guitar Rig v2.2.0 MAC OSX (UB) - Cracked by DYNAMiCS","uid":3815436,"size":255608075,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:085d86274f24c54f51081b8fa975aad2f643b568&amp;dn=NI+Guitar+Rig+v2.2.0+MAC+OSX+%28UB%29+-+Cracked+by+DYNAMiCS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AmpSim","files":3,"time":1190478575,"description":"Native Instruments Guitar Rig v2.2.0 for Mac OS X (Universal Binary included)\n\n\nBased on NI&amp;#039;s Dynamic Tube Response technology, the second version of Guitar Rig adds emulations of four sought-after amp classics, bringing the total number of included amp models up to eight. The new Marshall JCM 800 emulation delivers the powerful hi-gain tone that defined the sound of countless punk and metal bands, while the Fender Bassman model adds a highly characteristic vintage flavor for blues and classic rock. Also part of the new amp arsenal is an emulation based on the Roland Jazz Chorus, beloved for its pristine clean sounds by jazz and pop guitarists. \n\nGuitar Rig 2 also adds a full setup of bass gear, centered around an emulation of an Ampeg SVT bass head with its signature bottom-end richness and sonic precision. A selection of six bass cabinets ranging from 1x15 to 8x10 sizes as well as four additional microphone models optimized for bass recording allow Guitar Rig 2 to turn into a full-featured four-string studio whenever the need arises. \n\nMore classic distortion and effect modules \n\nGuitar Rig 2 brings the number of included stomp box emulations and effect units up to 36. Three new distortions pedals modeled after popular real-world units offer additional crunch, overdrive and hi-gain flavors, while seven new effect modules add further options to shape the tone.New additions include a stomp compressor, a classic Autofilter model, and a true-to-life emulation of the Dunlop Cry Baby Wah pedal. One of the most creative additions to the arsenal is the new Loop Machine, a powerful and highly intuitive real-time loop recording delay that allows musicians to record and overdub up to 99 layers of audio on the fly. \n\nNative Instruments GUITAR RIG 2 Specifications:\n\nAudio Units, VST, RTAS on ProTools 7, DXi, ASIO, Core Audio, Core MIDI, and DirectSound compatible \nMac requirements: Mac OS X 10.3.x, G4 733MHz, 512MB RAM \nMac recommendation: Mac OS X 10.4.x, G4 1.25GHz, 768MB RAM \nNative Instruments GUITAR RIG 2 Features:\n\n8 renowned guitar and bass amps \n15 guitar and 6 bass cabinets \n4 rotary speakers \n9 microphones \n35 effects \nLoop Machine \nSynth filters \nDynamic Tube Response technology \nDrag and drop sound building \nRealtime control of all parameters \nRig Kontrol 2 USB 2.0 foot-controller \n","torrent":{"xt":"urn:btih:085d86274f24c54f51081b8fa975aad2f643b568","amp;dn":"NI+Guitar+Rig+v2.2.0+MAC+OSX+%28UB%29+-+Cracked+by+DYNAMiCS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085d86274f24c54f51081b8fa975aad2f643b568","infoHashBuffer":{"type":"Buffer","data":[8,93,134,39,79,36,197,79,81,8,27,143,169,117,170,210,246,67,181,104]},"announce":[],"urlList":[]}}