{"title":"G.F. Haendel - Messiah - Hogwood (1991) [FLAC]","uid":4492035,"size":685801205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:08a90891f92a61521d60c6d99a0945f7a137fc26&amp;dn=G.F.+Haendel+-+Messiah+-+Hogwood+%281991%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Permanentus","files":50,"time":1226019576,"description":"George Frideric Handel (1685-1759)\n\nMessiah (Foundling Hospital Version 1754)\n\nOrchestra: The Academy Of Ancient Music (on authentic instruments)\nConductor: Christopher Hogwood\nChoir: Choir Of Christ Church Cathedral, Oxford (Directed By Simon Preston)\n\nSopranos: Judith Nelson, Emma KÃƒÆ’Ã‚Â­rkby\nContralto: Carolyn Watkinson\nTenor: Paul Elliott\nBass: David Thomas\n\nLabel: Decca, Edition De L'Oiseau-Lyre (2-CD) 430 488-2\n\nAudio CD (October 10, 1991) \n\n\n&quot;This is the 'Messiah' that started it all--the first period instrument performance recorded with a choir of men and boys. It introduced music lovers the world over to Christopher Hogwood, Emma Kirkby, and a whole host of performers who have since become ubiquitous as the 'English Early Music Mafia,' appearing as they do under zillions of different ensemble names on a variety of labels. Hogwood's performance still holds its own, however, as one of the finest and freshest available. A first-rate effort.&quot;\n--David Hurwitz &lt;a href=&quot;\nhttp://www.amazon.com/Handel-Messiah-Watkinson-Elliott-Hogwood/dp/B000004CXU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Handel-Messiah-Watkinson-Elliott-Hogwood/dp/B000004CXU&lt;/a&gt;\n\n--------------------\nDisc: 1\n\n1. Messiah - Part I: Sinfony\n2. Messiah - Part I: Recitative: Comfort Ye My People - Song: Every Valley Shall Be Exalted\n3. Messiah - Part I: Chorus: And The Glory Of The Lord\n4. Messiah - Part I: Recitative: Thus Saith The Lord - Song: But Who May Abide The Day Of His Coming?\n5. Messiah - Part I: Chorus: And He Shall Purify\n6. Messiah - Part I: Recitative: Behold, A Virgin Shall Conceive - Song: O Thou That Tellest Good Tidings To Zion\n7. Messiah - Part I: Recitative: For Behold, Darkness Shall Cover The Earth - Song:The People That Walked In The Darkness\n8. Messiah - Part I: Chorus: For Unto Us A Child Is Born\n9. Messiah - Part I: Pifa\n10. Messiah - Part I: Recitative: There Were Shepherds, Abinding In The Field - Recitative: And, Lo The Angel Of The Lord Came Upon Them - Recitative: And The Angel Said Unto Them - Recitative: And Suddenly There Was With The Angel\n11. Messiah - Part I: Song: Rejoice Greatly, O Daughter Of Zion\n12. Messiah - Part I: Recitative: Then Shall The Eyes Of The Blind - Song: He Shall Feed His Flock\n13. Messiah - Part I: Chorus: His Yoke Is Easy, And His Burden Is Light\n14. Messiah - Part II: Chorus: Behold The Lamb Of God\n15. Messiah - Part II: Song: He Was Despised \n\nDisc: 2\n\n1. Messiah - Part II: Chorus: Surely He Hath Borne Our Griefs - Chorus: And With His Stripes We Are Healed\n2. Messiah - Part II: Chorus: All We Like Sheep Have Gone Astray\n3. Messiah - Part II: Recitative: All They That See Him Laugh Him To Scorn - Chorus: He Trusted In God\n4. Messiah - Part II: Recitative: Thy Rebuke Hath Broken His Heart - Song: Behold And See If There Be Any Sorrow - Recitative: He Was Cut Off Out Of The Land Of The Living\n5. Messiah - Part II: Song: But Thou Didst Not Leave His Soul In Hell\n6. Messiah - Part II: Chorus: Lift Up Your Heads, O Ye Gates\n7. Messiah - Part II: Recitative: Unto Which Of The Angels Said He At Any Time - Chorus: Let All The Angels Of God Worship Him\n8. Messiah - Part II: Song: Thou Art Gone Up On High\n9. Messiah - Part II: Chorus: The Lord Gave The Word\n10. Messiah - Part II: Song: How Beautiful Are The Feet\n11. Messiah - Part II: Chorus: Their Sound Is Gone Out\n12. Messiah - Part II: Song: Why Do The Nations So Furiously Rage Together? - Chorus: Let Us Break Their Bonds Asunder\n13. Messiah - Part II: Recitative: He That Dwelleth In Heaven - Song: Thou Shalt Break Them\n14. Messiah - Part II: Chorus: Hallelujah\n15. Messiah - Part III: Song: I Know That My Redeemer Liveth\n16. Messiah - Part III: Chorus: Since By Man Came Death\n17. Messiah - Part III: Recitative: Behold, I Tell You A Mystery - Song: The Trumpet Shall Sound\n18. Messiah - Part III: Recitative: Then Shall Be Brought To Pass - Duet: O Death, Where Is Thy Sting?\n19. Messiah - Part III: Chorus: But Thanks To Be God\n20. Messiah - Part III: Song: If God Be For Us\n21. Messiah - Part III: Chorus: Worthy Is The Lamb That Was Slain\n22. Messiah - Part III: Chorus: Amen Listen Listen Listen \n\n(reposted from tntvillage)","torrent":{"xt":"urn:btih:08a90891f92a61521d60c6d99a0945f7a137fc26","amp;dn":"G.F.+Haendel+-+Messiah+-+Hogwood+%281991%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08a90891f92a61521d60c6d99a0945f7a137fc26","infoHashBuffer":{"type":"Buffer","data":[8,169,8,145,249,42,97,82,29,96,198,217,154,9,69,247,161,55,252,38]},"announce":[],"urlList":[]}}