{"title":"SensualPain - SM Exist To Serve  Abigail Dupree High","uid":15603605,"size":2792348045,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:08ce6bfeb3a3ac1d75f9bb4f1e594d4abed67807&amp;dn=SensualPain+-+SM+Exist+To+Serve++Abigail+Dupree+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"merzedes","files":1,"time":1471690632,"description":"\nS&amp;M Exist To Serve | Abigail Dupree\r\n\r\nAugust 10, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nExist To Serve\r\n\r\nMaster James and His slave abigail love to have fun but Mâ„s is not all about fun and games. Abigail has learned to be on her toes at all times whether shes making a meal and suddenly feels the sting of her Master's blow dartâ„pellet gun on her naked skin or taking a shower and suddenly challenged by a drastic temperature change. In this video, Master James sets up the camera just as the sun is beginning to rise and wakes His slave up from a deep sleep with her outfit of strict leather bondage laying before her to adorn. With sleep still in her eyes, He leads her to the whipping post and begins to challenge her with His buggery. Stinging whips, leather paddles, inflatable dildo, heavy rocks hung from her cunt piercings... enough to wake anyone up in the morning. Excellence is what is expected and excellence comes from knowing that the sometimes mundane tasks in life are a gift when not paired with mental and physical anguish. \r\n\r\nBDSM is a gateway... Sometimes I feel that the way I choose to live my life is worlds apart from others. To include those that have the capacity to grasp the extent of their own capabilities, to just let go and live here and now, is easy. Our emotional freedom to explore sensuality is really endless in its own sense. I find beauty in the simplest things. Sometimes this feeling hits hard. Sometimes others feel it. Sometimes there is a connection. Do we live to experience recreation just to live it again. Is this existence cyclical or is this the only single chance, all there is and we waste it on things that mean nothing.. Know that you are a loving sensual creature that is symbiotic to everything around you. Your a reflection of your own existence. BDSM is for those that need to break away, that need to feel more than singular. BDSM is a gateway to a spirituality that gods were made from. \r\n\r\nScreens \nhttp://www.sensualpain.com/sadomasochism/trailer.php?y=2016&amp;p=08_10adupree22&amp;u=SensualPain-Abigail-Dupree-SM-Exist-To-Serve\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:08ce6bfeb3a3ac1d75f9bb4f1e594d4abed67807","amp;dn":"SensualPain+-+SM+Exist+To+Serve++Abigail+Dupree+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08ce6bfeb3a3ac1d75f9bb4f1e594d4abed67807","infoHashBuffer":{"type":"Buffer","data":[8,206,107,254,179,163,172,29,117,249,187,79,30,89,77,74,190,214,120,7]},"announce":[],"urlList":[]}}