{"title":"DC Showcase Original Shorts Collection DVDRIP ","uid":6769424,"size":626962250,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08f8304384f4c77335960157057de986af70fd3c&amp;dn=DC+Showcase+Original+Shorts+Collection+DVDRIP+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"yerisan710","files":-1,"time":1319524179,"description":"Name:DC Showcase Original Shorts Collection\n\nAnimated Original Movies.\n\nThis collects:\n\n* DC Showcase: The Spectre, featuring the Spectre, that was included with Justice League: Crisis on Two Earths. The short features the voice talents of Gary Cole in the leading role of the Spectre/Jim Corrigan and supporting cast members Alyssa Milano, Jeff Bennett, Rob Paulsen, and Jon Polito.\n\n* DC Showcase: Jonah Hex, featuring Jonah Hex, that was included with Batman: Under the Red Hood. The short features the voice talents of Thomas Jane in the leading role of Jonah Hex and supporting cast members Linda Hamilton, Jason Marsden, Michael Rooker, and Michelle Trachtenberg.\n\n* DC Showcase: Green Arrow, featuring Green Arrow, that was included with Superman/Batman: Apocalypse. The short features the voice talents of Neal McDonough in the leading role of Green Arrow and supporting cast members Malcolm McDowell as Merlyn, Steven Blum as Count Vertigo, Grey DeLisle as Black Canary, John DiMaggio, and Ariel Winter.\n\n* Superman/Shazam!: The Return of Black Adam, featuring Superman and Captain Marvel, is included with the upcoming DC Showcase Original Shorts Collection. A significant feature has George Newbern and Jerry O'Connell reprising their roles of Superman and Captain Marvel from Justice League Unlimited. The short also features the voice talents of Arnold Vosloo\nas Black Adam and James Garner as Shazam. The short will be twenty-two minutes, giving it the longest run-time of any short in the series.\n\nCategory:\tMovies &gt; DVDRip\nLanguage:English  English\nTotal Size:612.268 MB\nCountry:Date\nUSA :9 November 2010 \t\n\n*****DATA TRANSFERRED SO WHAT AS THIS*******YRS","torrent":{"xt":"urn:btih:08f8304384f4c77335960157057de986af70fd3c","amp;dn":"DC+Showcase+Original+Shorts+Collection+DVDRIP+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08f8304384f4c77335960157057de986af70fd3c","infoHashBuffer":{"type":"Buffer","data":[8,248,48,67,132,244,199,115,53,150,1,87,5,125,233,134,175,112,253,60]},"announce":[],"urlList":[]}}