{"title":"Clandestinos (2007) Gay Interest","uid":9458854,"size":733488707,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08fd80796a2617cdab8a80bb852a5305e7f48680&amp;dn=Clandestinos+%282007%29+Gay+Interest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":null,"files":2,"time":1389315874,"description":"Author: Pinku_Eiga from Deutschland\n 15 October 2009\n\n \n&quot;Clandestinos&quot; is a very different and extremely cool film that combines the theme of terrorism with a very odd love story. Three boys escape from a youth prison in Spain, and head for the city of Madrid. Xabi and Joel, both Spanish, and an Arabic boy named Driss, quickly meet up with some eccentric people on the road. Joel, and the very cute and lovable Driss have no trouble hooking up with a couple girls that don't at all mind if the two handsome guys stay with them. \n\nThe quietly intense Xabi, however, is dealing with some darker demons, and his personal reason for escaping the prison soon becomes apparent. It seems that an older man involved in an extremist left-wing group has influenced the impressionable Xabi, and now the boy is out to impress his much-older lover. &quot;Clandestinos&quot; deals with a very unique kind of love relationship. Xabi sees in his older lover, a kind of father figure. Many who see this special film might wonder why a young and healthy guy like Xabi would be so in love with a man more than twice his age, but it is easy to see that Xabi seeks a kind of approval that one might seek from his father. \n\nThe love between the terrorist and Xabi, and later, between Xabi and the cop, are handled in a very believable way. The acting all around is excellent, and the story never loses it's way for a moment. Produced with a small budget, &quot;Clandestinos&quot; is something that no mainstream Hollywood company would go near. This is real, &quot;renegade&quot; film-making. I'm not sure who the intended audience was here, but this is what makes this one so unique. Not to mention, Xabi, Driss, and Joel are three characters that are difficult to forget. Excellent action/thriller/love story from Spain, made with a lot of style and energy. In fact I can honestly say that &quot;Clandestinos&quot; is the coolest and craziest film i have seen in a while. Terrorism and romance, mixed in with some comic overtones... I don't think there is another film like this one... \n","torrent":{"xt":"urn:btih:08fd80796a2617cdab8a80bb852a5305e7f48680","amp;dn":"Clandestinos+%282007%29+Gay+Interest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08fd80796a2617cdab8a80bb852a5305e7f48680","infoHashBuffer":{"type":"Buffer","data":[8,253,128,121,106,38,23,205,171,138,128,187,133,42,83,5,231,244,134,128]},"announce":[],"urlList":[]}}