{"title":"Bon Jovi - One Wild Night - Live 1985-2001","uid":9479943,"size":188530232,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0931086c6f020619b14b6459ba1371c67278a619&amp;dn=Bon+Jovi+-+One+Wild+Night+-+Live+1985-2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1389773073,"description":"Bon Jovi - One Wild Night - Live 1985-2001 320cbr (Big Papi) 2001 (Size: 179.8 MB)\n\nSource: 2001 CD\n\n\n \t\t\n01 Bon Jovi - It's My Life.mp3\t8.92 MB\n \t\t\n02 Bon Jovi - Livin' on a Prayer.mp3\t12.08 MB\n \t\t\n03 Bon Jovi - You Give Love a Bad Name.mp3\t9.02 MB\n \t\t\n04 Bon Jovi - Keep the Faith.mp3\t14.59 MB\n \t\t\n05 Bon Jovi - Someday I'll Be Saturday Night.mp3\t15 MB\n \t\t\n06 Bon Jovi - Rockin' in the Free World.mp3\t13.09 MB\n \t\t\n07 Bon Jovi - Something to Believe In.mp3\t13.86 MB\n \t\t\n08 Bon Jovi - Wanted Dead or Alive.mp3\t13.84 MB\n \t\t\n09 Bon Jovi - Runaway.mp3\t11.07 MB\n \t\t\n10 Bon Jovi - In and Out of Love.mp3\t14.31 MB\n \t\t\n11 Bon Jovi - I Don't Like Mondays.mp3\t12.98 MB\n \t\t\n12 Bon Jovi - Just Older.mp3\t12.06 MB\n \t\t\n13 Bon Jovi - Something for the Pain.mp3\t10.13 MB\n \t\t\n14 Bon Jovi - Bad Medicine.mp3\t10.02 MB\n \t\t\n15 Bon Jovi - One Wild Night 2001.mp3\t8.73 MB\n \t\n\n\n\nBy James\n\nThe 80's were a time of big hair, cool songs, and loads of fun. The 90's were a time of depression and deep thought. The new century, thus far, has seemed to be heading a little bit back to the 80's mentality and who better to usher in the new millennium of rock music than Bon Jovi?\n\nArguably the greatest Rock band of all time, personally my 6th favorite band, Bon Jovi released &quot;One Wild Night' a compilation of the band's greatest hits performed live since 1985 in various different locations. One Wild Night, a cool song off their most recent album &quot;Crush,&quot; serves as the title and I have to say that this is going right next to my set of party rock CD's next to ACDC Live, the KISS Alive set, and Poison's Power to the People. It is, without question, one of the better CD's of my collection which is not what I expected it to be.\n\nIt's a party CD. Plain and simple, it's not necessarily basic pop, it's not necessarily dance music, it's just a feel good, shake your bootie, bang your head good time. Though track 1 is &quot;It's My Life,&quot; which I never really found too musically appealing live as I think the guitar should be used more prominently in the song as it does sound hard rock, not like it ended up sounding. The rest of the album is a giant rock and roll party. They take songs like Keep the Faith, which I never was a big fan of, and turn it into an incredible melody of blazing guitar and energetic chorus. Also, Rockin' in the Free World is something to keep your eyes open for.\n\nnull Though the original One Wild Night came out in 2000 and was a hard ACDC meets Ricki Martin type dance song, this version drops the Ricki Martin aspect (which I applaud) and brings in more of the older Bon Jovi sound to create a &quot;hair metal&quot; sound that quite honestly makes me wonder how anyone could ever laugh at bands like Poison and Motley Crue, whom I've never turned my back upon and never will. All in all, Bon Jovi has gained my faith once again after a fairly unsavory review that I gave to Crush (though I think it's better than the boy band music out today by leaps and bounds). This is everything you'll ever need if you're a Bon Jovi fan, and all you'll need to become one.","torrent":{"xt":"urn:btih:0931086c6f020619b14b6459ba1371c67278a619","amp;dn":"Bon+Jovi+-+One+Wild+Night+-+Live+1985-2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0931086c6f020619b14b6459ba1371c67278a619","infoHashBuffer":{"type":"Buffer","data":[9,49,8,108,111,2,6,25,177,75,100,89,186,19,113,198,114,120,166,25]},"announce":[],"urlList":[]}}