{"title":"Major.League.1989.DvDrip.TeNNReeD","uid":4377764,"size":734835634,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0968cd9a830c538bd3de095784c881c3f85e03b6&amp;dn=Major.League.1989.DvDrip.TeNNReeD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"TeNNReeD","files":2,"time":1220496067,"description":"Major League (1989) A Release By: TeNNReeD\n\nInfo Hash: 0968cd9a830c538bd3de095784c881c3f85e03b6\n\nTrackers:\nudp://vip.tracker.thepiratebay.se:80/announce &lt;a href=&quot;\nhttp://tracker.bittorrent.am/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.bittorrent.am/announce&lt;/a&gt;\n\nFile Info\n\nTitle: Major League\nYear: 1989\nGenre: Comedy, Sports\nRun Time: 107 min\nIMDB Rating: 6.8/10 (16,323 votes)\nIMDB Url: http://www.imdb.com/title/tt0097815/\nLanguage: English\nFiles: 2\nSize: 700.67 MB\nSource: DVD\n\nMovie Info\n\nCountry: USA\nDirector: David S. Ward\nScreenwriter: David S. Ward\nCast: Charlie Sheen, Tom Berenger, Wesley Snipes, Rene Russo, Dennis Haysbert, Corbin Bernsen\n\nTag Line: When these three oddballs try to play hardball, the result is totally screwball.\n\nPlot Outline: The Cleveland Indians have gone 34 years without a division title. Team owner Donald Phelps has died, and his snobby wife Rachel Phelps, a former showgirl, has taken over as the new owner. Some in the media think Rachel shouldn&amp;#039;t be the owner of a baseball team. Rachel hates Cleveland, so she makes plans to move the Indians to the warmer climate of Miami, Florida, but she can&amp;#039;t break the team&amp;#039;s lease with Cleveland unless the team&amp;#039;s attendance for the season is below 800,000. Rachel&amp;#039;s plan is to put together a team so awful that the season attendance will be lower than 800,000. Rachel and general manager Charlie Donovan hire a manager for the Indians Lou Brown, who has been the manager of the minor league Toledo Mud Hens for the past 30 years. Charlie then recruits some misfit players catcher Jake Taylor, who is a major league standout with knee problems, Ricky &quot;Wild Thing&quot; Vaughn, who is a pitcher who throws wildly, third baseman Roger Dorn, who is a product endorser and former major league star who will do anything to avoid injury, outfielder Willie Mays Hayes, who runs fast enough to steal a lot of bases but can&amp;#039;t hit very well, and Pedro Cerrano, who is an outfielder who practices voodoo. As expected, the Indians get off to a slow start, but when they discover that Rachel wants the team to lose so she can move the team, the Indians get their act together and start winning games and raising their attendance, as Jake tries to win back his ex-girlfriend Lynn Wells, and the Indians do what they can to win the division title. \n\nI have the other two in this series if any one is interested just let me know and I will up them.\n\nHere for you-TeNNReeD","torrent":{"xt":"urn:btih:0968cd9a830c538bd3de095784c881c3f85e03b6","amp;dn":"Major.League.1989.DvDrip.TeNNReeD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0968cd9a830c538bd3de095784c881c3f85e03b6","infoHashBuffer":{"type":"Buffer","data":[9,104,205,154,131,12,83,139,211,222,9,87,132,200,129,195,248,94,3,182]},"announce":[],"urlList":[]}}