{"title":"Finishing School series by  Gail Carriger (epub - mobi) ","uid":9421795,"size":1880561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09cf96dc0a177471ff1c5974d1fefbf8b9680bef&amp;dn=Finishing+School+series+by++Gail+Carriger+%28epub+-+mobi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"7","files":-1,"time":1388603301,"description":"\nOverview:\n\nEtiquette &amp; Espionage by Gail Carriger (Finishing School #1)\nIt's one thing to learn to curtsy properly. It's quite another to learn to curtsy and throw a knife at the same time. Welcome to finishing school.\nFourteen-year-old Sophronia is the bane of her mother's existence. Sophronia is more interested in dismantling clocks and climbing trees than proper etiquette at tea--and god forbid anyone see her atrocious curtsy. Mrs. Temminnick is desperate for her daughter to become a proper lady. She enrolls Sophronia in Mademoiselle Geraldine's Finishing Academy for Young Ladies of Quality.\nBut little do Sophronia or her mother know that this is a school where ingenious young girls learn to finish, all right--but it's a different kind of finishing. Mademoiselle Geraldine's certainly trains young ladies in the finer arts of dance, dress, and etiquette, but also in the other kinds of finishing: the fine arts of death, diversion, deceit, espionage, and the modern weaponries. Sophronia and her friends are going to have a rousing first year at school.\nFirst in a four book YA series set 25 years before the Parasol Protectorate but in the same universe.\n\nCurtsies &amp; Conspiracies by Gail Carriger (Finishing School, #2)\nDoes one need four fully grown foxgloves for decorating a dinner table for six guests? Or is it six foxgloves to kill four fully grown guests?\n\nSophronia's first year at Mademoiselle Geraldine's Finishing Academy for Young Ladies of Quality has certainly been rousing! For one thing, finishing school is training her to be a spy (won't Mumsy be surprised?). Furthermore, Sophronia got mixed up in an intrigue over a stolen device and had a cheese pie thrown at her in a most horrid display of poor manners.\n\nNow, as she sneaks around the dirigible school, eavesdropping on the teachers' quarters and making clandestine climbs to the ship's boiler room, she learns that there may be more to a school trip to London than is apparent at first. A conspiracy is afoot--one with dire implications for both supernaturals and humans. Sophronia must rely on her training to discover who is behind the dangerous plot-and survive the London Season with a full dance card.\n\nIn this sequel to bestselling author Gail Carriger's YA debut Etiquette &amp; Espionage, class is back in session with more petticoats and poison, tea trays and treason. Gail's distinctive voice, signature humor, and lush steampunk setting are sure to be the height of fashion this season.\n","torrent":{"xt":"urn:btih:09cf96dc0a177471ff1c5974d1fefbf8b9680bef","amp;dn":"Finishing+School+series+by++Gail+Carriger+%28epub+-+mobi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09cf96dc0a177471ff1c5974d1fefbf8b9680bef","infoHashBuffer":{"type":"Buffer","data":[9,207,150,220,10,23,116,113,255,28,89,116,209,254,251,248,185,104,11,239]},"announce":[],"urlList":[]}}