{"title":"PS2 Classics for PS3 - 65 games direct PSN links + cracks","uid":8653597,"size":644340,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0a3a0199c539862f8a6aed81207b54b75d7da44f&amp;dn=PS2+Classics+for+PS3+-+65+games+direct+PSN+links+%2B+cracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dududus","files":212,"time":1373160388,"description":"Full pack of US region PS2 Classics for PS3. Needs CFW 4.21 or higher.\n\n\n\n1.Install reActPSN.\n\nInstall reActPSN but do not run it.\n\n2.You are now ready to activate PSN content.\n\nCreate a folder named &quot;exdata&quot; on the root of your external drive.\nWithin this folder you must place .rap files for the content you wish to activate.\n.rap files are files which activate PSN content without containing any information of the original buyer of the content.\nDo not rename the files , paste them in the exdata folder as they are.\n\nOnce done , connect your external drive to the right most port on your PS3 (If you get kicked back to the xmb try switching ports).\nDo not connect multiple USB devices , only the drive which contains the exdata folder with .rap files.\n\nCreate a new user profile on your XMB named aa. The aa profile is required for using reActPSN and run it from the aa profile only.\n\nLog in to aa profile from the XMB and run reActPSN (no button needs to be pressed if you have only placed .rap files in the exdata folder).\nThe PS3 will reboot after processing the rap files.This may take a while depending on the number of .rap files.\n\nYou may be greeted with a message that your ps3 was not shut down properly upon restart.\nDon't panic.This is normal.Press circle to skip.\n\nYou will notice that the aa profile has changed/renamed to reActPSN.\nThis also contains the number of activated rifs and edats.\n.rif files are files created from the .rap files by reActPSN to activate the content for your PS3.\nDo not use reActPSN profile to run reActPSN.\n\nCreate the user profile aa once more to use for activating raps in the future.\nAfter this you will not be required to create this profile again as running reActPSN from the aa profile will not rename it.\n\nSo you should have 2 profiles which deal with reActPSN on your XMB :\naa profile which you need to use to run reActPSN and\nreActPSN profile which tells you the number of rifs and edats you have activated (and actually stores the rif files for content you have activated).\n\n3.You can now install the pkg file for the content\n\nNow login to your normal profile on the XMB and proceed to Install the pkg file for the content you just activated.\nThe content you installed should now work. \t","torrent":{"xt":"urn:btih:0a3a0199c539862f8a6aed81207b54b75d7da44f","amp;dn":"PS2+Classics+for+PS3+-+65+games+direct+PSN+links+%2B+cracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a3a0199c539862f8a6aed81207b54b75d7da44f","infoHashBuffer":{"type":"Buffer","data":[10,58,1,153,197,57,134,47,138,106,237,129,32,123,84,183,93,125,164,79]},"announce":[],"urlList":[]}}