{"title":"Neil Sedaka - The Best Of Neil Sedaka  FLAC","uid":5610662,"size":259616131,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ba78cbcf350318a369782d33cfc74d0e7ee6a61&amp;dn=Neil+Sedaka+-+The+Best+Of+Neil+Sedaka++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"keeybee","files":22,"time":1275849951,"description":"Please seed!\n\nNeil Sedaka (born March 13, 1939) is an American pop singer, pianist, and songwriter. His career has spanned over 50 years, during which time he has written many songs for himself and others, often working with lyricist Howard Greenfield.\nSinger, songwriter, and pianist Neil Sedaka enjoyed two distinct periods of commercial success in two slightly different styles of pop music: first, as a teen pop star in the late '50s and early '60s, then as a singer of more mature pop/rock in the '70s.\nIn both phases, Sedaka, a classically trained pianist, composed the music for his hits, which he sang in a boyish tenor. And throughout, even when his performing career was at a low ebb, he served as a songwriter for other artists, resulting in a string of hits year in and year out, whether recorded by him or someone else. For himself, he wrote eight U.S. Top Ten pop hits,\nincluding the chart-toppers &quot;Breaking Up Is Hard to Do,&quot; &quot;Laughter in the Rain,&quot; and &quot;Bad Blood&quot;.\n\nNeil Sedaka is another one of all those &quot;oldies&quot; artists where the compilation albums by far outnumber the original studio albums. Here is one and I can understand if you miss one or two songs. Maybe someone else can help us to get more Sedaka in FLAC? &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Neil_Sedaka&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Neil_Sedaka&lt;/a&gt; &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:0ifrxqw5ldhe~T0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:0ifrxqw5ldhe~T0&lt;/a&gt;\n\n\nNeil Sedaka - The Best Of Neil Sedaka\nThis compilation P 1996 and Ã‚Â© 2006 \nBMG UK &amp; Ireland\n\n01  Neil Sedaka - The Best Of Neil Sedaka - Oh! Carol\n02  Neil Sedaka - The Best Of Neil Sedaka - Calendar Girl\n03  Neil Sedaka - The Best Of Neil Sedaka - King Of Clowns\n04  Neil Sedaka - The Best Of Neil Sedaka - Next Door To An Angel\n05  Neil Sedaka - The Best Of Neil Sedaka - One Way Ticket\n06  Neil Sedaka - The Best Of Neil Sedaka - Breaking Up Is Hard To Do\n07  Neil Sedaka - The Best Of Neil Sedaka - Happy Birthday, Sweet Sixteen\n08  Neil Sedaka - The Best Of Neil Sedaka - Little Devil\n09  Neil Sedaka - The Best Of Neil Sedaka - I Go Ape\n10  Neil Sedaka - The Best Of Neil Sedaka - Stairway To Heaven\n11  Neil Sedaka - The Best Of Neil Sedaka - The Diary\n12  Neil Sedaka - The Best Of Neil Sedaka - That's When The Music Takes Me\n13  Neil Sedaka - The Best Of Neil Sedaka - You Mean Everything To Me\n14  Neil Sedaka - The Best Of Neil Sedaka - The Girl For Me\n15  Neil Sedaka - The Best Of Neil Sedaka - I Must Be Dreaming\n16  Neil Sedaka - The Best Of Neil Sedaka - Let's Go Steady Again\n","torrent":{"xt":"urn:btih:0ba78cbcf350318a369782d33cfc74d0e7ee6a61","amp;dn":"Neil+Sedaka+-+The+Best+Of+Neil+Sedaka++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ba78cbcf350318a369782d33cfc74d0e7ee6a61","infoHashBuffer":{"type":"Buffer","data":[11,167,140,188,243,80,49,138,54,151,130,211,60,252,116,208,231,238,106,97]},"announce":[],"urlList":[]}}