{"title":"Allegorithmic Substance Designer 4.3.1 build 13894","uid":10445571,"size":175637222,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0bff002e382bee9cc713edab34b603b49b92c954&amp;dn=Allegorithmic+Substance+Designer+4.3.1+build+13894&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":-1,"time":1403956558,"description":"Allegorithmic Substance Designer 4.3.1 build 13894\n\nSubstance Designer 4 is the first texturing tool to introduce a material layering workflow.\nTired of messy layers? Fit all you need in a few compact and handy nodes. Let Substance connect all the channels for you and focus on what really matters: your art.\nYou are free to make any change you want at any time, and all your changes will automatically be applied to all the outputs of your substance (diffuse, specular, normal, etc), so you can create and edit complete texture sets in a much faster way than with traditional tools.\nNon-Destructive authoring workflow means you can revert all the actions you are making without losing any of your work. No more &quot;I can't come back to that point&quot;!\nSubstance Designer 4.3 integrates Yebis 2 from Silicon Studio, the most advanced middleware for post effects. Thanks to Yebis 2, you can visualize your assets in the 3D view as you imagine them: add glare, flare, depth of field, anti-aliasing, light shafts, etc. to mimic your game engine or simply make amazing beauty shots.\nSubstance Designer 4 allows you to create maps for Physical Based Rendering shaders.\nYou can visualize your materials directly in the 3D view with our embedded PBR shader, or import your own.\nNative support of Unity 3D, Unreal Engine 4, 3ds Max, Maya, Modo, ToolBag 2, Fuse.\n\nIf you like the software, support the developers, buy it!","torrent":{"xt":"urn:btih:0bff002e382bee9cc713edab34b603b49b92c954","amp;dn":"Allegorithmic+Substance+Designer+4.3.1+build+13894","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bff002e382bee9cc713edab34b603b49b92c954","infoHashBuffer":{"type":"Buffer","data":[11,255,0,46,56,43,238,156,199,19,237,171,52,182,3,180,155,146,201,84]},"announce":[],"urlList":[]}}