{"title":"Homer - The Iliad (Robert Fitzgerald trans.)[96] George Guidell ","uid":8818971,"size":729166921,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c1e8a8ce6ead153a20256fac5013a969f299fc3&amp;dn=Homer+-+The+Iliad+%28Robert+Fitzgerald+trans.%29%5B96%5D+George+Guidell+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rambam1776","files":-1,"time":1376654262,"description":"Homer (Robert Fitzgerald translation) - The Iliad\n\n96 kbps, unabridged, Read by George Guidall\n &lt;a href=&quot;\nhttp://www.recordedbooks.com/index.cfm?fuseaction=rb.show_prod&amp;book_id=55403&amp;prod_id=C1671&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.recordedbooks.com/index.cfm?fuseaction=rb.show_prod&amp;book_id=55403&amp;prod_id=C1671&lt;/a&gt;\n\nAnger be now your song, immortal one,\nAkhilleus' anger, doomed and ruinous, \nthat caused the Akhaians loss on bitter loss\nand crowded brave souls into the undergloom, \nleaving so many dead men-carrion\nfor dogs and birds; and the will of Zeus was done.\n-Lines 1-6\n\nSince it was first published more than twenty-five years ago, Robert Fitzgerald's prizewinning translation of Homer's battle epic has become a classic in its own right: a standard against which all other versions of The Iliad are compared. Fitzgerald's work is accessible, ironic, faithful, written in a swift vernacular blank verse that &quot;makes Homer live as never before&quot; (Library Journal). \n\nThe Iliad (sometimes referred to as the Song of Ilion or Song of Ilium) is an epic poem in dactylic hexameters, traditionally attributed to Homer. Set during the Trojan War, the ten-year siege of the city of Troy (Ilium) by a coalition of Greek states, it tells of the battles and events during the weeks of a quarrel between King Agamemnon and the warrior Achilles.\n\nAlthough the story covers only a few weeks in the final year of the war, the Iliad mentions or alludes to many of the Greek legends about the siege; the earlier events, such as the gathering of warriors for the siege, the cause of the war, and related concerns tend to appear near the beginning. Then the epic narrative takes up events prophesied for the future, such as Achilles' looming death and the sack of Troy, prefigured and alluded to more and more vividly, so that when it reaches an end, the poem has told a more or less complete tale of the Trojan War. The Iliad is paired with something of a sequel, the Odyssey, also attributed to Homer.\n\nAlong with the Odyssey, the Iliad is among the oldest extant works of Western literature, and its written version is usually dated to around the eighth century BC.[1] In the modern vulgate, the Iliad contains 15,693 lines; it is written in Homeric Greek, a literary amalgam of Ionic Greek and other dialects.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Iliad&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Iliad&lt;/a&gt;","torrent":{"xt":"urn:btih:0c1e8a8ce6ead153a20256fac5013a969f299fc3","amp;dn":"Homer+-+The+Iliad+%28Robert+Fitzgerald+trans.%29%5B96%5D+George+Guidell+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c1e8a8ce6ead153a20256fac5013a969f299fc3","infoHashBuffer":{"type":"Buffer","data":[12,30,138,140,230,234,209,83,162,2,86,250,197,1,58,150,159,41,159,195]},"announce":[],"urlList":[]}}