{"title":"James M. Cain Collection (Hard Boiled Crime and Mystery)","uid":11215317,"size":18274907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c51d799df4493e3d762bc14011429904ad8bfd3&amp;dn=James+M.+Cain+Collection+%28Hard+Boiled+Crime+and+Mystery%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1413320590,"description":"James Mallahan Cain was an American author and journalist. \nAlthough Cain himself vehemently opposed labeling, he is usually associated with the hardboiled school of American crime fiction and seen as one of the creators of the roman noir. Several of his crime novels inspired highly successful movies.\n\nCain's first novel, The Postman Always Rings Twice, was published in 1934. Two years later the serialized Double Indemnity was published in Liberty magazine.\n\nCain made use of his love of music and of the opera in particular in at least three of his novels: Serenade (about an American opera singer who loses his voice and who, after spending part of his life south of the border, re-enters the States illegally with a Mexican prostitute); Mildred Pierce (in which, as part of the subplot, the surviving daughter of a successful businesswoman trains as an opera singer); and Career in C Major (a short semi-comic novel about the unhappy husband of an aspiring opera singer who unexpectedly discovers that he has a better voice than she does). In the novel The Moth, music is important in the life of the main character. In addition, Cain's fourth wife Florence Macbeth, was a retired opera singer.\n\nAlthough Cain spent many years in Hollywood working on screenplays, his name appears as a screenwriter only in the credits of two films: Stand Up and Fight (1939) and Gypsy Wildcat (1944), for which he is one of three credited screenwriters. For Algiers (1938) and Blockade Cain received an &quot;additional dialogue&quot; credit, and he got story credits for other films","torrent":{"xt":"urn:btih:0c51d799df4493e3d762bc14011429904ad8bfd3","amp;dn":"James+M.+Cain+Collection+%28Hard+Boiled+Crime+and+Mystery%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c51d799df4493e3d762bc14011429904ad8bfd3","infoHashBuffer":{"type":"Buffer","data":[12,81,215,153,223,68,147,227,215,98,188,20,1,20,41,144,74,216,191,211]},"announce":[],"urlList":[]}}