{"title":"Camera Obscura-My Maudlin Career-Advance-2009","uid":4804555,"size":72841935,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0c92f261109c029a620c7f6045f6866b321bf2e1&amp;dn=Camera+Obscura-My+Maudlin+Career-Advance-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1238114197,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nCamera Obscura was formed in 1996 by Tracyanne Campbell, John Henderson, and Gavin Dunbar. The band's first releases were the singles &quot;Park and Ride&quot; and &quot;Your Sound&quot; in 1998. The Rare UK Bird EP followed in 1999.\nCamera Obscura's first album, Biggest Bluest Hi Fi, was recorded in 2000 and released in 2001. The album was supported by John Peel, who named &quot;Eighties Fan&quot; one of the top ten songs of the year, and charted in several independent music charts.\nThe band's second album, Underachievers Please Try Harder, was released in 2003 and was followed by Camera Obscura's first full tour of Britain and Ireland and the band's first tour of the United States. Founding member John Henderson left Camera Obscura following this tour.\nCamera Obscura recorded their third album, Let's Get Out of This Country, in 2005. It was released June 6, 2006. The first single, &quot;Lloyd, I'm Ready to Be Heartbroken&quot;, is a response to Lloyd Cole and the Commotions' song &quot;Are You Ready to Be Heartbroken?&quot; \nIn November 2008, the band announced that they have completed recording the follow-up to Let's Get Out of This Country, and that the new album, My Maudlin Career, would be released in April 2009. In February 2009, it was announced that the band had signed to the label 4AD, who will release the album, and that &quot;due to family commitments (including being a proud dad) Nigel will no longer be a full time member of Camera Obscura. But watch out for him popping up at live appearances from time to time.&quot; \n\n","torrent":{"xt":"urn:btih:0c92f261109c029a620c7f6045f6866b321bf2e1","amp;dn":"Camera+Obscura-My+Maudlin+Career-Advance-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c92f261109c029a620c7f6045f6866b321bf2e1","infoHashBuffer":{"type":"Buffer","data":[12,146,242,97,16,156,2,154,98,12,127,96,69,246,134,107,50,27,242,225]},"announce":[],"urlList":[]}}