{"title":"Led Zepellin - Flac Discography","uid":9613413,"size":16055123814,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d5387ce069e3a72f976066e4e267ec9b4cddc9b&amp;dn=Led+Zepellin+-+Flac+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"jmwreck","files":591,"time":1392369268,"description":"Led Zeppelin were an English rock band formed in London in 1968. The band consisted of guitarist Jimmy Page, singer Robert Plant, bassist and keyboardist John Paul Jones, and drummer John Bonham. The group's heavy, guitar-driven sound, rooted in blues on their early albums, has drawn them recognition as one of the progenitors of heavy metal, though their unique style drew from a wide variety of influences, including folk music.\n\nAfter changing their name from the New Yardbirds, Led Zeppelin signed a deal with Atlantic Records that afforded them considerable artistic freedom. Although the group was initially unpopular with critics, they achieved significant commercial success with albums such as Led Zeppelin (1969), Led Zeppelin II (1969), Led Zeppelin III (1970), their untitled fourth album (1971), Houses of the Holy (1973), and Physical Graffiti (1975). Their fourth album, which features the track &quot;Stairway to Heaven&quot;, is among the most popular and influential works in rock music, and it helped to cement the popularity of the group.\n\nPage wrote most of the music early in Led Zeppelin's career, while Plant generally supplied the songs' lyrics. Jones' keyboard-based compositions later became central to the group's music, and their later albums featured greater experimentation. The latter half of the band's career saw a series of record-breaking tours that earned them a reputation for excess and debauchery. Although they remained commercially and critically successful, their output and touring schedule were limited in the late 1970s, and the group disbanded following Bonham's death from alcohol-related asphyxia in 1980. In the decades since, the surviving members have sporadically collaborated and participated in one-off Led Zeppelin reunions. The most successful of these was at the 2007 Ahmet Ertegun Tribute Concert in London, with Jason Bonham taking his late father's place behind the drums.\n\nLed Zeppelin are widely considered one of the most successful, innovative and influential rock groups in history. They are one of the best-selling music artists in the history of audio recording; various sources estimate the group's record sales at 200 to 300 million units worldwide. With 111.5 million RIAA-certified units, they are the second-best-selling band in the United States.[1] Each of their nine studio albums placed on the Billboard Top 10 and six reached the number-one spot.[2] Rolling Stone magazine described them as &quot;the heaviest band of all time&quot;,[3] &quot;the biggest band of the '70s&quot;[4] and &quot;unquestionably one of the most enduring bands in rock history&quot;.[5] They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were &quot;as influential in that decade [the 1970s] as the Beatles were in the prior one&quot;.\n\nWIKI","torrent":{"xt":"urn:btih:0d5387ce069e3a72f976066e4e267ec9b4cddc9b","amp;dn":"Led+Zepellin+-+Flac+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d5387ce069e3a72f976066e4e267ec9b4cddc9b","infoHashBuffer":{"type":"Buffer","data":[13,83,135,206,6,158,58,114,249,118,6,110,78,38,126,201,180,205,220,155]},"announce":[],"urlList":[]}}