{"title":"(Audiobook) Wayne Dyer - How to be a NLP (Full 1 to 12).rar","uid":4433513,"size":155873902,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0d75688251dcb61a7f601e43947e2fbbc9fc49b5&amp;dn=%28Audiobook%29+Wayne+Dyer+-+How+to+be+a+NLP+%28Full+1+to+12%29.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mbbitch","files":1,"time":1223415295,"description":"Before you comment and say something stupid...\n\nI try fairly hard to release or re-release decent files. I do however have a life and am not here strictly to serve you.\n\nI cannot and do not hack, infect, or modify files, I am merely a participant trying to give something back. \n\nI am as vulnerable as anyone to a bad download, and while I do generally install something in a sandbox before I release it, I don&amp;#039;t always catch whatever might be lurking in a compressed file. \n\nIf I do miss a trick and you haven&amp;#039;t taken any measures to protect or educate yourself, shut up about it.\n\nI am not interested in your inadequacy, ignorance, or stupidity.If you go run a search on whatever question you have, you won&amp;#039;t have to wait for however long it happens to take me to respond to your comment questions... nothing wrong with that is there?\n\nIf your new to this try this checklist before you start talking smack or else piss off.\n\n*Did you search for information about what your downloading? \n\n*Did you read the instructions, such as an .nfo file or text that says READ ME, that are almost always included with an install, and actually follow the directions? \n\n*Did you search for anyone else with your problem to see if there&amp;#039;s already a solution just waiting for you to read it?\n\n*Did you research any offending file in a search engine to see if its a false positive? (And then disable your anti-virus so you could install it).\n\n*Did you educate yourself on the tactics virus scanning software companies use these days to scare off pirates by programming their software to generate false positives, or the fact that some keygens or cracks sometimes use code strings that resemble a hostile process out of necessity to make something work for you?\n\n*Do you think your entitled to something for zero effort, or without any need to be grateful for someone&amp;#039;s time?(If you do, don&amp;#039;t bother me again... or anyone else here for that matter!).\n\n*Did you search for whatever else you needed before pestering me about what might be missing or corrupted?\n\n*Did you use a sandbox to protect yourself when trying any kind of vulnerable file (i.e. an .exe .bat .vb ect)? \n\nIf you did not understand any of the words in these questions, your not ready to download anything from a torrent share anywhere. \n\nGo find out what the words mean and then come back for another try (unless you like tearing out your hair or possibly re-installing your operating system from scratch when you download something REALLY bad).\n\n*If you still require a response after answering yes to all these reasonable steps, and your email isn&amp;#039;t stupid or a waste of my time, you&amp;#039;ll hear back.Your odds are better on getting a response from me if you email. I don&amp;#039;t have the time to follow all the comment threads.\n\n*I do scan the files, and no one&amp;#039;s protection is perfect. If it does go bad, and you didn&amp;#039;t do any of the work beforehand to ascertain what you need to know to try it harm free, don&amp;#039;t come whining to me.\n\n*I&amp;#039;m not a super geek or anything beyond your basic power user so if it doesn&amp;#039;t work the way its supposed to, I probably won&amp;#039;t know why unless I search for an answer on the net. Since I am not interested in doing that for you, either go find out why or else toss the download. I won&amp;#039;t up anything that either hasn&amp;#039;t worked for me, or that hasn&amp;#039;t been released by someone trusted here that I know makes good downloads.\n\nI am not your personal file mule!\n\nmbitmaster (at) gmail.com\n\n\nAbout this software: The Complete Audio Book by Wayne Dyer - How to be a No-Limit Person CD&amp;#039;s 1 - 12 in mp3 format.\n\n1. Anybody Can do it\n2. You Become Your Expectations\n3. Allow Yourself to be a Child again\n4. Achieving Super Physical Health\n5. Achieving Super Emotional Health\n6. Going After a Sense of Purpose\n7. The Specifics of No Limit Living\n8. Anger; Inner Directedness\n9. Complaining; Pleasing Others\n10.Questions to Ask Yourself for Achieving Total Self-Honesty \n11.Typical Concerns about No Limit Living\n12. More Typical Concerns about No Limit Living\n\n\nObviously safe for anyone to use so I won&amp;#039;t bother with a blurb about how clean it was for me.\n\nMore to come.\n\nPeace Out.\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0d75688251dcb61a7f601e43947e2fbbc9fc49b5","amp;dn":"%28Audiobook%29+Wayne+Dyer+-+How+to+be+a+NLP+%28Full+1+to+12%29.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d75688251dcb61a7f601e43947e2fbbc9fc49b5","infoHashBuffer":{"type":"Buffer","data":[13,117,104,130,81,220,182,26,127,96,30,67,148,126,47,187,201,252,73,181]},"announce":[],"urlList":[]}}