{"title":"Rise.of.Venice-RELOADED","uid":8969732,"size":3472536741,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0dab03dca9aa00a236994f0f43fb5fc59d114f3c&amp;dn=Rise.of.Venice-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1380312173,"description":"\n                                      nERv\n\n\n                  Rise of Venice (c) Kalypso Media Digital\t\n\n      09/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n            1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n\nVenice was at the peak of its power during the Renaissance and was viewed as\na city of decadence, beauty and intrigue. Renowned as the linchpin of\ncivilization and the cultural centre of Europe, Venice was the most\nimportant trading post between Western Europe and the eastern stretch of the\nMediterranean Sea. It was also the stage for political corruptions and\nclandestine dealings.\n\nThis is where your story begins. As a young man striving for success, power\nand wealth and with the support of your family, you begin to build up a\ntrading empire across Genua, Tripoli, Rome, Alexandria and Constantinople in\naddition to many other significant cities from the Renaissance. As you\nprogress through the ranks of Venetian society, increasing your power with\nsmart trading moves and calling in the occasional favour you can begin to\nassemble your own fleet. With this you will start to build up new production\nfacilities, test yourself in challenging sea battles where you will face off\nagainst pirates as well as political enemies to finally become the Doge of\nVenice.\n\nFeatures:\n\n- Experience a compelling story full of intrigue and treason in Venice at\n  the time of the Renaissance\n- Trade a variety of goods in the most important cities of the time such as\n  Rome, Alexandria, Constantinople or Athens\n- With your own family tree you can interact with your family members, send\n  them on missions and watch how the power of your family grows over time\n- Meet other important families who are pulling the strings in Venices\n  government and influence political decisions yourself.\n- Build your own production facilities and trading fleets\n- Take fate into your own hands and test your skills in furious sea battles\n- Multiplayer mode for up to 4 players via LAN and Internet\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\n   your  directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:0dab03dca9aa00a236994f0f43fb5fc59d114f3c","amp;dn":"Rise.of.Venice-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dab03dca9aa00a236994f0f43fb5fc59d114f3c","infoHashBuffer":{"type":"Buffer","data":[13,171,3,220,169,170,0,162,54,153,79,15,67,251,95,197,157,17,79,60]},"announce":[],"urlList":[]}}