{"title":"Plato at the Googleplex: Why Philosophy Won't Go Away (2014)","uid":9705209,"size":6451024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f08ba97a1a2ab66e95a7319dd5330e244bb7c43&amp;dn=Plato+at+the+Googleplex%3A+Why+Philosophy+Won%27t+Go+Away+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bookzilla","files":1,"time":1394053402,"description":"Is philosophy obsolete? Are the ancient questions still relevant in the age of cosmology and neuroscience, not to mention crowd-sourcing and cable news? The acclaimed philosopher and novelist Rebecca Newberger Goldstein provides a dazzlingly original plunge into the drama of philosophy, revealing its hidden role in today's debates on religion, morality, politics, and science.\n\n At the origin of Western philosophy stands Plato, who got about as much wrong as one would expect from a thinker who lived 2,400 years ago. But Plato's role in shaping philosophy was pivotal. On her way to considering the place of philosophy in our ongoing intellectual life, Goldstein tells a new story of its origin, re-envisioning the extraordinary culture that produced the man who produced philosophy.\n\n But it is primarily the fate of philosophy that concerns her. Is the discipline no more than a way of biding our time until the scientists arrive on the scene? Have they already arrived? Does philosophy itself ever make progress? And if it does, why is so ancient a figure as Plato of any continuing relevance? Plato at the Googleplex is Goldstein's startling investigation of these conundra. She interweaves her narrative with Plato's own choice for bringing ideas to life--the dialogue.\n\n Imagine that Plato came to life in the twenty-first century and embarked on a multicity speaking tour. How would he handle the host of a cable news program who denies there can be morality without religion? How would he mediate a debate between a Freudian psychoanalyst and a tiger mom on how to raise the perfect child? How would he answer a neuroscientist who, about to scan Plato's brain, argues that science has definitively answered the questions of free will and moral agency? What would Plato make of Google, and of the idea that knowledge can be crowd-sourced rather than reasoned out by experts? With a philosopher's depth and a novelist's imagination and wit, Goldstein probes the deepest issues confronting us by allowing us to eavesdrop on Plato as he takes on the modern world.\n\n\nepub","torrent":{"xt":"urn:btih:0f08ba97a1a2ab66e95a7319dd5330e244bb7c43","amp;dn":"Plato+at+the+Googleplex%3A+Why+Philosophy+Won%27t+Go+Away+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f08ba97a1a2ab66e95a7319dd5330e244bb7c43","infoHashBuffer":{"type":"Buffer","data":[15,8,186,151,161,162,171,102,233,90,115,25,221,83,48,226,68,187,124,67]},"announce":[],"urlList":[]}}