{"title":"[FS9/FSX] Aerosoft/Digital Aviation - Piper PA31T Cheyenne v4.00","uid":7965867,"size":216745089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f58a1c6b4049e5250011fe67d7d995c75aeda4e&amp;dn=%5BFS9%2FFSX%5D+Aerosoft%2FDigital+Aviation+-+Piper+PA31T+Cheyenne+v4.00&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"_SnakEye","files":-1,"time":1356690784,"description":" This add-on for the Microsoft Flight Simulator X is an extraordinary replica of the twin engine Piper Cheyenne with a new developed weather radar. The package contains no less than four versions of the most successful Turboprop family: Cheyenne II, I, IA and IIXL.\n\n\nAll four aircraft have been rebuilt and animated for the Flight simulator in 3-D fashion right down to the smallest of details. In this way mechanical parts such as ailerons, rudders, flaps, engines and even windscreen wipers move just like in the original aircraft.\n\nThe excellent graphics of both the 2D- and 3D-Cockpits are equipped with all the avionic instruments usually to be found inside these models and the precise flight dynamics have been developed with the help of real Cheyenne pilots. Besides the accurate panels for the pilot and the co-pilot, the cabin of the Cheyenne has also been rebuilt to the highest level of detail with its opening doors for the passengers and the freight.\n\nThe sounds, which are being used, have all been recorded on the real thing. Numerous liveries for all the available versions and an extensive documentation round of a superb simulation for both VFR and IFR pilots.\n\nThis version of the Digital Aviaton Piper Cheyene (FSX and FS2004) includes a new full functional weather radar. ","torrent":{"xt":"urn:btih:0f58a1c6b4049e5250011fe67d7d995c75aeda4e","amp;dn":"%5BFS9%2FFSX%5D+Aerosoft%2FDigital+Aviation+-+Piper+PA31T+Cheyenne+v4.00","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f58a1c6b4049e5250011fe67d7d995c75aeda4e","infoHashBuffer":{"type":"Buffer","data":[15,88,161,198,180,4,158,82,80,1,31,230,125,125,153,92,117,174,218,78]},"announce":[],"urlList":[]}}