{"title":"My.Kitchen.Rules.s06e11.WS.PDTV.x264.BF1.mkv","uid":11707212,"size":636365315,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:102e39d02e12b446e42f6a1601782d567853e685&amp;dn=My.Kitchen.Rules.s06e11.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bigfish5","files":1,"time":1424178495,"description":"My Kitchen Rules Australia Series 6 Episode 11\n\nMaking history as the first ever mother and son contestants in the show, Victoria's Rose and Josh are hoping they have what it takes. Hosted by Pete Evans and Manu Feildel.\n\nRose and Josh Victoria\nWe're very close and I wouldn't want to be here with anyone else. \nWith age comes experience and wisdom, but don't let My Kitchen Rules' youngest competitor ever hear you say his age is a disadvantage.\nJosh, 19, a commerce student, has been waiting for years to meet the age requirement to apply to be on the show with his mum Rose, 48.\n&quot;I don't see it as a disadvantage. I mean some might but they'll just underestimate me,&quot; says a confident Josh. &quot;Mum will bring her traditional cooking and those techniques and I think I'll bring innovation because of my age. You know I've grown up with new cooking and new ways to find recipes and I think that will help me a lot too. And what I'll lack in experience, I'll make up in effort and desire.&quot;\nRose, an education support teacher, migrated from Uruguay when she was nine-years-old.\nLife was difficult transitioning into a new culture, with different traditions and even new foods.\n&quot;You know even buying bread was different because we had never seen sliced bread,&quot; recalls Rose. &quot;I remember kids teasing us when we went to school because we had salami and the smells that came from it. It didn't take long before we started fitting in though.&quot;\nShe recalls that Josh, the youngest of her two children with husband Carlos, has always enjoyed cooking.\n &quot;Growing up he was always like my little helper. But then as he got older he started cooking his own meals and we always cook together now,&quot; she says.\nAdds Josh: &quot;We are always the ones that cook at home. Dad and my sister can't cook because they don't know how to because we've always just enjoyed cooking together so they never had to learn.&quot;\nRose is known for her mustard and lemon sauce to accompany roasted meats, while Josh's white chocolate and berry crumble is always in demand at family gatherings.\n&quot;We do cook quite a bit of South American and Spanish food,&quot; says Josh. &quot;It's probably our favourite. We do venture to other cuisines but that's what we do most of.&quot;\nJosh, a Carlton and Melbourne Victory supporter, has had an adventurous palette from an early age and Rose says he's always eaten everything.\n&quot;At three he was eating prawns. And then we regretted introducing prawns to him because we'd go out to restaurants and he'd order prawns when all the other kids were ordering chicken nuggets,&quot; she recalls.\nThe roles will be reversed when they're under the pump with Rose readily admitting she's not one to cope well with pressure.\n&quot;I handle pressure pretty well,&quot; says Josh. &quot;I manage to keep a cool head in most situations. Mum tends to have her heart on her sleeve and let the emotions get the better of her.&quot;\nJosh admits to being the odd one out among his mates when it comes to his love of cooking. But he's found a comrade in girlfriend of two years Melissa, who shares his love of creating desserts.\nBut ultimately his mum is his perfect teammate in the kitchen for MKR. Together, they will make history as My Kitchen Rules first mother and son team.\n&quot;For a mother and son we do quite a bit together,&quot; he says. &quot;We're very close and I wouldn't want to be here with anyone else other than mum.&quot;","torrent":{"xt":"urn:btih:102e39d02e12b446e42f6a1601782d567853e685","amp;dn":"My.Kitchen.Rules.s06e11.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102e39d02e12b446e42f6a1601782d567853e685","infoHashBuffer":{"type":"Buffer","data":[16,46,57,208,46,18,180,70,228,47,106,22,1,120,45,86,120,83,230,133]},"announce":[],"urlList":[]}}