{"title":"George Duke-9 Albums","uid":4569539,"size":726710688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1052b790ebaeec0eea179a4f66941d05372322cf&amp;dn=George+Duke-9+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1229008891,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nGeorge Duke (born 12 January 1946 in San Rafael, California) is a piano and synthesizer pioneer and singer. He made a name for himself with the album The Jean-Luc Ponty Experience with the George Duke Trio. He is known for his solo work as well as for his collaborations with other musicians, particularly Frank Zappa.\nDuke attended Tamalpais High School in Mill Valley before earning a bachelor's degree in music from the San Francisco Conservatory in 1967.\nHe appeared on a number of Zappa's albums in the early and mid-1970s, including Chunga's Revenge, 200 Motels, Waka/Jawaka, The Grand Wazoo, Apostrophe, One Size Fits All, Bongo Fury and Roxy &amp; Elsewhere. Duke's other high-profile collaborators include Jean-Luc Ponty, Stanley Clarke, Billy Cobham, Cannonball Adderley, his cousin Dianne Reeves, Deniece Williams, Jeffrey Osborne, George Clinton, Anita Baker, Regina Belle, Rachelle Ferrell, Marilyn Scott and Mike Mainieri's fusion group Steps Ahead, for whom he produced the track &quot;Magnetic Love.&quot; He also served as a producer and composer for two instrumental tracks on Miles Davis albums: &quot;Backyard Ritual&quot; (from Tutu, 1986) and &quot;Cobra&quot; (from Amandla, 1989). He has also worked with a number of notable Brazilian musicians, including singer Milton Nascimento, percussionist Airto Moreira and singer Flora Purim. Sheila E appeared on Duke's late-1970s solo albums Don't Let Go and Master of the Game.\nDuke had been fairly visible in the R&amp;B world thanks to funk gems like &quot;Reach for It&quot; and &quot;Dukey Stick&quot; when in 1979 he ventured to Rio to record probably his best known album called, 'A Brazilian Love Affair'. He employed singers Flora Purim and Milton Nascimento and percussionist Airto Moreira. Although not the return to instrumental jazz some hoped it would be, this musical effort does contain its share of jazz-influenced material. From a jazz standpoint, the album's most noteworthy songs include Nascimento's &quot;Cravo e Canela,&quot; &quot;Love Reborn,&quot; and the exuberant &quot;Up from the Sea It Arose and Ate Rio in One Swift Bite.&quot; From the same album came the charming gem &quot;Brazilian Sugar&quot; which was featured on the 2006 video game Dead or Alive Xtreme 2. Meanwhile, Nascimento's vocal on the ballad &quot;Ao Que Vai Nascer&quot; is a fine example of Brazilian pop at its most sensuous. However one labels or categorizes this music, the album is clearly a labor of love from start to finish.\n\n","torrent":{"xt":"urn:btih:1052b790ebaeec0eea179a4f66941d05372322cf","amp;dn":"George+Duke-9+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1052b790ebaeec0eea179a4f66941d05372322cf","infoHashBuffer":{"type":"Buffer","data":[16,82,183,144,235,174,236,14,234,23,154,79,102,148,29,5,55,35,34,207]},"announce":[],"urlList":[]}}