{"title":"The Upperfloor--tUF-37164 Rilynn Rae, Syren de Mer Hi","uid":11679406,"size":667417457,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:10910f8104a864243b455af6829d5f09aca9b5d6&amp;dn=The+Upperfloor--tUF-37164+Rilynn+Rae%2C+Syren+de+Mer+Hi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"merzedes","files":1,"time":1423011680,"description":"A MILF and Cookies Brunch\n\nJan 30, 2015 - Performers: John Strong ,  Rilynn Rae  and  Syren de Mer \n\n\nHi MP4 Only.\n\n\nThe Upper Floor Brunch will be served by two lovely leggy brunette slaves. Both women make a perfect Milf and Cookie team, with fresh faced Rilynn looking exquisitely nervous and unsure as Syren takes charge of her training in front of the lascivious guests. Syren has been a mouthy bitch and had her jiggly ass tied up tight and canned hard, but now she must steer Rilynn into providing a proper warm up for her asshole to amuse the House. Verbal directions become complicated by a male guest fucking Syren's obstinate face, but body language prevails and finds both slaves shuddering and cumming for our brunch guests as Rilynn gets fucked and Syren has a gigantic toy crammed into her ass. \n\nThe guests are particularly turned on during this brunch and arrange themselves into a variety of scenes included spanking, caning, shibari, and a few orgy piles. Rilynne has proven she can please a woman's ass, but how is she with cock? Our male guest puts Rilynn into a strict reverse cowgirl and uses her pussy while Syren introduces Rilynn's fresh young tits to clover clamps. Fucked until she collapses, Rilynn's face is placed as a cum catcher under Syren's expert reverse cowgirl. The Steward finds Rilynn's pussy in disuse on the floor and torments the girl with endless orgasms until she begs for reprieve. \n\nIt wouldn't be a brunch with our slutty Syren if she didn't have her ass properly fucked. Our guest of honor takes care the matter with a hard ass reaming while Rilynn rides astride her senior slave's face and delivers endless orgasms. Once our slaves are well used, they are delivered to their knees to receive cum. Thank you ladies. \n\nUploaded by Merzedes and Shallow2\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n  \n\nCheers  :-)","torrent":{"xt":"urn:btih:10910f8104a864243b455af6829d5f09aca9b5d6","amp;dn":"The+Upperfloor--tUF-37164+Rilynn+Rae%2C+Syren+de+Mer+Hi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10910f8104a864243b455af6829d5f09aca9b5d6","infoHashBuffer":{"type":"Buffer","data":[16,145,15,129,4,168,100,36,59,69,90,246,130,157,95,9,172,169,181,214]},"announce":[],"urlList":[]}}