{"title":"Storagecraft ShadowProtect Recovery Environment Bootable-CD v4.1","uid":6571361,"size":328254026,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:10f7d399b2cc81aceb35086458cc0c442ee2e055&amp;dn=Storagecraft+ShadowProtect+Recovery+Environment+Bootable-CD+v4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"josti6","files":1,"time":1311986018,"description":"I got this from here hxxp://devilsdivine.org/forum/shadowprotect-recovery-environment-bootable-t579387.html \n\n\nThis is the ShadowProtect recovery CD. The recovery CD also contains the installable Windows software. Although the software for Windows is just a 30 day trial (there seems to be no crack on the CD) this torrent is still kinda useful because the recovery CD is not downloadable as a trial (you can download a trial of just the installable Windows software on the Storagecraft website). Besides that, the recovery CD is fully usable without any crack. I've tested this in a virtual machine and it works great (and yes, you can also make a clone/backup with the recovery CD, not just recover).\n\nOne little thing deserves some attention: If you try Hardware Independant Restore (HIR) from the recovery CD it scans the harddrive for a license file. It doesn't find one obviously. You can fix this by installing the Windows software before cloning (The Windows software installs a license file). The recovery CD will detect the license and HIR will also work. Of course this is only the 30 day trial version so maybe the HIR functionality will stop working after 30 days. I don't see this as a problem however because usually when you want to migrate a system it's just something you do once (you don't need software to be permanently installed for that). Let me be clear, of course it would be nice to have a fully cracked version of Shadowprotect 4, but the fully working recovery CD alone is already a very nice tool to have.\n\n\n\n","torrent":{"xt":"urn:btih:10f7d399b2cc81aceb35086458cc0c442ee2e055","amp;dn":"Storagecraft+ShadowProtect+Recovery+Environment+Bootable-CD+v4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f7d399b2cc81aceb35086458cc0c442ee2e055","infoHashBuffer":{"type":"Buffer","data":[16,247,211,153,178,204,129,172,235,53,8,100,88,204,12,68,46,226,224,85]},"announce":[],"urlList":[]}}