{"title":"Miguel Angel Asturias - Nobel Prize in Literature, 1967 (9 books","uid":14348187,"size":30802289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11a40cab8cb24394086933d3bbd12ee98599065c&amp;dn=Miguel+Angel+Asturias+-+Nobel+Prize+in+Literature%2C+1967+%289+books&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":19,"time":1461004082,"description":"\nMIGUEL ANGEL ASTURIAS (1899-1974) was a Guatemalan poet-diplomat, novelist, playwright and journalist.  He won the 1967 Nobel Prize in Literature &quot;for his vivid literary achievement, deep-rooted in the national traits and traditions of Indian peoples of Latin America.&quot;\r\n\r\nHis experimentation with language and stream-of-consciousness style is considered to be an early example of the magical realism genre.  In this way, he is an important precursor of the Latin American Boom of the 1960s and 1970s.  His novel THE PRESIDENT (El Señor Presidente, 1946) is a landmark text in Latin American literature, exploring the nature of political dictatorship and its effects on society.  Its themes, such as the inability to tell reality apart from dreams, the power of the written word in the hands of authorities, and the alienation produced by tyranny, center around the experience of living under a ruthless dictatorship.\r\n\r\nAsturias combined his extensive knowledge of Mayan beliefs with his political convictions, channeling them into a life of commitment and solidarity.  The book that is sometimes described as his masterpiece, MEN OF MAIZE (1949), draws on traditional legend and customs, and explores the magical world of indigenous communities.  MULATA (1963) uses Mayan mythology and Catholic tradition to form a distinctive allegory of belief.  The poetic cycle CLEARVIGIL IN SPRING (1965), a creative reworking of Mayan mythology, was cited by the Nobel Committee as an &quot;impressive&quot; work that &quot;deals with the very genesis of the arts and of poetic creation, in a language which seems to have assumed the bright splendor of the magical queztal's feathers and the glimmering of phosphorescent insects.&quot;\r\n\r\nThe epic &quot;Banana Trilogy&quot; -- STRONG WIND (1950), THE GREEN POPE (1954), and THE EYES OF THE INTERRED (1960) -- is a fictional account of the results of foreign control over the Central American banana industry and the exploitation of Guatemalan natives.  His critique eventually earned him the Soviet Union's highest prize, the Lenin Peace Prize, marking Asturias as one of the few authors recognized in both the West and the Communist bloc during the period of the Cold War for his literary works.\r\n\r\n\r\nThe following books are in PDF format:\r\n\r\n* Clearvigil in Spring: A Mayan Myth (Pennylesse, 2011).  Translated by Robert W. Lebling.\r\n\r\n* El Senor Presidente [The President] (Atheneum, 1967).  Translated by Frances Partridge.  Scan courtesy of @pharmakate.\r\n\r\n* The Eyes of the Interred (Jonathan Cape, 1974).  Translated by Gregory Rabassa.\r\n\r\n* The Green Pope (Delacorte, 1971).  Translated by Gregory Rabassa.\r\n\r\n* The Latin American Novel: Testimony of an Epoch -- The Nobel Prize Lecture (Nobel Foundation, 1967).\r\n\r\n* Men of Maize (Delacorte, 1975).  Translated by Gerald Martin.  Scan courtesy of @pharmakate.\r\n\r\n* Mulata (Delacorte, 1967).  Translated by Gregory Rabassa.  Scan courtesy of @pharmakate.\r\n\r\n* Nobel Prize Acceptance Speech (Nobel Foundation, 1967).\r\n\r\n* Strong Wind (Delacorte, 1968).  Translated by Gregory Rabassa.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                            \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:11a40cab8cb24394086933d3bbd12ee98599065c","amp;dn":"Miguel+Angel+Asturias+-+Nobel+Prize+in+Literature%2C+1967+%289+books","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11a40cab8cb24394086933d3bbd12ee98599065c","infoHashBuffer":{"type":"Buffer","data":[17,164,12,171,140,178,67,148,8,105,51,211,187,209,46,233,133,153,6,92]},"announce":[],"urlList":[]}}