{"title":"A Letter From An Unknown Woman - Stefan Zweig","uid":8767250,"size":293556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11ad8136be1b73e2e648e507aaa3c6fd5af26508&amp;dn=A+Letter+From+An+Unknown+Woman+-+Stefan+Zweig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Enkhsaikhan","files":-1,"time":1375362816,"description":"A rich and well-known writer, returning from one of many holidays to Vienna, finds a long letter from an unknown woman. As a teenager she had lived with her poor widowed mother in the same building and had fallen totally in love with both the opulent cultured lifestyle of her neighbour and the handsome charming man himself. This passion was not lessened by the flow of attractive women spending the night with him or by her being removed to Innsbruck when her mother remarried. At age 18 she returned to Vienna, took a job and tried to meet the writer. He did not recognise her and, without revealing her name, she succeeded in spending three nights with him before he disappeared on a holiday. Pregnant, she lost her job and had to give birth in a refuge for the indigent. Resolved that their child should have a good life, she spent nights with or became mistress of various rich men but would never marry because her heart belonged always to the writer. Out with a current lover, she saw the writer in a night club and went home with him instead. To him, she was just an agreeable companion for that night, as he again did not recognise her. In the 1918 flu pandemic, the child died and she, ill herself, wrote this letter to be posted after her death.","torrent":{"xt":"urn:btih:11ad8136be1b73e2e648e507aaa3c6fd5af26508","amp;dn":"A+Letter+From+An+Unknown+Woman+-+Stefan+Zweig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11ad8136be1b73e2e648e507aaa3c6fd5af26508","infoHashBuffer":{"type":"Buffer","data":[17,173,129,54,190,27,115,226,230,72,229,7,170,163,198,253,90,242,101,8]},"announce":[],"urlList":[]}}