{"title":"Ultima 9 - Ascension GOG","uid":7941945,"size":1148055438,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:11b737cc989ca7fccf6e1a3bd48deeb46bfbb49a&amp;dn=Ultima+9+-+Ascension+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1356013802,"description":"genre: rpg / action / fantasy\nrelease date: October 30, 1999\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: English\ndeveloper / publisher: Origin Systems / Electronic Arts\ngame modes: single-player\n\nBonus content included for FREE with purchase:\nmanual\n2 wallpapers\nspellbook\nreference card\n7 avatars\n17 artworks\n14 design documents\ntarot cards\n\nWhat's cool about it:\n\nDive into the rich and extensive fantasy world that is a worthy setting for the extravagant finale of the genre-changing, award-winning Ultima saga!\nWitness the final chapter in the chronicles of Britannia--a story so epic that its script takes hundreds of pages in writing.\nTake up the mantle of the Avatar one last time and free the land of Guardian s curse using an incredibly vast assortment of weapons, armor, items, and spells.\n\nOverview:\n\nPrepare to embark on the final adventure in Ultima--the best selling role-playing saga of all time that has nurtured generations of gamers. Answer the call and return to Britannia for your last epic quest. As the heroic Avatar, only you can save Lord British and his people from the evil Guardian who has devastated and corrupted the land. Valiant combat, magical prowess, and knowledge of the eight virtues are your weapons against evil in Ultima IX: Ascension.\n\nThe ninth installment of the Ultima series takes a leap into a vivid, detailed 3D environment that adds a whole new level of interaction to the exploration of the realm. Britannia was always one of the most life-like, well-developed, king-sized virtual lands, but this new perspective makes the experience of  living  in it much more immersive. The combination of a story of epic proportions, solid mechanics--true to the classic cRPG spirit, and that achingly familiar Ultima setting, Ultima IX: Ascension a memorable title that all role-players should experience for themselves.\n\nAscend to the realm of myth and legend in the final single-player Ultima game!\n\nAge requirements: ESRB Rating: MATURE with Animated Blood and Gore, Animated Violence.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nInstallation\n\nInstall and play","torrent":{"xt":"urn:btih:11b737cc989ca7fccf6e1a3bd48deeb46bfbb49a","amp;dn":"Ultima+9+-+Ascension+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b737cc989ca7fccf6e1a3bd48deeb46bfbb49a","infoHashBuffer":{"type":"Buffer","data":[17,183,55,204,152,156,167,252,207,110,26,59,212,141,238,180,107,251,180,154]},"announce":[],"urlList":[]}}