{"title":"Genghis Khan - Frank McLynn","uid":12174928,"size":24480601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11bee00f54e42676278a1c3e67d45ab5f81275e8&amp;dn=Genghis+Khan+-+Frank+McLynn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1438293876,"description":"Mongol leader Genghis Khan was by far the greatest conqueror the world has ever known. His empire stretched from the Pacific Ocean to central Europe, including all of China, the Middle East, and Russia. So how did an illiterate nomad rise to such colossal power and subdue most of the known world, eclipsing Alexander the Great, Julius Caesar, and Napoleon? Credited by some with paving the way for the Renaissance, condemned by others for being the most heinous murderer in history, who was Genghis Khan?\n\nHis actual name was Temujin, and the story of his success is that of the Mongol people: a loose collection of fractious tribes who tended livestock, considered bathing taboo, and possessed an unparalleled genius for horseback warfare. United under Genghis, a strategist of astonishing cunning and versatility, they could dominate any sedentary society they chose.\n\nCombining fast-paced accounts of battles with rich cultural background and the latest scholarship, Frank McLynn brings vividly to life the strange world of the Mongols, describes Temujin's rise from boyhood outcast to becoming Genghis Khan, and provides the most accurate and absorbing account yet of one of the most powerful men ever to have lived","torrent":{"xt":"urn:btih:11bee00f54e42676278a1c3e67d45ab5f81275e8","amp;dn":"Genghis+Khan+-+Frank+McLynn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11bee00f54e42676278a1c3e67d45ab5f81275e8","infoHashBuffer":{"type":"Buffer","data":[17,190,224,15,84,228,38,118,39,138,28,62,103,212,90,181,248,18,117,232]},"announce":[],"urlList":[]}}