{"title":"Windows 7 Ultimate USB Drive Edition x64 v3.0 by iMortaluz","uid":6263793,"size":2711004601,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:120ecbaf4c0e45344991b7fe506af8a77c308a8a&amp;dn=Windows+7+Ultimate+USB+Drive+Edition+x64+v3.0+by+iMortaluz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"some0neX","files":-1,"time":1300835216,"description":"Experience the first fully portable edition of Windows 7 x64 EVER created! \n\nInstall Windows 7 Ultimate to your USB drive/stick, take it with \nyou - and run from any x64 computer (even Macs). Bring your entire \noperating system, desktop, programs, games, files, personal settings, and much \nmore with you - everywhere! You can now carry your personal operating system in \na pocket!  \n\nThis is not bartpe/winpe/livecd or anything similar! This is the first real and \nfull version of Windows 7 Ultimate that can be run on any x64 computer from a USB drive! \n\nThis is the 64 bit edition which allows you to get most out of a x64 processor. \nCheck out the 32 bit edition, it runs on ANY computer and only requires 8GB disk \nspace: http://ub3r.1337.cx/7  or   7usb.tk/7\n\nVersion 3.0 brings you the completely NEW cloning feature. You can now easily share Win7 USB Edition with your friends (or back it up)! \n\n#################################################\nInstallation is easy as 1 2 3!\nRequirements: \n- at least 16GB high speed (15+ MB/s) USB drive or stick \n- .Net Framework 2 - http://ub3r.1337.cx/net \n[Tested on Windows 7/XP/Vista/2008 R2/2003] - can be installed from Mac/Linux as well, instructions are at http://ub3r.1337.cx/support \nIf your are running XP, make sure that the \\&quot;don\\'t format\\&quot; checkbox is selected! \n\n1. Extract the archive to a different location than your USB drive (e.g. desktop) \n2. Run \\&quot;INSTALL 7 USB Edition\\&quot; (You can use installer.bat, too.) \n3.a: Insert the USB drive into (any) computer [without any hubs!], (re)start it and press F8, F9, F11, F12, option or another key depending on your hardware. \nA menu should appear, choose your USB drive from it. You can also change the \nboot device order in the bios[press ctrl + s, F2, F10 etc.]. Read the motherboard \nmanual or google it. (This method works on computers that can boot from USB.) \n-==OR==- \n3.b: Burn the bootloader to an empty CD [run \\&quot;burn bootloader.bat\\&quot;], insert the CD \nand the USB drive to (any) computer, (re)start it and choose \\&quot;USB\\&quot; from the menu. \n(This method will work on almost any computer.) \n-==FOR MAC==- \n3.c: Install the included rEFIt bootloader on your Mac, insert the drive and reboot. \n\nThat\\'s it; enjoy carrying a full copy of Windows 7 Ultimate x64 \nin your pocket! \n\n[extra]: 7 Ultimate supports ANY language! In order to change it to your native \nlanguage go to start, type update and press \\&quot;windows update\\&quot;. Then click \\&quot;check for \nupdates\\&quot;, select the languages you want to install and wait. [I don\\'t recommend \ninstalling any other updates as it may destroy the crack] Finally set the language \nby going to start - control panel - clock language and region - change display \nlanguage. Enjoy using your portable windows in your native language! [Don\\'t forget \nto install your network and display drivers first!] \n\n[Optional:] If your drive is bigger than 8GB you may want to increase the size \nof the virtual system drive of your \nnew Windows in order to gain more disk space: \n1) browse to your USB drive and move the 7USBEditionByiMortaluz.vhd somewhere \nelse (e.g. desktop) \n2) start VHDResizer.exe and select this file \n3) press \\&quot;save as\\&quot; and browse to you USB drive again. Call the file \n7USBEditionByiMortaluz [It won\\'t work if you call it something else!] and press \nsave \n4) Choose the size depending on the size of your USB drive and press resize. Get \nyourself a cup of coffee, it\\'s going to take long time. \n5) When you boot your new portable windows for the first time - press start \nmenu, type partition and hit enter. Right click 7USBEditionByiMortaluz and \nchoose \\&quot;extend volume\\&quot;. Keep pressing next. \n################################################*\n\nRecovery: If your personal portable Windows does no longer boot, you can repair \nit with the included \\&quot;fix boot.bat\\&quot; tool. \nIf it doesn\\'t help, copy 7USBEditionByiMortaluz.vhd from your USB drive \nto your desktop, reinstall Win7 USB Edition, copy the 7USBEditionByiMortaluz.vhd \nfile back to the USB drive (replace the existing file). No files will be lost! \n\nYou can mount the virtual system partition from any other Windows 7 installation! \nGo to start, type partition, press \\&quot;create and format disk partitions\\&quot;. Press \naction - attach VHD and browse to the 7USBEditionByiMortaluz.vhd file. You can \nthen access (or recover) all your files. \n################################################\n*\nNew in version 3.0: \n-Graphical installer, cloning utility, countless fixes &amp; full XP compatibility \n\nAdditional info: \nThis is a fully functional and cracked copy of Windows 7 Ultimate x64. I don\\'t \nrecommend updating it with Windows Update, as this can destroy this system - do it \nat your own risk. Bear in mind that most USB sticks are slower than disks and that \nperformance may suffer. \n\nMD5 Checksum: D5EA94B5326220E6E68419B263B62AFB\n\nIncluded software: \nDriver Genius Professional - quickly find the drivers you need \nChrome Plus [with adblock]- because Internet Explorer sucks... \nSteam - now you can carry all your favorite games with you - everywhere! \nEverest Ultimate - Get advanced information about your hardware \n7zip - a free WinRAR replacement \nuTorrent - never stop downloading and seeding! \nCCleaner - easily free up disk space \nEttercap - control local network, recover (or hijack) passwords \nRemoveWAT - restores or removes Windows Activation, you can use this to activate Win7 \nwith a valid license from Micro$oft \n\nIncluded tools: \nDriverPack - additional network drivers - use if you have no internet connectivity \nGogonet - instant ipv6 connectivity - everywhere! \nWin7logon changer - change your logon background \nUltimate Win7 Tweaker \nProceXP - advanced task manager \nPassRenew - change passwords, add/delete users on any computer that you start \nyour new portable Windows on! \nWingate - start programs without logging on, log on without password (can be \nused for recovery (or evil) purposes) \nGodMode - useful Windows 7 Easter egg \n\nApplied tweaks: \nDisk performance has been improved by enabling drive caching \nSome services (error reporting, windows defender, etc.) have been disabled in \norder to give you the maximum performance \nWindows Activation is completely removed! (problem, Micro$oft?!) \nTerminal Server Patch applied, Windows 7 USB Edition supports unlimited remote \ndesktop connections! \n#################################################\n\nCreated, uploaded and written by iMortaluz. If somebody else shared it, check the \nchecksum of the archive with the included MD5Verifier.exe tool against those found \nat http://ub3r.1337.cx/7x64 to make sure that the release is not fake or infected! \n\nCopyright - Right To Copy - Share this as many times as you can! \nDo you like it? Share it with your friends using the CLONE utility! \nIf you have any problems or comments, go to the official forum -&gt; 7usb.tk or http://ub3r.1337.cx\n\nDIRECT DOWNLOAD LINK -&gt; 7usb.tk/dl  or &lt;a href=&quot; http://ub3r.1337.cx/dl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ub3r.1337.cx/dl&lt;/a&gt;\nDownload link is below, use bitlet.org if you don\\'t have a torrent client!","torrent":{"xt":"urn:btih:120ecbaf4c0e45344991b7fe506af8a77c308a8a","amp;dn":"Windows+7+Ultimate+USB+Drive+Edition+x64+v3.0+by+iMortaluz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120ecbaf4c0e45344991b7fe506af8a77c308a8a","infoHashBuffer":{"type":"Buffer","data":[18,14,203,175,76,14,69,52,73,145,183,254,80,106,248,167,124,48,138,138]},"announce":[],"urlList":[]}}