{"title":"Besieged by L.P. Lovell epub","uid":9723954,"size":288528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1226ecb8f4931e3fd5dad690334ba596a81f443b&amp;dn=Besieged+by+L.P.+Lovell+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"AtomTPB","files":1,"time":1394275586,"description":"What would you do if you were granted millions of pounds and a face that melts the underwear off of any woman? Meet Theodore Ellis, the business man who parties like a rock star, and has more women than he has room on his bed post to put the notches. \n\nMeet Lilly Parker. With a difficult past; Lilly is cold, closed off and emotionally unavailable in every way. Don't go thinking she's the sweet and innocent victim though, she plays the game better than most men, and is the original use and abuse woman. \nShe's built her walls ten feet high and topped with razor wire, but Theo is relentless in the face of a challenge and Lilly finds herself besieged by him. Can he get in her pants? Or will the unsuspecting man whore go a step further and finally tear down her walls? Unlikely. \n\nThis is no hearts and flowers love story, it is a battle of wills as a woman who trusts no-one denies a man who has never been denied. \n\nCue fireworks as female sass meets alpha male tenacity. \n\nBesieged will make you laugh, fantasize and perhaps even shed a tear.","torrent":{"xt":"urn:btih:1226ecb8f4931e3fd5dad690334ba596a81f443b","amp;dn":"Besieged+by+L.P.+Lovell+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1226ecb8f4931e3fd5dad690334ba596a81f443b","infoHashBuffer":{"type":"Buffer","data":[18,38,236,184,244,147,30,63,213,218,214,144,51,75,165,150,168,31,68,59]},"announce":[],"urlList":[]}}