{"title":"[SoM]L'era glaciale 2 - Il disgelo.avi[DvdRip-Divx-Ita-Mp3]","uid":4783007,"size":734189568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:123a4bfa1d7714c9e34eb4d67697a29843da3eec&amp;dn=%5BSoM%5DL%5C%27era+glaciale+2+-+Il+disgelo.avi%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mitimex","files":1,"time":1237451346,"description":"All'inizio del film il trio formato da Sid (il bradipo), Manny (il mammut) e Diego (la tigre dai denti a sciabola) se la spassa in un &quot;parco acquatico&quot; naturale. Improvvisamente, grazie a Sid, i tre scoprono che il luogo dove si trovano (una conca circondata da ghiacci) verrÃƒÂ  presto inondato a causa dello scioglimento dei ghiacci. I tre e il resto degli animali preistorici hanno una sola possibilitÃƒÂ  di salvarsi: raggiungere un'enorme barca che si trova nell'altra estremitÃƒÂ  della conca. Nel film si narra del viaggio, accompagnato alla storia di Manny, che nega il fatto di essere l'ultimo mammut, fatto sostenuto da tutti gli altri. Fra i protagonisti compariranno due nuovi nemici: due mostuosi dinosauri marini ibernati nel ghiaccio.\nDurante il viaggio i tre incontrano una mammut, Ellie. Manny, felice di aver dimostrato a tutti di non essere una specie estinta si trova perÃƒÂ² di fronte un problema: Ellie, a causa dei suoi due &quot;fratelli&quot; opossum, Crash ed Eddie, si crede anch'essa una opossum.\nAlla fine del film tutto si risolverÃƒÂ  nel migliore dei modi: Ellie capirÃƒÂ  di essere una mammut e nascerÃƒÂ  un amore tra lei e Manny e gli animali preistorici riusciranno a salvarsi. Mentre i due mostri marini verranno sconfitti, il finale non va bene solo per Scrat: verso la fine del film ÃƒÂ¨ moribondo,sta per raggiungere il paradiso, un luogo disseminato di ghiande e con una ghianda gigante al centro. Ma proprio mentre sta per toccare quella ghianda Sid lo salverÃƒÂ  tramite respirazione artificiale, negandogli cosÃƒÂ¬ il suo piÃƒÂ¹ grande sogno. Il film si conclude con Scrat che insegue Sid.\n","torrent":{"xt":"urn:btih:123a4bfa1d7714c9e34eb4d67697a29843da3eec","amp;dn":"%5BSoM%5DL%5C%27era+glaciale+2+-+Il+disgelo.avi%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"123a4bfa1d7714c9e34eb4d67697a29843da3eec","infoHashBuffer":{"type":"Buffer","data":[18,58,75,250,29,119,20,201,227,78,180,214,118,151,162,152,67,218,62,236]},"announce":[],"urlList":[]}}