{"title":"Doom Patrol (001 - 087 + Annuals) (1987 - 1995) (digital) (iUltr","uid":11406270,"size":3317644287,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:129136f9890bb7e1cc57735db4c2b1dcf186974c&amp;dn=Doom+Patrol+%28001+-+087+%2B+Annuals%29+%281987+-+1995%29+%28digital%29+%28iUltr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"nemesis43","files":89,"time":1415480628,"description":"Doom Patrol (001 - 087 + Annuals) (1987 - 1995) (digital) (iUltron-Empire)\n\n\nThe eighty-seven issue series is often divided into three distinctively different runs by the three writers who worked on the book:\n\n\nPaul Kupperberg (#01 - 18 ): This run was in the theme of a superhero book where various characters from the DC universe would guest star to take out so-and-so all while the new Doom Patrol was established. Kupperberg introduced a lot of new character's to the team, many of which he wrote out so that Morrison could ease into his run. Near the end of his run, Doom Patrol Annual #1 was released.\n\nThe Kupperberg/Morrison switch would occur using The Invasion mini-series and its cross-over.Grant Morrison (#19- 63): Morrison took this book, and superhero books in general, in a new direction for DC and it was his run on this comic that brought more &quot;mature&quot; themes to the comic world and it is the most acclaimed run of any Doom Patrol series. Ironically although this was one of the comics that helped bolster the enthusiasm for the Vertigo imprint, the imprint first appeared on the comic with the first issue of Pollack's run.\n\nRachel Pollack (#64- 87): Probably left with the hardest task of all, Pollack had to follow up on Morrison's run and although she kept the title in the Vertigo style and explored themes irregular for a superhero book, her run was never collected by Vertigo. #64 of the series would also be the first of this series to carry the Vertigo Banner. She wrote Doom Patrol Annual #2 which served as a tie-in to the Vertigo event, The Children's Crusade","torrent":{"xt":"urn:btih:129136f9890bb7e1cc57735db4c2b1dcf186974c","amp;dn":"Doom+Patrol+%28001+-+087+%2B+Annuals%29+%281987+-+1995%29+%28digital%29+%28iUltr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129136f9890bb7e1cc57735db4c2b1dcf186974c","infoHashBuffer":{"type":"Buffer","data":[18,145,54,249,137,11,183,225,204,87,115,93,180,194,177,220,241,134,151,76]},"announce":[],"urlList":[]}}