{"title":"The Complete Sherlock Holmes  (All Formats)","uid":6764574,"size":12801396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12a18cc89fad9e70658f989224a6726dd9e7ea4a&amp;dn=The+Complete+Sherlock+Holmes++%28All+Formats%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rosie1966","files":6,"time":1319322321,"description":"Arthur Conan Doyle \nThe most famous fictional detective in the world is Arthur Conan Doyle's Sherlock Holmes. However, Doyle was, at best, ambivalent about his immensely successful literary creation and, at worst, resentful that his more &quot;serious&quot; fiction was relatively ignored. Born in Edinburgh, Doyle studied medicine from 1876 to 1881 and received his M.D. in 1885. He worked as a military physician in South Africa during the Boer War and was knighted in 1902 for his exceptional service. Doyle was drawn to writing at an early age. Although he attempted to enter private practice in Southsea, Portsmouth, in 1882, he soon turned to writing in his spare time; it eventually became his profession. As a Liberal Unionist, Doyle ran, unsuccessfully, for Parliament in 1903. During his later years, Doyle became an avowed spiritualist. Doyle sold his first story, &quot;The Mystery of the Sasassa Valley,&quot; to Chambers' Journal in 1879. When Doyle published the novel, A Study in Scarlet in 1887, Sherlock Holmes was introduced to an avid public. Doyle is reputed to have used one of his medical professors, Dr. Joseph Bell, as a model for Holmes's character. Eventually, Doyle wrote three additional Holmes novels and five collections of Holmes short stories. A brilliant, though somewhat eccentric, detective, Holmes employs scientific methods of observation and deduction to solve the mysteries that he investigates. Although an &quot;amateur&quot; private detective, he is frequently called upon by Scotland Yard for assistance. Holmes's assistant, the faithful Dr. Watson, provides a striking contrast to Holmes's brilliant intellect and, in Doyle's day at least, serves as a character with whom the reader can readily identify. Having tired of Holmes's popularity, Doyle even tried to kill the great detective in &quot;The Final Problem&quot; but was forced by an outraged public to resurrect him in 1903. Although Holmes remained Doyle's most popular literary creation, Doyle wrote prolifically in other genres, inclu ding historical adventure, science fiction, and supernatural fiction. Despite Doyle's sometimes careless writing, he was a superb storyteller. His great skill as a popular author lay in his technique of involving readers in his highly entertaining adventures.\n\n\nThis collection was designed for optimal navigation on Sony Reader and other electronic devices. This collection offers lower price, the convenience of a one-time download, and it reduces the clutter in your digital library. All books included in this collection feature a hyperlinked table of contents and footnotes. The collection is complimented by an author biography.\n\nTABLE OF CONTENTS:\n\nA Study in Scarlet\nThe Sign of Four\nThe Adventures of Sherlock Holmes\nThe Memoirs of Sherlock Holmes\nThe Hound of the Baskervilles\nThe Return of Sherlock Holmes\nThe Valley of Fear\nHis Last Bow\nThe Case-Book of Sherlock Holmes\n\nAppendix:\nArthur Conan Doyle Biography\nList of Illustrations\nAbout and Navigation\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:12a18cc89fad9e70658f989224a6726dd9e7ea4a","amp;dn":"The+Complete+Sherlock+Holmes++%28All+Formats%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12a18cc89fad9e70658f989224a6726dd9e7ea4a","infoHashBuffer":{"type":"Buffer","data":[18,161,140,200,159,173,158,112,101,143,152,146,36,166,114,109,217,231,234,74]},"announce":[],"urlList":[]}}