{"title":"Faith Hill - The Hits (2007) FLAC","uid":9049991,"size":458584944,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13308085064029320313cf0f2c386c8c01e68a9a&amp;dn=Faith+Hill+-+The+Hits+%282007%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"shadoe.federation","files":18,"time":1381849447,"description":"Description: Six albums into her career, Faith Hill already has more than enough hit singles to fill a best-of album, so this 13 track compilation is a fine summation of her career up to 2007. Containing seven number-one country hits, many of which crossed over to the pop charts, HITS is a fine argument for Faith Hill as one of the top country singers of her time. From pop crossover smashes like &quot;This Kiss&quot; and &quot;Breathe&quot; to more traditional country songs like &quot;Mississippi Girl&quot; and &quot;The Way You Love Me,&quot; HITS is a solidly entertaining listen. However, for good measure, HITS also adds three live songs--the Janis Joplin standard &quot;Piece of My Heart,&quot; &quot;There Will Come A Day,&quot; and &quot;Cry&quot;--as well as one solid new single, &quot;Beautiful.&quot; Tastefully packaged and intelligently sequenced as well as musically unbeatable, HITS is a textbook example of how to do a mid-career best-of collection, and is far more listenable than the average uninspired cash-in. Audio Mixers: Scott Hendricks ; Tim McGraw; Byron Gallimore; Justin Niebank; Mike Shipley; Andy Wallace; Steve MacMillan; Steve Marcantonio; Tom Lord-Alge; Brendan O'Brien . Photographer: Andrew Southam. Personnel: Byron Gallimore (acoustic guitar, acoustic 12-string guitar, electric guitar, 12-string guitar); Marti Frederiksen (acoustic guitar, electric guitar, background vocals); Tom Bukovac (acoustic guitar, electric guitar); Billy Joe Walker, Jr., Marti Fredericksen, Byron Bukovac, Billy Joe Walker (acoustic guitar); Bruce Couton, Bruce Bouton (steel guitar); Kristin Katherine, Mary Kathryn Van Osdale (violin); Jamie Muhoberac (piano, Hammond b-3 organ, synthesizer, programming); Chris Lindsey (piano); Jeff McMahon (Fender Rhodes piano); Glenn Worf, Michael Rhodes , Mike Brignardello, Paul Bushnell , Tony Shanahan, Craig Nelson , John Marcus (bass guitar); David Dunkley (percussion); Monet Owens (background vocals); Ira Siegel, Tim Pierce (guitar); Don Potter, Larry Byrom, Biff Watson, Bob Minner (acoustic guitar); Dan Dugmore (electric guitar, steel guitar, lap steel guitar); Denny Hemingson (electric guitar, steel guitar); Dann Huff, Jeff King , Jerry McPherson, Michael Landau, Pat Buchanan, B. James Lowry, Darran Smith, Brent Mason (electric guitar); Paul Franklin (steel guitar, dobro); Sonny Garrish (steel guitar); Tom Hemby (gut-string guitar); Dean Brown , Stuart Duncan (mandolin, fiddle); Darrell Scott (mandolin); Jim Grosjean, Gary VanOsdale (violin, viola); Mary Katherine, Connie Ellisor, Carl Gorodetzky, Pamela Sixfin, David Davidson , Lee Larrison, Alan Umstead, David Angell, Catherine Umstead, Cate Myer (violin); Glen Duncan , Aubrey Haynie (fiddle); Kathryn Plummer, Kristin Wilkinson (viola); John Catchings (cello, percussion); Julia Tanner, Anthony LaMarchina, Bob Mason (cello); Tim Lauer (accordion); John Barlow Jarvis (piano); Jimmy Nichols (organ, keyboards); Steve Nathan (keyboards, synthesizer); Bill Cuomo (synthesizer); Shannon Forrest (drums, percussion); Chris McHugh, Lonnie Wilson, Richard Pagano, Paul Leim, Billy Mason (drums); Eric Darken, Terry McMillan, Vinnie Colaiuta (percussion); Chip Davis, Chris Rodriguez, Cindy Richardson Walker, Crystal Taliefero, Curtis Young, Steve Hornbeak, Greg Barnhill, Karen Staley, Kim Parent, Lari White, Lisa Cochran, Mark Luna, Mary Ann Kennedy, Pamela Rose, Stephanie Bentley, Vince Gill, Bekka Bramlett, Beth Nielsen Chapman, Perry Coleman (background vocals); David Campbell . Additional personnel: Tim McGraw.\n\nMY NOTES: Complete album in FLAC, enjoy and seed if you download ;) ","torrent":{"xt":"urn:btih:13308085064029320313cf0f2c386c8c01e68a9a","amp;dn":"Faith+Hill+-+The+Hits+%282007%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13308085064029320313cf0f2c386c8c01e68a9a","infoHashBuffer":{"type":"Buffer","data":[19,48,128,133,6,64,41,50,3,19,207,15,44,56,108,140,1,230,138,154]},"announce":[],"urlList":[]}}