{"title":"Real Racing 3 v4.5.1 (Mega Mod) APK [SadeemPC]","uid":15533638,"size":49845968,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:134f9be86bab1e935ea8ebeb52c2d6036428bf91&amp;dn=Real+Racing+3+v4.5.1+%28Mega+Mod%29+APK+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SadeemPC","files":1,"time":1470857547,"description":"Real Racing 3 v4.5.1 (MegaMod)\r\nRequired Android 4.0.3+\r\n\r\nReal Racing 3 sets a new standard for mobile racing games – it really must be experienced to be believed!\r\n\r\n\r\nReal Racing 3 features a continuously expanding roster of officially licensed tracks, a 22-car grid, and over 70 meticulously detailed cars from makers like Ferrari, Porsche, Lamborghini, Mercedes-Benz, Bugatti, and Audi. Plus social leaderboards, Time Trials, Ghost Challenges, and innovative Time Shifted Multiplayer™ (TSM) technology, allowing you to race anyone, anytime, anywhere.\r\n\r\nREAL CARS\r\n- Drive Real Racing’s largest roster of cars yet – don’t miss our new manufacturers like Ferrari, Porsche, Lamborghini, Mercedes-Benz, Bugatti, and Audi. Take the wheel of over 70 intensely detailed vehicles and test your skills on an authentic 22-car race grid – the most epic racing experience on any handheld.\r\n\r\nREAL TRACKS\r\n- Burn rubber on a full lineup of 12 real tracks in multiple configurations from top locations around the world, including the latest arrivals Circuit de Catalunya and Dubai Autodrome, plus Mazda Raceway Laguna Seca, Circuit de Spa-Francorchamps, Silverstone, Hockenheimring, and many more.\r\n\r\nREAL PEOPLE\r\n- Like nothing you’ve seen before, our innovative Time Shifted Multiplayer™ lets you race anyone, anytime – even if they’re offline! Every career event is filled with fully interactive, AI-controlled time-shifted versions of your friends, as well as other players from around the world. Real Racing 3 now also features Time Trial Ghost Challenges, allowing you to learn from the best or start a rivalry with Friends.\r\n\r\nWelcome to the definitive racing experience for everyone, everywhere.\r\n\r\nWhat's new:\r\nExperience the evolution of Jaguar and earn three Jags, the 1963 Lightweight E-Type, the 1992 XJ220, and the 2017 F-Type SVR, in three special events.\r\n\r\nPlus:\r\n- Get Double Durability, free customization, and Time Trials without using Drive\r\n- Win the Porsche 911 Carrera in Gauntlet 8\r\n- Win the Dodge Challenger SRT Hellcat in a limited-time series\r\n- Earn an exclusive livery Mercedes-Benz SLS GT3 in the Samsung Championship\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.ea.games.r3_row\r\n\r\nInstructions:\r\n1. Install APK.\r\n2. Download data via WiFi","torrent":{"xt":"urn:btih:134f9be86bab1e935ea8ebeb52c2d6036428bf91","amp;dn":"Real+Racing+3+v4.5.1+%28Mega+Mod%29+APK+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"134f9be86bab1e935ea8ebeb52c2d6036428bf91","infoHashBuffer":{"type":"Buffer","data":[19,79,155,232,107,171,30,147,94,168,235,235,82,194,214,3,100,40,191,145]},"announce":[],"urlList":[]}}