{"title":"(PSX-PSP) Digimon World 1-3 converted properly [ResourceRG Games","uid":4985818,"size":925172573,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:136023591c768f9679f2f61d1f93fabe2a012b89&amp;dn=%28PSX-PSP%29+Digimon+World+1-3+converted+properly+%5BResourceRG+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"toxicjuggalo","files":4,"time":1246682932,"description":"DIGIMON WORLD:\n\nFile Island was once a bustling place, where Digimon gathered, talked, and lived in peace. Suddenly, File Island is abandoned, and the Digimon can no longer speak. You have been sucked into the Digiworld to find out what is happening. The first step on that quest is to train a Digimon. Feed it, rest it, and take your new friend to the toilet. Whenever something needs to be done, it will let you know with convenient thought balloons. If your Digimon disobeys, then scold it, but remember, praise can go a long way as well. After getting the creature under control, use it to battle the wild Digimon and return them to File Island. Will you be able to return all of the Digimon to File Island? Who is responsible for all these strange occurrences? These questions and many others are answered in DIGIMON WORLD.\n\n\nDIGIMON WORLD 2:\n\nTravel back to the island where it all started, collecting electronic pets and training them to be mighty warriors. An entirely new battle system makes for the most realistic combat in series history, and the improved graphics and intense sound deliver you right to the heart of the tournament. Individual monster control allows you to have maximum influence over the story's outcome, and more than 100 new creatures are available for capture in this impressive sequel to the acclaimed Digimon World. The action is fast and furious, as you enter into battle against some of the most gruesome machines imaginable! This time around, you can actually gain a bit of an advantage by melding two Digimon together to create an entirely new creature. With more than 200 monsters to capture and train, the game ensures that you'll be at it for a while before the excitement dies down. Play alone or take on a friend.\n\n\nDIGIMON WORLD 3:\n\nFeaturing favorites from 3 seasons of the TV show;Save the world from hackers;See your Digimon grow and develop;Customize your Digimon;Digivolve for tactical superiority.\n\nAll 3 games tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:136023591c768f9679f2f61d1f93fabe2a012b89","amp;dn":"%28PSX-PSP%29+Digimon+World+1-3+converted+properly+%5BResourceRG+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136023591c768f9679f2f61d1f93fabe2a012b89","infoHashBuffer":{"type":"Buffer","data":[19,96,35,89,28,118,143,150,121,242,246,29,31,147,250,190,42,1,43,137]},"announce":[],"urlList":[]}}