{"title":"Boxers &amp; Saints (2013|Minutemen-Nweako)","uid":9702121,"size":871061459,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:13ac386301be04e7fe1a7f2330de30e5b4370336&amp;dn=Boxers+%26amp%3B+Saints+%282013%7CMinutemen-Nweako%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1393980519,"description":"Promotional info - &quot;One of the greatest comics storytellers alive brings all his formidable talents to bear in this astonishing new work.\n\nIn two volumes, Boxers &amp; Saints tells two parallel stories. The first is of Little Bao, a Chinese peasant boy whose village is abused and plundered by Westerners claiming the role of missionaries. Little Bao, inspired by visions of the Chinese gods, joins a violent uprising against the Western interlopers. Against all odds, their grass-roots rebellion is successful.\n\nBut in the second volume, Yang lays out the opposite side of the conflict. A girl whose village has no place for her is taken in by Christian missionaries and finds, for the first time, a home with them. As the Boxer Rebellion gains momentum, Vibiana must decide whether to abandon her Christian friends or to commit herself fully to Christianity.\n\nBoxers &amp; Saints is one of the most ambitious graphic novels First Second has ever published. It offers a penetrating insight into not only one of the most controversial episodes of modern Chinese history, but into the very core of our human nature. Gene Luen Yang is rightly called a master of the comics form, and this book will cement that reputation.\n\nThis boxed set includes the trade paperback Boxers as well as the trade paperback Saints, packaged together in one slipcase.\n\nOne of Publishers Weekly's Best Comic Books and Best Children's Books of 2013\n\nA New York Times Book Review Notable Children's Book of 2013\n\nA Kirkus Reviews Best Teen Book of 2013\nAn NPR Best Book of 2013&quot;\n\nThis is both books with quality manual scans by Minutemen-Nweako. Thanks to them for their work, please seed and enjoy! :-)\n","torrent":{"xt":"urn:btih:13ac386301be04e7fe1a7f2330de30e5b4370336","amp;dn":"Boxers+%26amp%3B+Saints+%282013%7CMinutemen-Nweako%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13ac386301be04e7fe1a7f2330de30e5b4370336","infoHashBuffer":{"type":"Buffer","data":[19,172,56,99,1,190,4,231,254,26,127,35,48,222,48,229,180,55,3,54]},"announce":[],"urlList":[]}}