{"title":"Eartha Kitt - My Heart Belongs To Daddy (1953-1959) (1998 Camden","uid":5491843,"size":278706178,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:13dbede5488c496be2249f58bdf77282e803cc74&amp;dn=Eartha+Kitt+-+My+Heart+Belongs+To+Daddy+%281953-1959%29+%281998+Camden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1271069098,"description":"artist/s: Eartha Kitt\nalbum: My Heart Belongs to Daddy\nlabel: Camden/BMG\nnumber catalogue/UPC Code: 74321 569632\nformat: factory pressed silver CD\npackage: jewel case\nrecording year/s: 1953-1959\nCD release year: 1998\ncodec: reference libFLAC 1.2.1 20070917 - level 8\ncovers: full scans 300 dpi\nextra contents: cue non compliant, info, m3u, st5, ffp, md5.\n\n\nvideos\nEartha Kitt - My Heart Belongs to Daddy (Nat King Cole Show, 1957)\nEartha Kitt - I Want To Be Evil (Live Kaskad 1962)\nEartha Kitt - C'est Si Bon (Live Kaskad 1962)\n\n\n\nReview: \n\namazon.com customer\nEartha Kitt is at home in cabaret, on the Broadway stage, and in film and television. The versatile performer has done it all in her prolific career, highlighted in this superb collection of studio-recordings from Camden, entitled &quot;My Heart Belongs to Daddy&quot;.\nThis collection is highlighted by her legendary signature-standard &quot;C'est Si Bon&quot;, which she made famous in the Broadway show NEW FACES OF 1952. Other highlights in this must-own collection are &quot;I Want to be Evil&quot;, &quot;Just an Old-Fashioned Girl&quot;, &quot;Careless Love&quot;, &quot;Lilac Wine&quot;, &quot;Lullaby of Birdland&quot; and &quot;Lazy Afternoon&quot;.\nMs Kitt has been seen most recently as the Fairy Godmother in the national tour of RODGERS AND HAMMERSTEIN'S CINDERELLA, and before that in THE WILD PARTY opposite Toni Collette and Mandy Patinkin.\nA must-own recording for fans. \n\n\nBiography\tby Steve Huey\nEartha Kitt epitomized the idea of the sex-kitten chanteuse, rising to fame with a nightclub act centered around her slinky stage presence and her throaty purr of a voice. As much as she enjoyed vamping it up, she also projected the image of an exotic international sophisticate, especially since she sang in several different languages. She brought a definite zest to her torch songs, and favored lyrics that painted her as the Material Girl of her time. Kitt's persona was so vivid and well-developed that she remained easily identifiable well after her early-'50s heyday, and it also helped her find success as an actress in movies, TV, and theater. Even if many remember her best as one of the actresses to play Catwoman on the '60s Batman series, Kitt was always a cabaret performer at heart, one whose act translated best in a live setting. After a dramatic rise to fame from a childhood of neglect and poverty, Kitt endured a ten-year blacklisting owing to her sharp criticism of the Vietnam War. She returned to performing in the '80s and '90s, both as an actress and as a singer on the nightclub circuit.\nEartha Mae Kitt's actual origins are somewhat in doubt. It's likely she was born on January 17, 1927, on a cotton plantation in the small South Carolina town of North. A birth certificate discovered in the late '90s seemed to corroborate that information, but Kitt was never entirely sure, because she lost contact with both her parents at a very young age. Her white father (sometimes alleged to be one of the plantation owner's sons) abandoned her when she was very young, and her mother, a black sharecropper, later remarried and sent her to live with neighbors. Kitt's mother died not long afterwards. Overworked, overlooked, and teased for being biracial, Kitt was finally sent to live with an aunt in Harlem when she was eight. Although she remained at the edge of poverty, things improved somewhat, as she began piano and dance lessons, and also got some singing and acting opportunities through church. Kitt was admitted to New York's High School for the Performing Arts, but unfortunately, her home life took a turn for the worse, and her aunt threw her out. Kitt was forced to drop out of school and worked a few odd jobs to support herself.\nA chance meeting with a dancer led Kitt to audition for Katherine Dunham's dance school at age 16. She won a scholarship, and went on tour with the school company all over Europe and the Americas. When the company stopped in Paris, Kitt got the chance to fill in for a singer who was too ill to perform. She was spotted by a nightclub owner who signed her on as a vocalist, and she stayed in Paris to work the cabaret circuit. There she was discovered by the legendary director Orson Welles, who called her &quot;the most exciting woman alive&quot; and, in 1950, cast her as Helen of Troy in his stage production Time Runs, an adaptation of Faust. Kitt returned to the United States and immediately found bookings on the New York nightclub scene, including lengthy runs at the Blue Angel and the Village Vanguard. She was also tapped for the Broadway revue New Faces of 1952, and her numbers -- especially &quot;Monotonous&quot; -- easily stole the show; they also led to a recording contract with RCA Victor.\nKitt recorded her debut album, RCA Victor Presents Eartha Kitt, in 1953, and it was a major hit, climbing into the Top Five on the LP charts. She scored a minor success with &quot;Uska Dara (A Turkish Tale),&quot; and had a breakout Top Ten hit that August with the French-language &quot;C'est Si Bon (It's So Good),&quot; which became her signature song. Her second album, That Bad Eartha, was released before the year's end, and also reached the Top Five; it featured much of her core repertoire, with songs like &quot;I Want to Be Evil,&quot; &quot;My Heart Belongs to Daddy,&quot; and &quot;Under the Bridges of Paris.&quot; Kitt scored a holiday hit at the end of 1953 with the breathy, over-the-top &quot;Santa Baby,&quot; which proved to be the biggest single of her career. It also marked the peak of her popularity; audiences who couldn't get enough of her act in 1953 were growing accustomed to her style, and she was a less dominant presence in 1954, though she did enjoy limited success with &quot;Somebody Bad Stole de Wedding Bell (Who's Got de Ding Dong)&quot; and the R&amp;B-flavored &quot;(If I Love Ya, Then I Need Ya) I Wantcha Around.&quot; She also returned to Broadway in the drama Mrs. Patterson, which earned her a Tony nomination, and made her film debut in the movie adaptation of New Faces.\nKitt's third LP, Down to Eartha, appeared in 1955 to a more muted response than her first two. She was still a top draw on the nightclub circuit, however, and found increasing success as an actress. In 1957, she starred in the Broadway show Shinbone Alley and appeared alongside Sidney Poitier in the film The Mark of the Hawk; the following year, she co-starred in two more films, the W.C. Handy biopic St. Louis Blues (with Nat King Cole) and Anna Lucasta (with Sammy Davis, Jr.). In 1959, Kitt left RCA and joined her producer David Kapp's new Kapp label; many of her recordings there were updated versions of her past successes. In 1960, she began a five-year marriage to real estate developer Bill McDonald, which produced a daughter, Kitt McDonald. Kitt continued to record sporadically over the '60s, including the 1965 live set Eartha Kitt in Person at the Plaza, a fan favorite. In 1967, she replaced Julie Newmar as the sultry villain Catwoman on the Batman TV series, which remains her best-known role as an actress.\nIt was not to last, however. In 1968, Lyndon and Lady Bird Johnson invited Kitt to a celebrity women's luncheon at the White House to offer her views on inner-city youth. Taking the event seriously, not as a publicity stunt, Kitt pointedly criticized the Vietnam War and its impact on poor minorities. An infuriated Johnson put out the word that Kitt's rudeness had reduced the First Lady to tears, and Kitt found herself essentially blacklisted across the country -- afraid of incurring the government's wrath, venues simply refused to book her. It was later revealed that Kitt was made the subject of a secret federal investigation; her house was bugged and she was tailed by Secret Service agents. When the FBI failed to find evidence that Kitt was a subversive, the CIA compiled a highly speculative dossier that attempted to portray her as a nymphomaniac. Unable to find work in America, Kitt moved to Europe, where she would spend most of the following decade. In 1974, she courted controversy once again by touring South Africa; although she performed for white-only audiences, her show was racially integrated, and she raised money for black schools by selling autographs.\nKitt finally returned to the U.S. for good in 1978 as a cast member of the Broadway show Timbuktu, an all-black adaptation of Kismet. The audience greeted her with a standing ovation, and she went on to earn a second Tony nomination; President Carter even welcomed her back personally. Her career in America rehabilitated, Kitt returned to the cabaret/supper club circuit, and also revived her film career starting in the late '80s, appearing in comedies like Erik the Viking, Ernest Scared Stupid, and Eddie Murphy's Boomerang. She recorded a series of albums for the ITM label during the '90s, and earned a Grammy nomination (Best Traditional Pop Vocal Performance) for 1994's cocktail-lounge set Back in Business on DRG. She also continued her acting career, and toward the end of the '90s she moved into voice-over work as well, appearing in the animated series The Wild Thornberrys and the Disney film The Emperor's New Groove. In 2000, she received a third Tony nomination for her work in the musical drama The Wild Party. Kitt continued performing and recording into the 2000s, but was diagnosed with colon cancer in 2006, and passed from the disease in late 2008. \n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:hifqxqw5ldhe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:hifqxqw5ldhe~T1&lt;/a&gt;\n\n\n\ntrack list: \n\n01. Let's Do It    [0:03:06.49]\n02. C'est Si Bon    [0:02:59.93]\n03. My Heart Belongs To Daddy    [0:03:02.80]\n04. I Want To Be Evil    [0:03:32.10]\n05. Just An Old Fashioned Girl    [0:02:53.49]\n06. Monotonous    [0:03:44.90]\n07. Beale Street Blues    [0:03:15.06]\n08. Lullaby of Birdland    [0:02:54.40]\n09. Under the Bridges of Paris    [0:02:43.33]\n10. Thursday's Child    [0:04:01.09]\n11. St. Louis Blues    [0:02:48.46]\n12. Uska Dara - A Turkish Tale    [0:03:10.84]\n13. The Memphis Blues    [0:03:28.80]\n14. Lazy Afternoon    [0:02:23.26]\n15. Careless Love    [0:03:15.82]\n16. Lilac Wine    [0:03:45.40]\n17. April in Portugal    [0:02:54.40]\n18. Apres Moi    [0:02:46.37]\n19. The Day The Circus Left Town    [0:03:19.42]\n20. If I Can't Take It With Me    [0:02:29.30]\n\n\n\n\nMy Friends:\n\ntrader's little helper &lt;a href=&quot;\nhttp://tlh.easytree.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tlh.easytree.org/&lt;/a&gt;\n\nflac &lt;a href=&quot;\nhttp://flac.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/&lt;/a&gt;\n\nfoobar &lt;a href=&quot;\nhttp://www.foobar2000.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.foobar2000.org/&lt;/a&gt;\n\nexact audio copy (EAC) &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/&lt;/a&gt;\n\n\nA MUST HAVE IF YOU'RE INTO EARTHA!!!\n","torrent":{"xt":"urn:btih:13dbede5488c496be2249f58bdf77282e803cc74","amp;dn":"Eartha+Kitt+-+My+Heart+Belongs+To+Daddy+%281953-1959%29+%281998+Camden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13dbede5488c496be2249f58bdf77282e803cc74","infoHashBuffer":{"type":"Buffer","data":[19,219,237,229,72,140,73,107,226,36,159,88,189,247,114,130,232,3,204,116]},"announce":[],"urlList":[]}}