{"title":"Grand Theft Auto II (Compatible with Windows 7)","uid":8702525,"size":361102564,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1431507ff7ee109fecdb396b2340cafc31117215&amp;dn=Grand+Theft+Auto+II+%28Compatible+with+Windows+7%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"PulseOfSk8","files":1,"time":1374084486,"description":"Grand Theft Auto 2 (abbreviated as GTA2) is a 1999 open world action-adventure video game developed by DMA Design (now Rockstar North) and published by Rockstar Games, originally released on 30 September 1999 for Microsoft Windows and 25 October 1999 for the PlayStation. The game was later ported to the Dreamcast console and the Game Boy Color. It is the sequel to 1997's Grand Theft Auto. The PC and Dreamcast versions of GTA2 are both rated M by the ESRB.\n\nGTA 2 is set in an unspecified time in a retrofuturistic metropolis referred to only as &quot;Anywhere, USA&quot;,[4] but the game's manual and website uses the phrase &quot;three weeks into the future&quot;;[5] fictional journal entries on the GTA2 website suggest the year to be 2013.[4] Radio host Johnny Riccaro mentions in the game that &quot;the millennium's coming,&quot; which would set the game in its release year of 1999.\n\nThe City is split into three levels, or &quot;districts.&quot; The first level, Downtown, is a hub of business activity as well as the site of a large mental institution and university. The second area, the Residential District, contains the city's prison, a trailer park with an Elvis-themed bar dubbed &quot;Disgracelands&quot;, a shopping mall, and a giant hydroelectric power plant. The third and final area is the Industrial District; it holds a large seaport, a meat packing plant, a Nuclear Power Plant and a Krishna temple.\n\nThere are a total of seven criminal gangs in the game: the Zaibatsu, a corrupt corporation, is present in all three areas. The Downtown area is also home to the Loonies, a gang of mentally ill people who have taken over the city asylum, and the Yakuza. In the Residential area, the gangs include SRS Scientists and the Rednecks, who live in a trailer park and drive around in pickups with large Confederate flags. The Industrial area contains the Russian Mafia and the Hare Krishna. Each gang has their own special characteristics, car, and behavior.\n\nThe game can be played in two modes (only in the PC version), noon or dusk. On the noon setting the lighting is bright making the game clear to see (also lowering the graphics overhead on low-end hardware because of the fewer lighting effects). On the dusk setting the game is darker, with multiple dynamic lights from explosions and car headlights. The Dreamcast version of the game can only be played in the dusk setting. The PlayStation version of the game can only be played in the noon setting. This feature was expanded further in Grand Theft Auto III where the daylight changes with the time of day in the game.\n\nInstalation:\n- Unrar instalator\n- Run instalator\n- Play / Have Fun / Seed\n\nHardware requirements:\n\n-Pentium 200 MHz CPU\n- 32 MB RAM\n- Graphics card compatible with Direct3D\n- 65 MB HDD\n- Microsoft Windows 95/98/98SE/Me/2000/XP/7\n- DirectX 6.1\n\nAdditional informations:\nIt's modificated version. Not 100% sure but it works on every new windows system.\n\nRead README file. It's important.\n\nScrenshoots:\n//bayimg.com/NanNfaAEM\n//bayimg.com/nanngAaeM\n//bayimg.com/nANNhaaem\n//bayimg.com/naNnIAAEm","torrent":{"xt":"urn:btih:1431507ff7ee109fecdb396b2340cafc31117215","amp;dn":"Grand+Theft+Auto+II+%28Compatible+with+Windows+7%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1431507ff7ee109fecdb396b2340cafc31117215","infoHashBuffer":{"type":"Buffer","data":[20,49,80,127,247,238,16,159,236,219,57,107,35,64,202,252,49,17,114,21]},"announce":[],"urlList":[]}}