{"title":"Doctor Who - Season 12 - (1974-75) - 20 Episodes","uid":9105428,"size":3769352926,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:145370fe9aa437207da7b20c941049aa859cafe4&amp;dn=Doctor+Who+-+Season+12+-+%281974-75%29+-+20+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"bnaron","files":20,"time":1382857571,"description":"The twelfth season of British science fiction television series Doctor Who began on 28 December 1974 with Tom Baker's first serial, Robot, and ended with Revenge of the Cybermen on 10 May 1975.\n\nThis is the first season to feature Tom Baker as the fourth incarnation of the Doctor, an alien Time Lord who travels through time and space in his TARDIS, which appears to be a British police box on the outside. He is accompanied by companions Sarah Jane Smith (Elisabeth Sladen), continuing from season eleven, and Harry Sullivan (Ian Marter), who joins in this season.\n\nAfter Robot, all the serials in this season continue directly one after the other, tracing one single problematic voyage of the TARDIS crew. Despite the continuity, each serial is considered its own standalone story.\n\n1.  Robot - Four Episodes\n\n    Synopsis: With the newly regenerated Doctor, UNIT have to contend with\n    the theft of the plans for the new disintegrator gun by what seems to\n    be a mechanical monster.  \n\n2.  The Ark in Space - Four Episodes\n\n    Synopsis: The Doctor, Sarah, and Harry accidentally travel to Space\n    Station Nerva in orbit around a far future Earth where they encounter\n    an insectoid alien race known as the Wirryn.  \n\n3.  The Sontaran Experiment - Two Episodes\n\n    Synopsis: On a future Earth, the Fourth Doctor, Harry Sullivan, and\n    Sarah Jane Smith discover Styre, a Sontaran warrior.  \n\n4.  Genesis of the Daleks - Six Episodes\n\n    Synopsis: Intercepted during a Transmat transfer, at the request of\n    the Time Lords, the Doctor, Sarah, and Harry travel to Skaro just as\n    the Daleks are being created where they try to change the history of\n    the Daleks. \n\n5.  Revenge of the Cybermen - Four Episodes\n\n    Synopsis: The Doctor, Harry and Sarah find themselves on Space Station\n    Nerva but millennia earlier when it was just a beacon for incoming and\n    outgoing space ships, where a lethal infection is spreading through\n    the crew.\n","torrent":{"xt":"urn:btih:145370fe9aa437207da7b20c941049aa859cafe4","amp;dn":"Doctor+Who+-+Season+12+-+%281974-75%29+-+20+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"145370fe9aa437207da7b20c941049aa859cafe4","infoHashBuffer":{"type":"Buffer","data":[20,83,112,254,154,164,55,32,125,167,178,12,148,16,73,170,133,156,175,228]},"announce":[],"urlList":[]}}