{"title":"Time-Saver Standards for Urban Design - (Malestrom)","uid":5115144,"size":80214286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14b441b251adb0dc642d8587146c406d775c4539&amp;dn=Time-Saver+Standards+for+Urban+Design+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1255022975,"description":" &lt;a href=&quot;http://bayimg.com/BaefjAACF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/BaefjAACF&lt;/a&gt;\n\nDonald Watson &quot;Time-Saver Standards for Urban Design&quot;\nMcGraw-Hill Professional | 2003-02-21 | ISBN: 007068507X | 960 pages | PDF \n\nExcerpts from review by Philip Langdon Judging by its title, you might think Time-Saver Standards for Urban Design would be a source mainly for street widths, sidewalk dimensions, parking ratios, and other matters than can largely be reduced to mathematical calculations. But this six-pound tome with its 960 oversized pages has far broader ambitions. McGraw-Hill calls this volume, &quot;the definitive reference on urban design,&quot; and the description doesn't seem to be hyperbole. Donald Watson, former dean of the School of Architecture at Rensselaer Polytechnic Institute, with help from Alan Plattus of Yale School of Architecture and Robert Shibley of SUNY-Buffalo School of Architecture and Planning, has assembled a volume containing the most significant urban design writings of the past 106 years. And that's just one of the eight sections in this enormous compilation. In addition to twelve classic texts...readers will find dozens of authoritative recent writings on world urbanization, regionalism, neighborhood planning, bike ways, green ways, universal design, outdoor lighting, way finding, acoustic considerations, and seemingly every other aspect of city-shaping. \n\nYou can flip from key documents of New Urbanism, including the Charter and the Lexicon, to LeCorbusier's (wrongheaded but fascinating) vision of towers and highways, Clarence Stein's The Radburn Idea, Clare Cooper Marcus's sociological analysis of urban plazas and shared outdoor spaces, and case studies of places such as Seattle's Pike Place Market. History, theory, principles and practice, they're all here...this is the best single volume I've seen, in terms of its ability to explain the entire spectrum of urban design through the words of its most prominent analysts and practitioners. Expand your bookshelf. New Urban News 20040301 Excerpts from review by Bay Brown. It is a how-to, with diagrams on street and courtyard siting, but it is also a history of urban-design theory, including seminal texts ranging from passages of Camillo Sitte's 1889 book The Art of Building Cities to Kevin Lynch's 1960 essay &quot;The City Image and Its Elements.&quot; Chapters are dedicated to sustainable design, universal design, transit-centered urban villages, wayfinding, and &quot;traffic calming.&quot; \n\nAlmost every essay is written by a different expert, which affords a diversity of experience and voice, and the tome liberally uses photographs, drawings, diagrams, and charts with informative statistics and demographics. It may offer more than you want to know, but after a selective read, it should be parked on your shelf as an invaluable reference. Architecture Magazine 20040109","torrent":{"xt":"urn:btih:14b441b251adb0dc642d8587146c406d775c4539","amp;dn":"Time-Saver+Standards+for+Urban+Design+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14b441b251adb0dc642d8587146c406d775c4539","infoHashBuffer":{"type":"Buffer","data":[20,180,65,178,81,173,176,220,100,45,133,135,20,108,64,109,119,92,69,57]},"announce":[],"urlList":[]}}