{"title":"Star Blazers Season 1-2-3 ENG BluRay-DVD","uid":10681711,"size":19583696751,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:14deadbbdf9e6ac8fa1b36ffc481197bc0ff943a&amp;dn=Star+Blazers+Season+1-2-3+ENG+BluRay-DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":7,"uploader":"darkj6","files":194,"time":1407039487,"description":" ______   _______  ______    ___   _      ___  --------|\n|      | |   _   ||    _ |  |   | | |    |   ||   |----|    \n|  _    ||  |_|  ||   | ||  |   |_| |    |   ||   |___ \n| | |   ||       ||   |_||_ |      _|    |   ||    _  |\n| |_|   ||       ||    __  ||     |_  ___|   ||   | | |\n|       ||   _   ||   |  | ||    _  ||       ||   |_| |\n|______| |__| |__||___|  |_||___| |_||_______||_______|\n\nJoin ThePirateBay Forum:\n                     &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=register&amp;referrer=908&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=register&amp;referrer=908&lt;/a&gt;\n\n\n\nStar Blazers Seasons 1, 2, and 3 Complete\n-----------------------------------------\nUntil this torrent, nobody has combined the Season 1 Blu-Ray video source with 'Star Blazers' editing and audio while using the DVD/VHS home video timeline. This torrent was made for all the 'Star Blazers' fans who do not want the scene transition hop/jitter as in all other iterations of Star Blazers. \n\nThough this torrent is fan made, it is as close to what was broadcast on TV back when first aired - including the missing 30 seconds of audio from the first broadcast episode which is missing from home DVD copies. \n\n'Star Blazers' was edited to be 'kid safe' while 'Space Battleship Yamato' was more for adults.\n\n\n\n- Rendered in 640x480 XviD/MP3 for 100% compatibility on all OS/Players.\n\n- *Season 1 rendered at 350MB per episode (BluRay video source)\n\n- Seasons 2 and 3 rendered at 175MB per episode (DVD video source)\n\n- Proper &quot;Star Blazers&quot; burst logo made using best available copies for opening and ending sequences.\n\n- Best effort made to remove scene transition 'hop'. Extremely time consuming!\n\n- Episode titles from Wikipedia were used along with use of proper season openings and endings.\n\n\n* Blu Ray source was 1920x1080 resolution however only a 640x480 video box appears within the 1920x1080 screen for any given episode. Therefore only the 640x480 portion was ripped and used as source for season 1.\n\n\nSeason 1 Details:\n-----------------\nVideo Source: Season 1 Blu-Ray of &quot;Space Battleship Yamato TV BD-BOX&quot;; #345283\n\nAudio Source: 128kbps CD quality audio ripped from OEM Voyager DVD \n\nVideo Timing Reference: Manga Star Blazers Season 1 on Youtube\n\n\nSeason 2 Details:\n-----------------\nVideo Source: Season 2 DVD of 'Space Battleship Yamato'; #383562\n\nAudio Source: 128kbps CD quality audio ripped from OEM Voyager DVD \n\nVideo Timing Reference: Manga Star Blazers Season 2 on Youtube\n\n\nSeason 3 Details:\n-----------------\nVideo Source: Season 3 DVD of 'Space Battleship Yamato'; #383612\n\nAudio Source: 128kbps CD quality audio ripped from OEM Voyager DVD \n\nVideo Timing Reference: Manga Star Blazers Season 3 on Youtube\n\n\nWWII Sequence Details:\n----------------------\nTwo versions were merged in to one. As we all know this sequence is in Yamato episode 2 but not Star Blazers. The scene in the HD source episode does not show the Captain tying the rope to himself as the Yamato was sinking. Elsewhere on the &quot;Space Battleship Yamato TV BD-BOX&quot; is the original which included the scene though it was not remastered in HD. This WWII Sequence clip includes that missing scene. Closest font I could match was 'Ariel Unicode MS' 10pt bold with outline and shadow. \n\n\n\nComments:\n---------\nAfter wanting to watch 'Star Blazers' I took it upon myself to create the best possible output with the best of what is available. Long live Sony Vegas. Five months of careful editing later, in many cases frame-by-frame, I present to you 'Star Blazers Complete'. Season 1 turned out so good the only item left for a 'production level' quality is a better Star Blazers 'Sunburst' logo animation and proper credits as in the original. I almost put them in but figure it is easier to add them than remove them from a finished product.\n\n\nWhile I was at it I found all the scenes used in the opening and closing sequences for Season 1 from the Blu-Ray video and pieced it together. Season 1 opening uses Blu-Ray video, Season 2 and 3 openings use DVD video. Openings and endings are per wikipedia and are correct as were on broadcast TV. The home DVD releases from Voyager tweaked Season 2 slightly from what is used here. All 3 seasons use the same BluRay Season 1 ending.\n\n\nFading, reversed (played backwards) scenes, reversed horizontal scenes, stretching and the infamous large black letterboxes (which were used to cover up the Japanese subtitles). It is all there in correct order and sync. Season 2 never used the black letterboxes as the Star Blazers edit cropped the video to not show the Japanese text. Season 3 never used the black letterboxes to cover the Japanese text and have been added here so it looks more like Season 1.\n\n\nThe 'Star Blazers' sun burst logo was difficult to make, but overall it 'works' well enough. At least the last most visible picture used is clear. Timed exactly to the same frame/time as original.\n\n\nWhat is 'Scene Transition Hop?'\n-------------------------------\nIn older animations, film is spliced together scene-by-scene. The film does not always line up perfect and so every time a scene changes there is 2-4 frames before and after the scene change where the frames are higher/lower/skewed from the rest. Can make it less enjoyable to watch. Season 2 was horrible with this.\n\n\nWhat was done to address the 'Scene Transition Hop' in this torrent?\n--------------------------------------------------------------------\n4 months was spent going scene-by-scene and eliminating as much as possible so the overall video of all 3 seasons is as smooth as possible. If this had not been done these would have been done in less than a month. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0078692/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0078692/&lt;/a&gt;","torrent":{"xt":"urn:btih:14deadbbdf9e6ac8fa1b36ffc481197bc0ff943a","amp;dn":"Star+Blazers+Season+1-2-3+ENG+BluRay-DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14deadbbdf9e6ac8fa1b36ffc481197bc0ff943a","infoHashBuffer":{"type":"Buffer","data":[20,222,173,187,223,158,106,200,250,27,54,255,196,129,25,123,192,255,148,58]},"announce":[],"urlList":[]}}