{"title":"ISHMAEL-Daniel Quinn-AudioBook","uid":3787304,"size":126326264,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:156387629598a3efc82f7e87ce2359a54d2cbef0&amp;dn=ISHMAEL-Daniel+Quinn-AudioBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"kjaksweden","files":26,"time":1188321930,"description":"From Publishers Weekly\nDaniel Quinn won the Turner Tomorrow Award\\&amp;#039;s half-million-dollar first prize for this fascinating and odd book--not a novel by any conventional definition--which was written 13 years ago but could not find a publisher. The unnamed narrator is a disillusioned modern writer who answers a personal ad (\\&quot;Teacher seeks pupil. . . . Apply in person.\\&quot;) and thereby meets a wise, learned gorilla named Ishmael that can communicate telepathically. The bulk of the book consists entirely of philosophical dialogues between gorilla and man, on the model of Plato\\&amp;#039;s Republic. Through Ishmael, Quinn offers a wide-ranging if highly general examination of the history of our civilization, illuminating the assumptions and philosophies at the heart of many global problems. Despite some gross oversimplifications, Quinn\\&amp;#039;s ideas are fairly convincing; it\\&amp;#039;s hard not to agree that unrestrained population growth and an obsession with conquest and control of the environment are among the key issues of our times. Quinn also traces these problems back to the agricultural revolution and offers a provocative rereading of the biblical stories of Genesis. Though hardly any plot to speak of lies behind this long dialogue, Quinn\\&amp;#039;s smooth style and his intriguing proposals should hold the attention of readers interested in the daunting dilemmas that beset our planet. \n\n96kpbs 3 cd-s in mp3 format.","torrent":{"xt":"urn:btih:156387629598a3efc82f7e87ce2359a54d2cbef0","amp;dn":"ISHMAEL-Daniel+Quinn-AudioBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156387629598a3efc82f7e87ce2359a54d2cbef0","infoHashBuffer":{"type":"Buffer","data":[21,99,135,98,149,152,163,239,200,47,126,135,206,35,89,165,77,44,190,240]},"announce":[],"urlList":[]}}