{"title":"StarCraft.II.Heart.of.the.Swarm.Proper-RELOADED","uid":8340702,"size":14530090876,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:15771632e8a96a34e11e0314d3d2467c1953cc25&amp;dn=StarCraft.II.Heart.of.the.Swarm.Proper-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":".SceNe.","files":2,"time":1365094823,"description":"StarCraft II: Heart of the Swarm Proper (c) Blizzard\n\n04/2013 :..... RELEASE.DATE .. PROTECTION .......: Battle.net\n1 :.......... DISC(S) .. GAME.TYPE ........: RTS\n\nProper notes\n\nYou only need to read FLTs nfo to know that something is wrong. Their\nrelease requires you to be online in order to download patch files from\nBlizzard. This makes their release invalid now, and useless later, when\nBlizzard disables their crack with patch files. Our release comes with all\ndata required to play\n\nFurthermore, the FLT release doesn't support custom (Arcade/Skirmish) maps\nOur release does, it supports all maps available offline\n\nFinally, their crack does not work with certain CPUs, for instance on\nthe latest AMD 8 core processors. Our crack does\n\nAdditional notes\n\nOur crack will attempt to automatically firewall the game using Windows\nFirewall. If your Windows Firewall is disabled, then you need to be offline,\nor you need to use your third party firewall to block the following exe\nmanually: &quot;VersionsBase24944SC2.exe\n\nIt's possible to add more custom maps (Arcade/Skirmish) if you wish. Ask one\nof your friends who has the original game to Create Games using these maps\n(while logged in to Battle.Net just enter the lobby, then leave it).\nAfter all maps are downloaded and pre-cached, get his Offline Cache folder\nwhich is located in &quot;C:Documents and SettingsAll UsersApplication Data\nBlizzard EntertainmentBattle.net&quot; and copy it into the &quot;Battle.net\nsub-folder of where you installed the game\n\nGame infos\n\nWelcome to The Hive Mind\n\nYou are Sarah Kerrigan, former Queen of Blades. Once the most feared entity\nin the galaxy, you now wait in a cell in the depths of a high-security\nresearch laboratory. Before the murderous forces of the Terran Dominion\nclose in, you must plot your escape to the dark reaches of space... and\nreclaim your living empire at the Heart of the Swarm\n\nCommand New Weapons of War\nDeploy devastating new units across an ever-shifting battlefield. Incinerate\nadvancing foes with the Hellbat, seize air superiority with the Tempest,\nengulf entrenched enemies with the Swarm Host, and much more\n\nUnleash Hell\nLead Sarah Kerrigan as she embarks on a path of furious vengeance. Evolve\nyour brood for maximum devastation, unlock latent psionic powers, and swarm\nfrom planet to planet aboard your moon-sized zerg Leviathan\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory, overwriting existing files\nFirewall the game manually if you have disabled Windows Firewall, as\ndescribed in the notes above\n5. Play the game by using the default login (rldsince9y.com\n6. Support the software developers. If you like this game, BUY IT ","torrent":{"xt":"urn:btih:15771632e8a96a34e11e0314d3d2467c1953cc25","amp;dn":"StarCraft.II.Heart.of.the.Swarm.Proper-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15771632e8a96a34e11e0314d3d2467c1953cc25","infoHashBuffer":{"type":"Buffer","data":[21,119,22,50,232,169,106,52,225,30,3,20,211,210,70,124,25,83,204,37]},"announce":[],"urlList":[]}}