{"title":"Rembrandts Eyes (Art Ebook).pdf","uid":11651366,"size":141478640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:159e4ad775ad4e71cb5da49cb586e36a6f198386&amp;dn=Rembrandts+Eyes+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1417879200,"description":"Pdf / English / Alfred A. Knopf 1999 / 768 pages / ISBN-10: 067940256X / 134 MB\n\nFor Rembrandt as for Shakespeare, all the world was indeed a stage, and he knew in exhaustive detail the tactics of its performance: the strutting and mincing; the wardrobe and the face paint; the full repertoire of gesture and grimace; the flutter of hands and the roll of the eyes; the belly laugh and the half-stifled sob. He knew what it looked like to seduce, to intimidate, to wheedle, and to console; to strike a pose or preach a sermon; to shake a fist or uncover a breast; how to sin and how to atone; how to commit murder and how to commit suicide. No artist had ever been so fascinated by the fashioning of personae, beginning with his own. No painter ever looked with such unsparing intelligence or such bottomless compassion at our entrances and our exits and the whole rowdy show in between.\n\nMore than three centuries after his death, Rembrandt remains the most deeply loved of all the great masters of painting, his face so familiar to us from the self-portraits painted at every stage in his life, yet still so mysterious. As with Shakespeare, the facts of his life are hard to come by: the Leiden miller's son who briefly found fame in Amsterdam, whose genius was fitfully recognized by his contemporaries, who fell into bankruptcy and died in poverty. So there is probably no painter whose life has engendered more legends, nor to whom more unlikely pictures have been attributed (a process now undergoing rigorous reversal). Rembrandt's Eyes, about which Simon Schama has been thinking for more than twenty years, shows that the true biography of Rembrandt is to be discovered in his pictures. Through a succession of superbly incisive descriptions and interpretations of Rembrandt's paintings threaded into this narrative, he allows us to see Rembrandt's life clearly and to think about it afresh.\n\nBut this book moves far beyond the bounds of conventional biography or art history. With extraordinary imaginative sympathy, Schama conjures up the world in which Rembrandt moved -- its sounds, smells, and tastes as well as its politics; the influences on him of the wars of the Protestant United Provinces against Spain, of the extreme Calvinism of his native Leiden, of the demands of patrons and the ambitions of contemporaries; the importance of his beloved Saskia and, after her death (Rembrandt was later forced to sell her grave, so complete was his ruin), of his mistress Hendrickje Stoffels; and, above all, the profound effect on him of the great master of the immediately preceding generation, the Catholic painter from Antwerp, Peter Paul Rubens: \n&quot;the prince of painters and the painter of princes&quot; with whom Rembrandt was obsessed for the first part of his life, and whose career was the shaping force that drove Rembrandt to test the farthest reaches of his own originality.\n\nRembrandt's Eyes shows us why Rembrandt is such a thrilling painter, so revolutionary in his art, so penetrating of the hearts of those who have looked for three hundred years at his pictures. Above all, Schama's understanding of Rembrandt's mind and the dynamic of his life allows him to re-create Rembrandt's life on the page. Through a combination of scholarship and literary skill, Schama allows us to actually see that life through Rembrandt's own eyes.  In overcoming the paucity of conventional historical evidence, it is the most intelligently true biography of Rembrandt that has been written, and the most dazzling achievement to date of the art historian whose work has been hailed as &quot;marvelously rich and eloquent&quot; . . . &quot;rare, imaginative&quot; . . . &quot;provocative&quot; . . . &quot;astoundingly learned with verve, humor, and an unflagging sense of delight&quot; . . . that of &quot;a master \nstoryteller . . . and &quot;a master of history.&quot;","torrent":{"xt":"urn:btih:159e4ad775ad4e71cb5da49cb586e36a6f198386","amp;dn":"Rembrandts+Eyes+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159e4ad775ad4e71cb5da49cb586e36a6f198386","infoHashBuffer":{"type":"Buffer","data":[21,158,74,215,117,173,78,113,203,93,164,156,181,134,227,106,111,25,131,134]},"announce":[],"urlList":[]}}