{"title":"Christopher Lee Reads Edgar Allen Poe   (BBC 2003)","uid":8695754,"size":64969870,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:15f7a68983e42b907841f551947a0aa60ce4db3c&amp;dn=Christopher+Lee+Reads+Edgar+Allen+Poe+++%28BBC+2003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Robin1966","files":4,"time":1373974064,"description":"Edgar Allan Poe's Gothic Tales\n\nChristopher Lee reads three tales by Edgar Allen Poe\n\n1) The Tell-tale Heart (25 Dec 2003)\nFirst published in 1843\n\nIt follows an unnamed narrator who insists on his sanity after murdering an old man with a &quot;vulture eye&quot;. The murder is carefully calculated, and the murderer hides the body by dismembering it and hiding it under the floorboards. Ultimately the narrator's guilt manifests itself in the hallucination that the man's heart is still beating under the floorboards.\n\nIt is unclear what relationship, if any, the old man and his murderer share. It has been suggested that the old man is a father figure, or whether the narrator works for the old man as a servant, perhaps, that his vulture eye represents some sort of veiled secret, or power. The ambiguity and lack of details about the two main characters stand in stark contrast to the specific plot details leading up to the murder.\n\nThe story was first published in James Russell Lowell's The Pioneer in January 1843. &quot;The Tell-Tale Heart&quot; is widely considered a classic of the Gothic fiction genre and one of Poe's most famous short stories. (Wiki)\n\n2) The Cask of Amontillado (26 Dec 2003)\nFirst published in the November 1846 issue of Godey's Lady's Book.\n\nThe story is set in a nameless Italian city in an unspecified year (possibly in the 18th century) and is about the narrator's deadly revenge on a friend whom he believes has insulted him. Like several of Poe's stories, and in keeping with the 19th-century fascination with the subject, the narrative revolves around a person being buried alive - in this case, by immurement.\n\nAs in &quot;The Black Cat&quot; and &quot;The Tell-Tale Heart&quot;, Poe conveys the story through the murderer's perspective. (Wiki)\n\n3) The Pit and the Pendulum (27 Dec 2003)\nfirst published in 1842 in the literary annual The Gift.\n\nA Christmas and New Year's Present for 1843. The story is about the torments endured by a prisoner of the Spanish Inquisition, though Poe skews historical facts. The narrator of the story describes his experience of being tortured. The story is especially effective at inspiring fear in the reader because of its heavy focus on the senses, such as sound, emphasizing its reality, unlike many of Poe's stories which are aided by the supernatural. The traditional elements established in popular horror tales at the time are followed, but critical reception has been mixed. The tale has been adapted to film several times. (Wiki)\n\n---------File Information----------\nBroadcast BBC R2\nRecorded direct from digital satellite radio onto CD recorder and converted to MP3\nMPEG 1.0 Layer 3 - 192 kbps mp3 - 44 khz - Joint Stereo\nDuration: 45 Mins (15 Mins each)\n\n\nEnjoy and Seed","torrent":{"xt":"urn:btih:15f7a68983e42b907841f551947a0aa60ce4db3c","amp;dn":"Christopher+Lee+Reads+Edgar+Allen+Poe+++%28BBC+2003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f7a68983e42b907841f551947a0aa60ce4db3c","infoHashBuffer":{"type":"Buffer","data":[21,247,166,137,131,228,43,144,120,65,245,81,148,122,10,166,12,228,219,60]},"announce":[],"urlList":[]}}