{"title":"Priya Anjali Rai BangBros Pack [Big Tits, Big Ass, Indian] x9 Cl","uid":11791923,"size":2642496940,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:16a6ec73cf25fd3cc4a5eeef837e4fdd9341f12b&amp;dn=Priya+Anjali+Rai+BangBros+Pack+%5BBig+Tits%2C+Big+Ass%2C+Indian%5D+x9+Cl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"H4ckuos","files":9,"time":1427988201,"description":"Priya Anjali Rai BangBros Pack [Big Tits, Big Ass, Indian] x9 Clips -=XCLUSiVE=-\n\nIndian Pornstar Priya Rai, also known by the full name Priya Anjali Rai, has an exotic look that entices almost any man who watches her. This gorgeous babe was born in New Delhi on January 26, 1982. She moved to the United States at two years old and was raised here. Priya is relatively petite. She is only 5'3&quot; but she measures 34F-24-34. She is open and proud of her great looking breast implants. She says on her website, &quot;Yes, I am petite; but not in the boobie department - I made sure of that!&quot; Priya Rai was an exotic dancer before going into porn. She entered the porn biz in 2005 when she was 25 years old. Since that time, Priya has been featured in over 50 dvd titles and many internet sites. Her sexy, big tits are often the focus of her scenes, though she has been featured in many MILF and facial scenes. She's also one of those rare pornstars that can squirt. Off camera, some of the most enjoyable things for Priya are meditation and being in touch with her sexuality and spirituality. She loves men who have imagination and can keep up with her wild side. She has also recently gone back to school for her degree, though she is still very active in the adult industry. You can find this Indian hottie featured on BangBro's sites such as Monsters of Cock, Big Tit Creampie, Milf Lessons, and Milf Soup. Priya describes herself as &quot;sweet&quot; but when it comes to sex she is a &quot;tiger waiting to be Unleashed.&quot; Living in Minnesota for 8 years caused Priya to develop a dislike for the cold. One thing Priya does like however are muscle cars,followed by steak and seafood,especially sushi,and shellfish. She also likes to cook, to be spoiled and spoil others, to dance, and to go fishing. Most importantly, Priya likes to be respected. When it comes to men, this is what Priya has to say: I like a man with an imagination. The way I look at it is,a man doesn't have to be rich if he can transform a one bedroom apartment into a stylish condo.A man doesn't have to be famous if he can make me feel special. He can show me off to all his friends; buy me flowers and open the car door for me. I want a man who imagines being with me forever! Oh, and also, someone who can keep up with my wild side, Rrrrrrrrrr!\n\nTags: natural tits, landing strip, dark hair , medium ass, outie pussy ,voluptous tits, large tits, indian \n\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551d43402abad.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551d43402abad.html&lt;/a&gt;","torrent":{"xt":"urn:btih:16a6ec73cf25fd3cc4a5eeef837e4fdd9341f12b","amp;dn":"Priya+Anjali+Rai+BangBros+Pack+%5BBig+Tits%2C+Big+Ass%2C+Indian%5D+x9+Cl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16a6ec73cf25fd3cc4a5eeef837e4fdd9341f12b","infoHashBuffer":{"type":"Buffer","data":[22,166,236,115,207,37,253,60,196,165,238,239,131,126,79,221,147,65,241,43]},"announce":[],"urlList":[]}}