{"title":"Adele - 25 (2015) [EAC-FLAC]","uid":12929137,"size":369375777,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:173dc24450b8570de58c02b2bab04321f5db7078&amp;dn=Adele+-+25+%282015%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"pucholoco","files":27,"time":1449504242,"description":"Adele - 25 (2015) \r\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 301 Mb \r\n                           Full Artwork @ 300 dpi (png) -&gt; 68 Mb\r\n\r\nAdele's 2011 blockbuster, 21, was all about turning pain into power. Four years and 30 million albums sold later, remorse is still her muse. But where 21 was the sound of a woman soldiering through bad romance, 25 finds her queenly and resolute, lamenting the past on songs with titles like &quot;Water Under the Bridge&quot; and &quot;When We Were Young.&quot; Even &quot;Hello&quot; is a goodbye. The nostalgic mood is the perfect fit for an artist who reaches back decades for her influences, even as her all-or-nothing urgency feels utterly modern.\r\n\r\nSome of pop's biggest names, from Max Martin to Bruno Mars, join familiar faces like Paul Epworth and Ryan Tedder in 25's dream team of producers and co-writers. They help create a rich set of songs without getting in the way of the lady in charge. &quot;River Lea,&quot; a collaboration with Danger Mouse, is an organ-heavy soul shouter, and &quot;Water Under the Bridge&quot; builds to gospel-steeped ecstasy. Adele is more somber on &quot;Million Years Ago,&quot; a gorgeous acoustic reverie that suggests Caetano Veloso writing for Dusty Springfield. &quot;I feel like my life is flashing by,&quot; she sings, her voice deepening with regret and sounding decades beyond her years.\r\n\r\nThe music feels more mature, too, on torchy ballads like &quot;When We Were Young&quot; and &quot;Love in the Dark.&quot; The most powerful moment is &quot;All I Ask,&quot; a silken tempest co-written with Mars, where Adele addresses a lover on what she knows will be their final night, processing the end of an affair in what feels like slow motion. When she sings, &quot;Give me a memory I can use,&quot; it's like she's already imagining the heartrending song she'll craft from the experience. There's vulnerability in that moment, but there's also grace and resilience.\r\n\r\nThroughout 25, there's a deeper sense of artistic command. In a great, intimate bit before the start of &quot;Send My Love (To Your New Lover),&quot; she issues orders to the guys in the studio: &quot;Just the guitar.&quot; The Martin-helmed song that follows – built on a nimble acoustic figure – is a farewell to an ex who couldn't deal with Adele's fire, sung with chill composure.\r\n\r\nWhether she's holding notes with the strength of a suspension bridge or enjoying a rare lighthearted &quot;whoo-hoo!&quot; on &quot;Sweetest Devotion,&quot; her incredible phrasing – the way she can infuse any line with nuance and power – is more proof that she's among the greatest interpreters of romantic lyrics. &quot;No river is too wide or too deep for me to swim to you,&quot; she sings on the gently lifting &quot;Remedy.&quot; On 25, no feat of strength comes as a surprise. Let's just hope the next one is called 28, and not, say, 30. Each new chapter of her story is too good to wait for.\r\n\r\n\r\n-------------------------------------------------------------------\r\nTracklist:\r\n-------------------------------------------------------------------\r\n\r\n01 - Hello\r\n02 - Send My Love (To Your New Lover)\r\n03 - I Miss You\r\n04 - When We Were Young\r\n05 - Remedy\r\n06 - Water Under The Bridge\r\n07 - River Lea\r\n08 - Love In The Dark\r\n09 - Million Years Ago\r\n10 - All I Ask\r\n11 - Sweetest Devotion\r\n\r\n*2015 XL Recordings | XLCD740\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:173dc24450b8570de58c02b2bab04321f5db7078","amp;dn":"Adele+-+25+%282015%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"173dc24450b8570de58c02b2bab04321f5db7078","infoHashBuffer":{"type":"Buffer","data":[23,61,194,68,80,184,87,13,229,140,2,178,186,176,67,33,245,219,112,120]},"announce":[],"urlList":[]}}