{"title":"Mega Brain Zones Vol 1 - 6 with Michael Hutchison [FLAC]","uid":11883992,"size":2360517358,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17ab70f50f9e600367bcb1512b7b13e8ddf3fd83&amp;dn=Mega+Brain+Zones+Vol+1+-+6+with+Michael+Hutchison+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"elessedilgirl","files":19,"time":1430762169,"description":"Mega Brain Zones Vol 1 (Classic Edition) Deep Relax + Peak Performance\n\n1. Deep Relaxation:\nThese frequencies in naturally accompany meditative states, accompanied of deep physical relaxation, relaxing in one, natural and healthy sleep can lead. Internal state: Deep physical relaxation is observed aware or relieved by sleep.\n\n2. Peak Performance:\nEspresso-replacement for a lively start to rest and for permanent mental or athletic excellence. Ideal for PC work, for learning and for Super Learning. Interior Condition: Consciousness depends on the slope gradually from the peak, highly active at inner peace.\n\nMega Brain Zones Vol 2 (Classic Edition) Focus + Exploration\n\n1. Focus - Total concentration:\nThis audio program stimulates a state of relaxed attention and serves as a training to easily and at any time to concentrate intensely. Internal state: the ideas are shielded from the outside with a clear focus on a the present subject.\n\n2. Exploration - Creative Mind Power:\nThe mental training, where you can run all his thoughts freely in a sea full of ideas and new bath, creative problem solving discovered. Interior Condition: association of ideas to develop free us to develop solutions that come from an inner calm.\n\nMega Brain Zones Vol 3 (Classic Edition) Flow + Awakening\n\n1. Flow - Centered being:\nDiscover the tranquility of the ZEN. Without years of training, only with High-tech stimulation: just in flux, always in deep silence and Serenity in being. The result is a Zen state: Getting inside Feel centered while the mind in deep peace and serenity can stay.\n\n2. Awakening - spiritual growth:\nThe music makes you feel for time and space, which may open up access to new dimensions. Internal state: Relaxed and disssoziiert from reality. As in advanced Meditation practice creates awareness of the world as seen from higher Wait (meta-level) right to life, e.g. in the Out-of-body experience is described.\n\nMega Brain Zones Vol 4 (New Edition) Deep Relax + Peak Performance\n\n1. Deep Relax - Deep Relaxation:\nFrequency stimulation for a restful, deep relaxation and Meditation, in which dissolve muscle tension. Snooze and sleep, Mind deeply relaxed. Interior Condition: The mind relaxes the body. The muscle tension tends near zero and promotes sleep and sleep.\n\n2. Peak Performance - Peak Power:\nHigh Performance in relaxation, the highest attention to any kind of mental or athletic performance. Ideal accompaniment to PC work, yoga or learning. Internal state: wide awake like a relaxed cat. Attentive high performance is also possible to relax. Is ideal for yoga, Tai Chi and to learn, if you stay wide awake want!\n\nMega Brain Zones Vol 5 (New Edition) Focus + Exploration\n\n1. Focus - Total concentration:\nYou can relax and at the same time your entire Attention on a single theme to draw, like a laser on a point of focus. The attention remains on a subject, thoughts are to the point brought. Internal state: relaxed and think without distraction.\n\n2. Exploration - Creative Power:\nThe thoughts go on a spiritual journey, can be solved problems, and easily find new connotations, good ideas, solutions and new Ideas. Internal state lifted: the problem and result in easily Associations, new contacts and new ideas for creative solutions find themselves!\n\nMega Brain Zones Vol 6 (New Edition) Flow + Awakening\n\n1. Flow - &quot;Flow&quot; state &quot;:\nThe &quot;river&quot; be: In what you are doing to rise, perfect, and to enjoy everything that succeeds by itself, pure joy, makes timeless perfect. Internal state: everything seems to have made themselves flow, it runs everything all by itself, completely detached from the Everyday life (stress) consciousness e.g. at the &quot;jogging High&quot;.\n\n2. Awakening - spiritual growth:\nWhile in deep meditation without space or sense of time, and automatically own attention to a greater awareness awakened. Interior Condition: deepest meditation, space and sense of time seem to forget, the full attention and consciousness rests in the &quot;here and now.&quot;\n\nreference libFLAC 1.3.1 20141125\n\nAll tracks secure rips &amp; AccurateRip verified. Logs included","torrent":{"xt":"urn:btih:17ab70f50f9e600367bcb1512b7b13e8ddf3fd83","amp;dn":"Mega+Brain+Zones+Vol+1+-+6+with+Michael+Hutchison+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17ab70f50f9e600367bcb1512b7b13e8ddf3fd83","infoHashBuffer":{"type":"Buffer","data":[23,171,112,245,15,158,96,3,103,188,177,81,43,123,19,232,221,243,253,131]},"announce":[],"urlList":[]}}