{"title":"Console Wars - Blake J. Harris - Audible Audiobook MP3 CBR 64k ","uid":10145635,"size":595992849,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:17c61cdf6c1fa1d18f41f9f34c62e221c29c50e3&amp;dn=Console+Wars+-+Blake+J.+Harris+-+Audible+Audiobook+MP3+CBR+64k+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1400049784,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\n\nConsole Wars: Sega, Nintendo, and the Battle That Defined a Generation\n\nWritten by: Blake J. Harris\nNarrated by: Fred Berman\nLength: 20 hrs and 41 mins \nFormat: Unabridged\nRelease Date:05-13-14\nProgram Type: Audiobook\n\n\nA mesmerizing, behind-the-scenes business thriller that chronicles how Sega, a small, scrappy gaming company led by an unlikely visionary and a team of rebels, took on the juggernaut Nintendo and revolutionized the video-game industry.\n\nIn 1990, Nintendo had a virtual monopoly on the video-game industry. Sega, on the other hand, was just a faltering arcade company with big aspirations and even bigger personalities. But all that would change with the arrival of Tom Kalinske, a former Mattel executive who knew nothing about video games and everything about fighting uphill battles. His unconventional tactics, combined with the blood, sweat, and bold ideas of his renegade employees, completely transformed Sega and led to a ruthless, David-and-Goliath showdown with Nintendo. Little did he realize that Sega's success would create many new enemies and, most important, make Nintendo stronger than ever.\n\nThe battle was vicious, relentless, and highly profitable, eventually sparking a global corporate war that would be fought on several fronts: from living rooms and school yards to boardrooms and Congress. It was a once-in-a-lifetime, no-holds-barred conflict that pitted brother against brother, kid against adult, Sonic against Mario, and the United States against Japan.\n\nBased on more than 200 interviews with former Sega and Nintendo employees, Console Wars is the tale of how Tom Kalinske miraculously turned an industry punch line into a market leader. Blake J. Harris brings into focus the warriors, the strategies, and the battles and explores how they transformed popular culture forever. Ultimately, Console Wars is the story of how a humble family man, with an extraordinary imagination and a gift for turning problems into competitive advantages, inspired a team of underdogs to slay a giant and, as a result, give birth to a $60 billion industry.\n","torrent":{"xt":"urn:btih:17c61cdf6c1fa1d18f41f9f34c62e221c29c50e3","amp;dn":"Console+Wars+-+Blake+J.+Harris+-+Audible+Audiobook+MP3+CBR+64k+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17c61cdf6c1fa1d18f41f9f34c62e221c29c50e3","infoHashBuffer":{"type":"Buffer","data":[23,198,28,223,108,31,161,209,143,65,249,243,76,98,226,33,194,156,80,227]},"announce":[],"urlList":[]}}