{"title":"FX Eleven-SKIDROW","uid":9549095,"size":1419367587,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:17fecff8dd9f6898b0adbb58ff28ef2db429ce63&amp;dn=FX+Eleven-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"HeroMaster","files":-1,"time":1391198403,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nFX Eleven (c) FX Interactive\n\n31-01-2014......Release Date - Protection.................Steam\nManager............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nTHE FOOTBALL MANAGER FOR EVERY FAN\nUser-friendly, easy to grasp and fun to master. FX Eleven believes in\noffering a game system designed for every football fan out there:\nagile, powerful, full of options and extremely fun\nA LEADER IN THE LOCKER ROOM\nSigning the new contract. Getting to know your squad. Discovering the\nclub's facilities. Being presented to your supporters. Finding your\nstarting lineup. Bringing out the best in every player. Watching them\ngrow under your guidance. Cheering them on when they display rehearsed\nmoves on the field. Feeling the fans' support\n\nA MANAGER IN THE OFFICE\nAs the club's manager, you will be responsible for making all the\ndecisions: expanding the stadium, hiring your coaching staff, signing\nand renewing players, fixing ticket prices... Lay the foundations for\na truly competitive team\n\nAND A MENTOR IN THE ACADEMY\nPlan and direct your youth divisions' tactics and training sessions\nKeep an eye on every one of your young footballers until you find a\ntrue talent. Enhance his performance by increasing his confidence:\ngive him the chance to play with the first team and realize his full\npotential. You might just turn him into a world-class star\n\nFeatures:\n\nUnited Kingdom, Germany, France, Spain, Italy... The first and second\ndivisions of all of these competitions are played simultaneously\nalong with the third division in the Spanish and Italian\nchampionships. Leagues, cups, international tournaments, preseason\nmatches... 450 teams, each and every one of them in constant evolution\n\nMore than 11,700 players created one by one that will become truly\nunique under your leadership. Players grow and evolve depending on your\nactions. Throughout their career they can acquire Achievements that\nwill in turn affect the entire game universe\n\nUpgrade and expand your stadium, customizing the facilities to adapt\nthem to the football club you wish to create\n\nDont just sit on the bench. Make decisions and apply them from the\nsideline to change game dynamics: choose when your team should put\npressure on rival players, when to use the flanks, when to keep the\nball... Or design your own moves on the field in real time\n\nInstantly customize players, kits and shields with MyTeam, the editor\nthat gives you total control create your ideal squad, a club with\nfootball legends, or the team of friends you play with on the weekends\n\nA game in constant evolution with new features suggested by the\ncommunity: manager track record fun and agile transfer system squad\nstats player evaluation after each match top scorers, goalkeepers and\nfootballers with most assists lineup of the week sponsors trophy\nroom man-to-man markings\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix irokos\ntitan artdivision\n\n\nSystem Requirements:\n\nOS: Windows XP SP3 \nProcessor: Pentium 4 3.2 GHz \nMemory: 2 GB RAM \nGraphics: Intel Series 4, NVIDIA GeForce 6600, ATI Radeon X1600 or higher \nDirectX: Version 9.0c \nHard Drive: 650 MB available space \nSound Card: DirectX Compatible\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/hYGkDCV.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/hYGkDCV.jpg&lt;/a&gt;\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/4jIoc7d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/4jIoc7d.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/XJn5ml9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/XJn5ml9.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/7zGv6YN.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/7zGv6YN.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY!","torrent":{"xt":"urn:btih:17fecff8dd9f6898b0adbb58ff28ef2db429ce63","amp;dn":"FX+Eleven-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17fecff8dd9f6898b0adbb58ff28ef2db429ce63","infoHashBuffer":{"type":"Buffer","data":[23,254,207,248,221,159,104,152,176,173,187,88,255,40,239,45,180,41,206,99]},"announce":[],"urlList":[]}}