{"title":"Nightmare Movies: Horror on Screen Since the 1960s","uid":9912829,"size":4215986,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:181735730b058b56058315ded54363f99ca70806&amp;dn=Nightmare+Movies%3A+Horror+on+Screen+Since+the+1960s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"rabid101","files":-1,"time":1396914980,"description":"Now over twenty years old, the original edition of Nightmare Movies has retained its place as a true classic of cult film criticism. In this new edition, Kim Newman brings his seminal work completely up-to-date, both reassessing his earlier evaluations and adding a second part that assess the last two decades of horror films with all the wit, intelligence and insight for which he is known. Since the publication of the first edition, horror has been on a gradual upswing, and taken a new and stronger hold over the film industry.\n\nNewman negotiates his way through a vast back-catalogue of horror, charting the on-screen progress of our collective fears and bogeymen from the low budget slasher movies of the 60s, through to the slick releases of the 2000s, in a critical appraisal that doubles up as a genealogical study of contemporary horror and its forebears. Newman invokes the figures that fuel the ongoing demand for horror - the serial killer; the vampire; the werewolf; the zombie - and draws on his remarkable knowledge of the genre to give us a comprehensive overview of the modern myths that have shaped the imagination of multiple generations of cinema-goers.\n\nNightmare Movies is an invaluable companion that not only provides a newly updated history of the darker side of film but a truly entertaining guide with which to discover the less well-trodden paths of horror, and re-discover the classics with a newly instructed eye.\n\nenjoy &amp; seed!!","torrent":{"xt":"urn:btih:181735730b058b56058315ded54363f99ca70806","amp;dn":"Nightmare+Movies%3A+Horror+on+Screen+Since+the+1960s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"181735730b058b56058315ded54363f99ca70806","infoHashBuffer":{"type":"Buffer","data":[24,23,53,115,11,5,139,86,5,131,21,222,213,67,99,249,156,167,8,6]},"announce":[],"urlList":[]}}