{"title":"Powerman 5000 - discography (7 studio albums)","uid":4472015,"size":445499247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:182653a4e5c6ad170117175a6578c612faddf04d&amp;dn=Powerman+5000+-+discography+%287+studio+albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"phrozin1","files":-1,"time":1225172198,"description":"Biography  \nPowerman 5000 \n\nHelmed by vocalist Spider (aka Michael Cummings, also know as Spider One or MC Spider, the younger brother of Rob Zombie), the Boston-based underground electro-metal band Powerman 5000 earned a popular cult following along the East Coast with the release of their 1994 indie debut EP, True Force, and 1995&amp;#039;s LP The Blood Splat Rating System, the latter of which appeared on Conscience Records. Two years later, the band moved to Dreamworks (and relocated to Los Angeles), where they released a revamped version of their debut as Mega!! Kung Fu Radio. \nTouring with the likes of Marilyn Manson and Korn, as well as a stint on Ozzfest, expanded their fan base and led up to Powerman 5000&amp;#039;s 1997 science fiction-esque follow-up, Tonight the Stars Revolt! During shows and promos for the album, the band was often found sporting spacesuits and other sci-fi paraphernalia. The record went platinum, helped in part by the success of singles &quot;When Worlds Collide&quot; and &quot;Nobody&amp;#039;s Real&quot; on MTV. The halted release of a since aborted album entitled Anyone for Doomsday? signaled the departure of longtime bassist Dorian Heartsong (aka Dorian 27) and drummer Al Pahanish (aka Al 3) in early November of 2001. A year later, drummer Adrian Ost (aka Ad7) was added to the group; bassist Siggy Sjursen joined 40 auditions later before 2002 came to a close. \n\nPowerman 5000, including Spider and longtime guitarists Adam Williams (aka Adam 12) and Mike Tempesta (aka M.33), was then back in full effect. Transform, their fourth album, marked the band&amp;#039;s new more punk-inspired, less industrial sound and new lineup when it was released in spring 2003. It debuted at number 25 on the Billboard charts and produced a hit in the song &quot;Free,&quot; though Dreamworks dissolved in the middle of the album&amp;#039;s promotion. A rarities collection appeared in 2004 on Spider&amp;#039;s own Megatronic label; more lineup changes would occur before the eventual release of the band&amp;#039;s fifth full-length. Williams and Tempesta exited to be replaced on guitar by Johnny Heatley and ex-Alien Ant Farm&amp;#039;s Terry Corso. Powerman 5000 inked a deal with DRT Entertainment in spring 2006, and Destroy What You Enjoy surfaced that August. Subsequent tour dates through fall were played. ~ Stephen Thomas Erlewine, All Music Guide\n\n\n=================================================================\nArtist    -  Powerman 5000       \nAlbum     -  various                                          \nGenre     -  Industrial metal                                             \nLabel     -  DRT Entertainment\nYear      -  1991 - present                                            \nTracks    -  n/a                                               \nPlaytime  -  n/a\nFile Type -  .mp3\nSize      -  424.86 MB\nkbps      -  VBR / 256 avg\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/phrozin1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phrozin1&lt;/a&gt; \n\nEnjoy. Please seed for others. Thanks.        \n=================================================================\n\nPowerman 5000 discography:\n\n1994: True Force \n1995: The Blood Splat Rating System \n1997: Mega!! Kung Fu Radio \n1999: Tonight the Stars Revolt! \n2001: Anyone for Doomsday? \n2003: Transform \n2006: Destroy What You Enjoy \n","torrent":{"xt":"urn:btih:182653a4e5c6ad170117175a6578c612faddf04d","amp;dn":"Powerman+5000+-+discography+%287+studio+albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"182653a4e5c6ad170117175a6578c612faddf04d","infoHashBuffer":{"type":"Buffer","data":[24,38,83,164,229,198,173,23,1,23,23,90,101,120,198,18,250,221,240,77]},"announce":[],"urlList":[]}}