{"title":"Ivo Andric - Nobel Prize in Literature, 1961 (7 books)","uid":11745762,"size":28872682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1848d556e92a1ac2452cb588f1d7f61d67bec96c&amp;dn=Ivo+Andric+-+Nobel+Prize+in+Literature%2C+1961+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"workerbee","files":14,"time":1426011288,"description":"\nIVAN &quot;IVO&quot; ANDRIÄ† (1892-1975) was a Yugoslav novelist and short story writer who won the 1961 Nobel Prize in Literature &quot;for the epic force with which he has traced themes and depicted human destinies drawn from the history of his country.&quot;\n\nBecause of AndriÄ‡'s unique circumstances (born in Bosnia to Croat parents, later living and working in Serbia), he is claimed as part of Serbian literature, Croatian literature, and Bosnian literature.  His novels and short stories deal mainly with the history, folklore, and culture of his native Bosnia under the Ottoman Empire.\n\nThe three principal novels included here comprise the &quot;Bosnian trilogy&quot;, which were written during World War II and released simultaneously in 1945.  They are, however, connected only thematically and are three completely different works:\n\nSet during the Napoleonic era, BOSNIAN CHRONICLE is a portrayal of conflict and fierce ethnic loyalties in a region that stubbornly refuses to submit to any outsider.  Ottoman viziers, French consuls, and Austrian plenipotentiaries are consumed by an endless game of diplomacy and double-dealing, while the Bosnians themselves observe and endure the machinations of greater powers that vie, futilely, to absorb them. \n\nTHE BRIDGE ON THE DRINA is a vivid depiction of the suffering history has imposed upon the people of Bosnia from the late 16th century to the beginning of World War I.  \n\nTHE WOMAN FROM SARAJEVO is set in the cities of Sarajevo and Belgrade during the first three decades of the 20th century.  It is the tragic life of a woman, Miss Raika RadakoviÄ‡, disappointed in people and the world she lives in, who is dominated by a single-minded greed for money and puts everything else out of her life: love, friendship, concern for other people.\n\nThe collection is rounded but by the novel DEVIL'S YARD (1954), two anthologies of short stories, and a volume featuring his Nobel Prize acceptance speech and associated materials.\n\n\nThe following books are in PDF format:\n\n* BOSNIAN CHRONICLE (Arcade, 1993).  Translated by Joseph Hitrec.\n\n* THE BRIDGE ON THE DRINA (Allen &amp; Unwin, 1919).  Translated by Lovett F. Edwards.\n\n* DEVIL'S YARD (Grove, 1962).  Translated by Kenneth Johnstone.\n\n* NOBEL PRIZE LIBRARY: S. Y. Agnon &amp; Ivo AndriÄ‡ (Alexis Gregory, 1971).  Includes Presentation and Acceptance Speeches / The Bridge on the Drina / Biography &amp; more.\n\n* THE PASHA'S CONCUBINE &amp; OTHER TALES (Knopf, 1968).  Translated by Joseph Hitrec.\n\n* THE SLAVE GIRL &amp; OTHER STORIES ABOUT WOMEN (CEU, 2009).  Edited by Radmila Gorup, with an Introduction by Zoran Milutinovic.\n\n* THE WOMAN FROM SARAJEVO (Knopf, 1965).  Translated by Joseph Hitrec.\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n    &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:1848d556e92a1ac2452cb588f1d7f61d67bec96c","amp;dn":"Ivo+Andric+-+Nobel+Prize+in+Literature%2C+1961+%287+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1848d556e92a1ac2452cb588f1d7f61d67bec96c","infoHashBuffer":{"type":"Buffer","data":[24,72,213,86,233,42,26,194,69,44,181,136,241,215,246,29,103,190,201,108]},"announce":[],"urlList":[]}}