{"title":"F4X Old School New Body fitness and diet program","uid":12380131,"size":379532584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18d0d02ef3d1eccf19872ddb9c76300a6f57b67a&amp;dn=F4X+Old+School+New+Body+fitness+and+diet+program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"scamcrack","files":11,"time":1441749627,"description":"This fitness program is being advertised aggressively online, but because the creators have flooded the web with spam reviews it's made it very difficult for customers to actually evaluate whether they want to buy it. I'm uploading it here in hopes that it will encourage some independent reviews.\n\nMy assessment:\n\nTheir sales tactics are awful. They are very spammy and have flooded websites with &quot;reviews&quot; that are just stock sales material, and even once you buy they make you sit through 10 minutes of attempts to upsell before they even let you download the product you've just purchased. It's pretty awful.\n\nBut once you get inside... it's not quite so terrible. The core product is a 100+ page ebook, which is poorly written and includes a lot of fluff to make it look bigger and more important than it is, but they do actually outline some workouts and meal plans. Nothing revolutionary, but given the low price it's not a disaster either. I'd never recommend anybody buy it, since there are better written, less spammy, and more scientifically grounded materials all over the internet, but it's not as much of a scam as it looks like at first glance.\n\nThis torrent includes all the files they let me download from the members page immediately after purchasing","torrent":{"xt":"urn:btih:18d0d02ef3d1eccf19872ddb9c76300a6f57b67a","amp;dn":"F4X+Old+School+New+Body+fitness+and+diet+program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18d0d02ef3d1eccf19872ddb9c76300a6f57b67a","infoHashBuffer":{"type":"Buffer","data":[24,208,208,46,243,209,236,207,25,135,45,219,156,118,48,10,111,87,182,122]},"announce":[],"urlList":[]}}