{"title":"A Most Fortunate Ship - A Narrative History of Old Ironsides","uid":16000978,"size":57479788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19538d02ee5c19de7b78fdd29d6b9c5d4dcafc7e&amp;dn=A+Most+Fortunate+Ship+-+A+Narrative+History+of+Old+Ironsides&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"STBGD","files":1,"time":1476128095,"description":"A Most Fortunate Ship: A Narrative History of Old Ironsides\r\nThe Globe Pequot Press | 1980 | 0871060337 | English | 408 pages | PDF | 55 MB\r\n\r\nCalled a definitive account when first published in 1980 and the winner of several book awards, this revised and expanded edition is available now for the first time in paperback. Tyrone G. Martin, the author, was captain of the USS Constitution during the nation's bicentennial celebrations. After decades of research and study, Martin was able to confirm that the innovative diagonal riders which ensured the frigate's long life were present at the ship's launching. He also provides details about the famous ship's participation in battles that have long been ignored or glossed over in official reports. Pictorial battle diagrams are included. The book not only tells Constitution's complete story, but also presents a picture of life in the U.S. Navy during the nineteenth century―its proud moments as well as its concerns, attitudes, and tensions. Fascinating details are presented on the organization, care, feeding, and disciplining of the crew, and on events that involved such famous names in early American naval history as Edward Preble and Stephen Decatur. Just as previous editions were sought-after as sources of pleasure and information, this new edition will appeal to everyone who enjoys a good sea story and to serious students and sailing ship buffs seeking a reliable reference","torrent":{"xt":"urn:btih:19538d02ee5c19de7b78fdd29d6b9c5d4dcafc7e","amp;dn":"A+Most+Fortunate+Ship+-+A+Narrative+History+of+Old+Ironsides","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19538d02ee5c19de7b78fdd29d6b9c5d4dcafc7e","infoHashBuffer":{"type":"Buffer","data":[25,83,141,2,238,92,25,222,123,120,253,210,157,107,156,93,77,202,252,126]},"announce":[],"urlList":[]}}