{"title":"Where is it","uid":4299255,"size":6583288,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:199dfe4593aa646231046b767e2f843995badb88&amp;dn=Where+is+it&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"romelanda","files":2,"time":1216202826,"description":"WhereIsIt is an application written for Windows operating systems, and designed to help you maintain and organize a catalog of your computer media collection, including CD-ROMs, audio CDs, diskettes, removable drives, hard drives, network drives, DVDs, or any other present or future storage media Windows can access as a drive. The primary goal for WhereIsIt is to provide access to the contents of cataloged disks, even when they are not available on the system, or even not your own. You can browse their contents, search for items you need, use imported descriptions and thumbnails, and organize data using categories, flags etc.\n\nÃ‚Â· Suitable for beginners and advanced users\nWhereIsIt was designed to be a very adjustable program with lots of options for power users, as well as quick and easy to use with predefined default settings and wizards for all those who don&amp;#039;t want to get their hands dirty.\n\nÃ‚Â· Well thought-out user interface with multi-language support\nWhereIsIt&amp;#039;s user interface is one of its most praised qualities. Easy to use, familiar Explorer-like user interface with clear overview of available functions, adjustable toolbar, columns to choose between, and extensive use of object menus (right mouse click) to let you quickly access command you need. Want to see item&amp;#039;s description or assigned thumbnail image? Just leave mouse pointer on it for a moment, it will popup as a tool-tip.\nNot just that, WhereIsIt&amp;#039;s user interface can be used in any of the supported languages, dialogs will adjust to translated text. Support for new languages can be downloaded in a form of small language files, or even created by users themselves by translating the program to a new language.\n\nÃ‚Â· Manageable catalog files\nWhereIsIt doesn&amp;#039;t use large and complex databases, all information is stored in a single catalog (.ctf) file, easily transferable to another computer, a friend, a public forum... as well as easy to backup. Share your data the easy way. Catalogs don&amp;#039;t need to be installed in any way, they can just simply be opened in the program as document files, even on someone else&amp;#039;s computer, while still retaining full functionality. Internal catalog file structure is optimized for very efficient access and small total size, allowing fast searches and small memory footprint, even with very large catalogs. For example, 30.000 files and folders (that&amp;#039;s about five heavily populated CD-ROMs) will result in a catalog file approximately\n1 MB in size - details may vary, depending on data structure and selected scanning options.\n\nÃ‚Â· Detailed information about every file, folder, or disk\nEvery item in catalog includes detailed basic information about files and folders you would come to expect, like name, size, date, file attributes and similar, but WhereIsIt adds to that its own information it provides as a catalog program. For example, every item can include up to 32 KB textual description, a small thumbnail image, you can assign items custom-defined, multi-level categories or flags, you can even assign them so-called alias names, under which are they known in catalog - for example, if the real file name is to cryptic. When displayed in WhereIsIt, items can be colored according their type, assigned categories or flags... All of those can be used to find items you are looking for, or just make browsing your disk images a lot simpler and more fun.\n\nÃ‚Â· Internal support for many compressed file formats\nMany of the often used compressed file formats can be handled during media scan, including ZIP, ARJ, RAR, CAB, LHA/LZH, TAR, ARC, ACE, ZOO, GZIP, BZIP2, 7ZIP, CBZ, CBR, PAK, HA, JAR, SFX... If so selected, compressed files can be presented as folders, showing their content inside. Files compressed inside archives can be extracted right out from WhereIsIt to any folder, or they can be viewed or launched with associated program with one click!\n\nÃ‚Â· Automatic description and thumbnails importing\nDescription Plugins One of WhereIsIt most powerful features are description and thumbnail plugins, in charge of importing descriptions and images while media is being scanned and stored in the catalog. This way, you can have your files and folders equipped with descriptions right after scanning completes. Based on source type, descriptions are automatically attached either to files themselves, to their parent folders, other files in the folder, etc. Standard description plugins handle importing from more than 60 file types and other sources, including files like File_id.diz, Descript.ion, 00index.txt, Files.bbs, they can browse and extract details from most documents, graphics and audio files, including MP3s (sampling, play time, ID3 tags...), Audio CDs (CDDB database, Cdplayer.ini), MS Office documents, Adobe Acrobat files, executable files and fonts, and many many more. Details about graphics files not only include their size and color depth, a small thumbnail can be imported in catalog as well, possibly together with digital camera info and other comments embedded inside.\nAs if all this wouldn&amp;#039;t be enough, there is even more - you can develop your own description and thumbnail plugins to handle additional types of sources and files WhereIsIt doesn&amp;#039;t handle yet at this time, or you can download plugins others have written and made them available for others to use.\n\nÃ‚Â· Built-in media recognition system\nWhereIsIt supports any media type Windows can access as drive, including diskettes, CD-ROMs, DVDs, removable disks like iomega Zip, hard disks, network drives etc. It will recognize by name and collect useful data for most of them, too. WhereIsIt is compatible with all Windows-supported file systems, including FAT, FAT32, and NTFS.\nWhereIsIt does not use drive letters to reference cataloged disks, it is able to recognize them by their key properties, like type, serial number, formatted capacity, and similar. This way, it doesn&amp;#039;t matter which drive your media is in, WhereIsIt will find it, even on some other computer over the network. In the unlikely event that media changes that much that it can no longer be recognized (for example, by reformatting it), you can still manually update its existing disk image in catalog.\n\nÃ‚Â· Powerful searching finds what you are looking for\nWhereIsIt features a powerful multi-threaded searching, with detailed settings on what to search for, where to search and how to search. Use either Quick Search to quickly find your items by name or description, or start up Advanced Search with Search Expression Editor, allowing you to write complex search queries using the full rich set of available search criteria and Boolean logic operators. WhereIsIt provides quick shortcuts to search only in selected disks or folders, or you can search through previous search results or user list items, resulting in countless capabilities to combine multiple searches, narrow down results...\nSearching for duplicate items is in there, too, as well as comparing cataloged disk image to actual files on the media, and comparing cataloged disk images allows for tasks such as version tracking, if comparing disk images of the same media taken at different points in time.\n\nÃ‚Â· Professional report generator\nAdjustable and professional report generator adds a final touch to your catalog collections. Report generator is usually used together with extensive search capabilities or report wizard, allowing you to first collect the items you want in the report, while report generator handles processing items themselves, such as specifying layout and details to be included, optionally sorting and arranging items by their location etc. Needless to point out, you can use the built in print preview, with adjustable zoom and full-screen capabilities.\nReport generator not only allows you to print your reports on your printer or send them by fax using the Microsoft Fax, it is also used for exporting cataloged data to other formats, including ASCII files, Excel tables, rich-text RTF documents, HTML documents, external database formats like SQL, XML, CSV, SYLK, or just send it directly to clipboard for pasting to some other application...\n\nSize : 6.4 MB\n","torrent":{"xt":"urn:btih:199dfe4593aa646231046b767e2f843995badb88","amp;dn":"Where+is+it","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199dfe4593aa646231046b767e2f843995badb88","infoHashBuffer":{"type":"Buffer","data":[25,157,254,69,147,170,100,98,49,4,107,118,126,47,132,57,149,186,219,136]},"announce":[],"urlList":[]}}