{"title":"David Ray Griffin - The New Pearl Harbor.911(Terrorism America W","uid":3630344,"size":1144344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19d810b5344930c79d6c3effb8434cfa0f2f9fdd&amp;dn=David+Ray+Griffin+-+The+New+Pearl+Harbor.911%28Terrorism+America+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"sampooran","files":1,"time":1172856736,"description":"Book Description\nTaking to heart the classic idea that those who benefit from a crime ought to be investigated, here the eminent theologian David Ray Griffin sifts through the evidence about the attacks of 9/11--stories from the mainstream press, reports from abroad, the work of other researchers, and the contradictory words of members of the Bush administration themselves--and finds that, taken together, they cast serious doubt on the official story of that tragic day. He begins with simple questions: Once radio contact was lost with the flights, why weren&amp;#039;t jets immediately sent up (&quot;scrambled&quot;) from the nearest military airport, something that according to the FAA&amp;#039;s own manual is routine procedure? Why did the administration&amp;#039;s story about scrambling jets change in the days following the attacks? The disturbing questions don&amp;#039;t stop there: they emerge from every part of the story, from every angle, until it is impossible not to suspect the architects of the official story of enormous deception. A teacher of ethics and theology, Griffin writes with compelling logic, urging readers to draw their own conclusions from the evidence. The New Pearl Harbor is a stirring call for a thorough investigation into what happened on 9/11. It rings with the conviction that it is still possible to search for the truth in American political life. \n\nAbout the Author\nDavid Ray Griffin has been a professor of philosophy of religion and theology at the Claremont School of Theology in California for over 30 years. He is co-director of the Center for Process Studies there and the author or editor of over 20 books. \n\n(Terrorism America WTC Bush Neocons Fascism Iraq)","torrent":{"xt":"urn:btih:19d810b5344930c79d6c3effb8434cfa0f2f9fdd","amp;dn":"David+Ray+Griffin+-+The+New+Pearl+Harbor.911%28Terrorism+America+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19d810b5344930c79d6c3effb8434cfa0f2f9fdd","infoHashBuffer":{"type":"Buffer","data":[25,216,16,181,52,73,48,199,157,108,62,255,184,67,76,250,15,47,159,221]},"announce":[],"urlList":[]}}