{"title":"Al-Andalus - The Art of Islamic Spain (Art Ebook).pdf","uid":11012626,"size":95084322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a0f0a9fbd7eade6646c3294d4d393e4ae01859b&amp;dn=Al-Andalus+-+The+Art+of+Islamic+Spain+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1410390924,"description":"Al-Andalus - The Art of Islamic Spain\n1992 | PDF | 464 pages | English | 90,6 Mb\n\n\nIn 711 an army of Arabs and Berbers from North Africa, united by their faith in Islam, crossed the Strait of Gibraltar and arrived on the Iberian Peninsula. In less than a decade the Muslims brought most of the peninsula under their domination; they called the Iberian lands they controlled al-Andalus. Although the borders of al-Andalus shifted over the centuries, the Muslims remained a powerful force on the peninsula for almost eight hundred years, until 1492, when they were expelled by Ferdinand and Isabella. This volume, which accompanies a major exhibition presented at the Alhambra in Granada and The Metropolitan Museum of Art in New York, is devoted to the little-known artistic legacy of Islamic Spain. From 711 to 1492 al-Andalus was the occidental frontier of Islam. Floating on the western edge of the Mediterranean, cut off from the European continent by jagged mountains, it was geographically isolated from both North Africa and Europe, from Islamic as well as Christian lands. Physical remoteness gave al-Andalus a privileged place in medieval myths but also separated it from the communities of the east and the west, so that it received only sporadic attention from both worlds. Although a small group of scholars pursued the serious study of the arts of Islamic Spain, these arts have for the most part been viewed as brilliant and exotic vestiges of a lost culture, as objects and monuments that left no mark on European tradition.","torrent":{"xt":"urn:btih:1a0f0a9fbd7eade6646c3294d4d393e4ae01859b","amp;dn":"Al-Andalus+-+The+Art+of+Islamic+Spain+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a0f0a9fbd7eade6646c3294d4d393e4ae01859b","infoHashBuffer":{"type":"Buffer","data":[26,15,10,159,189,126,173,230,100,108,50,148,212,211,147,228,174,1,133,155]},"announce":[],"urlList":[]}}