{"title":"How an Economy Grows and Why it Crashes by Peter Schiff","uid":6549584,"size":19351980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a4a5a05b1bb4ef469d789c195f1cb92fdc26a75&amp;dn=How+an+Economy+Grows+and+Why+it+Crashes+by+Peter+Schiff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Skyler827","files":1,"time":1311021166,"description":"How an Economy Grows and Why it Crashes uses illustration, humor, and accessible storytelling to explain complex topics of economic growth and monetary systems. In it, economic expert and bestselling author of Crash Proof, Peter Schiff teams up with his brother Andrew to apply their signature &quot;take no prisoners&quot; logic to expose the glaring fallacies that have become so ingrained in our country?s economic conversation.\n\nInspired by How an Economy Grows and Why It Doesn't, a previously published book by the Schiff's father Irwin, a widely published economist and activist?How an Economy Grows and Why It Crashes?incorporates the spirit of the original while tackling the latest economic issues.With wit and humor, the Schiffs explain the roots of economic growth, the uses of capital, the destructive nature of consumer credit, the source of inflation, the importance of trade, savings, and risk, and many other topical principles of economics.\n\nThe tales told here may appear simple of the surface, but they will leave you with a powerful understanding of How an Economy Grows and Why it Crashes. ","torrent":{"xt":"urn:btih:1a4a5a05b1bb4ef469d789c195f1cb92fdc26a75","amp;dn":"How+an+Economy+Grows+and+Why+it+Crashes+by+Peter+Schiff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a4a5a05b1bb4ef469d789c195f1cb92fdc26a75","infoHashBuffer":{"type":"Buffer","data":[26,74,90,5,177,187,78,244,105,215,137,193,149,241,203,146,253,194,106,117]},"announce":[],"urlList":[]}}