{"title":"Introduction to physical polymer science 4th ed","uid":12427516,"size":10491329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a50871040fe702b413622612ef17137c27d5765&amp;dn=Introduction+to+physical+polymer+science+4th+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1442362345,"description":"Introduction to physical polymer science 4th ed (Wiley, 2006).pdf\n\nISBN 978-0-471-70606-9\n\nAn Updated Edition of the Classic Text \nPolymers constitute the basis for the plastics, rubber, adhesives, fiber, and coating industries. The Fourth Edition of Introduction to Physical Polymer Science acknowledges the industrial success of polymers and the advancements made in the field while continuing to deliver the comprehensive introduction to polymer science that made its predecessors classic texts. \nThe Fourth Edition continues its coverage of amorphous and crystalline materials, glass transitions, rubber elasticity, and mechanical behavior, and offers updated discussions of polymer blends, composites, and interfaces, as well as such basics as molecular weight determination. Thus, interrelationships among molecular structure, morphology, and mechanical behavior of polymers continue to provide much of the value of the book. \nNewly introduced topics include: \n* Nanocomposites, including carbon nanotubes and exfoliated montmorillonite clays\n* The structure, motions, and functions of DNA and proteins, as well as the interfaces of polymeric biomaterials with living organisms\n* The glass transition behavior of nano-thin plastic films \nIn addition, new sections have been included on fire retardancy, friction and wear, optical tweezers, and more. \nIntroduction to Physical Polymer Science, Fourth Edition provides both an essential introduction to the field as well as an entry point to the latest research and developments in polymer science and engineering, making it an indispensable text for chemistry, chemical engineering, materials science and engineering, and polymer science and engineering students and professionals","torrent":{"xt":"urn:btih:1a50871040fe702b413622612ef17137c27d5765","amp;dn":"Introduction+to+physical+polymer+science+4th+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a50871040fe702b413622612ef17137c27d5765","infoHashBuffer":{"type":"Buffer","data":[26,80,135,16,64,254,112,43,65,54,34,97,46,241,113,55,194,125,87,101]},"announce":[],"urlList":[]}}