{"title":"The Boys of '67_ Charlie Company's War in Vietnam","uid":15545705,"size":376241656,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1b75d3023bca749f8a697019085a2ef63585fbae&amp;dn=The+Boys+of+%2767_+Charlie+Company%27s+War+in+Vietnam&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"usparc56","files":3,"time":1470969870,"description":"The Boys of '67: Charlie Company's War in Vietnam\r\nWritten by: Andrew Wiest\r\nNarrated by: William Hughes\r\nLength: 15 hrs and 12 mins \r\nUnabridged Audiobook\r\nRelease Date:12-06-13\r\nPublisher: Blackstone Audio, Inc.\r\n\r\nWhen the 160 men of Charlie Company were drafted by the US Army in May 1966, they were part of the wave of conscription that would swell the American military to eighty thousand combat troops in Vietnam by the height of the war in 1968. In the spring of 1966 the war was still popular, and the draftees of Charlie Company saw their service as a rite of passage. But by December 1967, when the company returned home, only thirty men were not casualties - and they were among the first veterans of the war to be spit on and harassed by war protesters as they arrived back home.\r\n\r\nIn The Boys of '67, Andrew Wiest, the award-winning author of Vietnam's Forgotten Army and The Vietnam War 1956-1975, examines the experiences of a company from the only division in the Vietnam era to train and deploy together in similar fashion to World War II's famous 101st Airborne Division.\r\n\r\nWiest interviewed more than fifty officers and enlisted men who served with Charlie Company, including the surviving platoon leaders and both of the company's commanders. In addition, he interviewed fifteen family members of Charlie Company veterans, including wives, children, parents, and siblings. Wiest also had access to personal papers, collections of letters, a diary, an abundance of newspaper clippings, training notebooks, field manuals,condolence letters, and photographs from before, during, and after the conflict.\r\n\r\nAs Wiest shows, the fighting that Charlie Company saw in1967 was nearly as bloody as many of the better publicized battles, including the infamous battles of the Ia Drang Valley and Hamburger Hill. As a result, many of the surviving members of Charlie Company came home with what the military now recognizes as post-traumatic stress disorder - a diagnosis that was not recognized until the late 1970s and was not widely treated until the 1980s.\r\n\r\nOnly recently, after more than forty years, have many members of Charlie Company achieved any real and sustained relief from their suffering","torrent":{"xt":"urn:btih:1b75d3023bca749f8a697019085a2ef63585fbae","amp;dn":"The+Boys+of+%2767_+Charlie+Company%27s+War+in+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b75d3023bca749f8a697019085a2ef63585fbae","infoHashBuffer":{"type":"Buffer","data":[27,117,211,2,59,202,116,159,138,105,112,25,8,90,46,246,53,133,251,174]},"announce":[],"urlList":[]}}