{"title":"Fringe Seizoen 1 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6143930,"size":7914336858,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b89366ece9f4c74db34589a8412da43312d0d2f&amp;dn=Fringe+Seizoen+1+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Koedje","files":-1,"time":1296599033,"description":"[img]http://img84.imageshack.us/img84/7254/fringex.jpg[/img]\n\n\n\nPlot:\n\nDe reeks draait rond FBI agente Olivia Dunham, de gestoorde professor Dr. Walter Bishop en zijn zoon Peter, die worden belast met een aantal vreemde zaken die over de hele wereld gebeuren. Al die vreemde gebeurtenissen zijn blijkbaar op de een of andere manier aan elkaar gelinkt: er is duidelijk 'een patroon' te herkennen dat over alle zaken heen loopt. Het patroon kan tevens gelinkt worden aan Massive Dynamic, een firma die een aantal patenten houdt op een aantal nieuwe technologieÃƒÂ«n en enkele mysterieuze onderzoeken doet. Alle zaken draaien rond Fringe science, een tak van de wetenschap die zeer speculatief en omstreden is. Voorbeelden van deze tak van de wetenschap zijn levitatie, telepathie en onzichtbaarheid.\n\n\n\n\nFringe Seizoen 1:\n\n\nSeizoen 1, aflevering 1: Pilot\nWhen a commercial flight from Germany lands at Boston's Logan Airport without a single passenger or crew member on board alive, \nFBI agent Olivia Dunham is assigned to the investigative team. When her partner and lover John Scott suffers severe chemical burns, \nshe seeks help from Dr. Walter Bishop a one-time university professor who experimented in the same field but has now been institutionalized for 17 years. \nTo get his cooperation however, she has to get Bishop's son Peter's cooperation as well. The information they gather leads to Massive Dynamics a huge multinational founded by someone who once shared laboratory space with Dr. Bishop. \nAgent Dunham also learns that what happened may have been part of a much larger pattern of strange phenomena.\n\n\n\n\nSeizoen 1, aflevering 2: The Same Old Story\nA woman gives birth to a baby which ages 80 years in just a few minutes and Olivia soon finds connection between the incident and a serial killer she had been chasing.\n\n\n\t\nSeizoen 1, aflevering 3: The Ghost Network\nFollowing a strange apparent terrorist attack on a bus, Olivia, Peter and Walter find a man who foresees future disasters before they happen.\n\n\n\t\nSeizoen 1, aflevering 4: The Arrival\nA strange cylinder which is somehow connected to Walter and a man known as &quot;the Observer&quot; appears from the ground at a construction site.\n\n\n\t\nSeizoen 1, aflevering 5: Power Hungry\nAn elevator crashes, killing a number of people, leading Olivia and the Bishops to a man who appears to unknowingly be able to manipulate electricity.\n\n\n\t\nSeizoen 1, aflevering 6: The Cure\nA number of people in a diner die of radiation exposure and Olivia and the Bishops believe a woman who disappeared two weeks earlier was the source.\n\n\n\t\nSeizoen 1, aflevering 7: In Which We Meet Mr. Jones\nAn FBI agent experiencing huge pain is brought to a hospital where it is discovered that there is a strange parasite wrapped around his heart.\n\n\n\t\nSeizoen 1, aflevering 8: The Equation\nA young musical genius is kidnapped and Walter recalls a patient at St Clair's who might have been kidnapped by the same people and forced to try and figure out the solution to an equation.\n\n\n\t\nSeizoen 1, aflevering 9: The Dreamscape\nAn employee of Massive Dynamics covered in mysterious cuts jumps out a window believing himself to be attacked by a swarm of butterflies. \nMeanwhile, Olivia becomes fed up with her visions of John Scott and decides to go back into the sensory deprivation tank to get rid of them.\n\n\n\t\nSeizoen 1, aflevering 10: Safe\nAfter a series of mysterious bank robberies, a suspect is found embedded into a wall, \ncausing Walter to realize that they have not only found a way to literally walk through walls, but are looking for something he's made in the past.\n\n\n\t\nSeizoen 1, aflevering 11: Bound\nOlivia has been abducted and Broyles hands over the investigation to Mitchell Loeb, one of the kidnappers.\n\n\n\t\nSeizoen 1, aflevering 12: The No-Brainer\nTwo mens' brains are liquefied and their only apparent connection is that they both downloaded a huge file before dying.\n\n\n\t\nSeizoen 1, aflevering 13: The Transformation\nA man undergoes a painful and ultimately fatal transformation aboard a plane. Meanwhile, Nina Sharp and Broyles reveal more information about John Scott to Olivia.\n\n\n\t\nSeizoen 1, aflevering 14: Ability\nThe team investigates a number of people who died faceless after their orifices are sealed while German agents investigating David Robert Jones' escape question Olivia.\n\n\n\nSeizoen 1, aflevering 15: Inner Child\nA mysterious child is recovered from a secret chamber that has been sealed for more than a half-century.\n\n\n\t\nSeizoen 1, aflevering 16: Unleashed\nA group of animal rights activists killed in action when trying to flee from a lab animal which doesn't exist in nature.\n\n\n\t\nSeizoen 1, aflevering 17: Bad Dreams\nFBI agent Dunham believes that she is killing random people in her dreams.\n\n\n\nSeizoen 1, aflevering 18: Midnight\nWhen a second victim is discovered with injuries to the back of the neck, Fringe division is called in to investigate. \nWalter does an autopsy and discovers that the injury was inflicted by a human bite; the wound is infected by a rare genetically modified syphilis virus and all the spinal fluid has been drained. Tracing users of the virus leads the team to a scientist with connections to ZFT. His story leads the team to find more victims and a desperate race against time to track down a killer with a dangerous addiction to human spinal fluid.\n\n\n\t\nSeizoen 1, aflevering 19: The Road Not Taken\nWhen a woman bursts into flames and explodes, Olivia and Peter start to look into it, and Olivia starts seeing things -- which Walter explains as possibly her seeing an alternate reality. \nThe investigation leads back to the experiment Olivia was part of as a child, and points to a high member of the FBI as well as links to Massive Dynamics. Meanwhile Nina comes to Broyles with her concern that the watcher has been sighted again, and frequently.\n\n\n\nSeizoen 1, aflevering 20: There's More Than One of Everything\nDavid Robert Jones comes out of hiding following an attempt on Nina Sharp's life while Walter leaves accompanied by the mysterious Observer.\n\n\n\nTrailer:\n\n\n\n\n\n\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:1b89366ece9f4c74db34589a8412da43312d0d2f","amp;dn":"Fringe+Seizoen+1+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b89366ece9f4c74db34589a8412da43312d0d2f","infoHashBuffer":{"type":"Buffer","data":[27,137,54,110,206,159,76,116,219,52,88,154,132,18,218,67,49,45,13,47]},"announce":[],"urlList":[]}}