{"title":"Theory and Design of Digital Communication Systems [2010]","uid":11971551,"size":4251445,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c22092108735575ee72970041d2124a0ac68b6f&amp;dn=Theory+and+Design+of+Digital+Communication+Systems+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"NoctDeath","files":2,"time":1432841288,"description":"Title: Theory and Design of Digital Communication Systems\nAuthor: Tri T. Ha \nFormat: PDF\nHardcover: 668 pages\nPublisher: Cambridge University Press; 1 edition (November 15, 2010)\nLanguage: English\nISBN: 9780521761741\n\nProviding the underlying principles of digital communication and the design techniques of real-world systems, this textbook prepares senior undergraduate and graduate students for the engineering practices required in industry. Covering the core concepts, including modulation, demodulation, equalization, and channel coding, it provides step-by-step mathematical derivations to aid understanding of background material. In addition to describing the basic theory, the principles of system and subsystem design are introduced, enabling students to visualize the intricate connections between subsystems and understand how each aspect of the design supports the overall goal of achieving reliable communications. Throughout the book, theories are linked to practical applications with over 250 real-world examples, whilst 370 varied homework problems in three levels of difficulty enhance and extend the text material. With this textbook, students can understand how digital communication systems operate in the real world, learn how to design subsystems, and evaluate end-to-end performance with ease and confidence","torrent":{"xt":"urn:btih:1c22092108735575ee72970041d2124a0ac68b6f","amp;dn":"Theory+and+Design+of+Digital+Communication+Systems+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c22092108735575ee72970041d2124a0ac68b6f","infoHashBuffer":{"type":"Buffer","data":[28,34,9,33,8,115,85,117,238,114,151,0,65,210,18,74,10,198,139,111]},"announce":[],"urlList":[]}}