{"title":"Investment Science","uid":10123438,"size":16776663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c47c7b2570614cede4070fae8e8284fd138174d&amp;dn=Investment+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1399719605,"description":"ABOUT THIS BOOK\nFueled in part by some extraordinary theoretical developments in finance, an explosive growth of information and computing technology, and the global expansion of investment activity, investment theory currently commands a high level of intellectual attention. Recent developments in the field are being infused into university classrooms, financial service organizations, business ventures, and into the awareness of many individual investors. Modern investment theory using the language of mathematics is now an essential aspect of academic and practitioner training. \nRepresenting a breakthrough in the organization of finance topics, Investment Science will be an indispensable tool in teaching modern investment theory. It presents sound fundamentals and shows how real problems can be solved with modern, yet simple, methods. David Luenberger gives thorough yet highly accessible mathematical coverage of standard and recent topics of introductory investments: fixed-income securities, modern portfolio theory and capital asset pricing theory, derivatives (futures, options, and swaps), and innovations in optimal portfolio growth and valuation of multiperiod risky investments. Throughout the book, he uses mathematics to present essential ideas of investments and their applications in business practice. The creative use of binomial lattices to formulate and solve a wide variety of important finance problems is a special feature of the book. \nIn moving from fixed-income securities to derivatives, Luenberger increases naturally the level of mathematical sophistication, but never goes beyond algebra, elementary statistics/probability, and calculus. He includes appendices on probability and calculus at the end of the book for student reference. Creative examples and end-of-chapter exercises are also included to provide additional applications of principles given in the text. \nIdeal for investment or investment management courses in finance, engineering economics, operations research, and management science departments, Investment Science has been successfully class-tested at Boston University, Stanford University, and the University of Strathclyde, Scotland, and used in several firms where knowledge of investment principles is essential. Executives, managers, financial analysts, and project engineers responsible for evaluation and structuring of investments will also find the book beneficial. The methods described are useful in almost every field, including high-technology, utilities, financial service organizations, and manufacturing companies.","torrent":{"xt":"urn:btih:1c47c7b2570614cede4070fae8e8284fd138174d","amp;dn":"Investment+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c47c7b2570614cede4070fae8e8284fd138174d","infoHashBuffer":{"type":"Buffer","data":[28,71,199,178,87,6,20,206,222,64,112,250,232,232,40,79,209,56,23,77]},"announce":[],"urlList":[]}}