{"title":"The Essential Phil Ochs: Louder than the Guns","uid":4918058,"size":211719332,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1c50362b89e641d49d9afde9affefa168fa74186&amp;dn=The+Essential+Phil+Ochs%3A+Louder+than+the+Guns&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Appleford","files":-1,"time":1243526524,"description":"More people should know the music of Phil Ochs. A contemporary, and occasionally colleague, of Bob Dylan, Ochs' music went from savagely comic talking blues through abstract, oblique electronic tributes to Kennedy and Martin Luther King, before winding up expressing an aching despair, prefiguring his tragic suicide in 1976.\n\nWe need a real &quot;Essential Phil Ochs&quot;, but until we get one, here's &quot;Louder than the Guns&quot;, compiled by me over a year or so from a mysterious rar I found on eMule featuring a selection of his best songs, with a tracklisting that didn't correspond to any compilation. I made it about half as big again and gave it the name &quot;Louder Than the Guns&quot;, complete with album art by Roly the Non-Wonder Dog.\n\nHerewith, just over three hours worth of his very best music. Including album tracks, live cuts, and in a couple of cases both. Not in any particular order, although the identities of the last two tracks were basically inevitable.\n\nMP3s from various sources, some a bit ragged, apparently coming from audio tape. The live version of &quot;Crucifixion&quot; in particular has a couple of momentary silences that I couldn't do anything about. All perfectly listenable.","torrent":{"xt":"urn:btih:1c50362b89e641d49d9afde9affefa168fa74186","amp;dn":"The+Essential+Phil+Ochs%3A+Louder+than+the+Guns","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c50362b89e641d49d9afde9affefa168fa74186","infoHashBuffer":{"type":"Buffer","data":[28,80,54,43,137,230,65,212,157,154,253,233,175,254,250,22,143,167,65,134]},"announce":[],"urlList":[]}}