{"title":"Raumplan vs Plan Libre - Adolf Loos and Le Corbusier (Architectu","uid":9469547,"size":131936092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c77602679da1ad71f436f5af9e390e2e4a04cca&amp;dn=Raumplan+vs+Plan+Libre+-+Adolf+Loos+and+Le+Corbusier+%28Architectu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1389527282,"description":"Max Risselada, Beatriz Colomina &quot;Raumplan versus Plan Libre: Adolf Loos and Le Corbusier, 1919 - 1930&quot;\nRizzoli | English | 1989 | ISBN: 0847810003 | 148 pages | PDF | 125 MB\n\nComparisons between Loos and Le Corbusier greatly illuminate the special qualities of each of these two magisterial architects. In the work of both architects there is creative tension between two paradigms: on the one hand, their work is concerned with the autonomy of architectural means, and on the other, each architect tries to locate his work in a context. These contexts frequently overlap. To Loos, the starting departure is traditional craftsmanship, the task being socially determined. In Le Corbusier's case, the division of labor between design and realization forms the core of architectural process. The assignment and means of realizing it are formulated in terms of new technologies. This revised and updated edition looks anew at the respective merits of two giants of modern architecture. As well as featuring writings by the architects themselves, the book illustrates the evolution of the work of Loos and Le Corbusier, with detailed reference to their domestic projects, ranging from the Strasser House (1919) to the Last House (1932), and from Maison Domino (1915) to Villa Savoye (1932). With excellent overviews and analyses, this book offers insight into the motivations of these two architects, so near yet so far away.","torrent":{"xt":"urn:btih:1c77602679da1ad71f436f5af9e390e2e4a04cca","amp;dn":"Raumplan+vs+Plan+Libre+-+Adolf+Loos+and+Le+Corbusier+%28Architectu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c77602679da1ad71f436f5af9e390e2e4a04cca","infoHashBuffer":{"type":"Buffer","data":[28,119,96,38,121,218,26,215,31,67,111,90,249,227,144,226,228,160,76,202]},"announce":[],"urlList":[]}}