{"title":"Heart of Darkness [Adventure] (1998)","uid":4036909,"size":623800794,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1d75bf07d6c068cbcb1cfba773d0700d6cae9fb4&amp;dn=Heart+of+Darkness+%5BAdventure%5D+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Rus--laN","files":1,"time":1203473659,"description":"&quot;The game follows Andy, a regular child who hates his teacher, loves his dog, and is afraid of the dark. One day, Andy and his dog, Whiskey, head for the park to watch a solar eclipse. During the eclipse, Whiskey disappears. In a flurry of childhood imagination, Andy heads for his treehouse, where he keeps his &quot;inventions&quot;, and jumps inside a spaceship to find his dog. Of course, he actually does take off, and finds himself in another world, called the Darklands. Inhabited by creatures of the night and ruled over by The Master of Darkness, the Darklands are extremely dangerous. Andy must find it in himself to rescue his dog, find a way home, face his fears, and enter the Heart of Darkness itself.\n\nIn his journey he encounters &quot;Amigos&quot; - winged beings who are also terrorised by the Master of Darkness. They are very friendly and help Andy whenever they can. Andy accidentally comes across a mysterious glowing magic green stone that grants magical powers to anyone who touches it, as long as the stone is in one piece. With the help of the Amigos, Andy believes they can fight back those dark forces. Later in the game, the stone is brought to the Dark Lair, the house of the Master of Darkness. Andy and his friends then decide to use the stone to bring down the entire Dark Kingdom by neutralizing the Master of Darkness. However, the Master won&amp;#039;t give up so easily...&quot;\n\nFull review @ http://en.wikipedia.org/wiki/Heart_of_Darkness_(game) \n\n&lt;3 this game.","torrent":{"xt":"urn:btih:1d75bf07d6c068cbcb1cfba773d0700d6cae9fb4","amp;dn":"Heart+of+Darkness+%5BAdventure%5D+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d75bf07d6c068cbcb1cfba773d0700d6cae9fb4","infoHashBuffer":{"type":"Buffer","data":[29,117,191,7,214,192,104,203,203,28,251,167,115,208,112,13,108,174,159,180]},"announce":[],"urlList":[]}}