{"title":"Tori Amos - Unrepentant Geraldines [2014] [EAC/FLAC]","uid":10173377,"size":334513410,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1dc14ea5a8edb740ae839b2dc1562579b86f8317&amp;dn=Tori+Amos+-+Unrepentant+Geraldines+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":19,"time":1400437160,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Mercury Classics / Deluxe Edition\nCountry: USA\nYear: May 13, 2014\nGenre: pop,folk/rock\nFormat: CD,Album\n\n\n1. America (04:11)\n2. Trouble's Lament (03:44)\n3. Wild Way (02:55)\n4. Wedding Day (03:44)\n5. Weatherman (04:41)\n6. 16 Shades of Blue (03:52)\n7. Maids of Elfen-Mere (02:53)\n8. Promise (04:04)\n9. Giant's Rolling Pin (04:11)\n10. Selkie (04:04)\n11. Unrepentant Geraldines (06:57)\n12. Oysters (05:14)\n13. Rose Dover (03:55)\n14. Invisible Boy (04:55)\n\n15. Forest Of Glass (5:08) (Deluxe Edition)\n\n\nUnrepentant Geraldines -- its title so knowingly Tori it verges on parody -- finds Tori Amos delivering original songs, which isn't a common occurrence for her in the new millennium. Following on the heels of the interpretive 2012 set Gold Dust, it's the first collection of original material since 2011's Night of the Hunters, but it seems as if its roots stretch back even farther, as it is a bright, open collection, sometimes suggesting her early-'90s heyday but never pandering toward the past. There's a nice tension on this record, as Amos gives her hardcore fans what they want -- left turns tempered with introspection -- while also wooing the skeptics with melody and color, giving the record a bright, open feel that stands in contrast to the handsome solipsism that characterized many of her new millennial records. Strictly speaking, there's not much here that signifies as &quot;pop&quot; -- there are hooks, both melodic and rhythmic, but they seem almost incidental to feel, as the record flits between meditation and extroversion, its warmest moments also being its most intimate. Amos operates like a veteran liberated by her dedicated audience; she never once assumes she'll lose her audience, so she taunts them, sometimes seducing but often teasing, operating just outside of the parameters of what is expected or acceptable for Tori. That's the real pleasure of Unrepentant Geraldines: it's lush and melodic but also barbed, sometimes seeming dissonant but often consoling, its soothing qualities eventually turning disturbing. This has long been Amos' calling card, this shimmering space between comfort and pain, but Unrepentant Geraldines trumps its predecessors by accentuating its polarity; it either seduces with its sweetness or it provokes with its pain, and either extreme is compelling.","torrent":{"xt":"urn:btih:1dc14ea5a8edb740ae839b2dc1562579b86f8317","amp;dn":"Tori+Amos+-+Unrepentant+Geraldines+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc14ea5a8edb740ae839b2dc1562579b86f8317","infoHashBuffer":{"type":"Buffer","data":[29,193,78,165,168,237,183,64,174,131,155,45,193,86,37,121,184,111,131,23]},"announce":[],"urlList":[]}}