{"title":"Nevada Barr-Destroyer Angel &amp; Endangered Species","uid":15731998,"size":415025530,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1df364cd3c4a2d7b78b9c05db4e868836f8a5a6d&amp;dn=Nevada+Barr-Destroyer+Angel+%26amp%3B+Endangered+Species&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"twocows","files":20,"time":1472794490,"description":"Destroyer Angel        Thriller\r\n\r\nAnna Pigeon, a ranger for the U.S. Park Services, sets off on vacation—an autumn canoe trip in the to the Iron Range in upstate Minnesota. With Anna is her friend Heath, a paraplegic; Heath's fifteen-year-old daughter, Elizabeth; Leah, a wealthy designer of outdoor equipment; and her daughter, Katie, who is thirteen. For Heath and Leah, this is a shakedown cruise to test a new cutting edge line of camping equipment. The equipment, designed by Leah, will make camping and canoeing more accessible to disabled outdoorsmen. On their second night out, Anna goes off on her own for a solo evening float on the Fox River. When she comes back, she finds that four thugs, armed with rifles, pistols, and knives, have taken the two women and their teenaged daughters captive. With limited resources and no access to the outside world, Anna has only two days to rescue them before her friends are either killed or flown out of the country, in Destroyer Angel by Nevada Barr.\r\n\r\n Endangered Species          Mystery\r\n\r\nMarooned on Cumberland Island National Seashore off the coast of Georgia, Anna finds time weighing heavily as she waits out a twenty-one day assignment on fire detail. When the sudden plane crash in the inland palmetto thickets calls her and the other members of the fire crew to action, the flames are quickly extinguished. But suspicions smolder over the cause of the accident which killed both the pilot and his passenger, Cumberland's lone law enforcement ranger. The tightly-knit island society begins to seethe with hushed accusations. As tensions escalate, Anna and crew find themselves pressed service. Though the &quot;experts&quot; are called in to evaluate the crash, Anna can't let the investigation rest solely in their hands. Her inquiry causes her to stumble into shady dealings that question the integrity-and honor-of her own crew. Cumberland Island has no fences or alarm systems to guard its cherished goods, only the eyes and ears of a handful of determined rangers. But will protecting the island come at a price even Anna is unwilling to pay","torrent":{"xt":"urn:btih:1df364cd3c4a2d7b78b9c05db4e868836f8a5a6d","amp;dn":"Nevada+Barr-Destroyer+Angel+%26amp%3B+Endangered+Species","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1df364cd3c4a2d7b78b9c05db4e868836f8a5a6d","infoHashBuffer":{"type":"Buffer","data":[29,243,100,205,60,74,45,123,120,185,192,93,180,232,104,131,111,138,90,109]},"announce":[],"urlList":[]}}