{"title":"Sleep Medicine in Neurology [PDF]~StormRG~","uid":9620073,"size":11349673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e3b7d101e7db87ace45fcc57ce11b147f421607&amp;dn=Sleep+Medicine+in+Neurology+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392487885,"description":"Series: NIP- Neurology in Practice (Book 2)\nHardcover: 188 pages\nPublisher: Wiley-Blackwell; 1 edition (December 31, 2013)\nLanguage: English\nISBN-10: 1444335510\nISBN-13: 978-1444335514\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n____________________________________________________________________________________\n\nA new addition to the Neurology in Practice series, Sleep Medicine in Neurology is a practical guide for neurologists diagnosing and managing sleep disorders in their patients. As a part of the series, various feature boxes are highlighted throughout. &quot;Tips and Tricks&quot; give suggestions on how to improve outcomes through practical technique or patient questioning. In addition, &quot;Caution&quot; warning boxes supply helpful advice on how to avoid problems and 'Science Revisited' boxes offer quick reminders of the basic science principles necessary for understanding the presented concepts.\n\nFrom the Back Cover\n\nRecognize, understand, and manage sleep dysfunction in your patients\n\nSleep disorders can cause neurological problems. Neurological problems can cause sleep disorders. Whatever the cause or effect, neurologists need to be well versed in sleep medicine. This enables effective discussion of sleep problems and improved patient outcomes and satisfaction.\n\n\n\nSleep Medicine in Neurology introduces the practicing neurologist to sleep medicine, from examination of the patient to treatment of many sleep disorders. With a focused, practical approach throughout, the expert author team covers:\n\n\n\nHistory, examination and sleep testing of the patient\nInsomnia\nExcessive daytime sleepiness\nNarcolepsy\nObstructive and central sleep apnea\nMovement disorders in sleep\nParasomnias\nSleep disorders in children\n\n\nClinical in approach, practical in execution, Sleep Medicine in Neurology helps you diagnose and treat your sleep-disordered patients more effectively.\n","torrent":{"xt":"urn:btih:1e3b7d101e7db87ace45fcc57ce11b147f421607","amp;dn":"Sleep+Medicine+in+Neurology+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3b7d101e7db87ace45fcc57ce11b147f421607","infoHashBuffer":{"type":"Buffer","data":[30,59,125,16,30,125,184,122,206,69,252,197,124,225,27,20,127,66,22,7]},"announce":[],"urlList":[]}}