{"title":"Natalie Merchant - Paradise Is There (2015) [EAC-FLAC]","uid":13101299,"size":561614368,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e3be118587095812d5c7f757da7473d94812159&amp;dn=Natalie+Merchant+-+Paradise+Is+There+%282015%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pucholoco","files":34,"time":1451234365,"description":"Natalie Merchant - Paradise Is There: The New Tigerlily Recordings (2015) \r\n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 319 Mb \r\n                      Full Artwork @ 600 dpi (jpg) -&gt; 241 Mb \r\n\r\n\r\nWhen Natalie Merchant left 10,000 Maniacs in 1994, she had given the band two years notice and was ready to embark on a solo career. \r\n\r\nGiven her high profile, she could have done anything she wanted -- and she did. She bucked conventional music biz wisdom, hired her own band, and self-produced the multi-platinum-selling Tigerlily. \r\n\r\nSome of its songs are still part of her live set and the classic album endures with fans and continues to find new ones. Twenty years later, Merchant presents Paradise Is There: The New Tigerlily Recordings. It's completely re-recorded, re-arranged, and revisioned. The obvious question -- why mess with a classic? -- is answered convincingly. She's learned a lot about these songs in the interim.\r\n\r\nHer approach remains holistic; her optimism has not been tempered by time as much as deepened with it. \r\nThe running order is very different. &quot;Wonder,&quot; for instance, is now the album's closer. \r\nIt has been stripped of electric instruments and adorned by acoustic piano, guitars, and a brushed trap kit. &quot;River,&quot; an elegy for the late actor River Phoenix, remains a lament. The electric guitars are still there, but a string quartet bears up Merchant's voice. \r\n\r\nIt continues to reflect her anger at the sensationalistic coverage of his death, but it's balanced now by an enduring sense of loss imbued with the weight of the heart's memory. A backing chorus featuring Gail Ann Dorsey and Elizabeth Mitchell adds spiritual resonance to her delivery. This version of &quot;The Letter&quot; is nearly twice as long. Merchant's vocal is accompanied only by an upright bass and the string quartet. &quot;Cowboy Romance&quot; offers a taut, upright bassline, a lonesome violin, a wafting accordion, and brushed snare. \r\n\r\nMerchant's voice is much deeper now, but also richer; it carries the authority of a personal truth that's been lived in. The wide-eyed innocent who delivered the line &quot;...There's no man born that can rule me…&quot; is gone. There is a nearly militant emphasis on those words here, offering the poignancy of experience as a testament. The rock &amp; roll core of &quot;Jealousy&quot; has been replaced by a vintage R&amp;B feel. \r\n\r\nSimi Stone's Motown-esque duet vocals and Sharel Cassity's tenor saxophone provide organic counterweights to Merchant's in-the-rear-view delivery and finally free of frustrated desire; the evidence of a lesson learned the hard way. On Paradise Is There, her songs thrive in new presentations. Their meanings have shifted and grown. This is not just a nostalgic look back at a classic album, but Merchant fully inhabiting the material in the present tense. The depth in these recordings makes it a welcome companion to Tigerlily.\r\n\r\n\r\n-----------------------------------------------------------------------\r\nTracklist:\r\n-----------------------------------------------------------------------\r\n\r\n01 - San Andreas Fault\r\n02 - Beloved Wife\r\n03 - Carnival\r\n04 - River\r\n05 - The Letter\r\n06 - Where I Go\r\n07 - I May Know the Word\r\n08 - Seven Years\r\n09 - Cowboy Romance\r\n10 - Jealousy\r\n11 - Wonder\r\n\r\n*2015 Nonesuch Records / Big City Sister / Warner | 7559-79501-5\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:1e3be118587095812d5c7f757da7473d94812159","amp;dn":"Natalie+Merchant+-+Paradise+Is+There+%282015%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3be118587095812d5c7f757da7473d94812159","infoHashBuffer":{"type":"Buffer","data":[30,59,225,24,88,112,149,129,45,92,127,117,125,167,71,61,148,129,33,89]},"announce":[],"urlList":[]}}