{"title":"Alpha Protocol-SKIDROW","uid":5598585,"size":10671690085,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e615e62c90bb15c642683626ddc82f5c52ff547&amp;dn=Alpha+Protocol-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":7,"uploader":"ReliableTorrent","files":-1,"time":1275161370,"description":"Alpha Protocol / SEGA\n\n\n\nRELEASE DATE: 27-05-2010 PROTECTION: Uniloc SoftAnchor\n\nGAME TYPE: Shooter/RPG DISKS: 2 DVD\n\n\n\nGame release information:\n\n\n\nIn the near future, worldwide political tensions are at a\n\nbreaking point when a commercial airliner is shot down by a\n\nU.S. missile over Eastern Europe, killing all aboard. The U.S\n\ngovernment claims no involvement, and dispatches Agent Michael\n\nThorton to investigate and bring those responsible to justice\n\n\n\nLoyalty carries a price and no one knows this more than agent\n\nMichael Thorton. A talented young agent cast out by his\n\ngovernment, Thorton is the only one with the information\n\nneeded to stop an impending international catastrophe. To do\n\nso means he must cut himself off from the very people he is\n\nsworn to protect. As players determine how to accomplish\n\ndifferent objectives, the decisions made and actions taken in\n\neach mission will ultimately transform the type of secret\n\nagent Michael Thorton will become. Every choice the player\n\nmakes as Michael Thorton will carry consequences for his\n\nfuture and the fate of the world\n\n\n\nAs the first modern day spy role-playing game, Alpha Protocol\n\noffers unprecedented control over the development of Thorton's\n\nabilities and his interactions with other characters. Upgrade\n\nskills such as physical combat, weapons mastery, cutting-edge\n\ntechnology and even seduction as you grow in experience and\n\ncomplete missions\n\n\n\nCustomizable Spy - Players continually develop their spy with\n\nadvanced close-combat techniques, lethal marksmanship, the\n\nability to wield ingenious spy gadgets, and much more\n\n\n\nMultiple Paths to Choose From - With no right or wrong\n\ndecisions, players can constantly change the storyline based\n\non the choices they make. Will they let a terrorist escape to\n\nfollow a lead, or eliminate targets against the mission\n\nagenda? Demanding decisions are challenging and many\n\n\n\nRevolutionary Interaction System - With the Alpha Protocol\n\n'Ripple Effect' system, players can interact with allies and\n\nenemies in a variety of ways. Their choices will dynamically\n\nchange the storyline and unlock new missions, weapons and\n\nalliances\n\n\n\nComplete Choice of Combat Style - An arsenal of weapons with\n\na plethora of customizable add-ons allows players to create a\n\npersonalized weapon load out for every mission. Cutting-edge\n\ntechnology, stealth maneuvers, ballistic explosives and more\n\ncan be discovered and used!\n\n\n\nNo Time to Spare - Every decision and interaction in Alpha\n\nProtocol is made with a time-limit that steadily ebbs away\n\nPlayers must think fast, act urgently, and then prepare for\n\nthe consequences!\n\n\n\nReal Modern-Day Setting - Players can live out real-world\n\nespionage within rich international settings such as Rome\n\nMoscow, Taipei, and Saudi Arabia\n\n\n\nDeveloped by RPG Masterminds, Obsidian Entertainment- Founding\n\nObsidian members have worked on RPG blockbusters including\n\nKOTOR II, Neverwinter Nights 2, Baldur's Gate, Planescape\n\nTorment, and Fallout.","torrent":{"xt":"urn:btih:1e615e62c90bb15c642683626ddc82f5c52ff547","amp;dn":"Alpha+Protocol-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e615e62c90bb15c642683626ddc82f5c52ff547","infoHashBuffer":{"type":"Buffer","data":[30,97,94,98,201,11,177,92,100,38,131,98,109,220,130,245,197,47,245,71]},"announce":[],"urlList":[]}}