{"title":"Darksword Margaret Weis &amp; Tracy Hickman","uid":10737835,"size":14195476,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1eb5a8c87c1a51bfe537d79a3e1c31e01684496d&amp;dn=Darksword+Margaret+Weis+%26amp%3B+Tracy+Hickman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gratefuldawg77","files":12,"time":1407711042,"description":"Forging the Darksword\n\n\n\nIn the enchanted realm of Merilon, magic is life.Born without magical abilities and denied his birthright, Joram is left for dead. Yet he grows to manhood in a remote country village, hiding his lack of powers only through constant vigilance and ever more skillful sleight-of-hand.\n\nForced to kill a man in self-defense, Joram can keep his secret from the townspeople no longer; he has no magic, no life. Fleeing to the Outlands, Joram joins the outlawed Technologists, who practice the long forbidden arts of science. Here he meets the scholarly catalyst Saryon, who has been sent on a special mission to hunt down a mysterious &quot;dead man&quot; and instead finds himself in a battle of wits and power with a renegade warlock of the dark Duuk-tsarith caste.\n\nTogether, Joram and Saryon begin their quest toward a greater destiny - a destiny that begins with the discovery of the secret books that will enable them to overthrow the evil usurper Blackloch... and forge the powerful magic-absorbing Darksword.\n\nDoom of the Darksword\n\n\n\nBorn without magic, Joram was one of the Dead, denied the throne of Merilon. For years, he lived among outlaws, surviving by wit and sleight-of-hand. Now, wielding the powerful, magic absorbing Darksword, Joram retums to the enchanted Kingdom that once was his home to win revenge and claim his birthright. Here he will test Bishop Vanya and his fierce army of Duuk-tsarith in a battle unlike any their world has known. Joined by the scholarly catalyst Saryon, the young mage Mosiah, and the trickster Simkin, Jorma confronts the shattering secret of his past and discovers the ancient prophecy that puts the fate of the world in his hands--the hands that forged the Darksword.\n\nTriumph of the Darksword\n\n\n\nJoram and his wife, Gwendolyn, return from beyond the Border to reclaim their rightful place in Merilon. Rejoined by Saryon, Mosiah and Simkin, Joram must confront the evil sorcerer, Menju, and his army of Technologists in a final apocalyptic battle to fulfill the ancient prophecy of the Darksword.\n\nLegacy of the Darksword\n\n\n\nTwenty years ago, the magical land of Thimhallan was destroyed with the forging of the Darksword, leaving a small group of survivors exiled on Earth. Only Joram, who created the Darksword, remained behind in the shattered land. But another catastrophe beckons, as an alien race plans to annihilate the remaining colonists. But Joram has forged another Darksword, and Earth's leaders see it as their only salvation. And it is up to Saryon, an old friend of Joram's, to put the sword in safe hands and possibly save the planet.","torrent":{"xt":"urn:btih:1eb5a8c87c1a51bfe537d79a3e1c31e01684496d","amp;dn":"Darksword+Margaret+Weis+%26amp%3B+Tracy+Hickman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb5a8c87c1a51bfe537d79a3e1c31e01684496d","infoHashBuffer":{"type":"Buffer","data":[30,181,168,200,124,26,81,191,229,55,215,154,62,28,49,224,22,132,73,109]},"announce":[],"urlList":[]}}