{"title":"Iron Maiden Powerslave 320kbps","uid":8257129,"size":122530226,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ebd1e5b13adc851180063e2dead760b9b7babe5&amp;dn=Iron+Maiden+Powerslave+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"Ironmaiden2013","files":-1,"time":1363288895,"description":"Powerslave is the fifth studio album by the English heavy metal band Iron Maiden, released on 3 September 1984 on EMI in Europe and its sister label Capitol Records in the U.S. (it was re-released by Sanctuary/Columbia Records in the U.S. in 2002).\n\nIt is notable for its Ancient Egyptian theme displayed in the cover artwork, lifted from the title track, which was carried over to the album's supporting tour. The World Slavery Tour began in Warsaw, Poland on 9 August 1984, and is widely regarded as being the band's longest and most arduous to date, as well as leading to the live album Live After Death.\n\nThe release also contains a musical re-telling of Samuel Taylor Coleridge's &quot;The Rime of the Ancient Mariner&quot;, which uses pieces of the original poem as lyrics and is, furthermore, Iron Maiden's longest song to date (at 13 minutes and 42 seconds in length).\n\nPowerslave is also notable as being the band's first album to feature the same lineup as the previous one, which would remain intact for two further studio releases.\n\n&quot;2 Minutes to Midnight&quot; and &quot;Aces High&quot; were released as singles.\n\nBackground, writing and recording:\n\nFollowing the conclusion of their highly successful World Piece Tour in December 1983, during which the group headlined large venues and arenas in the U.S. for the first time in their career,[5] the band took three weeks off in January 1984 before regrouping in Jersey.[1] As with Powerslave's predecessor, Piece of Mind, this was where most of the album's writing took place before the band began recording at Compass Point Studios in Nassau, Bahamas.[6] The band spent weeks drinking on the island, which singer Bruce Dickinson states consisted of Banana Daiquiris,[7] while recording the songs.\n\nSteve Harris recalled how, under time pressure, the song &quot;Rime of the Ancient Mariner&quot; was written in a relatively short space of time.[7] Influenced by Samuel Taylor Coleridge's poem of the same name (drawing heavily from his 1815-16 gloss),[8] the song directly quotes two passages from the poem, the former including the famous lines: 'Water, water everywhere - nor any drop to drink'.[9] At over thirteen minutes long, the track contains several distinct sections with differing moods, and would become a fan favourite.[2] During the 'Somewhere Back in Time World Tour', Dave Murray, Bruce Dickinson and Steve Harris cited the song as their favourite from that tour to play live.[10]\n\nOnce finished, the band undertook another short break while the album was mixed at Electric Lady Studios, New York, before reconvening in Ft. Lauderdale, Florida to rehearse for the World Slavery Tour,[11] which began in Poland in August 1984 and ended in California, USA in late 1985.[12] The stage set was an eye-opener, echoing the album cover, including monumental pedestals several stories high atop which the musicians appeared at times during the show.[8] The set amply filled even the gigantic proscenium of Radio City Music Hall. It was also the first time a heavy metal band had taken a full set behind the Iron Curtain, visiting Poland, Hungary and Yugoslavia, a landmark achievement at the time.[12] The tour continued into South America for the first time where they played to an estimated audience of 300,000 at the inaugural Rock in Rio as special guests to the band Queen.[7] The Live After Death album and video, recorded over four nights at Long Beach Arena in LA and Hammersmith Odeon in London,[13] were also released and respectively peaked at No. 2 and 1 in the UK charts.[14]\n\nIn total, the tour was 13 months long and touched 28 countries.[12] Powerslave debuted at number two in the UK Albums Chart, as a result of their record company (EMI's) third Now That's What I Call Music! pop compilation.[14][15][12] According to both Nicko McBrain and Adrian Smith, Powerslave began making Iron Maiden famous &quot;very fast, very quickly,&quot; such as in Brazil, where hundreds of fans waited outside hotels and restaurants for the band.[7]\n\n&quot;Flash of the Blade&quot; was included on the soundtrack of Dario Argento's 1985 horror film Phenomena, and was covered by the American band Avenged Sevenfold on their double live album/DVD: Live in the LBC &amp; Diamonds in the Rough. Rhapsody of Fire have also recorded a cover of the song that is featured on the deluxe edition of their album From Chaos to Eternity. The song &quot;Flash Of The Blade&quot; can also be heard in the Jem And The Holograms episode &quot;Kimber's Rebellion,&quot; just after the cartoon band members return home from Paris, on a boom-box stereo being carried by a passer-by.\n\n\nTrack Listing of what I think Is one of if not the best Iron Maiden's studio album:\n\n1. \t&quot;Aces High&quot;   \t\n2. \t&quot;2 Minutes to Midnight&quot;   \t\n3. \t&quot;Losfer Words (Big 'Orra)&quot; \n4. \t&quot;Flash of the Blade&quot;   \n5. \t&quot;The Duellists&quot;   \t\n6. \t&quot;Back in the Village&quot; \n7. \t&quot;Powerslave&quot; \n8. \t&quot;Rime of the Ancient Mariner&quot;  \n\nEnjoy and Seed. \n\n","torrent":{"xt":"urn:btih:1ebd1e5b13adc851180063e2dead760b9b7babe5","amp;dn":"Iron+Maiden+Powerslave+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ebd1e5b13adc851180063e2dead760b9b7babe5","infoHashBuffer":{"type":"Buffer","data":[30,189,30,91,19,173,200,81,24,0,99,226,222,173,118,11,155,123,171,229]},"announce":[],"urlList":[]}}