{"title":"Peter F. Hamilton - A Second Chance at Eden (Confederation Unive","uid":13750611,"size":220836860,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1efb19237b1049542c086c9a4b3ac9eb122a73d0&amp;dn=Peter+F.+Hamilton+-+A+Second+Chance+at+Eden+%28Confederation+Unive&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Cybotage","files":1,"time":1457148607,"description":"Peter F. Hamilton - A Second Chance at Eden (Confederation Universe)\r\n\r\n\r\nAcclaimed best-selling author Peter F. Hamilton has taken the science fiction world by storm with his stunning, grand-scale epic: The Reality Dysfunction, The Neutronium Alchemist, and The Naked God. Now, with this collection of six stories and a short novel, Hamilton spans more than five centuries in the future history of bitek, affinity genes, Edenists, Adamists, xenocs, the Saldanas, and the starship Lady Macbeth. This outstanding anthology includes &quot;Escape Route&quot;, which has been chosen for Gardner Dozois' prestigious collection The Year's Best Science Fiction. \r\n\r\n\r\n\r\n1. Sonnie's Edge\r\n\r\nSonnie's Edge was first published in New Moon magazine September 1991. It's set on Earth in the year 2070, and is a story about the then popular sport of beastie-baiting - involving contests to the death between artificial monsters controlled via human affinity bonds. Sonnie's team is particularly successful, and her monster, Khanivore, has one special advantage...\r\n\r\n2. A Second Chance at Eden\r\n\r\nA Second Chance at Eden is the main story in this collection, a detective story set in the year 2090. It tells about the events leading to the formation of the society that was to become the Edenists. Eden is a bitek habitat which orbits Jupiter, mining the fusion fuel on which Earth is dependent - a mini-nation of radical politics and even more radical technology. Then, one of its co-creators, Penny Maowkavitz, is murdered by one of the affinity-bonded servitor chimps, but nobody can identify the perpetrator - or the motive.\r\n\r\n3. New Days Old Times\r\n\r\nSettlers came to the planet Nyvan hoping for a lifestyle free of Earthbound hatred. Alas, though environments may change, human nature does not. Set in the year 2245.\r\n\r\n4. Candy Buds\r\n\r\nCandy Buds was first published in New Worlds #2 (1992). In the year 2393 the crime lord Laurus rules Kariwak on Tropicana with an iron fist, jealously guarding control of the bitek trade. But when an astonishing new substance appears on the streets, virtual reality takes on an entirely new dimension.\r\n\r\n5. Deathday\r\n\r\nDeathday was first published in Fear Magazine February 1991. On the desolate planet Jubarra, a man wages an obsessive campaign of retribution against the last survivor of an alien race. But vengeance can cut both ways.\r\n\r\n6. The Lives and Loves of Tiarella Rosa\r\n\r\nThe Lives and Loves of Tiarella Rosa first appeared in a different form as Spare Capacity in New Worlds #3 (1993). Now set in 2447 on Tropicana, this story is about passion, destiny and cloning.\r\n\r\n7. Escape Route\r\n\r\nEscape Route was first published in Interzone magazine July 1997. It's a story about Joshua Calvert's father, Marcus Calvert, set in the year 2586. In his starship Lady Macbeth he encounters a long-abandoned alien spacecraft with its escape route intact - but leading where? And is the craft as empty as it seems?\r\n\r\n\r\n\r\n\r\nNarrated by: Steven Crossley\r\nLength: 14 hrs and 48 mins \r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:02-09-16\r\nPublisher: Tantor Audio","torrent":{"xt":"urn:btih:1efb19237b1049542c086c9a4b3ac9eb122a73d0","amp;dn":"Peter+F.+Hamilton+-+A+Second+Chance+at+Eden+%28Confederation+Unive","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efb19237b1049542c086c9a4b3ac9eb122a73d0","infoHashBuffer":{"type":"Buffer","data":[30,251,25,35,123,16,73,84,44,8,108,154,75,58,201,235,18,42,115,208]},"announce":[],"urlList":[]}}