{"title":"Vuescan v. 9.0.77 with [K]rack","uid":6976236,"size":18863535,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:1f54ecd0eca63ce80c3ddc6e17a77e019b10783c&amp;dn=Vuescan+v.+9.0.77+with+%5BK%5Drack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"polisdavid","files":-1,"time":1327263792,"description":"Official Web SIte: &lt;a href=&quot; http://www.hamrick.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hamrick.com/&lt;/a&gt;\n\nVueScan 9 is the world's most widely used scanner software.\n\nVueScan is a replacement for the software that came with your scanner and supports most flatbed scanners, printer/scanners and film scanners. Over 10 million people have downloaded VueScan since it was first released in 1998. Whether you are looking for more advanced features that your scanner vendor doesn't provide, or your scanner vendor no longer supports your scanner, VueScan 9 helps you get the most out of your scanner.\n\nCompatible with over 1850 Scanners\n\nVueScan 9 is compatible with over 1850 different scanners, including most HP, Canon, Epson, and Nikon scanners. The best way to see if your scanner works is to download VueScan (it only takes 60 seconds). You can also check this list of supported scanners.\n\nWorks on Windows, Mac, and Linux\n\nVueScan 9 works on Windows, Mac OS X, and Linux. Many scanner vendors will stop supporting a scanner and it will stop working on a new operating system. VueScan 9 solves that problem and lets you use your old scanner again.\n\nVueScan Mobile for iPad and iPhone\n\nIf you have an iPad or iPhone, you can use VueScan Mobile Free for scanning. This is a completely free program that's available in the app store.\n\nOutputs scans in a variety of formats\n\nVueScan 9 can output scanned documents, photos, and film in PDF, JPEG and TIFF formats. It can also recognize text using OCR and create multi-page pdfs using both flatbed scanners and scanners with automatic document feeders\n\nGreat for Beginner and Pro Users\n\nWe built VueScan so that two completely different types of users can use it. Guide Me mode guides you step by step through the scanner process. The Advanced mode lets you unlock powerful features to have complete control over your scan\n\nConstantly Updated\n\nWe update VueScan once a week on average. With the Standard Edition you get free upgrades for a year. If you purchase the Professional Edition you get free upgrades for life. We are constantly adding new features and adding support for new scanners.\n\nSystem Requirements:\n\nIntel Mac, OS X.6 and above\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:1f54ecd0eca63ce80c3ddc6e17a77e019b10783c","amp;dn":"Vuescan+v.+9.0.77+with+%5BK%5Drack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f54ecd0eca63ce80c3ddc6e17a77e019b10783c","infoHashBuffer":{"type":"Buffer","data":[31,84,236,208,236,166,60,232,12,61,220,110,23,167,126,1,155,16,120,60]},"announce":[],"urlList":[]}}