{"title":"The Civil War in 500 Photographs (gnv64)","uid":13280394,"size":75910402,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f928eab67ad98392ad1eea9a05e8ff116f06765&amp;dn=The+Civil+War+in+500+Photographs+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":5,"time":1453483895,"description":"TIME-LIFE The Civil War in 500 Photographs\r\nby TIME-LIFE Books\r\nTIME-LIFE | April 2015 | ISBN-10: 1618931482 | ePUB | 71.2 mb\r\n\r\nPerhaps more than any other conflict in the history of the United States of America, the Civil War\r\nchanged the course of the country. The expansive growth during the first 90 years of the Union ushered in great change, especially in the Northern states where metropolises were forming and industry was taking off. The Southern states, largely agricultural with cotton and tobacco plantations fueled by slave labor, were slower to transform. The early American ideals of small government and the individual rights of the states remained strong in the region. The divide between the two ways of life became insurmountable, and in 1861, America went to war with itself.\r\nThe fight to preserve the Union transformed into a war against slavery, and when it was over, America emerged an altered nation. During the four years of the conflict, 620,000 lives were lost, whole towns and cities burned, and virtually no American was left unaffected. The Civil War in 500 Photographs chronicles this heart-wrenching and heroic narrative, while serving as a record of the emerging capabilities of the photographer's lens.\r\nThe new technology of photography was rapidly developing at the time, and as the conflict\r\nintensified, photojournalism and battlefield photography took hold, thanks to pioneers like Mathew\r\nBrady and George S. Cook.\r\nToday, the pictures, while over 150 years old, have lost none of their power to communicate the\r\nbrutality of war. Readers will note that while the photographs of the era were black and white or sepia-toned,\r\nThe Civil War in 500 Photographs contains some images that have been colorized, providing a\r\nnew sense of urgency to the stories they tell. The stoicism of troops assembled for battle and the\r\ndetermination of generals plotting strategies draw the viewer in, while the fields of dead and wounded offer irrefutable reminders of the incredible cost of this conflict.\r\n\r\n\r\nCONTENTS\r\nCover\r\nTitle\r\nIntroduction\r\nCHAPTER 1 - A Growing Fissure\r\nCHAPTER 2 - 1861: Brother Against Brother\r\nCHAPTER 3 - I Have Entered the Ranks\r\nCHAPTER 4 - 1862: A Country Torn Asunder\r\nCHAPTER 5 - The War on Water\r\nCHAPTER 6 - 1863: The Turning Point\r\nCHAPTER 7 - The Home Front\r\nCHAPTER 8 - 1864: The Collapse of the Confederacy\r\nCHAPTER 9 - 1865: A New Birth of Freedom\r\nSelected Bibliography\r\nImage Credit\r\n \nhttp://s14.postimg.org/6j21t6t9t/The_Civil_War_in_500_Photographs.jpg","torrent":{"xt":"urn:btih:1f928eab67ad98392ad1eea9a05e8ff116f06765","amp;dn":"The+Civil+War+in+500+Photographs+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f928eab67ad98392ad1eea9a05e8ff116f06765","infoHashBuffer":{"type":"Buffer","data":[31,146,142,171,103,173,152,57,42,209,238,169,160,94,143,241,22,240,103,101]},"announce":[],"urlList":[]}}