{"title":"Mastering TypeScript (2015).pdf Gooner","uid":12586798,"size":3382173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f9a546e38f2469efe95032d56e01b7a5b869f2e&amp;dn=Mastering+TypeScript+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445035240,"description":"Publisher: Packt Publishing - ebooks Account (April 30, 2015)\r\nLanguage: English\r\nISBN-10: 1784399663\r\nISBN-13: 978-1784399665\r\n\r\nBuild enterprise-ready, industrial strength web applications using TypeScript and leading JavaScript frameworks\r\n\r\nAbout This Book\r\n\r\nFocus on test-driven development to help build quality applications that are modular, scalable, maintainable, and adaptable.\r\nPractical examples that show you how to use TypeScript with popular JavaScript frameworks including Backbone, Angular, Node.js, require.js, and Marionette\r\nEnhance your TypeScript knowledge with in-depth discussions on language features, third-party libraries, declaration files, and so on using practical scenarios.\r\n\r\nWho This Book Is For\r\n\r\nWhether you are a JavaScript developer aiming to learn TypeScript, or an experienced TypeScript developer wanting to take your skills to the next level, this book is for you. From basic to advanced language constructs, test-driven development, and object-oriented techniques, you will learn how to get the most out of the TypeScript language.\r\n\r\nWhat You Will Learn\r\n\r\nGain an insight into core and advanced TypeScript language features including inheritance and generics\r\nIntegrate your existing JavaScript code and third-party JavaScript libraries by writing and using declaration files\r\nWrite TypeScript code to target popular JavaScript frameworks such as jQuery, Backbone, Angular, Node, and Marionette\r\nCreate extensive testing suites for your application, including unit testing, integration testing, and browser automation with Jasmine and Selenium\r\nOrganize your application code using modules, and utilize Asynchronous Module Loading with require.js\r\nExplore advanced object-oriented techniques including dependency injection and strongly typed domain events\r\nBuild a complete single-page web application with TypeScript and Marionette, incorporating object-oriented design patterns along the way\r\n\r\nIn Detail\r\n\r\nThe TypeScript compiler and language has brought JavaScript development up to the enterprise level, yet still maintains backward compatibility with existing JavaScript browsers and libraries.\r\n\r\nPacked with practical code samples, this book brings the benefits of strongly typed, object-oriented programming and design principles into the JavaScript development space. Starting with core language features, and working through more advanced topics such as generics and modules, you will learn how to gain maximum benefit from your JavaScript development with TypeScript. With a strong focus on test-driven development and coverage of many popular JavaScript frameworks, you can fast-track your TypeScript knowledge to a professional level. By the end of this book, you will be able to confidently implement a TypeScript application from scratch","torrent":{"xt":"urn:btih:1f9a546e38f2469efe95032d56e01b7a5b869f2e","amp;dn":"Mastering+TypeScript+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9a546e38f2469efe95032d56e01b7a5b869f2e","infoHashBuffer":{"type":"Buffer","data":[31,154,84,110,56,242,70,158,254,149,3,45,86,224,27,122,91,134,159,46]},"announce":[],"urlList":[]}}