{"title":"Ultra-High Performance Liquid Chromatography and Its Application","uid":15988968,"size":4542496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1faa03f299f5bf5be4f4fdc588f865f3913aa2ad&amp;dn=Ultra-High+Performance+Liquid+Chromatography+and+Its+Application&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"clouderone","files":1,"time":1475992042,"description":"Ultra-High Performance Liquid Chromatography and Its Applications - Quanyun Alan Xu (Wiley, 2013).pdf\r\n\r\nExplores both the benefits and limitations of new UHPLC technology\r\n\r\nHigh performance liquid chromatography (HPLC) has been widely used in analytical chemistry and biochemistry to separate, identify, and quantify compounds for decades. The science of liquid chromatography, however, was revolutionized a few years ago with the advent of ultra-high performance liquid chromatography (UHPLC), which made it possible for researchers to analyze sample compounds with greater speed, resolution, and sensitivity.\r\n\r\nUltra-High Performance Liquid Chromatography and Its Applications enables readers to maximize the performance of UHPLC as well as develop UHPLC methods tailored to their particular research needs. Readers familiar with HPLC methods will learn how to transfer these methods to a UHPLC platform and vice versa. In addition, the book explores a variety of UHPLC applications designed to support research in such fields as pharmaceuticals, food safety, clinical medicine, and environmental science.\r\n\r\nThe book begins with discussions of UHPLC method development and method transfer between HPLC and UHPLC platforms. It then examines practical aspects of UHPLC. Next, the book covers:\r\n\r\nCoupling UHPLC with mass spectrometry\r\nPotential of shell particles in fast liquid chromatography\r\nDetermination of abused drugs in human biological matrices\r\nAnalyses of isoflavones and flavonoids\r\nTherapeutic protein characterization\r\nAnalysis of illicit drugs\r\nThe final chapter of the book explores the use of UHPLC in drug metabolism and pharmacokinetics studies for traditional Chinese medicine.\r\n\r\nWith its frank discussions of UHPLC's benefits and limitations, Ultra-High Performance Liquid Chromatography and Its Applications equips analytical scientists with the skills and knowledge needed to take full advantage of this new separation technology","torrent":{"xt":"urn:btih:1faa03f299f5bf5be4f4fdc588f865f3913aa2ad","amp;dn":"Ultra-High+Performance+Liquid+Chromatography+and+Its+Application","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1faa03f299f5bf5be4f4fdc588f865f3913aa2ad","infoHashBuffer":{"type":"Buffer","data":[31,170,3,242,153,245,191,91,228,244,253,197,136,248,101,243,145,58,162,173]},"announce":[],"urlList":[]}}