{"title":"Railworks TS2016 Western Mainlines (Just Trains)","uid":14174106,"size":1867485423,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:203e71aa7f07041bec4ece14600f8899b66eeaa3&amp;dn=Railworks+TS2016+Western+Mainlines+%28Just+Trains%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"TPB5","files":1,"time":1459788715,"description":"Western Mainlines: Paddington-Bristol, Bristol-Cardiff and Bristol-Exeter\r\n\r\nSet in the years between 2013 and 2015, Western Mainlines consists of three newly developed routes running from the terminus station of London Paddington to Bristol, from Bristol to Cardiff and from Bristol to Exeter, all connected seamlessly together in this one pack.\r\n\r\nFeaturing both the south lines through Box Tunnel and the northern lines via Bristol Parkway, as well as the lines to Oxford, Western Mainlines features 60 stations and numerous new custom assets along with a set of 16 extensive scenarios. The route is Quick Drive enabled.\r\n\r\nPaddington to Bristol - this line is the main route running East-West in southern England. Starting from its grand London terminus at Paddington, it runs out to Bristol and from there to Cardiff in Wales and south-west from Bristol to Exeter in this simulation. The line is largely non-electrified, but in the late 1990s the section from Paddington to Heathrow Airport was electrified. There are plans to electrify all of the real-world route but this work is taking time and has been beset by numerous delays.\r\n\r\nBristol to Cardiff - the route from Bristol to Cardiff is part of the South Wales Main Line and continues the westward journey. It breaks away from the main Paddington-Bristol line at Royal Wootton Bassett and continues under the River Severn using the Severn Tunnel. There are plans to electrify the whole of the equivalent real-world route but, again, there have been numerous delays.\r\n\r\nBristol to Exeter - the line from Bristol to Exeter is a major branch of the line from Paddington to Bristol and runs south-west from Bristol","torrent":{"xt":"urn:btih:203e71aa7f07041bec4ece14600f8899b66eeaa3","amp;dn":"Railworks+TS2016+Western+Mainlines+%28Just+Trains%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203e71aa7f07041bec4ece14600f8899b66eeaa3","infoHashBuffer":{"type":"Buffer","data":[32,62,113,170,127,7,4,27,236,78,206,20,96,15,136,153,182,110,234,163]},"announce":[],"urlList":[]}}