{"title":"FSX - Iris Simulations T-6 Texan II Advanced","uid":4973073,"size":87456466,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2045ac41ef947c05b8c774dfc88a9623660b430c&amp;dn=FSX+-+Iris+Simulations+T-6+Texan+II+Advanced&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Squawk1200","files":-1,"time":1245867182,"description":"The T-6 Texan II Pro Series Advanced for Flight Simulator X only.\n------------------------------------------------------------------------------\n\n&quot;The IRIS Pro Series T-6/A Texan II Advanced is the 'top of the line' T-6 product. In conjunction with the team at Virtual Flight Academy and FSX Blue Angels, we have produced a new updated version of our FIRST IRIS Pro Series product.\n\nThe IRIS Pro Series T-6/A Texan II defined a new quality of product being developed here at IRIS. The last two years have seen a great deal of growth in the way we build products, as well as the systems and capabilities we can offer. The T-6/A Texan II Advanced is the culmination of those advances, and an aircraft we're so very proud of and confident in.\n\nAs a testament to our confidence in this product, we're also proud to announce that it is part of a possible training initiative being presented to the U.S. Air Force Academy in Colorado Springs by the team at Virtual Flight Academy.\n\nThe improvements over the existing T-6/A Texan II are as follows;\n\n- New and significantly improved flight model (included as part of SP2).\n- New Gauges with more commonality between submodes on the EHSI and EADI, along with working NACWS in FSX (included as part of SP2).\n- Updated Soundpack from Turbine Sound Studios.\n- New Virtual Cockpit Textures and brand new backlighting techniques for more a immersive night flight experience.\n- Due to popular demand, we have added a fictional autopilot feature to the rear seat with HDG, NAV and ALT hold functions.\n- New texture set with improved bump maps, specular maps and diffuse maps across all liveries.\n- Addition of four new texture schemes, USAF Academy, USN Multiplayer, VX-20 Delivery aircraft and 2010 TAW-6 Display schemes.\n- Addition of following advanced systems;\n\n\n- Realistic Engine. If you run the engine in excess of 93% Torque for more than 3 minutes, the engine becomes damaged and drops in power output. Continued running at greater than 60% torque for more than 90 seconds will then result in an engine failure and onboard fire.\n- Perishable Crew. Opening the cockpit in flight is bad in real life, in this version, the crew will die and the aircraft will spiral out of control if you do stupid things!\n- Ejection Seat. Pull the handle to pop out!\n- Simulated G-Force effects. With the OBOGS system on, the oxygen mask will force air in through the mask and you will audibly hear the pilot breathing hard under high G conditions.\n\n\n- More hidden objects linked to flight model entries! Now the pilot and instructor can be removed or inserted by adjusting the payload entries in the FSX payload manager screen. The Hellenic Air Force T-6/A Texan II NTA can also add or remove the fuel tanks by adjusting the required payload entries allowing for a more accurate flight model.\n\n- A full PDF Pilot Handbook.\n\n- Shockwave Light ready. 3D Lighting available for those with the Shockwave 3D Lights addon available from A2A Simulations.&quot; \n\n\n\nMore info here: &lt;a href=&quot;\nhttp://www.irissimulations.com/product-pro-t6a-advanced.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.irissimulations.com/product-pro-t6a-advanced.php&lt;/a&gt;\n\n\n-------------------------------------------------------------------------------\n\nThis is a standalone, executable installer and no other files or patches are required.  Includes all of the new SP2 updates plus the additional advanced feature set for the latest Texan II from Iris.   \n\nEnjoy!\n\n","torrent":{"xt":"urn:btih:2045ac41ef947c05b8c774dfc88a9623660b430c","amp;dn":"FSX+-+Iris+Simulations+T-6+Texan+II+Advanced","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2045ac41ef947c05b8c774dfc88a9623660b430c","infoHashBuffer":{"type":"Buffer","data":[32,69,172,65,239,148,124,5,184,199,116,223,200,138,150,35,102,11,67,12]},"announce":[],"urlList":[]}}