{"title":"Gnarls Barkley - St.Elsewhere","uid":3805011,"size":79532766,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20a759410489625ffdfcddfc4fe9d8f31dbe17cd&amp;dn=Gnarls+Barkley+-+St.Elsewhere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"marckos","files":16,"time":1189670508,"description":"Artist : Gnarls Barkley\nTitle : St.Elsewhere\nGenre : Rap\nSource : CD\nRipper : EAC 0.99pb (Secure mode)\nCodec : MP3\nEncoder : LAME 3.97\nCommand line : -h -v -b 192 -V 0 --vbr-new -m s\nBitrate : VBR ~250kbps\nMode : Stereo\nFrequency : 44100Hz\nTags : ID3v2.3 (With covers images)\nTeam : iPS\nWeb site :\nRelease Date : 09/13/2007\n\nReview by John Bush\n\nWho is Gnarls Barkley, and how did he ascend to the top of the British charts with a song that brings an eerie clarity to the cloud of mental illness? (Hint: It wasn&amp;#039;t just the fact that Britain began factoring download data into its chart equations.) If St. Elsewhere sounds like one of the best rap-based pop productions since the second Gorillaz album, then look no further than the common link, producer Danger Mouse. And if the vocal performances are twisted with the type of unbalanced wisdom not seen in pop music since Sly Stone (or at least OutKast), credit Cee-Lo Green, the former Goodie Mob seer/sage/freak. A pop album straight through, St. Elsewhere is as good as Danger Mouse&amp;#039;s two earlier landmarks (Gorillaz&amp;#039;s Demon Days and Danger Doom&amp;#039;s The Mouse and the Mask), but not because of any inherent similarities in the three records. The reasons for greatness here include DM&amp;#039;s uncommon facility for writing (or sampling) simple hooks that stick, his creation of productions that entertain but don&amp;#039;t detract from the main action, and his ability to coax a parade of enticing vocal performances from Green. The hit &quot;Crazy&quot; and the title track are perfect examples. Over detached backings, Green croons, growls, scats, and generally delivers fine neo-soul vocals while Danger Mouse blankets the tracks with choruses of disembodied harmonies and a well-placed string section or crackling organ to conjure an appropriately minor chord atmosphere. The focus on instability doesn&amp;#039;t end there -- paranoia, suicidal tendencies, and multiple personalities are all in the cards, and there&amp;#039;s also &quot;Necromancer&quot;: &quot;She was cool when I met her, but I think I like her better dead.&quot; Then, just to make sure listeners understand this is a concept album and not a message from a mind playing tricks on itself, they drop &quot;The Boogie Monster&quot; (although even the lyrics here can give pause: &quot;I used to wonder why he looked familiar, and then I realized it was a mirror&quot;). With the help of Danger Mouse&amp;#039;s platinum ear and intricate vocal productions, Green is revealed as a top-notch post-millennial soul singer. Even when he&amp;#039;s floating another mass of wise, serene gibberish, DM simply drops another production trick to keep things tight. Much like DJ Shadow&amp;#039;s Private Press, Danger Mouse relies on samples from the downcast end of obscure &amp;#039;60s pop -- prog, psych, and Italian soundtrack music (his most valuable lieutenant here, Daniele Luppi, has the requisite Italian connection). Although Gnarls Barkley topping the charts was a slight fluke, the excellence of St. Elsewhere could have been seen coming a mile away.","torrent":{"xt":"urn:btih:20a759410489625ffdfcddfc4fe9d8f31dbe17cd","amp;dn":"Gnarls+Barkley+-+St.Elsewhere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a759410489625ffdfcddfc4fe9d8f31dbe17cd","infoHashBuffer":{"type":"Buffer","data":[32,167,89,65,4,137,98,95,253,252,221,252,79,233,216,243,29,190,23,205]},"announce":[],"urlList":[]}}