{"title":"Sculptress of Sound The Lost Works of Delia Derbyshire - Docu -","uid":5473033,"size":54116508,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:20b58471d2b25d63ded890a1ef1b7bb53ecba5d7&amp;dn=Sculptress+of+Sound+The+Lost+Works+of+Delia+Derbyshire+-+Docu+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Misk1974","files":-1,"time":1269984088,"description":"Sculptress of Sound: The Lost Works of Delia Derbyshire\n\nArchive on 4\n\n27-03-2010 - 20.00\n\n\nThe broadcaster and Doctor Who fan MATTHEW SWEET travels to The University of Manchester - home of Delia Derbyshire's private collection of audio recordings - to learn more about the wider career and working methods of the woman who realised Ron Grainer's original theme to Doctor Who.\n\nDelia's collection of tapes was, until recently, in the safekeeping of MARK AYRES, \narchivist for the BBC Radiophonic Workshop. Matthew meets up at Manchester University with Mark, along with Delia's former colleagues from the BBC Radiophonic Workshop, BRIAN HODGSON and DICK MILLS - plus former 'White Noise' band member DAVID VORHAUS - to hear extracts from the archive, discuss their memories of Delia and the creative process behind some of her material.\n\nHer realisation of the Doctor Who theme is just one small example of her genius and we'll demonstrate how the music was originally created as well as hearing individual tracks from Delia's aborted 70's version. We'll also feature the make up tapes for her celebrated piece 'Blue Veils and Golden Sands', and hear Delia being interviewed on a previously 'lost' BBC recording from the 1960s.Matthew's journey of discovery will take in work with the influential poet Barry Bermange, as well as her 1971 piece marking the centenary of the Institution of Electrical Engineers.\n\nThis Archive on 4 is brought up to date with an individual track from 'The Dance' from the children's programme 'Noah'. Recorded in the late 1960s this remarkable tape sounds like a contemporary dance track which wouldn't be out of place in today's most 'happening' trance clubs.\n\nProducer: Phil Collinge.\n\n\nFile Type - MPEG 1 Layer 3\nBit Rate - 128kbps\nFrenquency - 44100hz\nEncoder - Lame 3.986\nChannels - Stereo \nLength - 56.22\nSource - Radio Downloader","torrent":{"xt":"urn:btih:20b58471d2b25d63ded890a1ef1b7bb53ecba5d7","amp;dn":"Sculptress+of+Sound+The+Lost+Works+of+Delia+Derbyshire+-+Docu+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20b58471d2b25d63ded890a1ef1b7bb53ecba5d7","infoHashBuffer":{"type":"Buffer","data":[32,181,132,113,210,178,93,99,222,216,144,161,239,27,123,181,62,203,165,215]},"announce":[],"urlList":[]}}