{"title":"Accelerating MATLAB with GPUs: A Primer with Examples","uid":9497210,"size":33220109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20edab5bd17a564c8e23b7fc4d7c975809b3a173&amp;dn=Accelerating+MATLAB+with+GPUs%3A+A+Primer+with+Examples&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MucGar","files":-1,"time":1390143800,"description":"Accelerating MATLAB with GPUs: A Primer with Examples\n\n\nEnglish | ISBN: 0124080804 | 2013 | 258 pages | PDF | 32 MB\n\nMany developers want to increase the speed of their MATLAB prototyping and algorithm development by leveraging the distributed parallelism of graphics processing units (GPUs), but lack the necessary experience in C coding or computer architecture. Accelerating MATLAB with GPUs offers a primer on using these technologies together. Starting with the basics, setting up MATLAB for CUDA (in Windows, Linux and Mac OS X), and profiling, it then guides users through advanced topics such as CUDA libraries. The authors share their experience developing algorithms using MATLAB, C++ and GPUs for huge datasets, modifying MATLAB codes to better utilize the computational power of GPUs, and integrating them into commercial software products. Throughout the book, they demonstrate many example codes that can be used as templates of C-MEX and CUDA codes for readers' projects. * Shows how to accelerate MATLAB codes through the GPU for parallel processing, with minimal hardware knowledge* Explains the related background on hardware, architecture and programming for ease of use* Provides simple worked examples of MATLAB and CUDA C codes as well as templates that can be reused in real-world projects\n\n\n","torrent":{"xt":"urn:btih:20edab5bd17a564c8e23b7fc4d7c975809b3a173","amp;dn":"Accelerating+MATLAB+with+GPUs%3A+A+Primer+with+Examples","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20edab5bd17a564c8e23b7fc4d7c975809b3a173","infoHashBuffer":{"type":"Buffer","data":[32,237,171,91,209,122,86,76,142,35,183,252,77,124,151,88,9,179,161,115]},"announce":[],"urlList":[]}}