{"title":"Business Ethics For Dummies (2011)","uid":6775582,"size":3261213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2132eeb3bf1ac383025ced64796b487d451bfdb4&amp;dn=Business+Ethics+For+Dummies+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":2,"time":1319720689,"description":"The tools you need to deal with ethical dilemmas in business In today's world, it's increasingly important for all businesses and government agencies to implement ethical conduct in the workplace. Therefore, business ethics has become required coursework for most students in undergraduate and postgraduate business programs. Mapping to a business ethics course, Business Ethics For Dummies examines ethical theory and discusses the moral issues facing corporate America. It covers topics such as conflicts of interest, trade secrets and insider trading, product safety and product liability, hiring, drug testing, sexual harassment, diversity, and much more. The basics of ethics and making ethical decisions How-tos on incorporating business ethics in the workplace A discussion of moral issues facing corporate America Packed with easy-to-understand explanations and examples, Business Ethics For Dummies is a helpful resource for students, professors, business owners, managers, and CEOs who seek a clear understanding of the importance of ethics.\n\nWiley 2011\n388 pp","torrent":{"xt":"urn:btih:2132eeb3bf1ac383025ced64796b487d451bfdb4","amp;dn":"Business+Ethics+For+Dummies+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2132eeb3bf1ac383025ced64796b487d451bfdb4","infoHashBuffer":{"type":"Buffer","data":[33,50,238,179,191,26,195,131,2,92,237,100,121,107,72,125,69,27,253,180]},"announce":[],"urlList":[]}}