{"title":"Dr Harry Henshaw Power of the Moment Stress Management Program","uid":11967210,"size":119866581,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:21429de151c33ce557d303d5344c81bd48c0af05&amp;dn=Dr+Harry+Henshaw+Power+of+the+Moment+Stress+Management+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"elessedilgirl","files":4,"time":1432736424,"description":"1. Stress Reduction Exercise (31:28)\n2. Stress Reduction Affirmations (36:48)\n3. Stress Reduction Music (31:28)\n\nStress is a major factor in the development of many disorders that plague human beings. Low levels of stress are apart of life and can even be motivational in nature. Higher levels of stress on the other hand can actually be very harmful, leading to chronic disease. The disorders that we can experience as a direct result of high levels of stress can be both physical and emotional in nature. High levels of stress can raise blood pressure, impair the immune system, increase the risk of heart attack and stroke, even speed up the aging process. Prolonged stress can even leave a person more vulnerable to anxiety and depression.\n\nThere are many ways to effectively reduce the high levels of stress that we experience. One way to reduce stress on your system would be to alter your diet, to eat properly. Another possibility would be to create an exercise plan for yourself. In some cases an individual must give up something to reduce the experience of stress, to eliminate certain living situations, circumstances and situations, harmful relationships, for example, that the person is continually creating. Counselling can sometimes help a person to reduce the stress that he or she is experiencing. Another very effective manner in which stress can be reduced is through the use of guided imagery.\n\nGuided imagery is a hypnotic technique designed to help an individual produce a change in his or her life by following the suggestions of another person. Guided imagery can be utilized to help a person reduce weight, stop smoking, improve hypertension, manage pain and promote physical and emotional healing. Guided imagery can also be used to assist a person in reducing the high levels of stress that he or she experiences on a daily basis. Another very effective way to reduce stress is through the use of therapeutic relaxation music. Therapeutic Relaxation Music is a unique type of music designed primarily to create a relaxed and harmonious state in the individual. Therapeutic relaxation music is specially designed musical compositions that produce a very deep and profound sense of relaxation in the individual. Combined with binaural audio tones within the theta and delta range therapeutic relaxation music will create an audio environment that will greatly enhanced the effectiveness of the message or suggestions being given for change through guided imagery exercises. Combined with therapeutic relaxation music, positive affirmations can also be utilized to help a person reduce stress and create a harmonious way of being.\n\nThe stress management program, The Power of the Moment, that Dr. Harry Henshaw has created combines a guided imagery exercise, positive affirmations and the power of therapeutic relaxation music to help a person reduce and manage stress. This program has three tracks. The first track is a guided imagery exercise that is designed to teach a particular technique for reducing stress and assisting a person in becoming very grounded in the moment, in the present. Track One combines a guided imagery exercise, positive affirmations and therapeutic relaxation music. The second track uses positive affirmations designed to help you relax and therapeutic relaxation music to create a harmonious way of being. The third track is therapeutic relaxation music only, giving the individual the opportunity to practice the guided imagery relaxation technique or the positive affirmations.\n\nThe Power of the Moment first teaches a person the importance of his or her breath. As we know, ones breath is the key to ones ability to relax and reduce stress, to live fully in the moment or present. The initial part of the guided imagery is designed to help a person learn how to breath appropriately and as a result obtain a very profound state of relaxation. The focus of the second part of the guided imagery is to assist a person in grounding themselves in the present, in the moment. Utilizing a chair as the point of focus or power, the second part of the guided imagery helps a person to come fully into the moment, the present, the Now and as a result obtain true serenity and peace, an even more profound state of relaxation.\n\nSuggestions for effectively utilizing this program:\n\n1. For best result always use high quality headphones. The technology of the program is only fully utilized with the use of headphones.\n2. Find a place and time where you will be alone, for approximately thirty minutes, free from distractions and interruptions.\n3. Use the Guided Imagery program (Track One) once a day, in the mornings preferably.\n4. Use Track Two once a day, preferably before you sleep.\n5. Remember to practice grounding yourself throughout the day. The goal is to utilize the technique in your daily life.\n6. Remember also that the change process takes time, work and commitment.\n7. Be patient and persistence! Perseverance is the key!\n\nThe Holistic Healing Programs are designed to help you improve the quality of your life. All of our programs have been developed by Dr. Harry Henshaw and utilize three therapeutic components: guided imagery, positive affirmations and therapeutic relaxation music. Each program has three tracks. The first track contains the guided imagery exercise designed to teach a specific technique. The second track contains positive affirmations which have been chosen to support and reinforce the learning from the guided imagery exercise on track one. Track three contains Dr Henshaw's therapeutic relaxation music only, the purpose of which is to give a person the opportunity to practice the particular exercise taught in Track one.\n\nMP3 - 160 kbps - CBR","torrent":{"xt":"urn:btih:21429de151c33ce557d303d5344c81bd48c0af05","amp;dn":"Dr+Harry+Henshaw+Power+of+the+Moment+Stress+Management+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21429de151c33ce557d303d5344c81bd48c0af05","infoHashBuffer":{"type":"Buffer","data":[33,66,157,225,81,195,60,229,87,211,3,213,52,76,129,189,72,192,175,5]},"announce":[],"urlList":[]}}