{"title":"Joshua Knobe, Shaun Nichols - Experimental Philosophy [2008][A]","uid":10215556,"size":1027985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2148013e026e4e113279d6091160e9f25f0b5c2b&amp;dn=Joshua+Knobe%2C+Shaun+Nichols+-+Experimental+Philosophy+%5B2008%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":-1,"time":1400958746,"description":"Description\nProduct Details\nBook Title: Experimental Philosophy\nBook Author: Joshua Knobe, Shaun Nichols\nHardcover: 256 pages\nPublisher: Oxford University Press (July 15, 2008)\nLanguage: English\nISBN-10: 0195323254\nISBN-13: 978-0195323252\n\n===================================================================================\nBook Description\nPublication Date: July 15, 2008 | ISBN-10: 0195323254 | ISBN-13: 978-0195323252\nExperimental philosophy is a new movement that seeks to return the discipline of philosophy to a focus on questions about how people actually think and feel. Departing from a long-standing tradition, experimental philosophers go out and conduct systematic experiments to reach a better understanding of people's ordinary intuitions about philosophically significant questions. Although the movement is only a few years old, it has already sparked an explosion of new research, challenging a number of cherished assumptions in both philosophy and cognitive science.\nThe present volume provides an introduction to the major themes of work in experimental philosophy, bringing together some of the most influential articles in the field along with a collection of new papers that explore the theoretical significance of this new research.\n\n===================================================================================\nReviews\n&quot;Experimental Philosophy, edited by Joshua Knobe and Shaun Nichols, two of its foremost practitioners, provides an admirable introduction to the experimental philosophy movement.&quot;--Richard Holton, Times Literary Supplement\n\n&quot;The experimental philosophy movement is certainly one of the most exciting developments in contemporary philosophy, and this volume is the perfect introduction to its methods, concerns and key thinkers.&quot;--Neil Levy, Metapsychology Online Reviews\n\n&quot;Many philosophical questions are about human concepts. But the diversity of the philosophers' intuitions suggests that our intuitive access to concepts is far from reliable. So why not explore human intuition experimentally by studying the intuition of our fellow humans? This sane and productive idea has been the impetus for the new experimental philosophy; and this book brings some of the best of that work--including some important reflections on the questions of method it raises-together. Anyone who is interested in what is going on in philosophy now should read this stuff.&quot;--Kwame Anthony Appiah, Department of Philosophy, Princeton University\n\n&quot;In the good old days, science and philosophy were one, and philosophers were the leading scientists of their day. Then philosophers took to admiring science from a distance, and philosophy became, for scientists, a distant memory of sophomore year. But the good old days are coming back, and this volume heralds their arrival. Philosophers are once again discovering interesting things about the human mind, and scientists are once again discovering philosophy. Read this book, and find out what the buzz is about.&quot;--Joshua Greene, Department of Psychology, Harvard University\n\n&quot;Experimental philosophy is one of the most exciting and controversial developments in philosophy in recent years. Whether it undermines or extends the methods of traditional philosophy, it raises questions that go to the heart of philosophical inquiry. This book collects many key experimental studies and theoretical analyses, bringing the reader to the leading edge of the current debate.&quot;--David Chalmers, Department of Philosophy, Australian National University\n\n===================================================================================\nAbout the Author\nJoshua Knobe is assistant professor in the philosophy department at the University of North Carolina - Chapel Hill. He has published widely in both psychology (Journal of Personality and Social Psychology, Psychological Science) and philosophy (Nous, Analysis).\nShaun Nichols is in the Philosophy Department and Cognitive Science Program at the University of Arizona. He is the author of Sentimental Rules (OUP) and co-author (with Stephen Stich) of Mindreading.\n===================================================================================","torrent":{"xt":"urn:btih:2148013e026e4e113279d6091160e9f25f0b5c2b","amp;dn":"Joshua+Knobe%2C+Shaun+Nichols+-+Experimental+Philosophy+%5B2008%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2148013e026e4e113279d6091160e9f25f0b5c2b","infoHashBuffer":{"type":"Buffer","data":[33,72,1,62,2,110,78,17,50,121,214,9,17,96,233,242,95,11,92,43]},"announce":[],"urlList":[]}}