{"title":"A Short History of Modern Philosophy by Roger Scruton (2001) ","uid":10392363,"size":6105173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:216a7e9c86743800b4d8d1c3b061ed27f355b3bd&amp;dn=A+Short+History+of+Modern+Philosophy+by+Roger+Scruton+%282001%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1403209270,"description":"Title: A Short History of Modern Philosophy - From Descartes to Wittgenstein\nAuthor: Roger Scruton\nCategory: Academic\nSeries: Routledge Classics\nPublisher: Routledge; 2 edition (October 19, 2001)\nLanguage: English\nISBN-10: 0415267625\nISBN-13: 978-0415267625\n\nPromotional info/Publisher's summary - &quot;Discover for yourself the pleasures of philosophy! Written both for the seasoned student of philosophy as well as the general reader, the renowned writer Roger Scruton provides a survey of modern philosophy. Always engaging, Scruton takes us on a fascinating tour of the subject, from founding father Descartes to the most important and famous philosopher of the twentieth century, Ludwig Wittgenstein. He identifies all the principal figures as well as outlines of the main intellectual preoccupations that have informed western philosophy. Painting a portrait of modern philosophy that is vivid and animated, Scruton introduces us to some of the greatest philosophical problems invented in this period and pursued ever since. Including material on recent debates, A Short History of Modern Philosophy is already established as the classic introduction. Read it and find out why.&quot;\n\nThis is a well-reviewed and highly respected summation of several major branches of philosophical thought. Well worth reading as a primer or intermediate exploration into philosophy and significant concepts and thinkers within the field.\n\nThe torrent folder contains the original retail quality EPUB as well as conversions into MOBI, LIT, AZW3 and large print PDF formats done in Calibre. The front cover image and generated metadata.opf are also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;\n","torrent":{"xt":"urn:btih:216a7e9c86743800b4d8d1c3b061ed27f355b3bd","amp;dn":"A+Short+History+of+Modern+Philosophy+by+Roger+Scruton+%282001%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"216a7e9c86743800b4d8d1c3b061ed27f355b3bd","infoHashBuffer":{"type":"Buffer","data":[33,106,126,156,134,116,56,0,180,216,209,195,176,97,237,39,243,85,179,189]},"announce":[],"urlList":[]}}