{"title":"Lastics A Stretch Workout Like No Other with Donna Flagg x264 aa","uid":11810027,"size":946204375,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:216e26b96303a0a373d4ee4f6ad73dc5f6ed6fea&amp;dn=Lastics+A+Stretch+Workout+Like+No+Other+with+Donna+Flagg+x264+aa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"MANTESH","files":2,"time":1428736677,"description":"\n\nLastics is a technique born directly from the world of dance that will give you a stretch workout like no other, and also change the way you think about, and understand, your body. Lastics was designed by Donna Flagg, a trained dancer, to give people of all ages, body types, and fitness levels a way to improve their flexibility based on techniques dancers use to stay lean and limber. Improved flexibility results from articulating your body in ways that isolate the ends of your muscles to gently pull them in opposite directions. Unlike methods that rely on external force to push a stretch, Lastics trains your body to move internally to stretch itself. That is how dancers move the way they do and also the key to their flexibility. They move from the inside first. This is what makes Lastics so different and it is a difference you will feel immediately. In this hour-long DVD, a full body workout is broken down into four series that target specific parts of the body crucial to creating an effective and meaningful stretch. Also, included is a special segment dedicated to the most common mistakes and how you can correct them. You will move, perform and feel better with muscles that are longer, stronger, more supple and healthy from the inside-out and from end-to-end.\n\nVideo; x264; 720*480 (16:9); 1744 kbps; 23.976 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:216e26b96303a0a373d4ee4f6ad73dc5f6ed6fea","amp;dn":"Lastics+A+Stretch+Workout+Like+No+Other+with+Donna+Flagg+x264+aa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"216e26b96303a0a373d4ee4f6ad73dc5f6ed6fea","infoHashBuffer":{"type":"Buffer","data":[33,110,38,185,99,3,160,163,115,212,238,79,106,215,61,197,246,237,111,234]},"announce":[],"urlList":[]}}