{"title":"Essential Oils and Aromatherapy ebook by Gregory White","uid":12135873,"size":909284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:217b4b2370a8fef5571989df65a0ad820198663b&amp;dn=Essential+Oils+and+Aromatherapy+ebook+by+Gregory+White&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KiwiSue49","files":2,"time":1437175915,"description":"\nTHANK YOU FOR DOWNLOADING AND SEEDING THIS TORRENT\n\n\nTitle:\nESSENTIAL OILS AND AROMATHERAPY: How to Use Essential Oils for Beauty, Health, and Spirituality by Gregory Lee White\n\n\nDescription:\nEssential Oils and Aromatherapy: How to Use Essential Oils for Beauty, Health, and Spirituality is written in a personable and easy to understand style and covers all of the important aspects of aromatherapy and essential oils. Reads like a conversation instead of a text book. Authored by a professional aromatherapist, it includes the history of aromatherapy, how to use the oils, the chemistry of essential oils, how to create a balanced blend, how essential oils are made, the carrier oils used in blends, scent notes, a few questionable aspects of the industry, recipes to get you started, and a complete encyclopedia of the top fifty-five oils. \n\nThe essential oil guide (encyclopedia) covers fifty-five of the most-used essential oils with detailed information about each oil including: botanical name, aromatic profile, origin, perfumery note, extraction method, description of the essential oil, safety warnings, and each oils uses and benefits for the mind, the body, and the spirit. \n\nAdded bonus rarely found in essential oils books: step by step directions showing how a professional aromatherapist creates a blend for a client based on their ailments, symptoms, medical history, emotions, and personal preferences. Sample Case Study included.\n\nProduct Details:\nFile size:  epub 403 Kb, mobi 486 Kb\nPublisher: White Willow Books\nISBN: 0615858104\nISBN-13: 978-0615858104\nLanguage: English","torrent":{"xt":"urn:btih:217b4b2370a8fef5571989df65a0ad820198663b","amp;dn":"Essential+Oils+and+Aromatherapy+ebook+by+Gregory+White","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217b4b2370a8fef5571989df65a0ad820198663b","infoHashBuffer":{"type":"Buffer","data":[33,123,75,35,112,168,254,245,87,25,137,223,101,160,173,130,1,152,102,59]},"announce":[],"urlList":[]}}