{"title":"Chinese and Related North American Herbs:  Therapeutic Values","uid":8520087,"size":3400971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21e4548865d7af8d2b8eef30063b7cb711eeef6b&amp;dn=Chinese+and+Related+North+American+Herbs%3A++Therapeutic+Values&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1369889963,"description":"\nThomas S. C. Li - Chinese and Related North American Herbs: Phytopharmacology and Therapeutic Values (2nd Edition)\nPublished: 2009-10-30 | ISBN: 1420094157 | PDF | 718 pages | 3 MB\n\n\nHailed as a seminal work and considered the most complete compendium of Chinese herbs available, the first edition of Chinese and Related North American Herbs: Phytopharmacology and Therapeutic Values brought new and hard to find information into a single, well-referenced resource. With the addition of 130 herbs and 100 new references, the second edition provides a basic understanding of the science behind Chinese herbal preparations.\nUsing the same format that made the first edition so popular, author Thomas Li provides a seamless integration of topics drawn from a diverse array of sources. The first table presents major constituents and therapeutic values of more than 1800 species. The data are arranged alphabetically by the Latin name followed by common Chinese and English names. Tables 2 and 3 present data on a total of 700 North American herbs belonging to the same species or genus as Chinese herbs, and a comparison of active ingredients and claimed therapeutic values. Appendices 1, 2, and 3 cross-reference Chinese and scientific names, and major active ingredients and their sources in the Chinese and North American herbs cited in the tables.\nResearch in Chinese medicinal herbs has been conducted for decades in China, Japan, and Korea and recently in the West. Unfortunately, language barriers and the unreliability of sources and herbal material have hampered progress. Carefully crafted and designed to provide easy access to key data, this book supplies information compiled from authentic and highly regarded sources scattered throughout the Chinese and Western literature. This information can then be used to develop proper procedures for eliminating adulteration, contamination, and toxic side effects in Chinese herbs, and also to determine appropriate regulations for their use.\n","torrent":{"xt":"urn:btih:21e4548865d7af8d2b8eef30063b7cb711eeef6b","amp;dn":"Chinese+and+Related+North+American+Herbs%3A++Therapeutic+Values","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e4548865d7af8d2b8eef30063b7cb711eeef6b","infoHashBuffer":{"type":"Buffer","data":[33,228,84,136,101,215,175,141,43,142,239,48,6,59,124,183,17,238,239,107]},"announce":[],"urlList":[]}}