{"title":"Renegade Hypnotist's Guide to Conditioning for Permanent Change","uid":7909451,"size":672109615,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2282abae9d0f3cac4ca83c6003305773fece10f4&amp;dn=Renegade+Hypnotist%27s+Guide+to+Conditioning+for+Permanent+Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"acer47x","files":11,"time":1355176369,"description":"I had promised to teach something about Awakening Within the Dream -- the process of growing a life where Awake and Aware is your default state.\n\nAnd it got me thinking about what people really need to know in order to help them make those changes turn into attributes - just a part of who we are.\n\nSo it's time to talk about making Change so compellingly real that it's impossible to resist - Change becomes irresistible!\nDetails:\nThis seminar is about teaching you the professional's secrets of hypnotic conditioning that results in permanent powerful and positive change -- change that lasts from the peak experience on throughout the rest of your life! Think about it this way -- the most common grumble we get from students is that even though they get their peak experiences at our live appearances, even though they've done the exercises over and over in the seminar room, the magick fades over time and they slip back into Who They Were. They don't understand the Laws of Conditioning, so their training never moves from event to process. If you've ever tasted what it's like to stand for that brief moment on The Next Level Up, only to slide back into complacency, you need this seminar. There's a way to approach your own conditioning process so that all of your hard-won gains become your reflexive responses in your Life! I'll give you the way to Have The Experience, and Keep The Change. It's time to Wake Up and Take Control of Your Mind! 13 DVDs.","torrent":{"xt":"urn:btih:2282abae9d0f3cac4ca83c6003305773fece10f4","amp;dn":"Renegade+Hypnotist%27s+Guide+to+Conditioning+for+Permanent+Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2282abae9d0f3cac4ca83c6003305773fece10f4","infoHashBuffer":{"type":"Buffer","data":[34,130,171,174,157,15,60,172,76,168,60,96,3,48,87,115,254,206,16,244]},"announce":[],"urlList":[]}}