{"title":"James Gleick - The Information and Faster - Ebooks","uid":7710307,"size":14531748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22a4b81075be830dbf5b46712c391a7e58914477&amp;dn=James+Gleick+-+The+Information+and+Faster+-+Ebooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"showpirateslove","files":-1,"time":1349791726,"description":"Two ebooks in Epub and Mobi format. \n\n-Book Descriptions-\n\nFaster (2000):\n\nMost of us suffer some degree of &quot;hurry sickness.&quot; a malady that has launched us into the &quot;epoch of the nanosecond,&quot; a need-everything-yesterday sphere dominated by cell phones, computers, faxes, and remote controls. Yet for all the hours, minutes, and even seconds being saved, we're still filling our days to the point that we have no time for such basic human activities as eating, sex, and relating to our families. Written with fresh insight and thorough research, Faster is a wise and witty look at a hurried world not likely to slow down anytime soon.  \n\nThe Information (2011):\n\nThe story of information begins in a time profoundly unlike our own, when every thought and utterance vanishes as soon as it is born. From the invention of scripts and alphabets to the long-misunderstood talking drums of Africa, Gleick tells the story of information technologies that changed the very nature of human consciousness. He provides portraits of the key figures contributing to the inexorable development of our modern understanding of information: Charles Babbage, the idiosyncratic inventor of the first great mechanical computer; Ada Byron, the brilliant and doomed daughter of the poet, who became the first true programmer; pivotal figures like Samuel Morse and Alan Turing; and Claude Shannon, the creator of information theory itself.\n\n-Bio on James Gleick-\n\nJames Gleick was born in New York and began his career in journalism, working as an editor and reporter for the New York Times. He covered science and technology there, chronicling the rise of the Internet as the Fast Forward columnist, and in 1993 founded an Internet startup company called The Pipeline. His books have been translated into more than twenty-five languages.","torrent":{"xt":"urn:btih:22a4b81075be830dbf5b46712c391a7e58914477","amp;dn":"James+Gleick+-+The+Information+and+Faster+-+Ebooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a4b81075be830dbf5b46712c391a7e58914477","infoHashBuffer":{"type":"Buffer","data":[34,164,184,16,117,190,131,13,191,91,70,113,44,57,26,126,88,145,68,119]},"announce":[],"urlList":[]}}