{"title":"Juno Reactor - Complete Discography (1992-2004) (192kbps)","uid":3395960,"size":1510570837,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22d3f147c403d833a253a5716a1ac112ff93b28f&amp;dn=Juno+Reactor+-+Complete+Discography+%281992-2004%29+%28192kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"D_H_A","files":278,"time":1129212151,"description":"JUNO REACTOR - COMPLETE DISCOGRAPHY (1992-2004) (Electronic) (192kbps)\n7 albums + live, 13 singles &amp; 27 remixes\n\n\n\nJuno Reactor - Biography\n\nAlthough Juno Reactor's personnel has been in a continual state of flux over the course of their five albums and eleven years one constant is pivotal member BEN WATKINS.\nSince the early 80's Ben has been at the centre of numerous electronic musical projects that have pushed ahead of populist trends. As far back as 1983 he released a couple of albums with YOUTH as THE EMPTY QUARTER. One was recorded and mixed in two days, the other in five.\n\nAs THE FLOWERPOT MEN he had a series of indie hits such as 'JO's SO MEAN TO JOSEPHINE' and 'WALK ON GUILDED SPLINTERS'. The duo's combined influences produced a sound that drew comparisons to German pioneers DAF as well as 70's New York punk anarchists SUICIDE.\n\nA name change to SUNSONIC heralded their signing to Polydor and the subsequent 'MELTING DOWN ON MOTOR ANGEL' album of 1990. By the time the Sunsonic relationship dissolved the following year Ben was already working on a variety of parallel experimental projects driven by his increasing fascination with the new influx of technology and studio trickery.\n\nA series of temporary alliances followed, resulting in a flurry of releases under various pseudonyms. With Frenchman STEFAN HOLWECK he became ELECROTETE, releasing 'I LOVE YOU' for APOLLO, the off-shoot of seminal Belgian label R&amp;S Records. The PSYCHO SLAP HEAD project was issued by American label TVT and Ben was also part of APOLLO XI, alongside THE ORB's ALEX PATERSON who recorded the 'PEACE (IN THE MIDDLE EAST)' track for Mr.Modo during the Gulf war.\n\nBy 1992 Logic had issued 'JUNGLE HIGH' followed by JUNGLE HIGH &amp; BLUE PEARL's 'FIRE OF LOVE'. The 'Jungle High' single later re-appeared on the PERFECTO label in 1996, complete with an OAKENFOLD remix and credited to Juno Reactor. Another collaboration with TONY THORPE resulted in the URBAN JUNGLE PROJECT and a sound that was one of the earliest examples of Drum &amp; Bass.\n\nOut of all this feverish activity Juno Reactor somehow emerged, initially as an experimental ambient soundtrack, recorded live by Ben &amp; Holweck to accompany a sculptural art installation and performance project by artist Norma Fletcher entitled 'THE MISSILE PROJECT'. The track was eventually released as 'LUCIANA', the second Juno Reactor album, on Alex Paterson's INTER-MODO label.\n\nIn the meantime, the 'LAUGHING GAS' single had appeared on the NOVAMUTE label along with the debut 'TRANSMISSIONS' album. Juno's sound is in a continual state of evolution, always moving ahead of the pack. In the early 90's, long before it was hip or hyped, they'd forged their sound from the trance vibe going off in Goa.\n\nJuno, unwilling to stagnate in a spiral of repetition and predictability, had moved on by beginning to incorporate more live elements and 'real' musicians. A move to BLUE ROOM resulted in 1995's 'GUARDIAN ANGEL' single and 'BEYOND THE INFINITE' album, still displaying heavy trance influences, yet pushing away from the purist attitude by employing more varied elements including break beats.\n\nBy the 'BIBLE OF DREAMS' album of 1997, Juno had moved dynamically away from the ebb and flow of that previous rambling 'musical journey' style towards a much more punchy and focused sound. Ben came into contact with traditional South African percussion act AMAMPONDO ( Nelson Mandela's favorite band) and with conga player MABI THOBEJANE co-wrote 'CONGA FURY' which was released as a single, to great acclaim.\nBen and Amampondo embarked upon a 5 week tour of the U.S as support act to MOBY. Realising that a change of show was needed for the American audience, the Juno Reactor live show switched from the standard dark, sombre set to a visually spectacular show with Ben providing the techno and playing cock rocking guitar riffs while Amampondo, clad in body paint and full costume wowed the crowds with circus acrobatics while beating out their percussion rhythms. This wasn't a cliched case of 'ethnic' vocal wails over driving techno beats but instead a genuine collision of diverse musical cultures feeding from each other to provide a unique live experience. The idea of DJ domination and and shadowy figures hunched over mixing desks was blown away in favor of something more akin to theatre, an inspirational subversion of the techno principle.\n\nAs well as his own original productions, Ben has also remixed artists such as DEVO, TALKING HEADS, FATIMA MANSIONS, SIOUXIE &amp; THE BANSHEES and KILLING JOKE as well as composing and producing four tracks for former porn star TRACI LORDS' debut album '1000 Fires'.\n\nHis dramatic instrumental versions have all since appeared on film soundtracks for punchy action movies like 'MORTAL KOMBAT', 'VIRTUOSITY', 'ERASER', 'LOST IN SPACE' (with Siouxsie Sue) and the trailers for 'ROMEO &amp; JULIET', 'TOMB RAIDER' &amp; the forthcoming Robert Rodrigez film 'ONCE UPON A TIME IN MEXICO'.\n\nBen has also composed the score for the forthcoming movie 'BEOWULF' starring Christopher Lambert and provided three new tracks to Playstation's Jet Moto 2 game as well as the entire score to 'MARK OF KRI'.\n\nThe fifth Juno Reactor album, entitled 'Shango' and named after a Nigerian God of Thunder was released in 2000. The first single to be taken from the album is 'PISTOLERO'. A collaboration with Billy Idol's guitarist Steve Stevens. Juno Reactor toured North America twice in support of this album as well as a number of dates in Japan including two shows at the Fuji Rock Festival in 2001. The sold out shows at the Tokyo Akaska Blitz were also filmed and released on DVD, 'Shango Live'.\n\nIn early 2002 he recorded a new single Hotaka at a studio overlooking Mt Fuji featuring the exciting Taiko drums of Gocoo. This track was included on the 'Odyssey' best of album which was released last year on Universal / Island in Japan.\n\nHe is currently holed up in Brighton, England at his studio finishing the next Juno album after spending the first two months of 2003 in Los Angeles working on the new Matrix film 'Reloaded' to which he wrote four scenes.\n\n\n\nDiscography:\n\n\nAlbums:\n(1993)\tTransmissions\n(1994)\tLuciana\n(1995)\tBeyond The Infinite\n(1997)\tBible Of Dreams\n(2000)\tShango\n(2002)\tOdyssey 1992-2002\n(2004)\tLabyrinth\n\n\nLive:\n(2002) Shango Tour 2001 Tokyo (Live In Tokyo)\n\n\nSingles:\n(1993)\tLaughing Gas\n(1994)\tHigh Energy Protons\n(1995)\tGuardian Angel\n(1996)\tSamurai\n(1996)\tConga Fury\n(1997)\tJungle High\n(1997)\tGod Is God\n(1997)\tGod Is God (Front 242 Mixes)\n(2000)\tPistolero\n(2001)\tMasters Of The Universe\n(2002)\tHotaka\n(2003)\tZwara\n\n\nRemixes &amp; Music Production 1993-2003:\n(this aren't all remixes, few missing)\n\nAna Voog - Hollywood (Juno Reactor 7&quot; Mix)\nAnne Clark - Wallies (Night Of The Hunter Remix by Juno Reactor)\nDevo - Whip It (HMS &amp; M Mix)\nFatima Mansion's - The Loyaliser (JR Vocal Mix)\nGravity Kills - Guilty (Juno Reactor Instrumental)\nGravity Kills - Guilty (Juno Reactor Remix)\nJuno Reactor - Alash (When I Graze My Beautiful Sheep)\nJuno Reactor - Conga Fury (Animatrix Mix)\nJuno Reactor - Jardin De Cecile (Man With No Name Remix)\nJuno Reactor &amp; Creatures - I&amp;acute;m Here... Another Planet\nJuno Reactor &amp; Don Davis - Mona Lisa Overdrive\nJuno Reactor &amp; Don Davis - Tetsujin\nJuno Reactor &amp; Don Davis - The Trainman Cometh\nJuno Reactor vs. Don Davis - Burly Brawl\nKilling Joke - Millenium (Back To Orion Mix)\nLaibach - Final Countdown (Juno Reactor Remix)\nSiouxsie &amp; The Banshees - Stargazer (Mambo Sun Remix)\nSiouxsie &amp; The Banshees - Stargazer (Planet Queen Mix)\nSkold - Anything (Dominatrix Mix)\nSunkings - Starbuck (Juno Reactor Remix)\nTraci Lords - Control\nTraci Lords - Control (Juno Reactor Instrumental)\nTraci Lords - Fallen Angel\nTraci Lords - Fallen Angel (P. Oakenfold Mix)\nTraci Lords - Fallen Angel (Perfecto Mix)\nTraci Lords - Good-N-Evil\nTraci Lords - Outlaw Lover\n\n\nTrack &quot;Teahouse&quot; from Matrix Reloaded is on Zwara EP and track &quot;Navras&quot; from Matrix Revolutions is on Labyrinth album. &quot;Biot Messiah&quot; is also known as &quot;The Journey Kontinues&quot; on Mortal Kombat: More Kombat album and track named &quot;Labyrinth&quot; is also known as &quot;Inedith Special Gaia&quot; but the tracks are same. Track &quot;Dante&quot; from Enter The Matrix game is actually first 2 minutes and 20 seconds from &quot;Mona Lisa Overdrive&quot;.\n\n\nJuno Reactor - Transmissions (1993)\n\nReview\tby John Bush\n\nTransmissions leads off with Juno Reactor's biggest club hit to date, &quot;High Energy Protons,&quot; a curious track that translates three-chord heavy metal through some 303 acid with a few suitably trippy vocals. The rest of the album has more of the same, alternately spacy or psychedelic. It's occasionally reminiscent of the Orb's ambient-dub, especially on the astronaut-sampling &quot;Luna-Tic.&quot; \n\n01. High Energy Protons\t\t\t  6:32\n02. The Heavens\t\t\t\t  6:26\n03. Luna-tic\t\t\t\t  9:01\n04. Contact\t\t\t\t  5:53\n05. Acid Moon\t\t\t\t  8:38\n06. 10,000 Miles\t\t\t  5:54\n07. Laughing Gas\t\t\t  8:04\n08. Man To Ray\t\t\t\t  6:43\n09. Landing\t\t\t\t  8:42\n\nTOTAL TIME\t\t\t\t 65:53\n\n\n\nJuno Reactor - Luciana (1994)\n\nOut of all this feverish activity Juno Reactor somehow emerged, initially as an experimental ambient soundtrack, recorded live by Ben &amp; Holweck to accompany a sculptural art installation and performance project by artist Norma Fletcher entitled 'THE MISSILE PROJECT'. The track was eventually released as 'LUCIANA', the second Juno Reactor album, on Alex Paterson's INTER-MODO label.\n\n01. Luciana\t\t\t\t 61:32\n\nTOTAL TIME\t\t\t\t 61:32\n\n\n\nJuno Reactor - Beyond The Infinite (1995)\n\nReview\tby Dean Carlson\n\nWhether you believed Goa trance was the LSD-inspired wave of the future or just another bastardization of third-world culture, Juno Reactor has been plunging forward as if they don't care how close the genre could come to disaster. This might be a good time for the band to get a devil's advocate implanted inside their heads. Beyond the Infinite offers more of the east meets west dance sentiments thrown together in a surprisingly tiresome manner and its overall feeling of flipped-out exclusivity damages any of the band's mighty aspirations. &quot;Silver&quot; can have all the sitar friendliness to satisfy those prone to psychedelics, &quot;Magnetic&quot; nods along to the twirling excesses of an outdated pre-jungle beat, yet these efforts make the sober listener simply feel left out of a loop. It doesn't make things easier that the band has yet to choose which path to take. In &quot;Samurai,&quot; for example (the track used in promoting Arnold Schwarzenegger's Eraser), there is more of a Photek-like, oriental focus on techno-trance operations than ever before. Which is an interesting new attempt; even though it feels stilted, confused, and just an excuse to steal the keyboards from the Cure's &quot;A Forest.&quot; With its mystified sense of native adoration and tiring execution, Beyond the Infinite is an album signifying a band at a crossroads. They've now exposed about five musical directions to take, and it might take less (or more) drugs to show which path is the correct one. \n\n01. Guardian Angel\t\t\t  7:12\n02. Magnetic\t\t\t\t  8:18\n03. Ice Cube\t\t\t\t  7:02\n04. Feel The Universe\t\t\t  7:30\n05. Razorback\t\t\t\t  6:55\n06. Samurai\t\t\t\t  8:17\n07. Silver\t\t\t\t  6:35\n08. Rotorblade\t\t\t\t  8:19\n09. Mars\t\t\t\t  7:11\n\nTOTAL TIME\t\t\t\t 67:19\n\n\n\nJuno Reactor - Bible Of Dreams (1997)\n\nReview\tby Alex Henderson\n\nAll too often, techno recordings that sounded exciting in the clubs of the late '80s and early to late '90s didn't hold up well at home, where their limitations became quite obvious. Bible of Dreams, on the other hand, is interesting both on and off the dance floor. Instead of simply concerning itself with the number of beats per minute it can provide, Juno Reactor delivers trance to sit down and listen to. The mostly instrumental material (though with scattered soundbites and samples) is varied, and the group fuses trance with everything from Middle Eastern music (&quot;God Is God&quot;) to heavy metal (&quot;Swamp Thing&quot;). \n\n01. Jardin De Cecile\t\t\t  7:03\n02. Conga Fury\t\t\t\t  8:06\n03. God Is God\t\t\t\t  6:47\n04. Komit\t\t\t\t  8:12\n05. Swamp Thing\t\t\t\t  5:12\n06. Kaguya Hime\t\t\t\t  6:41\n07. Children Of The Night\t\t  7:57\n08. Shark\t\t\t\t  9:37\n09. High Energy Protons (Orion Mix)\t  6:28\n\nTOTAL TIME\t\t\t\t 66:03\n\n\n\nJuno Reactor - Shango (2000)\n\nReview\tby Steven E. McDonald\n\nGoodbye Goa, hello world. The members of Juno Reactor seem to have made a decision here as to what they wanted to do when they grew up, with the answer being, interestingly, Art of Noise for the 21st century coupled with atmospheric merging with world music elements from all over the planet. There are mammoth sounds at hand -- deep, dark moods, moments of widescreen cinema -- and much clever subtlety. With &quot;Pistolero&quot; alone -- a mad blend of samples, beats, effects, and flamenco guitar from Steve Stevens -- Juno Reactor has leapt away from the past and into a more imaginative future. The only question now is whether or not they can keep up this kind of growth, and whether that means continuing to work with live musicians or expanding their tonal and rhythmic space. Either way, Shango is a benchmark for the duo.\n\n01. Pistolero\t\t\t\t  6:13\n02. Hulelam\t\t\t\t  4:00\n03. Insects\t\t\t\t  6:18\n04. Badimo\t\t\t\t  7:14\n05. Masters Of The Universe\t\t  6:05\n06. Nitrogen Part 1\t\t\t  8:34\n07. Nitrogen Part 2\t\t\t  6:26\n08. Solaris\t\t\t\t  8:58\n09. Song For Ancestors\t\t\t  8:09\n\nTOTAL TIME\t\t\t\t 61:57\n\n\n\nJuno Reactor - Odyssey 1992-2002 (2002)\n\nReview\tby Rick Anderson\n\nSeveral things quickly become apparent when you sit down to listen to this ten-year retrospective of music by Juno Reactor. The first is that the group hit upon its formula early on and has, for the most part, stuck with it: a combination of industrial music's house-derived beats and dense synthesizers that generally eschews the oppressive Teutonic shouting and harsh textures that typify most industrial releases. In fact, Juno Reactor generally avoids homemade lyrics and vocals at all, instead spicing up the instrumental mix with found-sound commentary or prerecorded singers of various ethnic backgrounds. Easy listening it isn't, but the end result is a surprisingly pleasant and sometimes even soothing one. This program traces the band's evolution from its early years, during which its sound was just a bit generic and it seemed to be poking around a bit to find its identity (note early tracks like &quot;Laughing Gas&quot; and &quot;High Energy Protons,&quot; which are perfectly fine but not particular interesting), to its much more exciting current work, which includes the funny and funky &quot;Pistolero&quot; (featuring spaghetti Western sound effects and some very impressive nylon-string guitar playing) and the lovely &quot;Hotaka&quot; (featuring some equally impressive Tibetan throat singing). The album's finest track is smack in the middle of the program, though: It's a funked-up recording of a woman singing devotional Arabic music. Titled &quot;God Is Good,&quot; it provides a perfect centerpiece for what is, in the end, a very impressive look back on a great decade of music-making.\n\n01. High Energy Protons\t\t\t  6:32\n02. Laughing Gas\t\t\t  8:04\n03. Rotorblade\t\t\t\t  8:07\n04. Feel The Universe\t\t\t  7:27\n05. God Is God\t\t\t\t  6:47\n06. Conga Fury\t\t\t\t  8:07\n07. Komit\t\t\t\t  8:12\n08. Pistolero\t\t\t\t  6:13\n09. Hulelam\t\t\t\t  4:00\n10. Masters Of The Universe\t\t  6:05\n11. Hotaka\t\t\t\t  8:17\n\nTOTAL TIME\t\t\t\t 77:51\n\n\n\nJuno Reactor - Labyrinth (2004)\n\nReview\tby Joshua Glazer\n\nJuno Reactor are best known for their over the top cinematic trance epics utilized in equally overwrought action adventure films like The Matrix: Reloaded and The Matrix: Revolution, and the sweeping strings that open their sixth full-length album in just over a decade instigate a familiar rush for those who like their adventure administered with a fair amount of sci-fi/fantasy flair. But the warm-up of &quot;Conquistador I&quot; is so long, as it pulls back from digital orchestration to ethnic guitar meandering, that when the industrial-techno stomp of &quot;Conquistador II&quot; finally kicks in, it is almost jarring. It is also one of the few moments that Juno Reactor isn't kicking video game butt, as &quot;Giant&quot; hits even harder with Reece basslines pilfered from the darker side of jungle and &quot;War Dogs&quot; fully warps into an electronic metal band, albeit one with some kitchy world music leanings. This all-genre stomp of course finds its apex in &quot;Mona Lisa Overdrive&quot; and &quot;Navaras,&quot; the two tracks taken from the Matrix films, remixed here but still shameless in their cathartic orchestral epiphanies. Only the dirge of &quot;Angels and Men&quot; offers reprieve for an entire song, although blaze-and-smolder dynamics are one of the group's specialties throughout. Those who loved Juno Reactor for their hyperdrive psychedelic trance of yore may or may not appreciate this direction taken in earnest since 2000's Shango. But perhaps a new generation raised on Xbox adrenalin blasts can handle the shock'n'awe. \n\n01. Conquistador Part 1\t\t\t  6:03\n02. Conquistador Part 2\t\t\t  5:06\n03. Giant\t\t\t\t  4:00\n04. War Dogs\t\t\t\t  5:00\n05. Mona Lisa Overdrive v2\t\t  4:45\n06. Zwara\t\t\t\t  6:35\n07. Mutant Message\t\t\t  6:10\n08. Angels And Men\t\t\t  7:07\n09. Navras\t\t\t\t  9:06\n\nTOTAL TIME\t\t\t\t 53:52\n\n\n\nJuno Reactor - Shango Tour 2001 Tokyo (2002)\n\nAudio track taken from Juno Reactor - Live In Tokyo DVD.\n\n01. The Forest (Amampondo)\t\t  4:25\n02. Conga Fury\t\t\t\t  7:51\n03. Laughing Gas\t\t\t  7:09\n04. Komit\t\t\t\t  7:07\n05. Vocal And Drums (Amampondo)\t\t  2:41\n06. Feel The Universe\t\t\t  8:58\n07. God Is God\t\t\t\t  6:50\n08. Hulelam\t\t\t\t  4:24\n09. Pistolero\t\t\t\t  6:46\n10. Biot Messiah\t\t\t  8:40\n11. Stage Introduction (Amampondo)\t  3:26\n12. Insects\t\t\t\t  6:12\n13. Guardian Angel\t\t\t  5:43\n14. Masters Of The Universe\t\t  6:10\n15. Mars\t\t\t\t  6:34\n16. Drums For Tomorrow (Amampondo)\t  7:17\n\nTOTAL TIME\t\t\t\t100:13\n\n\n\n\nJuno Reactor - Laughing Gas (CDM) (1993)\n\n01. Laughing Gas\t\t\t\t 6:43\n02. Laughing Gas (On The Other Side Mix)\t 7:53\n03. Lullaby\t\t\t\t\t 4:59\n\nTOTAL TIME\t\t\t\t\t19:35\n\n\n\nJuno Reactor - High Energy Protons (CDM) (1994)\n\n01. High Energy Protons (Orion Mix)\t\t 6:29\n02. High Energy Protons (Voodoo People Mix)\t 7:20\n03. The Heavens (Monolith Mix)\t\t\t 7:01\n04. The Heavens (Vapour Mix)\t\t\t 7:00\n\nTOTAL TIME\t\t\t\t\t27:50\n\n\n\nJuno Reactor - Guardian Angel (EP) (1995)\n\n01. Guardian Angel\t\t\t\t 7:28\n02. Razorback\t\t\t\t\t 6:54\n\nTOTAL TIME\t\t\t\t\t14:22\n\n\n\nJuno Reactor - Samurai (EP) (1996)\n\n01. Samurai\t\t\t\t\t 8:18\n02. Samurai (Total Eclipse Remix)\t\t 5:12\n03. Feel The Universe (Kox Box Remix)\t\t 7:47\n04. Magnetic (Robert Liener Remix)\t\t 8:08\n05. Labyrinth\t\t\t\t\t 6:26\n\nTOTAL TIME\t\t\t\t\t35:51\n\n\n\nJuno Reactor - Conga Fury (EP) (1996)\n\n01. Conga Fury\t\t\t\t\t 8:14\n02. Magnetic (Robert Liener Remix)\t\t 8:07\n03. Feel The Universe (Kox Box Remix)\t\t 7:46\n\nTOTAL TIME\t\t\t\t\t24:07\n\n\n\nJuno Reactor - Jungle High (EP) (1997)\n\n01. Jungle High (Oakenfold Edit)\t\t 3:21\n02. Jungle High (Our House Remix)\t\t 8:39\n03. Jungle High (Original Mix)\t\t\t 9:07\n\nTOTAL TIME\t\t\t\t\t21:07\n\n\n\nJuno Reactor - God Is God (CDM) (1997)\n\n01. God Is God (Rock Of Sion Mix)\t\t 6:50\n02. Biot Messiah\t\t\t\t 7:57\n03. God Is God (Revelation Mix)\t\t\t 5:41\n04. God Is God (CJ Bolland Mix)\t\t\t 6:05\n\nTOTAL TIME\t\t\t\t\t26:33\n\n\n\nJuno Reactor - God Is God (Front 242 Mixes) (12&quot; Vinyl) (1997)\n\n01. God Is God (Godzilla Front 242 Mix)\t\t 5:08\n02. God Is God (Grisha Zemix Front 242 Mix)\t 6:05\n\nTOTAL TIME\t\t\t\t\t11:13\n\n\n\nJuno Reactor - Pistolero (CDM) (2000)\n\n01. Pistolero (Radio Edit)\t\t\t 3:22\n02. Pistolero (Juno Reactor Mix)\t\t 6:18\n03. Pistolero (Fluke &quot;Hang'em High&quot; Remix)\t 5:21\n04. Pistolero (Headrillaz Sandinista Remix)\t 6:50\n05. Pistolero (Man With No Name Remix)\t\t 6:30\n06. Pistolero (Picture Of Man Remix)\t\t 6:50\n07. Pistolero (Tarantino Radio Mix)\t\t 3:37\n\nTOTAL TIME\t\t\t\t\t38:48\n\n\n\nJuno Reactor - Masters Of The Universe (CDM) (2001)\n\n01. Masters Of The Universe (Edit)\t\t\t 4:05\n02. Masters Of The Universe (Eternal Basement Remix)\t 7:39\n03. Masters Of The Universe (Neon Remix)\t\t 6:18\n04. Masters Of The Universe (Eternal Basement 12&quot; Mix)\t 8:21\n05. Masters Of The Universe (Front 242 Pure Remix)\t 4:57\n\nTOTAL TIME\t\t\t\t\t\t31:20\n\n\n\nJuno Reactor - Hotaka (Promo Single) (2002)\n\nTrack 3 &amp; 4 have different names on Japan single but tracks are same as on EU/US singles.\n\n01. Hotaka (Radio Edit)\t\t\t\t\t 3:35\n02. Hotaka (12&quot; Dance Version)\t\t\t\t 8:20\n03. Hotaka (Thomas P. Heckman Remix) (Kloq Remix)\t 7:59\n04. Hotaka (Der Dritte Raum Remix) (Kris Kylven Remix)\t 8:24\n\nTOTAL TIME\t\t\t\t\t\t28:16\n\n\n\nJuno Reactor - Zwara (EP) (2003)\n\n01. Zwara (Sleepwalker)\t\t\t\t\t 7:32\n02. Teahouse (feat. Gocoo)\t\t\t\t 1:04\n03. Komit\t\t\t\t\t\t 4:43\n04. Guardian Angel\t\t\t\t\t 7:12\n\nTOTAL TIME\t\t\t\t\t\t20:31","torrent":{"xt":"urn:btih:22d3f147c403d833a253a5716a1ac112ff93b28f","amp;dn":"Juno+Reactor+-+Complete+Discography+%281992-2004%29+%28192kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22d3f147c403d833a253a5716a1ac112ff93b28f","infoHashBuffer":{"type":"Buffer","data":[34,211,241,71,196,3,216,51,162,83,165,113,106,26,193,18,255,147,178,143]},"announce":[],"urlList":[]}}