{"title":"Breeze Systems PSRemote 2.1 [ak]","uid":6161137,"size":6204425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:22da0e4a86bbe217f87aabbffabd2f323ab889ba&amp;dn=Breeze+Systems+PSRemote+2.1+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1297216107,"description":"Breeze Systems PSRemote 2.1\n\n\nThe leading application for controlling Canon PowerShot cameras from a Windows PC. It gives a high degree of control over the camera and includes a live viewfinder display allowing the camera to be operated up to 5m (16 feet) from the computer using a standard USB cable.\n\nPSRemote is designed for all Canon PowerShot cameras that support remote capture including the G10, G9, G7, SX110 IS, SX100 IS, S5 IS, A640, S80, Pro1, G6, S3 IS, S2 IS, S70, A620, A520 and many other cameras.\n\nPSRemote enables Canon PowerShot camera users to:\nControl the camera from a Windows PC\nOperate the camera from a distance and in inaccessible locations\nTake photo booth style sequences of photos and print them out automatically\nSee live viewfinder display on PC screen\nSee large high resolution previews of shots on the PC within seconds\nTake better product shots for eBay and other online auctions/stores\nImprove exposure control in tricky lighting conditions\nGain unrivalled control of camera settings in tethered operation\nCreate time lapse sequences over short or extended periods\nUse motion detection to automatically take pictures for wildlife photography and security applications (requires Webcam Zone Trigger which must be purchased separately).\n\nHome page - http://www.breezebrowser.com/\n\n","torrent":{"xt":"urn:btih:22da0e4a86bbe217f87aabbffabd2f323ab889ba","amp;dn":"Breeze+Systems+PSRemote+2.1+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22da0e4a86bbe217f87aabbffabd2f323ab889ba","infoHashBuffer":{"type":"Buffer","data":[34,218,14,74,134,187,226,23,248,122,171,191,250,189,47,50,58,184,137,186]},"announce":[],"urlList":[]}}