{"title":"Green Energetic Materials - Tore Brinck (Wiley, 2014).pdf","uid":11979461,"size":26090350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2350cccc84d580d0cfb6f114819fe102a173edda&amp;dn=Green+Energetic+Materials+-+Tore+Brinck+%28Wiley%2C+2014%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ferdgust","files":1,"time":1433151865,"description":"Since the end of the 20th century it has been increasingly realised that the use, or production, of many energetic materials leads to the release of substances which are harmful to both humans and the environment. To address this, the principles of green chemistry can be applied to the design of new products and their manufacturing processes, to create green energetic materials that are virtually free of environmental hazards and toxicity issues during manufacturing, storage, use and disposal. Active research is underway to develop new ingredients and formulations, green synthetic methods and non-polluting manufacturing processes.\n\nGreen Energetic Materials provides a detailed account of the most recent research and developments in the field, including green pyrotechnics, explosives and propellants. From theoretical modelling and design of new materials, to the development of sustainable manufacturing processes, this book addresses materials already on the production line, as well as considering future developments in this evolving field.\n\nTopics covered include:\n\nTheoretical design of green energetic materials\nDevelopment of green pyrotechnics\nGreen primary and secondary explosives\nOxidisers and binder materials for green propellants\nEnvironmentally sustainable manufacturing technologies for energetic materials\nElectrochemical methods for synthesis of energetic materials and waste remediation\nGreen Energetic Materials is a valuable resource for academic, industrial and governmental researchers working on the development of energetic materials, for both military and civilian applications","torrent":{"xt":"urn:btih:2350cccc84d580d0cfb6f114819fe102a173edda","amp;dn":"Green+Energetic+Materials+-+Tore+Brinck+%28Wiley%2C+2014%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2350cccc84d580d0cfb6f114819fe102a173edda","infoHashBuffer":{"type":"Buffer","data":[35,80,204,204,132,213,128,208,207,182,241,20,129,159,225,2,161,115,237,218]},"announce":[],"urlList":[]}}