{"title":"Good Hunting An American Spymaster's Story Jack Devine Audiobook","uid":11497814,"size":348160478,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:23d623e1028efd18df2d31e11d12e23f4d387768&amp;dn=Good+Hunting+An+American+Spymaster%27s+Story+Jack+Devine+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"Squiddy82","files":-1,"time":1416268934,"description":"*************************************\nThe last three seconds of each of the 14 audio segments is cut off. Save yourself the disappointment of downloading this substandard product. \n*************************************\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nGood Hunting: An American Spymaster's Story\n\nWritten by: Jack Devine\nNarrated by: Malcolm Hillgartner\nLength: 12 hrs and 4 mins\nUnabridged Audiobook\nRelease Date:11-14-14\n\nA master class in spycraft from one of its greatest practitioners.\n\n\n\nJack Devine ran Charlie Wilson's War in Afghanistan. It was the largest covert action of the Cold War, and it was Devine who put the brand-new Stinger missile into the hands of the mujahideen during their war with the Soviets, paving the way to a decisive victory against the Russians. He also pushed the CIA's effort to run down the narcotics trafficker Pablo Escobarin Colombia. He tried to warn the director of central intelligence, George Tenet, that there was a bullet coming from Iraq with his name on it. He was in Chile when Allende fell, and he had too much to do with Iran-Contra for his own taste, though he tried to stop it. He also tangled with Rick Ames, the KGB spy inside the CIA, and hunted Robert Hanssen, the mole in the FBI.\n\nGood Hunting: An American Spymaster's Story is the spellbinding memoir of Devine's time in the CIA, where he served for more than 30 years, rising to become the acting deputy director of operations, responsible for all of the agency's spying operations. This is a story of intrigue and high-stakes maneuvering - all the more gripping when the fate of our geopolitical order hangs in the balance. But this audiobook also sounds a warning to our nation's decision makers: covert operations, not costly and devastating full-scale interventions, are the best safeguard of America's interests worldwide.\n\nPart memoir, part historical redress, Good Hunting debunks some of the myths surrounding the agency and cautions against its misuses. Beneath the exotic allure - living abroad, running operations in seven countries, serving successive presidents from Nixon to Clinton - this is a realist's gimlet-eyed account of the CIA. As Devine sees it, the agency is now trapped within a larger bureaucracy, losing swaths of turf to the military, and most ominous of all, becoming overly weighted toward paramilitary operations after a decade of war. \n\n*************************************\nThe last three seconds of each of the 14 audio segments is cut off. Save yourself the disappointment of downloading this substandard product. \n*************************************","torrent":{"xt":"urn:btih:23d623e1028efd18df2d31e11d12e23f4d387768","amp;dn":"Good+Hunting+An+American+Spymaster%27s+Story+Jack+Devine+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d623e1028efd18df2d31e11d12e23f4d387768","infoHashBuffer":{"type":"Buffer","data":[35,214,35,225,2,142,253,24,223,45,49,225,29,18,226,63,77,56,119,104]},"announce":[],"urlList":[]}}