{"title":"Creating Visual Effects in Maya- Fire, Water, Debris and Destruc","uid":9921809,"size":18182316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2410cb6af2442da75d12cd9d44ebb0d116d31a46&amp;dn=Creating+Visual+Effects+in+Maya-+Fire%2C+Water%2C+Debris+and+Destruc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"steelballz","files":-1,"time":1397004405,"description":"Description\nCreating Visual Effects in Maya Fire, Water, Debris and Destruction\nAuthor:Lanier, Lee\nPublished:March 20 2014\nPublisher:Focal Press\nISBN-10:041583418X\nISBN-13:9780415834186\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\n\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nPublication Date: March 20 2014 | ISBN-10: 041583418X | ISBN-13: 978-0415834186\n\nProduce mind-blowing visual effects with Autodesk Maya. Gain the practical skills and knowledge you need to recreate phenomena critical to visual effects work, including fire, water, smoke, explosions, and destruction, as well as their integration with real-world film and video.\n\nIn Creating Visual Effects in Maya, Maya master Lee Lanier has combined the latest studio techniques with multi-chapter, hands-on projects and professionally-vetted workflows to bolster your CG toolkit. Engaging, full-color tutorials cover:\n\nCreating foliage, fire, and smoke with Paint Effects\n\nGrowing Maya Fur and nHair on clothing, characters, and sets\n\nReplicating water, smoke, sparks, swarms, bubbles, and debris with nParticles and nCloth\n\nControlling scenes and simulations with expressions and MEL, Python, and PyMEL scripting\n\nAdding dust, fog, smoke, rippling water, and fireballs with Fluid Effects containers\n\nCreating damage with Effects presets, deformers, and animated textures\n\nMatchmoving and motion tracking with Maya and MatchMover\n\nCreating complex destruction by combining rigid bodies, nParticles, nCloth, and Fluid Effects\n\nSetting up, rendering, and compositing mental ray render passes with Autodesk Composite, Adobe After Effects, and The Foundry Nuke\n\nThe companion website (www.focalpress.com/cw/lanier) features a treasure trove of Maya, MatchMover, After Effects, and Nuke project files, image sequences, texture bitmaps, and MEL, Python, and PyMEL scripts, allowing you to immediately apply the techniques taught in the book.\n\n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:2410cb6af2442da75d12cd9d44ebb0d116d31a46","amp;dn":"Creating+Visual+Effects+in+Maya-+Fire%2C+Water%2C+Debris+and+Destruc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2410cb6af2442da75d12cd9d44ebb0d116d31a46","infoHashBuffer":{"type":"Buffer","data":[36,16,203,106,242,68,45,167,93,18,205,157,68,235,176,209,22,211,26,70]},"announce":[],"urlList":[]}}