{"title":"Audiophile Vinyl Rips, various artists classic rock metadata","uid":12305979,"size":1599894552,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:249ca2527b20a1d7de637e0444b716a6ba00bdd9&amp;dn=Audiophile+Vinyl+Rips%2C+various+artists+classic+rock+metadata&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rontoolsie","files":59,"time":1440802340,"description":"These were sourced from my LP collection, culling single tracks from a wide variety of artists, some of which will be very well known to most, quite a few will be fairly obscure. But in most instances the music is very good to excellent. And some of the transcriptions also have quite astounding sonic fidelity (St. James Infirmary from the Louis Armstrong Plays King Oliver is but one example-and shows how little recording technology has improved in over 50 years. \n\nAll of these were transcribed using a $2500 Lyra Helikon SL moving coil cartridge inputed into a custom built/designed all-tube phono stage using exotic components such as a Lundahl amorphous core step up transformer, NOS 6SN7 tubes, Cardas capacitors, tantalum resistors, an 850VA toroid transformer for its power supply etc. None of which would mean much if the final result didn't justify the means. And I believe it does. The turntable I used is enigmatic. I had a fairly top spec Naimed Linn Sondek LP12 at my disposal sitting unused next to the one I used to make these transriptions, because it was 'simply better'. \n\nBecause the musical styes are so diverse, nobody will like EVERY selection...but most will like most, which is a good enough striking rate to justify this 1.5GB download. The individual tracks are titled 'song name-artist', so before you download this, you can look at the files and have some idea what to expect. And BTW...if you think that the lead vocalist in the Python Lee Jackson track sounds uncannily like Rod Stewart in his prime, it is because it IS Rod Stewart, circa 1969.\n\nYou will find artists like Dave Brubeck, Emmylou Harris, Ry Cooder, Paul Simon, Traffic, Roberta Flack, Harry James, Rickie Lee Jones and quite a few others. If this sounds like your cup of tea, than try this teapot!","torrent":{"xt":"urn:btih:249ca2527b20a1d7de637e0444b716a6ba00bdd9","amp;dn":"Audiophile+Vinyl+Rips%2C+various+artists+classic+rock+metadata","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"249ca2527b20a1d7de637e0444b716a6ba00bdd9","infoHashBuffer":{"type":"Buffer","data":[36,156,162,82,123,32,161,215,222,99,126,4,68,183,22,166,186,0,189,217]},"announce":[],"urlList":[]}}