{"title":"A Concise Introduction to Additives for Thermoplastic Polymers","uid":12402710,"size":2828646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24b35bb7d5bcabe58282fd94f02be2b956dc8bb3&amp;dn=A+Concise+Introduction+to+Additives+for+Thermoplastic+Polymers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1442049651,"description":"A Concise Introduction to Additives for Thermoplastic Polymers - Johannes Karl Fink (Wiley-Scrivener, 2010).pdf\n\nDescribes twenty-one of the most important and commonly usedadditives &quot;A Concise Introduction to Additives for ThermoplasticPolymers&quot; focuses on additives for thermoplastic polymers anddescribes 21 of the most important and commonly used additives fromPlasticizers and Fillers to Optical Brighteners and Anti-Microbialadditives. It also includes chapters on safety and hazards, andprediction of service time models.\n\nWhile there are many exhaustive and complex books dealing withadditives for polymers, the size of them deter students and manyindustry engineers from using them. The purpose of this book, therefore, is to fill this void and present a concise introductionto this important subject.\n\nWritten in an accessible and practical style, the authorintroduces the reader to the complex subject of plastics additivesin an engaging manner. His ability to be concise is the result ofhis teaching courses on the subject and using his own lecture notesfor material. This book comprises the author's course notes so thata larger public can benefit from his knowledge.\n\n&quot;A Concise Introduction to Additives for ThermoplasticPolymers&quot; is the ideal primer for students who will later workin polymer science or the development of plastics formulation, aswell as industry engineers and specialists who want to have adeeper knowledge of the plastics industry","torrent":{"xt":"urn:btih:24b35bb7d5bcabe58282fd94f02be2b956dc8bb3","amp;dn":"A+Concise+Introduction+to+Additives+for+Thermoplastic+Polymers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b35bb7d5bcabe58282fd94f02be2b956dc8bb3","infoHashBuffer":{"type":"Buffer","data":[36,179,91,183,213,188,171,229,130,130,253,148,240,43,226,185,86,220,139,179]},"announce":[],"urlList":[]}}