{"title":"[Clips4Sale / MissMissaX] Adriana Chechik (Bad Medicine) 480p [R","uid":15570177,"size":389844230,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:25000c8f6b5ac34369f6db1c2398ae336d9ecb20&amp;dn=%5BClips4Sale+%2F+MissMissaX%5D+Adriana+Chechik+%28Bad+Medicine%29+480p+%5BR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"LucasCar","files":2,"time":1471247356,"description":"[Clips4Sale / MissMissaX] Adriana Chechik (Bad Medicine) 480p [Roleplay]\r\n\r\nAdriana is a little prankster and loves any opportunity to ruffle her brother's feathers. This morning is graduation day and she's slipped her father's viagra into a drink for her brother. She walks into the living room as he is practicing his valedictorian speech and she makes a toast, her eyes are laser focused on his glass. He huffs &quot;thank you,&quot; puts the glass to his lip and sets it down on the coffee table and continues to practice. &quot;Hey,&quot; Adrianna whines, &quot;I bought that vodka for you as a present, it was expensive.&quot; He tells her that he can not drink on the most important day of his life. Adriana rolls her eyes, her brother can be so melodramatic. She puts the glass to his lips and says convincingly &quot;the valedictorian can have a drink to calm his nerves.&quot; He swallows it down to satisfy her and continues practicing the speech. Adriana watches his pants, she knows she put enough in the glass to see immediate results.\r\n\r\nHis penis grows erect and strong, longer and thicker than it has ever been before. Adriana giggles at the tent in his robe. Robby looks down and is humiliated, he tries to cover it, he sits down. &quot;Adriana!&quot; He is certain she did something to him and she confesses. She smiles satisfied as she's got yet another prank over on him, he's far too easy, and he scrunches his brow. &quot;Do you understand that Elliot University will be at the graduation ceremony scouting for a person to give a scholarship to?&quot; Adriana sees his anger and frustration and tries to remedy his penis problem, just uh-- tuck it under your belt, or maybe you can use duct tape or something..&quot; Robby throws his hands in the air in frustration, &quot;good for you, you did it.. you ruined my chance to go to my dream school.. everything I have worked so hard for in life, and I hope you're hap..&quot; She cuts him off and responds with concern, &quot;hey, listen.. ivy league schools are for pricks anyway.&quot; Robby bows his head in sadness and it pulls on Adriana's heart strings. &quot;You have to help me,&quot; he tells her.\r\n\r\nThe ceremony is in 30 minutes and they only have 10 minutes to relieve this boner predicament, and he can't do it in that time. He explains to her, I don't know how to get rid of it fast, so if you really want to help, if you really feel sorry for what you did, you need to help me out. Adrianna nods her head in agreement, her face filled with concern. Robby continues, &quot;I'm going to need to see you naked.&quot; Adriana's eyes are wide in disbelief, &quot;there is no way, how could you even..? Robby interrupts her, &quot;you need to keep your mouth shut, I can't hear your voice because it will remind me that you're my sister.. just please.&quot; She agrees. She bites her lip and swallows her feminine pride as she removes her sweet pink dress, she covers her private areas and he strokes his massive dick under his robe to her.\r\n \nhttp://screenimage.net/img-57b157eba6ef0.html\r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n   \nhttps://thepiratebay.org/user/LucasCar/","torrent":{"xt":"urn:btih:25000c8f6b5ac34369f6db1c2398ae336d9ecb20","amp;dn":"%5BClips4Sale+%2F+MissMissaX%5D+Adriana+Chechik+%28Bad+Medicine%29+480p+%5BR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25000c8f6b5ac34369f6db1c2398ae336d9ecb20","infoHashBuffer":{"type":"Buffer","data":[37,0,12,143,107,90,195,67,105,246,219,28,35,152,174,51,109,158,203,32]},"announce":[],"urlList":[]}}