{"title":"Mars Rover Curiosity - Rob Manning and William L. Simon","uid":11156226,"size":6514981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:254d6691fba9cb1381b695f82e076adf4cdf42f2&amp;dn=Mars+Rover+Curiosity+-+Rob+Manning+and+William+L.+Simon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1412431087,"description":"The firsthand account of the trials and tribulations of engineering one of the most complex pieces of space technology, the Mars Rover Curiosity, by its chief engineer Rob Manning In the course of our enduring quest for knowledge about ourselves and our universe, we haven't found answers to one of our most fundamental questions: Does life exist anywhere else in the universe? Ten years and billions of dollars in the making, the Mars Rover Curiosity is poised to answer this all-important question. In Mars Rover Curiosity: An Inside Account from Curiosity's Chief Engineer, Rob Manning, the project's chief engineer, tells of bringing the groundbreaking spacecraft to life. Manning and his team at NASA's Jet Propulsion Laboratory, tasked with designing a lander many times larger and more complex than any before, faced technical setbacks, fights over inadequate resources, and the challenges of leading an army of brilliant, passionate, and often frustrated experts. Manning's fascinating personal account--which includes information from his exclusive interviews with leading Curiosity scientists--is packed with tales of revolutionary feats of science, technology, and engineering. Readers experience firsthand the disappointment at encountering persistent technical problems, the agony of near defeat, the sense of victory at finding innovative solutions to these problems, the sheer terror of staking careers and reputations on a lander that couldn't be tested on Earth, and the rush of triumph at its successful touchdown on Mars on August 5, 2012. This is the story of persistence, dedication, and unrelenting curiosity.","torrent":{"xt":"urn:btih:254d6691fba9cb1381b695f82e076adf4cdf42f2","amp;dn":"Mars+Rover+Curiosity+-+Rob+Manning+and+William+L.+Simon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254d6691fba9cb1381b695f82e076adf4cdf42f2","infoHashBuffer":{"type":"Buffer","data":[37,77,102,145,251,169,203,19,129,182,149,248,46,7,106,223,76,223,66,242]},"announce":[],"urlList":[]}}