{"title":"Bayside - Discography (2001-2014) [FLAC]","uid":12092976,"size":3592436129,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:255b8358ad1ad0a42b5effb5d6dc4addcee780c4&amp;dn=Bayside+-+Discography+%282001-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"politux","files":168,"time":1436055127,"description":"\n  Bayside - Discography (2001-2014) [FLAC]\n\n  Genre: Rock\n  Style: Punk, Alternative, Indie, Emo\n  Source: CD, WEB\n  Codec: FLAC \n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  2001 Long Stories Short\n  2003 Bayside and Name Taken Split\n  2004 Sirens and Condolences\n  2005 Bayside\n  2006 Acoustic \n  2007 The Walking Wounded\n  2008 Shudder\n  2008 The Walking Wounded (Gold Edition)\n  2008 Live at the Bayside Social Club\n  2011 Tour 7&quot;\n  2011 Killing Time\n  2012 Covers Vol 1\n  2014 Cult\n\n  Bayside formed in the winter of 2000 and developed a quick following with their melodic, moody, guitar-driven emo. They soon left their native Queens, New York and hit the road, sharing stages across the United States with bands like the Alkaline Trio, Taking Back Sunday, and Further Seems Forever. The band's first release, the Long Stories Short EP, was released by the local Dying Wish Records in August 2001. Touring continued throughout the following year, including festival slots at the Skate and Surf Fest in Asbury, Furnace Fest in Birmingham, and a two-week stint with the Warped Tour.\n\n  As with many young bands, various lineup changes occurred throughout these early years, and spring 2003 found original members Anthony Raneri (vocals/guitar) and Andrew Elderbaum (bass) cementing a revised incarnation of the band with newcomers Jim Mitchell (drums) and Jack O'Shea (guitar). That same summer, they released a split EP with Name Taken before signing with Chicago powerhouse Victory Records. Sirens and Condolences, a brooding debut album produced by J. Robbins (Jawbox), was issued in January 2004. Along with a relentless show schedule, the guys utilized community-oriented websites like Friendster and MySpace to promote their music and build up a loyal underground following. Also during this time, bassist Nick Ghanbarian (ex-the Movielife, Silent Majority) and N.Y.C. veteran drummer John &quot;Beatz&quot; Holohan joined Bayside's ranks, replacing Elderbaum and Mitchell.\n\n  Going into their next album, Bayside decided to depart from the group of producers whom many of their peers had been using. Consequently, their August 2005 self-titled sophomore album materialized with Shep Goodman and Ken Gioia at the controls; the producers had previously worked on albums by Mandy Moore and Lee Ann Womack. With their album completed, an energized Bayside hit the road with Hawthorne Heights, Silverstein, and Aiden on the Never Sleep Again tour. But on the morning of October 31, their van hit a patch of ice and flipped over on the way to a show in Salt Lake City. Holohan was tragically killed in the accident and Ghanbarian severely injured. Grieving the loss, Bayside canceled several shows before Raneri and O'Shea decided to honor their friends by pressing on as an acoustic duo. The tour wrapped up at Chicago's House of Blues, where the band recorded the performance and released it February 2006. The live DVD and accompanying ten-song Acoustic EP included a new track, &quot;Winter,&quot; which was a tribute to Holohan.\n\n  After a brief headlining tour, Bayside spent the beginning of 2006 serving as the opening act for the Smoking Popes' reunion tour. With Ghanbarian fully recovered and new drummer Chris Guglielmo on board, the band reprised its relationship with Goodman and Gioia and began working on its next album. The aptly titled The Walking Wounded was issued in early February 2007; it found the guys not explicitly focusing on their earlier tragedy, but instead on survival and moving forward. The punky Shudder followed in 2008, giving Bayside their highest chart placement to date by peaking at number 52. Having fulfilled their contract with Victory, Bayside jumped ship and signed with Wind-Up Records in March 2010, promising a new album by the coming fall. Sessions with producer Gil Norton took slightly longer than expected, with the resulting Killing Time ultimately coming out in early 2011.\n\n  The band again toured heavily in support of the album before self-releasing the Covers EP in 2012 and announcing that they would be starting work on another new release. Working once again with producer Shep Goodman and his regular collaborator Aaron Accetta, they set themselves to writing their best album yet, taking elements from all of their previous releases and further honing their distinctive sound. Heavily inspired by a tumultuous year in Raneri's life in which he lost his grandfather, stepfather, and stepbrother, got married, had his first child, and built his first home, the album, eventually titled Cult, was released in 2014 through Hopeless Records","torrent":{"xt":"urn:btih:255b8358ad1ad0a42b5effb5d6dc4addcee780c4","amp;dn":"Bayside+-+Discography+%282001-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"255b8358ad1ad0a42b5effb5d6dc4addcee780c4","infoHashBuffer":{"type":"Buffer","data":[37,91,131,88,173,26,208,164,43,94,255,181,214,220,74,221,206,231,128,196]},"announce":[],"urlList":[]}}