{"title":"Tone-Loc - Loc-ed After Dark 320cbr (Big Papi) 1989","uid":9460774,"size":123072799,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:255db47631da66f706f406569ee67bfd6251de32&amp;dn=Tone-Loc+-+Loc-ed+After+Dark+320cbr+%28Big+Papi%29+1989&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389348886,"description":"Source: 1989 CD\n\n\n\nBy Daniel Jolley HALL OF FAMETOP 500 REVIEWERVINE VOICE\n\n\nIn 1988, Tone-Loc took the pop music world by storm with his immensely popular track Wild Thing and its even spicier follow-up Funky Cold Medina. While this is not gangsta rap or what many listeners might even call serious rap, it did help introduce rap and hip hop to young people such as myself mired in the sputtering realms of generic Top 40 and classic rock music during the late 1980s. I'm not sure that Tone-Loc's throat is the perfect vehicle for rapping, as he sounds like he has a permanent frog in his throat, yet his laid-back style actually works well with his unique sound. Tone-Loc rapped about things almost all young people have in common, thereby making his music much more accessible than the hardcore rap that has never appealed to me. He did lay down a few lines about how talented and cool he was, but he never carried this to excess, nor did he spend any time tearing down other people in the music industry. There is enough profanity on here to merit the Explicit Lyrics tagline, but the language is really pretty tame over all. In one song, he actually uses the words &quot;One, two, buckle my shoe.&quot; Any rapper than can say that and still be both tough and successful is a rare talent indeed.\nThis album is actually filled with good tracks, achieving success outside of its two main hits. On Fire, Loc'ed After Dark, I Got It Goin' On, and Next Episode all share a similar sound, but each of them is a track you wouldn't want to skip over. Cheeba-Cheeba is a lot of fun to listen to, and the fact that it can be seen as glorifying the smoking of a certain type of plant is not important as long as you don't take the song too seriously. Loc'in on the Shaw is a track I could do without, but the album closes strongly, in my opinion, with Homies.\n\nBasically, Loc'ed After Dark qualifies as mainstream rap music, and the immense popularity Tone-Loc enjoyed in 1988 and 1989 did have a profound effect on the rap and pop music industry, preparing the way for more serious rappers to reach a wider audience in the years following this album's release. If you were a youth during the 1980s, you almost surely have fond memories of Wild Thing and Funky Cold Medina; for me the album qualifies as yet another memory-laden memento of the late, great 1980s","torrent":{"xt":"urn:btih:255db47631da66f706f406569ee67bfd6251de32","amp;dn":"Tone-Loc+-+Loc-ed+After+Dark+320cbr+%28Big+Papi%29+1989","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"255db47631da66f706f406569ee67bfd6251de32","infoHashBuffer":{"type":"Buffer","data":[37,93,180,118,49,218,102,247,6,244,6,86,158,230,123,253,98,81,222,50]},"announce":[],"urlList":[]}}