{"title":"Way of The Samurai 1 &amp; 2 [Ntsc], Ps2","uid":5922012,"size":1341713571,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:25c4d4d422da3d1890ce6bc55f89d4e0eeb3199d&amp;dn=Way+of+The+Samurai+1+%26+2+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big_dude","files":-1,"time":1288456479,"description":"Way of The Samurai 1 &amp; 2 for the Ps2                               Rel. 2002 &amp; 2004\n\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        Action, Fighting\nRating:        (M) Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Both Games were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: Way of The Samurai has been converted from CD To DVD. Way of The \n               Samurai 2 is already DVD.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nWay of Samurai Game Description:\n\nThis is a story of the Way of the Samurai in their final days. Warring factions are vying for control of feudal Japan. At Rokkotsu Pass, three groups wrestle for power. Into this conflict walks a lone samurai who is quickly swept up into battles that threaten to engulf the entire region.\n\nCombat, deception and betrayal are tools to be used at will. So grasp your sword and prepare yourself, for history is forged in the fires of battle. \n\n\nFeatures:\n\n* Choose one of four samurai in this Multi-Path adventure. Your &quot;moral&quot; choices \n  determine the outcome of the game.\n\n* Fight in a true 3D environment. Acquire new swords from enemy warlords and learn \n  new fighting stances and styles.\n\n* Head-to-Head Sword Fighting allows you to test your fighting skills against a \n  friend. \n\n\nWay of Samurai 2 Description:\n\nAcquire's second Way of the Samurai game is designed to offer the authentic settings, deep sword-fighting system, and cause-and-effect role-playing found in the original, while boosting the graphics and enhancing the interface. Characters can obtain as many as 60 different swords and, with the proper equipment and practice, perform more than 100 different special moves. Also as in the original, the hero must choose his own path through the plot lines, and the decisions he makes can drastically affect the outcome of the story.\n\nThe adventure begins as the player's lone samurai warrior comes upon a small, remote village mired in the midst of large, internal dispute. The traditional village leaders favor fealty to feudalistic powers that are becoming prominent throughout the land, while a group of outlaw rebels, known as the Aoto, vehemently oppose acquiescence to the regional authority. As the main character and hero of the story, the player must bring resolution to this conflict, and peace to the town, in whatever Way he deems best.\n\nThere is a realistic day and night cycle and various strategical elements. You can talk to various characters, accept tasks and shop for new items. Decisions influence the relationships with the different groups. There are 60 swords, hammers and clubs to choose from, and you have to keep a variable quality and durability level in mind. You can perform both offensive and defensive moves, and even perform special actions. Swords can be enhanced or upgraded in stores, according to your fighting style. \n\n\nFeatures:\n\n* Multiple endings based on players decisions - help free the innocent or join the \n  corrupt.\n\n* Experience traditional Samurai techniques with realistic sword fighting - \n  acrobatic ninja style, quick slash, twin swords and more...\n\n* More than 60 swords to battle with - find famous and powerful swords among the \n  townspeople.\n\n* Tons of special moves to take over your enemy\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:25c4d4d422da3d1890ce6bc55f89d4e0eeb3199d","amp;dn":"Way+of+The+Samurai+1+%26+2+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c4d4d422da3d1890ce6bc55f89d4e0eeb3199d","infoHashBuffer":{"type":"Buffer","data":[37,196,212,212,34,218,61,24,144,206,107,197,95,137,212,224,238,179,25,157]},"announce":[],"urlList":[]}}