{"title":"YOOtheme YT Nite Joomla 2.5 - 3.x Template","uid":10372403,"size":55602325,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:25c9e98bf8d5397ceca176bae82f20e2ec28bcec&amp;dn=YOOtheme+YT+Nite+Joomla+2.5+-+3.x+Template&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":1,"time":1402950098,"description":"Summer time has already started and we have a brand new theme release for June 2014. Say hello to Nite, a modern widescreen layout combined with flat colors and a lot of features. The theme comes with 4 dark and 4 light styles making it suitable for a broad range of websites.\n\nNite features some very unique features. We've included the option to add a fullscreen position where you can publish eye-catching content, which will adapt perfectly to your browser window size. Another feature of Nite is the centered logo position inside the navbar. Furthermore you have the option to create a navbar that will stay fixed at the top of the screen and you can animate it on a scroll event. Nearly all theme position renderings can simply be customized in the Warp UI. You can choose from 5 different background colors and 3 various paddings, which make the theme very versatile. In addition to that, the search has its own layout position to save some space in the header area of the layout.\n\nNite is based on Warp 7 and provides full support for LESS. The front-end is completely built with UIkit and can be modified through the Customizer. You can change colors, spacing and fonts without having to write a single line of code. To get you started, Nite already provides 8 different style variations to choose from.\n\nFull LESS support\nFull UIkit integration\n8 pre-built style variations available\nBeautiful off-canvas navigation for mobile devices\nAll Warp framework features are available","torrent":{"xt":"urn:btih:25c9e98bf8d5397ceca176bae82f20e2ec28bcec","amp;dn":"YOOtheme+YT+Nite+Joomla+2.5+-+3.x+Template","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c9e98bf8d5397ceca176bae82f20e2ec28bcec","infoHashBuffer":{"type":"Buffer","data":[37,201,233,139,248,213,57,124,236,161,118,186,232,47,32,226,236,40,188,236]},"announce":[],"urlList":[]}}