{"title":"SimpleRockets v1.5.10","uid":11729446,"size":20425857,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:25dcc1c7d386511c96d6c72f40ac6b9a36f04069&amp;dn=SimpleRockets+v1.5.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Androider","files":1,"time":1425231413,"description":"Design your own rocket ships. Blast off into space. Explore the solar system. See if you have what it takes to be a rocket scientist.\n\nCREATE\nChoose and connect parts together to build rocket ships. You can choose from a variety of rocket engines, fuel tanks, and other gizmos. You can even build rovers with powered wheels. You are only limited by your imagination.\n\nEXPLORE\nBlast off from any planet you want. You can fly through the intense atmosphere of Venus, or you can take advantage of the low gravity of Mercury. Whip around the sun and launch yourself out to the far reaches of the solar system.\n\nCHALLENGES\nSeveral challenges are built into the game so you can compete with other humans from around the world to see who can go the fastest, fly the farthest, orbit with the least amount of fuel, land on the moon, and so much more.\n\nROCKET SCIENCE\nKepler wrote the equations 400 years ago, and SimpleRockets uses those equations to model extremely realistic orbital physics. Players will learn about rocket science and astrodynamics while they are having a blast exploring the solar system. This makes SimpleRockets ideal for the classroom, or as a healthy alternative to the barrage of brainless games available on the App Store.\n\nWhat's New:\n\n* Added link to our new game, SimplePlanes. It's like SimpleRockets, but with airplanes. Build airplanes and test them with realistic physics and see how they fly. If you like SimpleRockets, then you will love SimplePlanes! You can find it on the App Store now!\nOther features added in this update:\n* Added ability to transfer RCS fuel while docked with a satellite\n* Reduced RCS fuel consumption\n* Increased max zoom distance in map view\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.jundroo.simplerockets&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.jundroo.simplerockets&lt;/a&gt;","torrent":{"xt":"urn:btih:25dcc1c7d386511c96d6c72f40ac6b9a36f04069","amp;dn":"SimpleRockets+v1.5.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25dcc1c7d386511c96d6c72f40ac6b9a36f04069","infoHashBuffer":{"type":"Buffer","data":[37,220,193,199,211,134,81,28,150,214,199,47,64,172,107,154,54,240,64,105]},"announce":[],"urlList":[]}}