{"title":"Michał Cholewa - Inwit. Gambit 4 [Polish]","uid":13863736,"size":1028624884,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2659c6c870187499f4563e6954636faa4ab22299&amp;dn=Micha%C5%82+Cholewa+-+Inwit.+Gambit+4+%5BPolish%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"everdarksoul","files":58,"time":1458051752,"description":"Audiobook PL - 56 części /   \r\nrozmiar: 980 MB / czas: 23:45:35\r\nczyta: Maciej Więckowski\r\n\r\nŚwiat po zagładzie. Moralność nie istnieje. Ludzie prześcignęli w okrucieństwie SI...\r\nMałostkowi i źli - gotowi są mścić się i mordować w imię prywatnych ambicji...\r\n\r\nLudzkość przetrwała Dzień zagłady świata, gdy Sztuczne Inteligencje postanowiły ją unicestwić. Podzielona na trzy mocarstwa walczy o pozostałości dawnej cywilizacji.\r\nMarcin Wierzbowski ze swoim oddziałem weteranów zostaje wciągnięty w szeregi niezawodnego, lecz okrytego złą sławą Dowództwa Operacji Specjalnych Unii Europejskiej. Dowodzący nimi pułkownik Brisbane zabiera żołnierzy w kolejną misję, tym razem na Liberty, planetę, która zadziwiająco dobrze poradziła sobie z buntem maszyn i dysponuje aż dwiema kopalniami caellium, niezwykle cennego surowca.\r\nNiestety Liberty leży w strefie wpływów potężnych Stanów Zjednoczonych. Inwazję na pełną skalę muszą więc zastąpić drobiazgowo planowane operacje specjalne. Tym razem jednak szans na ich sukces nie dostrzegają nawet magowie, ludzie-komputery żyjący w komorach medycznych, którzy stracili kontakt ze swoim gatunkiem, w zamian zyskując niemal nieograniczone możliwości analizowania wiedzy i jej zdobywania. Na przekór temu wszystkiemu Brisbane wierzy Colette, dziewczynie ukształtowanej w projekcie Dedal, który miał za zadanie stworzenie następcy SI.\r\nCzy w tak skomplikowanej sytuacji możliwe jest zwycięstwo? A jeśli do niego dojdzie, czym się okaże i jaką cenę przyjdzie za nie zapłacić..?\r\n\r\n&quot;Inwit&quot; to powieść Michała Cholewy - laureata Nagrody Fandomu Polskiego im. Janusza A. Zajdla, która jest czwartą częścią cyklu SF &quot;Algorytm Wojny&quot;\r\n\r\ncykl &quot;Algorytm Wojny&quot; (również: Gambit)\r\n\r\n1 - Gambit\r\n2 - Punkt Cięcia\r\n3 - Forta\r\n4 - Inwit","torrent":{"xt":"urn:btih:2659c6c870187499f4563e6954636faa4ab22299","amp;dn":"Micha%C5%82+Cholewa+-+Inwit.+Gambit+4+%5BPolish%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2659c6c870187499f4563e6954636faa4ab22299","infoHashBuffer":{"type":"Buffer","data":[38,89,198,200,112,24,116,153,244,86,62,105,84,99,111,170,74,178,34,153]},"announce":[],"urlList":[]}}