{"title":"Wind Power - The Industry Grows Up  - Rebecca L. Busby","uid":12152053,"size":45199502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26772d00b923455021ab5f42b908fe5242f7d064&amp;dn=Wind+Power+-+The+Industry+Grows+Up++-+Rebecca+L.+Busby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1437662024,"description":"Wind Power - The Industry Grows Up  - Rebecca L. Busby (PennWell, 2012).pdf\n\nISBN 978-1-59370-244-1\n\nIn her timely new book, best-selling author Rebecca Busby provides a balanced, comprehensive view of the wind power industry. This book enables readers to: \n- Expand their knowledge of the environmental and economic issues associated with wind power development\n- Understand the steps involved in developing a wind farm and the best ways to operate it successfully and profitably\n- Find out how wind energy is integrated into power grids and transmission networks, including the growing use of technologies for energy storage\n- Get an overall picture of the global wind business and the deployment of offshore wind power\n- Learn the basics of how wind power is generated and used, how wind turbines work, and how wind power systems are designed\n- Find out how wind energy is measured and evaluated at prospective sites, including maps of wind resources worldwide\n- Review the status of global wind energy research, technology development, and product testing, as well as advanced wind power generation concepts","torrent":{"xt":"urn:btih:26772d00b923455021ab5f42b908fe5242f7d064","amp;dn":"Wind+Power+-+The+Industry+Grows+Up++-+Rebecca+L.+Busby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26772d00b923455021ab5f42b908fe5242f7d064","infoHashBuffer":{"type":"Buffer","data":[38,119,45,0,185,35,69,80,33,171,95,66,185,8,254,82,66,247,208,100]},"announce":[],"urlList":[]}}