{"title":"The Art of Harvey Kurtzman - The Mad Genius of Comics","uid":8645385,"size":59187428,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2686a13cd174ae44f149c5dad5cf46a976b5807b&amp;dn=The+Art+of+Harvey+Kurtzman+-+The+Mad+Genius+of+Comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1372972950,"description":"'The Art of Harvey Kurtzman - The Mad Genius of Comics'\n\nAbrams ComicsArt, 2009, 256 pages\n\nHarvey Kurtzman discovered Robert Crumb and gave Gloria Steinem her first job in publishing when he hired her as his assistant. Terry Gilliam also started at his side, met an unknown John Cleese in the process, and the genesis of Monty Python was formed. Art Spiegelman has stated on record that he owes his career to him. And he's one of Playboy publisher Hugh Hefner's favorite artists.\n\nHarvey Kurtzman had a Midas touch for talent, but was himself an astonishingly talented and influential artist, writer, editor, and satirist. The creator of MAD and Playboy's \n&quot;Little Annie Fanny&quot; was called, &quot;One of the most important figures in postwar America&quot; by the New York Times. Kurtzman's groundbreaking &quot;realistic&quot; war comics of the early '50s and various satirical publications (MAD, Trump, Humbug, and Help!) had an immense impact on popular culture, inspiring a generation of underground cartoonists. Without Kurtzman, it's unlikely we'd have had Airplane, SNL, or National Lampoon.\n\nThe Art of Harvey Kurtzman is the first and only authorized celebration of this &quot;Master of American Comics.&quot; This definitive book includes hundreds of never-before-seen illustrations, paintings, pencil sketches, newly discovered lost E.C. Comics layouts, color compositions, illustrated correspondence, and vintage photos from the rich Kurtzman archives","torrent":{"xt":"urn:btih:2686a13cd174ae44f149c5dad5cf46a976b5807b","amp;dn":"The+Art+of+Harvey+Kurtzman+-+The+Mad+Genius+of+Comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2686a13cd174ae44f149c5dad5cf46a976b5807b","infoHashBuffer":{"type":"Buffer","data":[38,134,161,60,209,116,174,68,241,73,197,218,213,207,70,169,118,181,128,123]},"announce":[],"urlList":[]}}