{"title":"Tony Hawk's Project 8 [RF] XBOX360","uid":8259743,"size":7145143269,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:26ded7bbd615f05bdfd091b0b90756c8704637ce&amp;dn=Tony+Hawk%27s+Project+8+%5BRF%5D+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"Big_dude","files":-1,"time":1363352942,"description":"Tony Hawk's Project 8 for XBox 360                              Rel. 11/07/2006\n\n\nDVD9 Region Free\nWave 1\nEnglish\nStealth Patched.\n\n\nDiscs:            1\nImage:            .DVD/ISO\nGenre.:           Sports/Skateboarding\nRating:           Teen\nRequirements:     Modded or Flashed Drive (iXtreme or LT+)\n\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: Your xbox360 console must be Modded or drive flashed with Ixtreme\n      to play any copy. It isn't recommended to play any game copy online \n      unless your using LT+. Even then you still run the risk of getting \n      banned so just be aware of that.\n\n\n\nGame Description:\n\nIn Tony Hawk's Project 8, The Birdman is out looking for the top 8 skaters for his new Project and it happens that he has stopped in your city to search for the best top skaters. It is up to you to prove that you can make the cut among the 200 other people varying for the coveted 8 spots. You are start out ranked 200th with various goals set for you throughout the city including the return of classic mode from the early Tony Hawk games. \n\nChances to rank up come in various different ways now. There are spray painted lines located throughout the city to mark a type of goal. Weather it is grinding a certain distance, completing Natas spins, keeping your balance while doing a manual for a certain time and distance, point combos, and trick combos. Also players can obtain missions via random strangers located throughout the city.\n\nPlayers can also earn Stokens by performing tricks to impress the locals that can be found wandering around the city. Players can use these Stokens to buy additional clothing, haircut styles, shoes, tricks, and boards from the store.\n\nNew to this game is the slow motion &quot;Nail the Trick&quot; mode where the focus is placed on the skater's feet and the movement of the board can be controlled with both of the analog sticks to build up a huge combo score! The PSP version includes 14 multiplayer modes and 8 classic levels including Hawaii, Alcatraz and The Mall. The PS2, PS3 and Xbox version do not support online multiplayer.\n\n-------------------------------------------------------------------------\n\nOnly use DVD Decrypter or Imgburn to burn with respected media.\n\n\nIf using DVD Decrypter make sure Layer Break (For DL Media) is at 1913760 \nuser specified option. As DVD Decrypter doesn't recognize .DVD files.\n\n\nIf your new to the Xbox360 scene do some research online.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t","torrent":{"xt":"urn:btih:26ded7bbd615f05bdfd091b0b90756c8704637ce","amp;dn":"Tony+Hawk%27s+Project+8+%5BRF%5D+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ded7bbd615f05bdfd091b0b90756c8704637ce","infoHashBuffer":{"type":"Buffer","data":[38,222,215,187,214,21,240,91,223,208,145,176,185,7,86,200,112,70,55,206]},"announce":[],"urlList":[]}}