{"title":"Kabuki (David Mack)","uid":5182602,"size":846281578,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2763a361e62ba03a63186bb13cb9c06d4d40c983&amp;dn=Kabuki+%28David+Mack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"ParrowJack","files":70,"time":1259318782,"description":"Kabuki is a comic book series by artist and writer David Mack about an assassin who struggles with her identity, in near-future Japan.\n\nKabuki was first published in 1994 by Caliber Press,  later by Image Comics and most recently by Marvel Comics under its imprint Icon Comics. \n\nUnlike most comic series, the plot of Kabuki moves very little over the course of the volumes. Very little fast-paced or violent action takes place, instead most of the focus is on memories, dreams, thoughts and philosophy. Mack's characters, especially Kabuki herself, revisit the same scenes and memories many times, rethinking them and their significance.\n\nMack uses a myriad of art styles, not only with pencil, ink, and color, but with paint, magazine clippings, manga scans, and crayons. In Kabuki: The Alchemy especially, many of the pages are photos (or color scans) of collages, using a variety of materials; for example, the fingers of Japanese sandalwood fans become the borders of the comic panels. One technique he uses often is reusing the same artwork, the same scenes, to represent a characters' memories, or simply to shift scene back to something the reader has already seen. Imagery is very important and prominent in the series; Mack reuses the same images, often changing them slightly, and focusing on the emotional content of images and the power of memories.\n\nMack does not always do the art for these comics alone. In Kabuki: Masks of the Noh a different artist was assigned to each agent as a way of visually representing their personalities. This continued in Kabuki: Scarab, which was written by Mack with art by Rick Mays, who had previously drawn Scarab in Masks of the Noh.\n\nThis pack contains all currently scanned issues.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:2763a361e62ba03a63186bb13cb9c06d4d40c983","amp;dn":"Kabuki+%28David+Mack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2763a361e62ba03a63186bb13cb9c06d4d40c983","infoHashBuffer":{"type":"Buffer","data":[39,99,163,97,230,43,160,58,99,24,107,177,60,185,192,109,77,64,201,131]},"announce":[],"urlList":[]}}