{"title":"Animal Planet: Body Found (Mermaid)","uid":7615887,"size":692287080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27b984a865628b0fd0c75029cfa6f4b777044e67&amp;dn=Animal+Planet%3A+Body+Found+%28Mermaid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"M0as","files":1,"time":1347197979,"description":"Mermaids: The Body Found is a science docufiction television film that originally aired on May 27, 2012, on Animal Planet and June 17 on Discovery Channel. It tells the story of a scientific team's investigative efforts to uncover the source behind mysterious underwater recordings and an unidentified marine body.\n\n\n\nSummary:\n\nIn 2004, when marine biologist Dr Brian McCormick (Sean C. Michael) stumbled across a recording of mysterious underwater sounds, he launched a scientific investigation to uncover the creature responsible. In search of conclusive proof, he and his research team are called out to an unusual whale stranding in South Africa. Here they find the part digested remains of an animal none of them can identify. As each of its body parts is autopsied, they provide new pieces of the puzzle. As the picture builds, McCormick is drawn to an astonishing conclusion: this new marine creature is related to humans. This two-hour special combines beautiful CGI animation, real natural history, a thrilling contemporary conspiracy theory and a race against time to unveil an ancient secret before it's too late.\n\n\nThis is a higer quality video than what is currenly available on TPB.  It took over 6 hours to download from another site and I wanted to put it up so that others can download it faster and easier.  It also doesn't have the annoying Chinese hard-coded subtitles.\n\nThis is my first torrent.  Enjoy!!!!","torrent":{"xt":"urn:btih:27b984a865628b0fd0c75029cfa6f4b777044e67","amp;dn":"Animal+Planet%3A+Body+Found+%28Mermaid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27b984a865628b0fd0c75029cfa6f4b777044e67","infoHashBuffer":{"type":"Buffer","data":[39,185,132,168,101,98,139,15,208,199,80,41,207,166,244,183,119,4,78,103]},"announce":[],"urlList":[]}}