{"title":"Dyscourse - TiNYiSO","uid":11787797,"size":380938953,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2829e13b95950165504f8c6233e56a632b1d535a&amp;dn=Dyscourse+-+TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"dauphong","files":3,"time":1427820186,"description":"DyscourseProudly Presents\n\nDyscourse (c) Owlchemy Labs\n\nRelease On: 31 March 2015 Disk Amount/Format: 1 CD ISO\nType of Game: Adventure Media Protection: Steam\n\nDyscourse is an interactive choose-your-own adventure where you journey\nthrough a stylized world of choice and consequence. You play as Rita, an\nunfortunate art school grad turned barista, who is now stuck on a desert\nisland with a crew of oddball travelers after a plane crash. That last\nchoice you just made? It may end up being integral to your group s\nsurvival, or it may lead you down a path to murder and cannibalism!\n\nStories in Dyscourse are emergent, and choices made in the game directly\ntie to the survival or downfall of the group. As players get to know\ntheir fellow castaways and make critical and interpersonal decisions\ndrama dynamically unfolds, and your choices author your own unique story\n\nWe've designed Dyscourse so that players will end up with vastly\ndifferent stories forged from their choices - everyone s playthrough\nwill have a unique story to tell. With over 120,000 words and many hours\nof replayable content, each playthrough allows players to explore more of\nthe overall story space and learn more about the crash and their fellow\nsurvivors. There are no good or bad choices and endings to Dyscourse\nhow to best survive the island is a decision left up to the player\nChoose wisely!\n\nBurn/mount, install, copy crack, play!\n\nGreetz: LARGEiSO and MEDIUMiSO","torrent":{"xt":"urn:btih:2829e13b95950165504f8c6233e56a632b1d535a","amp;dn":"Dyscourse+-+TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2829e13b95950165504f8c6233e56a632b1d535a","infoHashBuffer":{"type":"Buffer","data":[40,41,225,59,149,149,1,101,80,79,140,98,51,229,106,99,43,29,83,90]},"announce":[],"urlList":[]}}