{"title":"Advanced Java EE Development with WildFly - Deepak Vohra","uid":11963215,"size":12825547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282a1aca4414279f66df92aab777412ebb184746&amp;dn=Advanced+Java+EE+Development+with+WildFly+-+Deepak+Vohra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432596275,"description":"About This Book\n\nDevelop Java EE 7 applications using the WildFly platform\nDiscover how to use EJB 3.x, JSF 2.x, Ajax, JAX-RS, JAX-WS, and Spring with WildFly 8.1\nA practical guide filled with easy-to-understand programming examples to help you gain hands-on experience with Java EE development using WildFly\nWho This Book Is For\n\nThis book is for professional WildFly developers. If you are already using JBoss or WildFly but don't use the Eclipse IDE and Maven for development, this book will show you how the Eclipse IDE and Maven facilitate the development of Java EE applications with WildFly 8.1. This book does not provide a beginner-level introduction to Java EE as it is written as an intermediate/advanced course in Java EE development with WildFly 8.1.\n\nIn Detail\n\nThis book starts with an introduction to EJB 3 and how to set up the environment, including the configuration of a MySQL database for use with WildFly. We will then develop object-relational mapping with Hibernate 4, build and package the application with Maven, and then deploy it in WildFly 8.1, followed by a demonstration of the use of Facelets in a web application.\n\nMoving on from that, we will create an Ajax application in the Eclipse IDE, compile and package it using Maven, and run the web application on WildFly 8.1 with a MySQL database. In the final leg of this book, we will discuss support for generating and parsing JSON with WildFly 8.1.\n\n**","torrent":{"xt":"urn:btih:282a1aca4414279f66df92aab777412ebb184746","amp;dn":"Advanced+Java+EE+Development+with+WildFly+-+Deepak+Vohra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282a1aca4414279f66df92aab777412ebb184746","infoHashBuffer":{"type":"Buffer","data":[40,42,26,202,68,20,39,159,102,223,146,170,183,119,65,46,187,24,71,70]},"announce":[],"urlList":[]}}