{"title":"Hypnosis in Clinical Practice: Steps for Mastering Hypnotherapy","uid":4725859,"size":1873803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282da24138668c822e5cac742ab6e88996fbec4f&amp;dn=Hypnosis+in+Clinical+Practice%3A+Steps+for+Mastering+Hypnotherapy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"VasiaZozulia","files":1,"time":1234741523,"description":"This book is aimed at helping both newly trained and experienced mental health professionals become comfortable and adept in using hypnosis in their clinical practice. Despite dramatic evidence of the effectiveness of hypnosis and its growing acceptance, only a small percentage of psychotherapists employ their hypnotherapy training in their practices. This under-use of hypnosis is due to exaggerated misconceptions about its power and the resultant performance anxiety therapists experience after their training. This text is designed to address therapist performance anxiety surrounding the use of hypnosis by exploring the myths surrounding its power and therapeutic potential. The integration of a straightforward systematic hypnotic approach into therapeutic practice has value both in assessment and treatment. Using clinical anecdotes and personal experience, the authors of Hypnosis in Clinical Practice explain induction style and trance work in a way that is fundamental and highly accessible.\n\n","torrent":{"xt":"urn:btih:282da24138668c822e5cac742ab6e88996fbec4f","amp;dn":"Hypnosis+in+Clinical+Practice%3A+Steps+for+Mastering+Hypnotherapy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282da24138668c822e5cac742ab6e88996fbec4f","infoHashBuffer":{"type":"Buffer","data":[40,45,162,65,56,102,140,130,46,92,172,116,42,182,232,137,150,251,236,79]},"announce":[],"urlList":[]}}