{"title":"Free Willy /1, 2 en 3/Retail/multi Audio+multi Subs [NLUPPER]","uid":5263253,"size":13779779086,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:28390c0db93c47c4aa6d15a6ba7576c945bf438f&amp;dn=Free+Willy+%2F1%2C+2+en+3%2FRetail%2Fmulti+Audio%2Bmulti+Subs+%5BNLUPPER%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"NLUPPER","files":-1,"time":1262804145,"description":"Free Willy 1 ( 1993 )\n\nPLOT\n\nFishermen separate a young orca whale (Willy) from his parents and he ends up in a fish bowl at a \n\nmarina. Meanwhile, a street kid runs afoul of the law and gets caught vandalising the marina, but his \n\nsocial worker gets him off the hook (so to speak) provided he cleans up his mess at the marina. While \n\nthere, he befriends the whale and teaches him tricks, something the trainer hasn't been able to do. But \n\nwhen Willy is a dud in front of the audience, the marina owner plans some bad things, and the boy and \n\nhis friends must try to free Willy\n\n\nFrankrijk / Verenigde Staten\nFamilie / Avontuur\n112 minuten\n\ngeregisseerd door Simon Wincer\nmet Jason James Richter, Lori Petty en Michael Madsen\n\nJesse is in een pleeggezin geplaatst, maar loopt weg en beklad het bassin van een dolfinarium met \n\nspuitverf. De politie brengt hem terug naar de pleegouders met de opdracht dat hij alles schoonmaakt. Bij \n\nde uitvoering hiervan sluit hij vriendschap met Willy, een eigenwijze orka die niet veel van mensen moet \n\nhebben en al van jongs af aan in gevangenschap leeft. Juist omdat ze zo gelijk zijn liggen de twee elkaar \n\nwel. Hij wil alles doen om Willy te bevrijden.\n\nMM:  &lt;a href=&quot; http://www.moviemeter.nl/film/2091&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/2091&lt;/a&gt;\n\nIMDB:  &lt;a href=&quot; http://www.imdb.com/title/tt0106965/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0106965/&lt;/a&gt;\n\nFree Willy 2: The Adventure Home   ( 1995 )\n\nPLOT\n\nTwo years ago the boy Jesse helped the whale Willy to jump into freedom. Jesse enjoys the life with his \n\nadoptive parents, when his half-brother Elvis arrives because of the death of their mother. During a \n\ncamping trip Jesse meets Willy again, as well as his Indian friend Randolph. A tender love develops \n\nbetween Jesse and Rudolph's goddaughter Nadine. Suddenly a crashed oil tanker endangers the \n\nwhales, and several animal and human lives have to be saved as well when the oil catches fire.\n\n\nVerenigde Staten / Frankrijk\nFamilie / Avontuur\n95 minuten\n\ngeregisseerd door Dwight H. Little\nmet Jason James Richter, Mary Kate Schellhardt en Michael Madsen\n\nDe geadopteerde Jesse krijgt te horen dat zijn echte moeder eindelijk gelokaliseerd is, doordat ze \n\noverleden is. Hij blijkt een halfbroer te hebben die nu als pleegkind wordt opgenomen in hun gezin. Jesse \n\nwil hem echter niet accepteren, zeker niet omdat hij steeds leugens vertelt. Als ze allen gaan kamperen \n\nzien ze de orka Willy die herenigd is met zijn familie. De vrijheid van de orka's wordt nu echter bedreigd \n\ndoor een ramp met een olietanker.\n\nMM:  &lt;a href=&quot; http://www.moviemeter.nl/film/2092&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/2092&lt;/a&gt;\n\nIMDB:  &lt;a href=&quot; http://www.imdb.com/title/tt0113114/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0113114/&lt;/a&gt;\n\n\nFree Willy 3: The Rescue    ( 1997 )\n\nPLOT\n\nWilly the whale is back, this time threatened by illegal whalers making money off sushi. Jesse, now 16, \n\nhas taken a job on an orca-researching ship, along with old friend Randolph and a sarcastic scientist, \n\nDrew. On the whaler's ship is captain John Wesley and his son, Max, who isn't really pleased about his \n\nfather's job, but doesn't have the gut to say so. Along the way, Willy reunites with Jesse, who helps Max \n\nrealize that whales are a little more than just cheese burgers.\n\n\nVerenigde Staten\nFamilie / Avontuur\n86 minuten\n\ngeregisseerd door Sam Pillsbury\nmet Jason James Richter, August Schellenberg en Annie Corley\n\nJesse is inmiddels 17 jaar. Hij werkt tijdens de vakantie samen met Randolph op een boot waar \n\nonderzoek wordt gedaan naar orka's. Willy en zijn familie worden op een mysterieuze manier bedreigd \n\nmet uitsterven. Als Jesse zijn nieuwe vriendje Max ontmoet wordt hem al snel duidelijk wat er aan de \n\nhand is. De vader van Max, een visser, houdt zich bezig met duistere werkzaamheden die een bedreiging \n\nvormen voor de orka's\n\nMM:  &lt;a href=&quot; http://www.moviemeter.nl/film/2093&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/2093&lt;/a&gt;\n\nIMDB:  &lt;a href=&quot; http://www.imdb.com/title/tt0119152/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0119152/&lt;/a&gt;\n\nEr zijn veel meningen die verschillen over deze films, ik ben blij dat ik ze in mijn verzameling heb want het \n\nblijft een ontroerend verhaal en kan begrijpen dat sommige een zakdoek nodig hebben.\nMijn mening is als volgt. ( cijfer 1-10 )\n\nDeel 1: 9.0, Zeer mooie film.\nDeel 2: 7,5  Zeker geen slechte film, maar net niet zo mooi als deel 1.\nDeel 3. 6.0, Deze was eigenlijk teveel van het goede, maar is zeker de moeite waard.\n\nINFO\n\nFormat: All 3-DVD5\nSource: All 3  Retail\nVideo: All 3 16x9 PAL\nAudio : All 3 DD 5.1 Eng, DD 5.1 French, DD2.0 Dutch\nMenu: Yes\nSubs: All 3 English, French, Dutch, Arabic \nGenre: Adventure, Family\nCover: Yes all 3 inside resolutions 1194x800\n\n","torrent":{"xt":"urn:btih:28390c0db93c47c4aa6d15a6ba7576c945bf438f","amp;dn":"Free+Willy+%2F1%2C+2+en+3%2FRetail%2Fmulti+Audio%2Bmulti+Subs+%5BNLUPPER%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28390c0db93c47c4aa6d15a6ba7576c945bf438f","infoHashBuffer":{"type":"Buffer","data":[40,57,12,13,185,60,71,196,170,109,21,166,186,117,118,201,69,191,67,143]},"announce":[],"urlList":[]}}