{"title":"The Italian Painters of the Renaissance (Phaidon Art Ebook).pdf","uid":10476252,"size":48346359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28646b16fbb1ee6381866765d2ab27ce458de295&amp;dn=The+Italian+Painters+of+the+Renaissance+%28Phaidon+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1404338402,"description":"Pdf / English / 1954 Phaidon / 488 pag / 46 MB\n\nBerenson's classic study of Italian Renaissance painters is well worth seeking in used bookstores or through book-finding services. This collection of essays separately published between 1894 and 1907 focuses on the painters of Venice, Florence, central Italy, and north Italy. In intelligent, lively prose, the author not only analyzes the merit of scores of individual painters from Giotto to Correggio but also traces the development of Italian painting and constantly reiterates his theory that the &quot;life enhancement&quot; qualities of of high art are found in the areas of tactile values, movement, and spatial composition, all of which he explains in articulate detail. Movement and energy, for example, can be expressed in an arm leaning on a pillow. He correctly identifies the partnership in Florence between an intense desire for knowledge that helps to explain and control the world and the &quot;discovery&quot; of classical forms from ancient Rome. In painting, this led above all to a focus on the human figure (which Berenson claims as the ultimate subject of art) and a preeminent dedication to line. The intellectual rigor of Florence contrasted with Venice, the voluptuous capital of a wealthy mercantile empire distinguished by public rituals, where spectacle and color were the chief aims of art. Berenson's authority ranges through landscape, the uses of antiquity, Illustration and Decoration, prettiness versus beauty, and archaic art, whose appeal lies in its search for form and movement. The book is sparsely illustrated, so you will have to supplement it with your own visual sources, but it's a goldmine of information, useful perspectives, and thought-provoking opinions.\n\nAmazon, By Andrew Rasanen on September 4, 2000","torrent":{"xt":"urn:btih:28646b16fbb1ee6381866765d2ab27ce458de295","amp;dn":"The+Italian+Painters+of+the+Renaissance+%28Phaidon+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28646b16fbb1ee6381866765d2ab27ce458de295","infoHashBuffer":{"type":"Buffer","data":[40,100,107,22,251,177,238,99,129,134,103,101,210,171,39,206,69,141,226,149]},"announce":[],"urlList":[]}}