{"title":"BBC.Documentaries.2016.07.20.The.Joy.of.Data.EN.SUB.x265.MPup","uid":15390964,"size":269875202,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:292514b162b6183bac0e7b45e92c10743f1e0cfc&amp;dn=BBC.Documentaries.2016.07.20.The.Joy.of.Data.EN.SUB.x265.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"makinapufterpup","files":2,"time":1469339203,"description":"BBC.Documentaries.2016.07.20.The.Joy.of.Data.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nA witty and mind-expanding exploration of data, with mathematician Dr Hannah Fry. This high-tech romp reveals what data is and how it is captured, stored, shared and made sense of. Fry tells the story of the engineers of the data age, people most of us have never heard of despite the fact they brought about a technological and philosophical revolution.\r\n\r\nFor Hannah, the joy of data is all about spotting patterns. Hannah sees data as the essential bridge between two universes - the tangible, messy world that we see and the clean, ordered world of maths, where everything can be captured beautifully with equations.\r\n\r\nThe film reveals the connection between Scrabble scores and online movie streaming, explains why a herd of dairy cows are wearing pedometers, and uncovers the network map of Wikipedia. What's the mystery link between marmalade and One Direction?\r\n\r\nThe film hails the contribution of Claude Shannon, the mathematician and electrical engineer who, in an attempt to solve the problem of noisy telephone lines, devised a way to digitise all information. Shannon singlehandedly launched the 'information age'. Meanwhile, Britain's National Physical Laboratory hosts a race between its young apprentices in order to demonstrate how and why data moves quickly around modern data networks. It's all thanks to the brilliant technique first invented there in the 1960s by Welshman Donald Davies - packet switching.\r\n\r\nBut what of the future? Should we be worried by the pace of change and what our own data could be used for? Ultimately, Fry concludes, data has empowered all of us. We must have machines at our side if we're to find patterns in the modern-day data deluge. But, Fry believes, regardless of AI and machine learning, it will always take us to find the meaning in them","torrent":{"xt":"urn:btih:292514b162b6183bac0e7b45e92c10743f1e0cfc","amp;dn":"BBC.Documentaries.2016.07.20.The.Joy.of.Data.EN.SUB.x265.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"292514b162b6183bac0e7b45e92c10743f1e0cfc","infoHashBuffer":{"type":"Buffer","data":[41,37,20,177,98,182,24,59,172,14,123,69,233,44,16,116,63,30,12,252]},"announce":[],"urlList":[]}}