{"title":"Mp3 Tag Editor 5.9.0.406 + Crack","uid":4341504,"size":5104632,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:296da65f9af43b8ebdde2b40b6240d50f43c9d64&amp;dn=Mp3+Tag+Editor+5.9.0.406+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"romelanda","files":6,"time":1218588671,"description":"ManiacTools mp3Tag 5 is a tag processor for MP3, WMA, OGG, APE, AAC, WAV, FLAC, WavPack WV, Musepack MPC/MPP/MP+ and Apple iPod MP4/M4a files with great features, like an automated search for lyrics and pictures (album covers). Another important advantage is the automatic tag filling option, which works great for mp3 albums that come without tags and meaningless file names, like 01.mp3, 02.mp3, 03.mp3, etc. The program takes the track lengths and compares this information with FreeDB data to find the appropriate album to import tags from. After confirmation the information is stored in the tags and if required can be used to rename the files. mp3Tag also import tags from Amazon.\n\nManiacTools mp3Tag 5 allows the users to view and edit tag information, save lyrics and pictures inside MP3/WMA/M4a files, view technical information about music files and delete unused MP3-tags. The program is capable of changing one or more tag fields simultaneously (including multiple files), generating Winamp and Windows Media Player playlists, exporting tag information, renaming groups of files according to their tag data and much more. And special feature for iPod lovers - m4a tag editor!\n\nOther important program features are the Drag&amp;Drop technology and is fully compatible with Windows Media Player 10 and iTunes 6. It does not require any special skills and has received over a dozen awards, including prestigious My Music Tools Editor&amp;#039;s Pick. The program is translated into all major European languages.\n\nHome - www.maniactools.com\n","torrent":{"xt":"urn:btih:296da65f9af43b8ebdde2b40b6240d50f43c9d64","amp;dn":"Mp3+Tag+Editor+5.9.0.406+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296da65f9af43b8ebdde2b40b6240d50f43c9d64","infoHashBuffer":{"type":"Buffer","data":[41,109,166,95,154,244,59,142,189,222,43,64,182,36,13,80,244,60,157,100]},"announce":[],"urlList":[]}}