{"title":"Pink Floyd 24 Bit Vinyl Pack","uid":9088350,"size":23702550172,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29c9da204586c3787158a01202dedd006b257e96&amp;dn=Pink+Floyd+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"politux","files":-1,"time":1382539739,"description":"\n  Pink Floyd 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Art Rock, Prog-Rock, Hard Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  1967 The Piper at the Gates of Dawn\n  1968 A Saucerful of Secrets\n  1969 More \n  1971 Meddle\n  1972 Obscured By Clouds\n  1975 Wish You Were Here \n  1976 Wish You Were Here (Sony Mastersound)\n  1977 Animals (1st Korean Press)\n  1977 Shine On Tour\n  1979 The Wall\n  1983 The Final Cut (UK)\n  1983 The Final Cut (CBS Sony)\n  1988 Delicate Sound of Thunder \n  1988 Delicate Sound of Thunder (1991)\n  1990 Rhapsody in Pink\n  1994 The Division Bell (UK)\n  1994 The Division Bell (PBTHAL 2011)\n\n    Some bands turn into shorthand for a certain sound or style, and Pink Floyd belongs among that elite group. The very name connotes something specific: an elastic, echoing, mind-bending sound that evokes the chasms of space. Pink Floyd grounded that limitless sound with exacting explorations of mundane matters of ego, mind, memory, and heart, touching upon madness, alienation, narcissism, and society on their concept albums of the '70s. Of these concept albums, Dark Side of the Moon resonated strongest, earning new audiences year after year, decade after a decade, and its longevity makes sense. That 1973 concept album distilled the wild psychedelia of their early years -- that brief, heady period when they were fronted by Syd Barrett -- into a slow, sculpted, widescreen epic masterminded by Roger Waters, the bassist who was the band's de facto leader in the '70s. Waters fueled the band's golden years, conceiving such epics as Wish You Were Here and The Wall, but the band survived his departure in the '80s, with guitarist David Gilmour stepping to forefront on A Momentary Lapse of Reason and The Division Bell. Throughout the years, drummer Nick Mason and keyboardist Rick Wright appeared in some capacity, and the band's sonic signature was always evident: a wide, expansive sound that was instantly recognizable as their own yet was adopted by all manner of bands, from guitar-worshipping metal-heads to freaky, hippie, ambient electronic duos. Unlike almost any of their peers, Pink Floyd played to both sides of the aisle: they were rooted in the blues but their heart belonged to the future, a dichotomy that made them a quintessentially modern 20th century band.","torrent":{"xt":"urn:btih:29c9da204586c3787158a01202dedd006b257e96","amp;dn":"Pink+Floyd+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c9da204586c3787158a01202dedd006b257e96","infoHashBuffer":{"type":"Buffer","data":[41,201,218,32,69,134,195,120,113,88,160,18,2,222,221,0,107,37,126,150]},"announce":[],"urlList":[]}}