{"title":"Fundamentals of Amputation Care and Prosthetics Murphy [StormRG]","uid":11836170,"size":1965803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a730a15eead214010ec1ac8d46c8bc8b0b81ba7&amp;dn=Fundamentals+of+Amputation+Care+and+Prosthetics+Murphy+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1429746978,"description":"TITLE/EDITION Fundamentals of Amputation Care and Prosthetics \nBy: Douglas Murphy\nPaperback: 248 pages\nPublisher: Demos Medical; 1 edition (August 28, 2013)\nLanguage: English\nISBN-10: 1936287706\nISBN-13: 978-1936287703\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nWritten by experienced physiatrists, prosthetists, and therapists, this book provides an introduction to the field of amputee care and prosthetics. Dedicated chapters guide you through prescription of prostheses for the various levels and types of amputations in both the lower and upper extremity and address recent advances in functionality and safety. Pre- and post-operative care, prosthetic troubleshooting, gait issues and medical management of the residual limb are also addressed. With concise key information highlighted throughout, this handbook is a welcome point of care resource or study tool for trainees and practitioners in any field who work with amputees to restore function and help enrich the lives of these individuals.\n\nFundamentals of Amputation Care and Prosthetics features:\n\nConcise, practical manual; covers the basics of upper and lower extremity amputee care and prosthetics\nSuccinct presentation, well-illustrated; information is easy to find\nPortable; perfect for use on rounds or in the clinic\nState-of-the-art distillation of current thinking and practice; excellent transitional book for residents or ready reference for experienced practitioners","torrent":{"xt":"urn:btih:2a730a15eead214010ec1ac8d46c8bc8b0b81ba7","amp;dn":"Fundamentals+of+Amputation+Care+and+Prosthetics+Murphy+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a730a15eead214010ec1ac8d46c8bc8b0b81ba7","infoHashBuffer":{"type":"Buffer","data":[42,115,10,21,238,173,33,64,16,236,26,200,212,108,139,200,176,184,27,167]},"announce":[],"urlList":[]}}