{"title":"Tapping Into Your Energy Awareness with Judith Orloff [MP3]","uid":11892435,"size":60141650,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ad849a27b6676dfe2104528c0bcb5213cc57b9d&amp;dn=Tapping+Into+Your+Energy+Awareness+with+Judith+Orloff+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"elessedilgirl","files":3,"time":1431028577,"description":"Transform your life by accessing your sacred energy.\n\nLearn what your intuitive state is and how you interact with the energies in this world.\nFind out how to attract positive people and energy to your life.\nStop feeling drained and live a vibrant life!\n\nWe're not taught, as children, how to manage our energy, and this is a big omission. What drains our energy? What increases our energy? What effect do the people in our lives have on us? Our souls come from a place of spiritual energy, and learning how to become aware of our energy levels and the positive and negative sources of energy in our world can help us further along the path of achieving our primary job in life - finding our soul's true purpose.\n\nDr. Orloff helps her listeners discover their innate intuitive empathy -- the ability to sense and absorb the energy of people and places around you -- and learn how to work with it in a positive fashion to experience life to the fullest. It's a tremendous gift, but this ability is not well understood in our culture. Often people who have high levels of intuitive empathy can find themselves overwhelmed by exhaustion, by physical aches and pains, and by other mysterious symptoms that doctors cannot diagnose. Dr. Orloff offers insight into the energy imbalances that can cause these feelings and provides a roadmap to increasing positive energy, avoiding overloads or energy drains, and living life to the fullest.\n\nJudith Orloff, M.D. is an intuition expert and board-certified psychiatrist with a private practice in Los Angeles. She is the author of the bestsellers Positive Energy, upon which this CD set is based, and Guide to Intuitive Healing and Second Sight. She is an Assistant Clinical Professor of Psychiatry at UCLA and an international workshop leader on the interrelationship of intuition, energy, and medicine.\n\nTracks:\n\nPart 1 - 1:09:52\nPart 2 - 30:22\n\nMP3 - 80 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:2ad849a27b6676dfe2104528c0bcb5213cc57b9d","amp;dn":"Tapping+Into+Your+Energy+Awareness+with+Judith+Orloff+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ad849a27b6676dfe2104528c0bcb5213cc57b9d","infoHashBuffer":{"type":"Buffer","data":[42,216,73,162,123,102,118,223,226,16,69,40,192,188,181,33,60,197,123,157]},"announce":[],"urlList":[]}}