{"title":"Avatar Theatrical (2009) 1080p Rifftrax 6ch 2ch v2","uid":11930497,"size":4445929580,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2b154ecd5139a2d59e30e8cac22ad97883bf719f&amp;dn=Avatar+Theatrical+%282009%29+1080p+Rifftrax+6ch+2ch+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"bsg4you","files":3,"time":1431781548,"description":"Avatar.Theatrical.2009.1080p.Rifftrax.6ch.2ch.v2.mkv\n\nDEFAULT AUDIO IS TRACK1 MOVIE PLUS RIFFTRAX\nFOR MOVIE ONLY SOUND SWITCH TO TRACK2 FOR 5.1 OR TRACK3 FOR 2.0\n\nTHIS IS THE 2D THEATRICAL VERSION OF AVATAR (NOT THREE DEE, NOT E X T E N D E D)\n\nAvatar Theatrical Edition (2009)\nvideo: 1920x1080 AVC\naudio1 (default): movie plus Rifftrax AAC 2.0\naudio2: just movie AC3 5.1\naudio3: just movie AAC 2.0\nsubs1: Na'vi only to English, hard coded, burned in, not switchable\nsubs2: English without Na'vi, built in, off by default, not hard coded, switchable\nintro: 1s after Disembaudio's singing during the credits\nRifftrax released 2010.04.22 2hour41min41sec 4,445,866,007bytes\n\nThis version2 has the following changes:\n* newly remastered 2.0 Riff track using Chris's Dynamic Compressor on the movie and Level Speech on the riffs\n* new 2.0 Riff audio track has more balanced and understandable riff and movie dialog\n* the volume range for the riffs is much, much more consistent so even very quiet riff words are clear\n* the v2 movie audio has better fidelity, especially in loud parts\n* the quietest movie dialog is now louder and easier to hear\n* Disembaudio's singing volume was reduced relative to the credits song volume\n* the overall credits song volume has the same peak as the riffs\n* v2 2.0 Riff is 193Kbps vs v1 at 163bps\n* v2 has Advanced SSA subs instead of v1's UTF-8 Plain Text subs\n\nThis is a remux with the Rifftrax commentary added as the default audio track. The Rifftrax audio track has been newly remastered to ensure the riff comments are just loud enough to be clear when the movie is loud and not too loud when the movie is quiet. Please leave any feedback regarding the Rifftrax audio remastering.\n\nThere are some faint pops in the source commentary mp3 from Rifftrax. This was confirmed with PotPlayer, VLC and Foobar on 2 computers. The pops are not so pronounced that they can be seen in the waveform or removed with Audacity but a few may be noticeable. The pops are in the source, have nothing to do with the processing and are more prominent at the end, especially during Disembaudiou's singing.\n\nMost, but not all, of the Na'vi dialog is hard subtitled and can not be switched off. The soft English only subs do not include the Na'vi dialog except for one line. There is a small Na'vi hard subtitle error when Grace enters the village for the first time: around 1h02m57s Jake says a narration line that is mistakenly included in the Na'vi hard subs (it's a mistake in the source).\n\nBig thanks to the posters of the 1080p/5.1 encodes of the movies, the subs and the chapters.\n\nIf this Rifftrax was enjoyable, you haven't paid for it and you have a few dollars to spare, please consider purchasing this riff (3.99USD) or make a general donation via CCard, PPal, Bitcoin/Dogecoin/Litecoin or wallet payment apps at  \n\nPlease check out other Rifftrax, Battlestar Galactica, DC Comics, documentaries, Star Trek Enterprise and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \n &lt;a href=&quot; https://kickass.so/user/bsg4you/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://kickass.so/user/bsg4you/uploads/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:2b154ecd5139a2d59e30e8cac22ad97883bf719f","amp;dn":"Avatar+Theatrical+%282009%29+1080p+Rifftrax+6ch+2ch+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b154ecd5139a2d59e30e8cac22ad97883bf719f","infoHashBuffer":{"type":"Buffer","data":[43,21,78,205,81,57,162,213,158,48,232,202,194,42,217,120,131,191,113,159]},"announce":[],"urlList":[]}}