{"title":"1989 World Tour Live - Taylor Swift","uid":13078985,"size":5611555217,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c40ccbc71933e38966bced661453b62ae33e075&amp;dn=1989+World+Tour+Live+-+Taylor+Swift&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Wolftame","files":1,"time":1450884647,"description":"The 1989 World Tour LIVE is Available Worldwide Exclusively on Apple Music on December 20th\r\n \r\nTaylor Swift is giving her fans on Apple Music a special surprise this holiday, The 1989 World Tour LIVE. The 1989 World Tour LIVE was filmed in front of 76,000 fans at the ANZ Stadium in Sydney, Australia on November 28, 2015. The 1989 World Tour LIVE captures Taylor’s entire performance from Sydney with never seen footage filmed backstage and during rehearsals with surprise musical and special guests that appeared on The 1989 World Tour. \r\n \r\nBeginning Sunday, December 20, The 1989 World Tour LIVE will be available in its entirety exclusively to Apple Music members around the world at applemusic.com/Taylorswift and can be enjoyed across devices including iPhone, iPad, iPod touch, Mac, PC and Apple TV. Fans who don’t already have an active Apple Music account can visit apple.com/music to sign up for a three month free trial today. Plus, Apple Music is the only place where fans can stream Taylor Swift’s full catalog of albums and songs including the Grammy nominated Album of the Year, 1989.\r\n \r\n \r\nMusical guests featured in The 1989 World Tour LIVE include: \r\nThe Band Perry, Beck, Dierks Bentley, Mary J. Blige, Charli XCX, Jason Derulo, Echosmith, Fetty Wap, Selena Gomez, Ellie Goulding, HAIM  Fifth Harmony, Imagine Dragons, Mick Jagger, Nick Jonas, Alison Krauss, Lisa Kudrow, Miranda Lambert, Avril Lavigne, John Legend, Leona Lewis, Little Big Town, Lorde, Natalie Maines, Ricky Martin, Idina Menzel, Alanis Morissette, Rachel Platten, Nelly, Pitbull, St. Vincent, Justin Timberlake, Tove Lo, Steven Tyler, Keith Urban, Walk the Moon, The Weeknd and Wiz Khalifa. \r\n \r\n \r\nThe 1989 World Tour LIVE also includes special guests appearances by: \r\nLily Aldridge, Abigail Anderson, Joan Baez, Kobe Bryant, Ciara, Ellen Degeneres, Cara Delevingne, Lily Donaldson, Lena Dunham, Gigi Hadid, Mariska Hargitay, Martha Hunt, Kendall Jenner, Jaime King, Karlie Kloss, Heidi Klum, Matt LeBlanc, Sean O’Pry, Andreja Pejic, Behati Prinsloo, Julia Roberts,  Chris Rock, Hailee Steinfeld, Candice Swanepoel, Dwyane Wade, Serena Williams, Russell Wilson and the U.S. Women's Soccer Team","torrent":{"xt":"urn:btih:2c40ccbc71933e38966bced661453b62ae33e075","amp;dn":"1989+World+Tour+Live+-+Taylor+Swift","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c40ccbc71933e38966bced661453b62ae33e075","infoHashBuffer":{"type":"Buffer","data":[44,64,204,188,113,147,62,56,150,107,206,214,97,69,59,98,174,51,224,117]},"announce":[],"urlList":[]}}