{"title":"Building Strong Brands - David Aaker  [Qwerty80]","uid":8016429,"size":38297273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c94fb4d594bb9698c79d2650d0361445ca0f909&amp;dn=Building+Strong+Brands+-+David+Aaker++%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KatQwerty","files":3,"time":1358111701,"description":"\nThis is a very Hard to Find book, but a must have. So when i Found this LO-Quality Scan, i still uploaded it, for the ones who may need it.\n\n\n \n[b] Release Date: December 12, 1995 |  PDF  [/b]\n \n \n \n\nAs industries turn increasingly hostile, it is clear that strong brand-building \n\nskills are needed to survive and prosper. In David Aaker's pathbreaking book, \n\nManaging Brand Equity, managers discovered the value of a brand as a strategic asset \n\nand a company's primary source of competitive advantage. Now, in this compelling new \n\nwork, Aaker uses real brand-building cases from Saturn, General Electric, Kodak, \n\nHealthy Choice, McDonald's, and others to demonstrate how strong brands have been \n\ncreated and managed.\nA common pitfall of brand strategists is to focus on brand attributes. Aaker shows \n\nhow to break out of the box by considering emotional and self-expressive benefits and \n\nby introducing the brand-as-person, brand-as-organization, and brand-as-symbol \n\nperspectives. The twin concepts of brand identity (the brand image that brand \n\nstrategists aspire to create or maintain) and brand position (that part of the brand \n\nidentity that is to be actively communicated) play a key role in managing the &quot;out-\n\nof-the-box&quot; brand.\n\nA second pitfall is to ignore the fact that individual brands are part of a larger \n\nsystem consisting of many intertwined and overlapping brands and subbrands. Aaker \n\nshows how to manage the &quot;brand system&quot; to achieve clarity and synergy, to adapt to a \n\nchanging environment, and to leverage brand assets into new markets and products.\n\nAaker also addresses practical management issues, introducing a set of brand equity \n\nmeasures, termed the brand equity ten, to help those who measure and track brand \n\nequity across products and markets. He presents and analyzes brand-nurturing \n\norganizational forms that are responsive to the challenges of coordinated brands \n\nacross markets, products, roles, and contexts. Potentially destructive organizational \n\npressures to change a brand's identity and position are also discussed.\n\nAs executives in a wide range of industries seek to prevent their products and \n\nservices from becoming commodities, they are recommitting themselves to brands as a \n\nfoundation of business strategy. This new work will be essential reading for the \n\nbattle-ready.\n \n \n \n \n ","torrent":{"xt":"urn:btih:2c94fb4d594bb9698c79d2650d0361445ca0f909","amp;dn":"Building+Strong+Brands+-+David+Aaker++%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c94fb4d594bb9698c79d2650d0361445ca0f909","infoHashBuffer":{"type":"Buffer","data":[44,148,251,77,89,75,185,105,140,121,210,101,13,3,97,68,92,160,249,9]},"announce":[],"urlList":[]}}