{"title":"Oedipus Rex (1967) dir by Paolo Pasolini","uid":15841879,"size":960503486,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ca3abfb7463f401cbb378572a7e1463507dedf5&amp;dn=Oedipus+Rex+%281967%29+dir+by+Paolo+Pasolini&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"loninappleton","files":2,"time":1474054454,"description":"Oedipus Rex from the play by Sophocles (1967)\r\n directed by Pier Paolo Pasolini\r\nfrom the Pier Paolo Pasolini Collection volume 1 at Water Bearer Films\r\n\r\nRun time 1 hr 45 min.\r\n\r\nIMDb:  tt0061613\r\n\r\nDirected by Pier Paolo Pasolini\r\n\r\nCast\r\n\r\nSilvana Mangano               Giocasta\r\nFranco Citti                  Edipo\r\nAlida Vali                    Merope\r\nCarmelo Bene                  Creonte\r\nJulian Beck                   Tiresia\r\n\r\nSummary\r\n\r\n  Pasolini's own translation of the original Sophocles play is set within a modern \r\nprologue and epilogue. Oracles predict that Oedipus will someday kill his father and \r\nmarry his mother, so the infant is sent into the hills to be killed. The baby \r\nsurvives and is adopted by a neighboring King of Corinth. Oedipus returns but his \r\norigins are kept a secret until it is too late to avert his destiny.\r\n\r\nMy notes\r\n\r\n  A number of the Pasolini films on Greek classics became available  to me all at once\r\nand include a three film set called The Pier Paolo Pasolini Collection,  this being \r\nvolume 1 and one film from the collection. \r\n\r\n   After a prologue in modern time, the film tells the story of Oedipus in a similar \r\ntribal and ancient manner as Pasolini's &quot;Medea&quot; of Euripides which is also in my file share \r\ncollection.\r\n\r\n   The story is well known.  But perhaps the best moment in the film is when we learn the reason why Oedipus' name means &quot;swollen foot.&quot;\r\n\r\n   But of significance to me is the appearance of Julian Beck.  Julian Back was famous \r\nin his own right as a theatre practitioner.  He,  along worth Judith Malina,  was the \r\nfounder of The Living Theatre.  The documentary on The Living Theatre made shortly\r\nbefore Beck's death in the 1980's is a part of my file share collection.  It is \r\ncalled &quot;Signals Through The Flames&quot;.  The title itself is significant as a quotation \r\nfrom Antonin Artaud,  the French theatre theorist.  All of this can be explored by \r\nthe viewer but for me it is a way of bringing together things I know about the \r\ntheatre, experimental theatre of the 1960's in particular.\r\n\r\n   See the introduction of Signals through the flames and you will perhaps find out what I \r\nmean.\r\n\r\n   Here in the Oedipus we have Italian language with hard subtitles in English.\r\nMuch of the story is told in images and can be enjoyed simply visually.  There are \r\nseveral inter-titles (message boards) which are translated in all capital letters.\r\n\r\n   This film by Pasolini is one of the very few dramatizations of the Oedipus legend \r\nand well worth getting for educational purposes everywhere.\r\n\r\nnotes written  September 15th 2016","torrent":{"xt":"urn:btih:2ca3abfb7463f401cbb378572a7e1463507dedf5","amp;dn":"Oedipus+Rex+%281967%29+dir+by+Paolo+Pasolini","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca3abfb7463f401cbb378572a7e1463507dedf5","infoHashBuffer":{"type":"Buffer","data":[44,163,171,251,116,99,244,1,203,179,120,87,42,126,20,99,80,125,237,245]},"announce":[],"urlList":[]}}