{"title":"Porous Materials - Processing and Applications","uid":12129407,"size":24512040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cca93e8aa371827ca4ad35b0654f8661145cd5c&amp;dn=Porous+Materials+-+Processing+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1436999175,"description":"Porous Materials - Processing and Applications (Elsevier, 2014).pdf\n\nISBN 9780124077881\n\nEngineers and scientists alike will find this book to be an excellent introduction to the topic of porous materials, in particular the three main groups of porous materials: porous metals, porous ceramics, and polymer foams. Beginning with a general introduction to porous materials, the next six chapters focus on the processing and applications of each of the three main materials groups. The book includes such new processes as gel-casting and freeze-drying for porous ceramics and self-propagating high temperature synthesis (SHS) for porous metals. The applications discussed are relevant to a wide number of fields and industries, including aerospace, energy, transportation, construction, electronics, biomedical and others. The book concludes with a chapter on characterization methods for some basic parameters of porous materials. Porous Materials: Processing and Applications is an excellent resource for academic and industrial researchers in porous materials, as well as for upper-level undergraduate and graduate students in materials science and engineering, physics, chemistry, mechanics, metallurgy, and related specialties.\n\nA comprehensive overview of processing and applications of porous materials - provides younger researchers, engineers and students with the best introduction to this class of materials\nIncludes three full chapters on modern applications - one for each of the three main groups of porous materials\nIntroduces readers to several characterization methods for porous materials, including methods for characterizing pore size, thermal conductivity, electrical resistivity and specific surface area","torrent":{"xt":"urn:btih:2cca93e8aa371827ca4ad35b0654f8661145cd5c","amp;dn":"Porous+Materials+-+Processing+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cca93e8aa371827ca4ad35b0654f8661145cd5c","infoHashBuffer":{"type":"Buffer","data":[44,202,147,232,170,55,24,39,202,74,211,91,6,84,248,102,17,69,205,92]},"announce":[],"urlList":[]}}