{"title":"The Nicomachean Ethics - Aristotle","uid":9416246,"size":5720946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cdac5c3af8376699c74de55e574e8bf248dedb2&amp;dn=The+Nicomachean+Ethics+-+Aristotle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"420weedman","files":-1,"time":1388450528,"description":" A student of Plato and a teacher of Alexander the Great, Aristotle is one of the towering figures in Western thought. A brilliant thinker with wide-ranging interests, he wrote important works in physics, biology, poetry, politics, morality, metaphysics, and ethics.\n\nIn the Nicomachean Ethics, which he is said to have dedicated to his son Nicomachus, Aristotle's guiding question is what is the best thing for a human being? His answer is happiness. &quot;Happiness,&quot; he wrote, &quot;is the best, noblest, and most pleasant thing in the world.&quot; But he means not something we feel, not an emotion, but rather an especially good kind of life. Happiness is made up of activities in which we use the best human capacities, both ones that contribute to our flourishing as members of a community, and ones that allow us to engage in god-like contemplation. Contemporary ethical writings on the role and importance of the moral virtues such as courage and justice have drawn inspiration from this work, which also contains important discussions on responsibility, practical reasoning, and on the role of friendship in creating the best life.\nThis new edition combines David Ross's classic translation, lightly revised by Lesley Brown, with a new and invaluable introduction and explanatory notes. A glossary of key terms and comprehensive index, as well as a fully updated bibliography, add further value to this exceptional new edition.\n\nAbout the Series: For over 100 years Oxford World's Classics has made available the broadest spectrum of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, voluminous notes to clarify the text, up-to-date bibliographies for further study, and much more.\n\nReview\n\n&quot;Very useful as a cornerstone for our discussion of ethics and the Western moral tradition. The translation is elegant.&quot;--Dominic A. Aquila, Rochester Institute of Technology\n\n&quot;A fine translation of an essential classic in the field of ethics.&quot;--Claudia Card, University of Wisconsin\n\n&quot;The index is extremely helpful. The 'contents' are also a helpful tool. The numbering and division titles also make this book a little easier to teach.&quot;--Rose Marie Surwilo, College of St. Francis\n\n&quot;Very useful text of Aristotle: the translation presents no pitfalls to a beginning student; the editor's organization is useful but unitrusive; and finally, the cost is perfect.&quot;--Nickolas O. Papas, Hollins College\n\n&quot;An excellent translation and edition.&quot;--Winfield J.C. Myers, University of Georgia\n\n&quot;Most lucid and accessible edition popularly available.&quot;--John L. Hemingway, Washington State University","torrent":{"xt":"urn:btih:2cdac5c3af8376699c74de55e574e8bf248dedb2","amp;dn":"The+Nicomachean+Ethics+-+Aristotle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cdac5c3af8376699c74de55e574e8bf248dedb2","infoHashBuffer":{"type":"Buffer","data":[44,218,197,195,175,131,118,105,156,116,222,85,229,116,232,191,36,141,237,178]},"announce":[],"urlList":[]}}