{"title":"The God Delusion (Dawkins) [NF]","uid":3946994,"size":349600282,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ce7f524ab4a886d88f7b8679d660f0e7275fa81&amp;dn=The+God+Delusion+%28Dawkins%29+%5BNF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"autoslump","files":16,"time":1198551372,"description":"The God Delusion \n\nAuthor: Richard Dawkins\n\nNarrator: Richard Dawkins and Lalla Ward\n\nLength: 13 hours and 52 minutes\n\nType: Unabridged Audiobook\n\nGenre:  Biology, Genetics, Evolution, Atheism, Science &amp; Religion\n\nMP3 56 Kbps, 22 KHz, CBR, Stereo\n\n\nSummary:\n\nRichard Dawkins, in The God Delusion, tells of his exasperation with colleagues who try to play both sides of the street: looking to science for justification of their religious convictions while evading the most difficult implications?the existence of a prime mover sophisticated enough to create and run the universe, &quot;to say nothing of mind reading millions of humans simultaneously.&quot; Such an entity, he argues, would have to be extremely complex, raising the question of how it came into existence, how it communicates ?through spiritons!?and where it resides. Dawkins is frequently dismissed as a bully, but he is only putting theological doctrines to the same kind of scrutiny that any scientific theory must withstand. No one who has witnessed the merciless dissection of a new paper in physics would describe the atmosphere as overly polite.\n\nDiscover magazine recently called Richard Dawkins &quot;Darwin&amp;#039;s Rottweiler&quot; for his fierce and effective defense of evolution. Prospect magazine voted him among the top three public intellectuals in the world (along with Umberto Eco and Noam Chomsky). Now Dawkins turns his considerable intellect on religion, denouncing its faulty logic and the suffering it causes.\n\nHe critiques God in all his forms, from the sex-obsessed tyrant of the Old Testament to the more benign (but still illogical) Celestial Watchmaker favored by some Enlightenment thinkers. He eviscerates the major arguments for religion and demonstrates the supreme improbability of a supreme being. He shows how religion fuels war, foments bigotry, and abuses children, buttressing his points with historical and contemporary evidence. In so doing, he makes a compelling case that belief in God is not just irrational, but potentially deadly.\n\nDawkins has fashioned an impassioned, rigorous rebuttal to religion, to be embraced by anyone who sputters at the inconsistencies and cruelties that riddle the Bible, bristles at the inanity of &quot;intelligent design&quot;, or agonizes over fundamentalism in the Middle East or Middle America.\n\n-----\n\nThis is an excellent book and well worth the listen. \n\nCheers!\n\n","torrent":{"xt":"urn:btih:2ce7f524ab4a886d88f7b8679d660f0e7275fa81","amp;dn":"The+God+Delusion+%28Dawkins%29+%5BNF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce7f524ab4a886d88f7b8679d660f0e7275fa81","infoHashBuffer":{"type":"Buffer","data":[44,231,245,36,171,74,136,109,136,247,184,103,157,102,15,14,114,117,250,129]},"announce":[],"urlList":[]}}