{"title":"Microsoft Windows XP Professional Corporate Edition RTM SP0 2001","uid":4130362,"size":512347733,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d8528a95a8c63129d7b8c9ca539cf0a7f45dfa5&amp;dn=Microsoft+Windows+XP+Professional+Corporate+Edition+RTM+SP0+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"adsbaer12","files":2,"time":1208007553,"description":"*.*.* this is my first &quot;release/upload&quot;, and it&amp;#039;s not even by myself ;) *.*.*\n\nM!cr050ft windows xp professional corporate edition rtm x32 untouched and pure, english, no sp integrated\n\nfeatures of this torrent:\n- standard uncompressed .iso-file (no .uif-.ccd-.nrg or other bullsh__ format)\n- MD5-checksum: 5db1a137ba7bc8b561a1dd120f5c7d8d\n\n(md5 checksum created with rapidcrc 0.6.1; use a checksum tool like rapidcrc if you want to verify file integrity by yourself; http://rapidcrc.sourceforge.net/)\n\n- emule-v0.48a-file-id: 8386544E7BFFC3D2F252E9F6C96AFCC1\n- file size is 488 MB (512.342.016 bytes)\n- iso-file is not password protected, in fact: no passwords needed for anything at all\n- iso-label: &quot;WXPVOL_EN&quot;\n- all extracted files from the iso and the iso-file itself were scanned for viruses; result: no virus, no trojan, no worm, no spyware, no malware inside the iso and among the extracted files.\n\n(scanned with &quot;Kaspersky Anti-Virus 7.0&quot; using the latest virus-definitions available at the time of release; additionally scanned with &quot;Avira AntiVir PersonalEdition Classic&quot; also using the latest virus-definitions available at the time of publishing; both scans were done using the highest detection levels an most intensive scan-methods)\n\n- this is a clean, original, unmodified version of microsoft windows xp professional corporate edition\n- no retail / no oem version\n- it&amp;#039;s a corporate edition; it *could* work with a volume license key if you have your own legal product key! (&quot;VLK&quot;)\n- genuine windows, if you have you own legit VLK it passes all WGA checks (don&amp;#039;t use illegal keys! they will be blacklisted be micro$oft anyway and wpa will not work! buy your own legit key from microsoft!)\n- no stupid microsoft product activation or 30 day-trial-period --&gt; not necessary because it&amp;#039;s corporate and the activation-thing was removed by microsoft\n- it&amp;#039;s in english language\n- it is the 32bit edition, not the x64 version!\n- build: 5.1.2600.0 (Gold)\n- the iso can be burned to a real (empty) cd-rom using a burn program like nero or alcohol 120%\n- the iso/cd-rom is bootable, although you might want to simulate the entire setup procedure with VMWare or M$ VirtualPC\n- it&amp;#039;s completely updateable\n- no files were deleted, no modifications made, not &quot;nlited&quot;, it&amp;#039;s pure like a virgin ;)\n- no cracks, no hacks, no modifications on sfc/wfp\n- no brandings, no wallpapers, etc\n- ideal for slipstreaming upcoming sp3 (slipstreaming from rtm/sp0 directly to sp3 is recommended; slipstreaming from wxpsp1/sp22 to sp3 leaves unnecessary files on the iso, thus wasting valuable space on the iso!)\n- no &quot;optimized&quot; version, eg: &quot;gamers edition&quot;, &quot;power edition&quot; or similar crap\n- no missing or courrupted files during setup-procedure, i encountered no errors at all\n- no winnt.sif, no unattended setup, no $OEM$-dir, no WIN51IP.SP[x]-file in root dir\n- **NO SERVICE PACK INCLUDED**: no sp1, no sp1a (build 5.1.2600.1106), no sp2 (build 5.1.2600.2180), no sp3 (i don&amp;#039;t know yet the final build number of sp3); sp-level is &quot;sp0&quot; (build 5.1.2600.0)\n- on general-tab of system properties window it says: &quot;Microsoft Windows Xp; Professional; Version 2002; [no ServicePack-information given]&quot;\n\n--&gt; this is the first version of winxp released on october 25, 2001; with absolutely no microsoft updates, patches, hotfixes or servicepacks (so it&amp;#039;s buggy and vulnerable like hell! please integrate sp3 if you want to use it in a productive environment!)\n\n### YOU NEED YOUR OWN CD-KEY ###\nno product-key is included or slipstreamed. get your own legit VLK key from microsoft!!!\nthese are just the original setup-files. this OS cannot be installed without a legal product key and therefore is useless without key: get your own legal license from microsoft!\n\n- you can use this version to create your own xp-modifications, find bugs, search for security holes, or whatever you want to do...\n- upcomming sp3 rtm can easily be slipstreamed into the setup-cd; try AutoStreamer (goolgle for &quot;AutoStreamer&quot;) or use nlite (http://www.nliteos.com/).\n\ndisclaimer:\ni am not the author of this iso-file. i did not made the cd-image of my own. i am 99% sure that this is an untouched winxp-version, but since i did it not by myself i cannot give you a 100%-guarantee.\ni was searching for a clean and untouched wxp-setup-cd for a long time and finally found one at sumotorrents. so i downloaded it, (virus-) checked it, verified the iso-content, tested everything with a virtual machine (VMWare and M$ VirtualPC), compared file versions and checksums with information available online and finally (re-)upload it for all those of you who want no premodified xp-bullsh__ by third parties. so no thanks to me, thanks to the original uploader!\n\n============== &lt;a href=&quot;\nhttp://www.sumotorrent.com/en/details/978052/Windows%20XP%20Professional%20Corporate%20Edition.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sumotorrent.com/en/details/978052/Windows%20XP%20Professional%20Corporate%20Edition.html&lt;/a&gt;\n\nquote: &quot;This is an original Windows XP Professional Corporate Edition bootable install disc. It&amp;#039;s not much on its own, but it is useful if you want a clean disc to start creating your own XP mods.&quot;\n==============\n\nif you are looking for an easy n00b-pr00f setup with lots of toys and integrated stuff: this is not what you want!\n\n\nlast but not least i want to encourage everyone of you who wants to download this torrent to seed this torrent for a while. you are downloading / finished downloading this file because some people provided it to you. so please: SEED! it costs no great effort and gives something back to our peer2peer-community :)\n\n\nwhat can you do?\n1. write comments\n2. scan for viruses yourself to verify my statements above and give feedbacks\n3. report bugs or errors during setup (if any occur at all)","torrent":{"xt":"urn:btih:2d8528a95a8c63129d7b8c9ca539cf0a7f45dfa5","amp;dn":"Microsoft+Windows+XP+Professional+Corporate+Edition+RTM+SP0+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8528a95a8c63129d7b8c9ca539cf0a7f45dfa5","infoHashBuffer":{"type":"Buffer","data":[45,133,40,169,90,140,99,18,157,123,140,156,165,57,207,10,127,69,223,165]},"announce":[],"urlList":[]}}