{"title":"India Today - 1 August 2016 (gnv64)","uid":15421418,"size":46336698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d8697d9a859ed8d986db02e0cfe3b6c07ce7c3d&amp;dn=India+Today+-+1+August+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":4,"time":1469643037,"description":"India Today - 1 August 2016\r\nEnglish | 136 pages | True PDF | 44.1 mb\r\n\r\nIndia Today is an Indian weekly news magazine published by Living Media India Limited, in publication since 1975 based in New Delhi. India Today is also the name of its sister-publication in Hindi. Aroon Purie has been the magazine's editor-in-chief since 1975, a position he has held continuously for the last three decades.\r\nIt is part of the India Today group, also founded in 1975, which now includes 13 magazines, 3 radio stations, 4 TV channels, 1 newspaper, a classical music label (Music Today), book publishing, and India's only book club. With the publication of its 30th Anniversary issue in December 2005, the magazine, which had commenced publication in 1975 with a circulation of 5,000 copies, has published five editions and currently has a circulation of over 1.1 million copies with a readership of over 5.62 million.\r\n\r\nThis week’s cover story, For Gold and Glory, looks at how the 121 Indian athletes who will leave for the Rio Olympics are different from the previous Indian contingents and how they are hoping not just for medals, but are going for Gold. The cover story takes a close look at the gold in the Indian contingent.\r\n\r\nThe story, Twitter Treadmill, looks at how PM Narendra Modi has let his ministers know that they will be judged by their ‘social’ standing and how all the ministers in the PM’s cabinet are jostling with each other to stay on top of the e-governance game.\r\n\r\nThe Nation story - The Last of Sheila, You Said? - looks at how the Congress is almost all set for the Uttar Pradesh Elections with a new battle plan, a surprise CM candidate and a new team.\r\n\r\nThe story, Behind the Wires, reports on how even a week-and-a-half after Burhan Wani's killing, the Valley is still simmering and the disconnect between Jammu and Kashmir Chief Minister Mehbooba Mufti and her administration isn’t helping solve matters.\r\n \nhttps://s32.postimg.org/4b11gw7s5/India_Today_1_August_2016.jpg","torrent":{"xt":"urn:btih:2d8697d9a859ed8d986db02e0cfe3b6c07ce7c3d","amp;dn":"India+Today+-+1+August+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8697d9a859ed8d986db02e0cfe3b6c07ce7c3d","infoHashBuffer":{"type":"Buffer","data":[45,134,151,217,168,89,237,141,152,109,176,46,12,254,59,108,7,206,124,61]},"announce":[],"urlList":[]}}