{"title":"The Boys from Brazil (1978)-SiLvErDuSt","uid":4945911,"size":734986240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e57f1e5670da1496b87e97b0aab8448ff336b34&amp;dn=The+Boys+from+Brazil+%281978%29-SiLvErDuSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dodgerblue","files":1,"time":1244658236,"description":"The Boys from Brazil (1978)-SiLvErDuSt\n[URL]http://www.imdb.com/title/tt0077269/[/URL]\nCast\n (Cast overview, first billed only)\n\n\tGregory Peck\t... \tDr. Josef Mengele\n\n\tLaurence Olivier\t... \tEzra Lieberman\n\n\tJames Mason\t... \tEduard Seibert\n\tLilli Palmer\t... \tEsther Lieberman\n\tUta Hagen\t... \tFrieda Maloney\n\n\tSteve Guttenberg\t... \tBarry Kohler (as Steven Guttenberg)\n\tDenholm Elliott\t... \tSidney Beynon\n\n\tRosemary Harris\t... \tMrs. Doring\n\tJohn Dehner\t... \tHenry Wheelock\n\tJohn Rubinstein\t... \tDavid Bennett\n\tAnne Meara\t... \tMrs. Curry\n\tJeremy Black\t... \tJack Curry / Simon Harrington / Erich Doring / Bobby Wheelock\n\tBruno Ganz\t... \tProfessor Bruckner\n\tWalter Gotell\t... \tMundt\n\tDavid Hurst\t... \tStrasser\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 701 MiB\nDuration                         : 2h 4mn\nOverall bit rate                 : 784 Kbps\nWriting application              : Nandub v1.0rc2\nWriting library                  : Nandub build 1853/release\n\nVideo\nFormat                           : MPEG-4 Visual\nCodec ID                         : DIV3\nCodec ID/Hint                    : DivX 3 Low\nDuration                         : 2h 4mn\nBit rate                         : 643 Kbps\nWidth                            : 640 pixels\nHeight                           : 352 pixels\nDisplay aspect ratio             : 16/9\nFrame rate                       : 23.976 fps\nResolution                       : 24 bits\nBits/(Pixel*Frame)               : 0.119\nStream size                      : 575 MiB (82%)\n\nAudio\nFormat                           : MPEG Audio\nThe film follows the attempts of aging Nazi hunter Ezra Lieberman (Laurence Olivier) to discover and thwart a diabolical plan by surviving Nazi death-camp doctor Josef Mengele (Gregory Peck) to clone Adolf Hitler.\n\nWhen well-intentioned young Barry Kohler stumbles upon a secret sect of Third Reich war criminals holding clandestine meetings in Paraguay, he alerts Ezra Lieberman by phone. Lieberman is well aware that Dr. Mengele is alive and in hiding, but is highly skeptical otherwise.\n\nKohler is discovered and killed. Lieberman begins following the trail of the Nazis, traveling throughout Europe and North America to investigate the suspicious deaths of a number of civil servants. He meets several widows and is amazed to find an uncanny resemblance in their adopted, black-haired, blue-eyed sons.\n\nLieberman's investigations unnerve Mengele's superiors, who demand that he abort his scheme. But the doctor has spent twenty years pursuing his plans, having acquired skin and blood samples from Hitler to use as DNA in a plan to recreate the FÃƒÂ¼hrer body and soul and to fulfill the aims of the Third Reich. For him it is now or never. Mengele ends up traveling to rural Lancaster County, Pennsylvania, where one of the young Hitler clones lives on a farm. There he murders the boy's father, a dog breeder, and lies in wait for Lieberman, who is on his way.\n\nThey fight savagely until Mengele gains the upper hand. Mengele then taunts Lieberman with his hopes of turning the world into one run by Hitler clones. With one desperate lunge, Lieberman reaches the closet where the dogs are held and turns them loose. The dogs corner Mengele. At that point, young Bobby arrives home from school. It is Mengele's first look in person at one of his &quot;boys&quot;. Bobby can tell from the carnage that something is amiss. Lieberman tells him that Mengele has killed his father and to notify the police. Bobby sets the pack of vicious Doberman dogs on Mengele, relishing his bloody death and avenging his father's death.\n\nLieberman is encouraged by fellow Nazi hunters to expose the scheme and turn over a list identifying the names and whereabouts of the other &quot;boys from Brazil&quot; from around the world, so that they can be systematically killed before growing up. But they are mere children, in Lieberman's opinion, so he destroys the list. The film ends with Bobby happily developing photos he took during the dog attack.\n","torrent":{"xt":"urn:btih:2e57f1e5670da1496b87e97b0aab8448ff336b34","amp;dn":"The+Boys+from+Brazil+%281978%29-SiLvErDuSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e57f1e5670da1496b87e97b0aab8448ff336b34","infoHashBuffer":{"type":"Buffer","data":[46,87,241,229,103,13,161,73,107,135,233,123,10,171,132,72,255,51,107,52]},"announce":[],"urlList":[]}}