{"title":"Operation Chariot: The Raid on St Nazaire","uid":15752430,"size":4756326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e90c8c1d1158c822acc10d942da9e4c76e723f5&amp;dn=Operation+Chariot%3A+The+Raid+on+St+Nazaire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"marty14","files":1,"time":1473038193,"description":"Operation Chariot: The Raid on St Nazaire - Jon Cooksey [epub]\r\n\r\nBy March 1942, mainland France had been under German occupation for almost two years. Every month that passed saw Germany bolster her defenses against an expected allied invasion. Every month that passed saw Germany tighten her grip on Britain's transatlantic lifeline; menacing allied shipping from the French west coast ports. At St Nazaire on the Loire estuary, the vast Normandie dry dock was the only one capable of holding the mighty battleship Tirpitz, still at large and free to hunt allied ships.\r\n\r\nSomething had to be done. Operation Chariot was conceived; an audacious plan to mount a large-scale commando raid on the Normandie dock using a loaned US destroyer packed with high explosive as a battering ram. For the Germans at St Nazaire the invasion came earlier than expected. In the dead of night British commandos were landed and swarmed over the quaysides to destroy key installations. Grit, determination and training carried them forward to accomplish their mission at a heavy price in dead, wounded and captured. The award of more than eighty decorations for the raid - including five VCs - bore witness to the ferocity of the struggle to strike at the Germans in France","torrent":{"xt":"urn:btih:2e90c8c1d1158c822acc10d942da9e4c76e723f5","amp;dn":"Operation+Chariot%3A+The+Raid+on+St+Nazaire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e90c8c1d1158c822acc10d942da9e4c76e723f5","infoHashBuffer":{"type":"Buffer","data":[46,144,200,193,209,21,140,130,42,204,16,217,66,218,158,76,118,231,35,245]},"announce":[],"urlList":[]}}