{"title":"Wind Energy An Introduction - Mohamed A. El-Sharkawi","uid":11992155,"size":21177061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e9fa7b57100b02310ae6599edd961feaa4bcafd&amp;dn=Wind+Energy+An+Introduction+-+Mohamed+A.+El-Sharkawi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1433553460,"description":"ISBN 9781482264005\n\n\nWind Energy: An Introduction covers wind energy system types, operation, modeling, analysis, integration, and control. Beginning with a history of the development of wind energy, this comprehensive book:\n\n\n\nExplains the aerodynamic theories that govern the operation of wind turbines\n\nPresents wind energy statistics to address the stochastic nature of wind speed\n\nEmploys the statistical modeling of wind speed to evaluate sites for wind energy generation\n\nHighlights the differences between the most common types of wind turbines\n\nAnalyzes the main power electronic circuits used in wind energy\n\nDetails the induction, synchronous, and permanent magnet generators from the basic principle of induced voltage to the steady-state and dynamic models\n\nExplores the operation, stability, control, and protection of type 1, 2, 3, and 4 wind turbines\n\nDiscusses the main integration challenges of wind energy systems with electric utility systems\n\nFeatures numerous models, illustrations, real-world examples, and exercise problems\n\nIncludes a solutions manual and figure slides with qualifying course adoption\n\nWind Energy: An Introduction requires a basic knowledge of electric circuit theory, making it an ideal text for students at the senior-undergraduate and graduate levels. In addition, the book provides practicing engineers with a handy professional reference","torrent":{"xt":"urn:btih:2e9fa7b57100b02310ae6599edd961feaa4bcafd","amp;dn":"Wind+Energy+An+Introduction+-+Mohamed+A.+El-Sharkawi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e9fa7b57100b02310ae6599edd961feaa4bcafd","infoHashBuffer":{"type":"Buffer","data":[46,159,167,181,113,0,176,35,16,174,101,153,237,217,97,254,170,75,202,253]},"announce":[],"urlList":[]}}