{"title":"Dante for Beginners - Joe Lee.epub","uid":11575470,"size":25894452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f1398da29b71300294ca570a20269b96ea75ccc&amp;dn=Dante+for+Beginners+-+Joe+Lee.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1417068114,"description":"Dante Alighieri is considered by many the greatest poet who ever lived. This book provides a canto-by-canto description of the books of The Divine Comedy: Inferno, Purgatorio, and Paradiso.\n\nDante For Beginners takes the reader on a trip starting in hell and ending in heaven. The reader gets a quick introduction to Dante and his times. Next, the reader meets a sweet lass named Beatrice and samples a bit of his other literary offerings, such as the great feast, the Convivio. But then it's on to the big one, the Commedia, and a canto by canto description of the entire work. Characters, ideas and situations are described as they happen--no searching through end notes, footnotes or field notes to distinguish Forese Donati, Dante's pal, from his evil brother, Corso. The entire plan of the hereafter is simply mapped out. Dante For Beginners is a great vacation with history's greatest tourist, Dante Alighieri.\n\nAbout the Author\nJoe Lee is an illustrator, cartoonist, writer, and clown. With a degree from Indiana University centering on Medieval History, Joe is also a graduate of Ringling Brothers, Barnum and Bailey's Clown College. He worked for some years as a circus clown. He is the illustrator of a baker's dozen of For Beginners books including, Barack Obama, [Howard] Zinn, Shakespeare, Postmodernism, Deconstruction, Eastern Philosophy, and Global Warming among others. Joe lives in Bloomington, Indiana with his wife Mary Bess, son Brandon, cat George, and the terriers (or rather terrors) Max and Jack","torrent":{"xt":"urn:btih:2f1398da29b71300294ca570a20269b96ea75ccc","amp;dn":"Dante+for+Beginners+-+Joe+Lee.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1398da29b71300294ca570a20269b96ea75ccc","infoHashBuffer":{"type":"Buffer","data":[47,19,152,218,41,183,19,0,41,76,165,112,162,2,105,185,110,167,92,204]},"announce":[],"urlList":[]}}