{"title":"FSX - FSGenesis - World Terrain Mesh for FSX","uid":3787281,"size":4099322031,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f1b82f6a96b1c8268b0134dec1712a21f01f81a&amp;dn=FSX+-+FSGenesis+-+World+Terrain+Mesh+for+FSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"4X-AXG","files":3,"time":1188321103,"description":"Terrain Mesh is the shape of the ground in Microsoft Flight Simulator 2000/2002/2004. It is compiled by FSGenesis using real world data in the form of Digital Elevation Models (DEMs) from the United States Geological Survey (USGS) and Natural Resources Canada (NRC), Centre for Topographic Information.\nThe default terrain mesh covering most of the world is 1223m horizontal resolution, that is, 1223m between elevation points. There are small areas of the Japan and the south Pacific, including Papua New Guinea, with 76.4m terrain. Mount Kilimanjaro in Africa is done in 76.4m.\n\nThe default terrain mesh covering the United States is generally 611.5m horizontal resolution, that is, 611.5m between elevation points. Small areas of the western United States are done in 153.2m, as well as the entire Caribbean. The Grand Canyon, Hawaii, Mount Rainier, Yosemite, and Catalina Island are done in 76.4m.\n\nFSGenesis terrain mesh is compiled in all available horizontal resolutions. Beginning with the lowest resolution that displays the most distant terrain from your aircraft all the way to the highest resolution, which displays immediately surrounding your aircraft.\n\nWorld Terrain Mesh for FSX\n\nWorld 76m coverage (except North America) from 90m SRTM2 source data, reprocessed to remove voids and spikes. Also includes enhancements to the Himalayas, Alps (19m/LOD 11), Scandinavaia, Pyrenees, Caucusus, parts of Japan, parts of Africa, and New Zealand from Jonathan de Ferranti source data.\n\nSize: 3.8 Gb\nSource data: SRTM/De Ferranti\nVers: 1.2\nUpdated: January 12, 2007","torrent":{"xt":"urn:btih:2f1b82f6a96b1c8268b0134dec1712a21f01f81a","amp;dn":"FSX+-+FSGenesis+-+World+Terrain+Mesh+for+FSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1b82f6a96b1c8268b0134dec1712a21f01f81a","infoHashBuffer":{"type":"Buffer","data":[47,27,130,246,169,107,28,130,104,176,19,77,236,23,18,162,31,1,248,26]},"announce":[],"urlList":[]}}