{"title":"I Shot Andy Warhol [1996] Mary Harron","uid":6592696,"size":733643793,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f3a9e6ebc971d3bd5a1495ab7a9039431c583ca&amp;dn=I+Shot+Andy+Warhol+%5B1996%5D+Mary+Harron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1312887967,"description":" &lt;a href=&quot;http://bayimg.com/LajmDAaDH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/LajmDAaDH&lt;/a&gt;\n\nI Shot Andy Warhol (1996)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0116594/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0116594/&lt;/a&gt;\n\nI Shot Andy Warhol is a 1996 independent film about the life of Valerie Solanas and her relationship with Andy Warhol. The movie marked the debut of Canadian director Mary Harron.\n\n  Lili Taylor  ...  Valerie Jean Solanas  \n  Jared Harris  ...  Andy Warhol  \n  Martha Plimpton  ...  Stevie  \n  Lothaire Bluteau  ...  Maurice Girodias  \n  Anna Levine  ...  Iris (as Anna Thompson)  \n  Peter Friedman  ...  Alan Burke  \n  Tahnee Welch  ...  Viva  \n  Jamie Harrold  ...  Jackie Curtis  \n  Donovan Leitch  ...  Gerard Malanga  \n  Michael Imperioli  ...  Ondine  \n  Reg Rogers  ...  Paul Morrisey (as Reg Rodgers)  \n  Bill Sage  ...  Tom Baker  \n  Jill Hennessy  ...  Laura  \n  Coco McPherson  ...  Brigid Berlin  \n  Myriam Cyr  ...  Ultra Violet  \n\nThe film stars Lili Taylor as Valerie, Jared Harris as Andy Warhol and Martha Plimpton as Valerie's friend Stevie. Stephen Dorff plays Warhol superstar Candy Darling.\n\nLou Reed of the Velvet Underground, whose anger with Solanas was well known, stated publicly that he did not want any film about her to be made, and would not allow the filmmakers to use his music. Nevertheless, the film's music score was written by John Cale, a former member of the Velvet Underground. In the film, Yo La Tengo plays an anonymous band that is somewhat reminiscent of the group.\n\nThe film was screened in the Un Certain Regard section at the 1996 Cannes Film Festival.\n\nThis film is based on a true story and was thoroughly researched by the filmmaker, Mary Harron, who initially intended to make a documentary.\n\nMany people who knew Solanas and Warhol tried to rationalize the shooting. Stephen Koch, who in 1973 wrote a study of Warhol's film, stated: Valerie lives in terror of dependence: That is what the SCUM Manifesto is about, an absolute terror before the experience of need. Like Warhol, Solanas is obsessed with an image of autonomy, except that... she has played the obsession desperately, rather than with Warhol's famous cool.\n\nThe script for I Shot Andy Warhol began life as a documentary before the producers convinced writer/director Mary Harron to transform it into a dramatic interpretation. The result is an impressive feature debut -- a provocative look at Valerie Solanas, the intellectual, possibly psychotic prefeminist who shot Warhol in 1968. In the wake of Nico Icon, a documentary about The Velvet Underground and their lead singer, this film represents the next (and certainly not last) motion picture to plunge into the strange, experimental world surrounding Andy Warhol and his Factory. \n\nMost of I Shot Andy Warhol takes place in New York City from 1966 to 1968, chronicling the period in Valerie Solanas' (Lili Taylor) life when she wrote her definitive work, SCUM Manifesto, was introduced to Andy Warhol (Jared Harris), became a fringe member of his circle, and eventually shot him. Valerie, who had a pitiful childhood characterized by abuse and molestation, is subversive and disturbed, but many of her theories, as outlandish as they initially seem, are consistent, logical, and thought-provoking. \n\nSCUM, or the Society for Cutting Up Men, was the prefeminist organization formed by Valerie (she was also the only member). It was founded on a number of basic principles -- the male is a biological accident, women are the naturally superior gender, the female function is to create a magical world, and men are sex-obsessed machines. The SCUM Manifesto represents Valerie's legacy (it's still in print today). \n\nThose offended by the male bashing aspect of Thelma and Louise may become apoplectic during I Shot Andy Warhol. Since the film is essentially a character study of Valerie, it gives an uncompromising presentation of her views and experiences. She despises men, married women, and other degenerates, and makes no secret of her feelings. She's a butch dyke, and proud of it, and the only time she has any sexual interaction with men is when she gets paid. \n\nLili Taylor has gravitated towards independent features, and gives a powerful, passionate portrayal, bringing out Valerie's anger and disgust with the world. Like Jennifer Jason Leigh in Mrs. Parker and the Vicious Circle, Taylor makes us believe that we're watching Valerie, not just an actress playing her. There won't be an Oscar nomination for this work, but recognition of some sort is warranted. \n\nThere are two other notable performances in I Shot Andy Warhol. The first, given by Jared Harris (the son of Richard Harris), is that of Warhol himself. Harris manages to capture not only Warhol's strange magnetism, but his aloof, almost-shy nature. Stephen Dorff (Backbeat) plays Candy Darling, Valerie and Warhol's transvestite companion. Supporting roles are filled by Martha Plimpton (as Valerie's best friend), Lothaire Bluteau (as Maurice Girodius, the publisher who buys the rights to Valerie's writing), and Tahnee Welch (as a member of Warhol's circle). \n\nI Shot Andy Warhol presents a toned-down, nostalgic look at New York in the late 1960s as well as the subculture that took root around Warhol -- the wild, bohemian lifestyle, complete with drugs and sex. Primarily, however, this is Valerie's story -- an invitation to explore her theories and understand her motivation, even if you can't relate to such a disagreeable personality. In fact, I Shot Andy Warhol is daring because it makes no attempt to soften Valerie's character or blunt the downward spiral of her insanity. This is a film of powerful ideas, impressive set design, and compelling performances. It will offer fodder for hours of post-movie discussion. \n\n","torrent":{"xt":"urn:btih:2f3a9e6ebc971d3bd5a1495ab7a9039431c583ca","amp;dn":"I+Shot+Andy+Warhol+%5B1996%5D+Mary+Harron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f3a9e6ebc971d3bd5a1495ab7a9039431c583ca","infoHashBuffer":{"type":"Buffer","data":[47,58,158,110,188,151,29,59,213,161,73,90,183,169,3,148,49,197,131,202]},"announce":[],"urlList":[]}}