{"title":"My Story (Audiobook) By Elizabeth Smart, Chris Stewart 2013","uid":9025065,"size":266201283,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f73c147fb2c8132c679ef1cd1920c118904d0c7&amp;dn=My+Story+%28Audiobook%29+By+Elizabeth+Smart%2C+Chris+Stewart+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"BosuxRedsux","files":31,"time":1381354175,"description":"My Story (Audiobook) By Elizabeth Smart, Chris Stewart, read by Elizabeth Smart\nUnabridged edition 2013 | 9 hours and 12 mins | ISBN: 42723342X | MP3@64 kbps | 253MB\n\nFor the first time, ten years after her abduction from her Salt Lake City bedroom, Elizabeth Smart reveals how she survived and the secret to forging a new life in the wake of a brutal crime\nOn June 5, 2002, fourteen-year-old Elizabeth Smart, the daughter of a close-knit Mormon family, was taken from her home in the middle of the night by religious fanatic, Brian David Mitchell and his wife, Wanda Barzee. She was kept chained, dressed in disguise, repeatedly raped, and told she and her family would be killed if she tried to escape. After her rescue on March 12, 2003, she rejoined her family and worked to pick up the pieces of her life.\n\n\nNow for the first time, in her memoir, MY STORY, she tells of the constant fear she endured every hour, her courageous determination to maintain hope, and how she devised a plan to manipulate her captors and convinced them to return to Utah, where she was rescued minutes after arriving. Smart explains how her faith helped her stay sane in the midst of a nightmare and how she found the strength to confront her captors at their trial and see that justice was served.\n\nIn the nine years after her rescue, Smart transformed from victim to advocate, traveling the country and working to educate, inspire and foster change. She has created a foundation to help prevent crimes against children and is a frequent public speaker. In 2012, she married Matthew Gilmour, whom she met doing mission work in Paris for her church, in a fairy tale wedding that made the cover of People magazine.","torrent":{"xt":"urn:btih:2f73c147fb2c8132c679ef1cd1920c118904d0c7","amp;dn":"My+Story+%28Audiobook%29+By+Elizabeth+Smart%2C+Chris+Stewart+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f73c147fb2c8132c679ef1cd1920c118904d0c7","infoHashBuffer":{"type":"Buffer","data":[47,115,193,71,251,44,129,50,198,121,239,28,209,146,12,17,137,4,208,199]},"announce":[],"urlList":[]}}