{"title":"On Such A Full Sea: A Novel (2014) Chang-Rae Lee (multi) ","uid":9549246,"size":2017665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f97ac2c14b9f4ea1fab8427649be5fa71adb333&amp;dn=On+Such+A+Full+Sea%3A+A+Novel+%282014%29+Chang-Rae+Lee+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"7","files":-1,"time":1391205279,"description":"On Such A Full Sea: A Novel by Chang-Rae Lee\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Sci-Fi/Dystopian\nDate: 7 January 2014\n\nA mesmerising narrative of courage and longing, On Such a Full Sea is an epic tale: brilliantly speculative, absolutely involving and profoundly humane.\n\nLithe and tiny, Fan is a diver at the New China settlement of B-Mor, a worker colony long-ago known as Baltimore, her circumscribed world the temperature-controlled fish tanks that feed a contaminated continent, and Reg, the golden-skinned, simple-hearted man she loves.\n\nRigorously pressurised and demarcated, the dystopian America Fan serves is ruled by the professional Charter caste. While B-Mors are obedient and tranquillised by duty and the fear of chaos, the pampered, ruthless Charters inhabit idyllic, over-supplied communities behind whose gates they jostle ceaselessly for dominance. Estranged from nature, B-Mors and Charters alike shy from the spaces between, where 'counties' people - outcasts, free-thinkers and renegades, bandits and pedlars - forage and grub and steal and kill.\n\nOne quiet day Reg is removed from the colony - whether for a nameless infraction, or because he is disease-resistant in a world where no one is C-free, it is impossible to say. Fan decides she must follow. But her departure threatens to disrupt the whole order of B-Mor society, and only savage action can hold it together.\n\nAn Amazon Best Book of the Month, January 2014.\n\nAuthor:\n\nChang-Rae Lee is the author of Native Speaker, winner of the PEN/Hemingway Award for first fiction; A Gesture Life; Aloft; and The Surrendered, winner of the Dayton Peace Prize and a finalist for the Pulitzer Prize. Selected by The New Yorker as one of the &quot;20 Writers for the 21st Century,&quot; Chang-rae Lee teaches writing at Princeton University.","torrent":{"xt":"urn:btih:2f97ac2c14b9f4ea1fab8427649be5fa71adb333","amp;dn":"On+Such+A+Full+Sea%3A+A+Novel+%282014%29+Chang-Rae+Lee+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f97ac2c14b9f4ea1fab8427649be5fa71adb333","infoHashBuffer":{"type":"Buffer","data":[47,151,172,44,20,185,244,234,31,171,132,39,100,155,229,250,113,173,179,51]},"announce":[],"urlList":[]}}