{"title":"Jean-Jacques Rousseau - Philosophical Works (17 books)","uid":13458372,"size":115234336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fe41b04a83137e713c94a03d9c63030ee94319c&amp;dn=Jean-Jacques+Rousseau+-+Philosophical+Works+%2817+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":34,"time":1454867307,"description":"\nJEAN-JACQUES ROUSSEAU (1712-1778) was a Genevan philosopher and writer of the 18th-century. His political philosophy influenced the French Revolution as well as the overall development of modern political, sociological and educational thought.\r\n\r\nThe centerpiece of this collection are the multiple volumes comprising THE COLLECTED WRITINGS OF ROUSSEAU, edited by Christopher Kelly and Roger D. Masters, and published for Darmouth College by the University Press of New England (1989-2010).\r\n\r\nForemost among the books included are Rousseau's novel ÉMILE: or, ON EDUCATION, a treatise on the education of the whole person for citizenship (&quot;the best and most important of all my writings&quot;); JULIE, or THE NEW HELOISE, a sentimental novel that was central to the development of romanticism in fiction; the CONFESSIONS, which initiated the genre of modern autobiography; REVERIES OF A SOLITARY WALKER, which emplified the late 18th-century movement known as the Age of Sensibility, and featured an increased focus on subjectivity and introspection that later characterized modern writing; and THE SOCIAL CONTRACT and DISCOURSE ON THE ORIGIN OF INEQUALITY, both cornerstones of modern political and social thought.\r\n\r\n\r\nThe following books are in PDF format unless otherwise noted:\r\n\r\n* BASIC POLITICAL WRITINGS (Hackett, 1987).  Translated and edited by Donald A. Cress; Introduced by Peter Gay.\r\n\r\n* COLLECTED WRITINGS, Vol. 1: Judge of Jean-Jacques: Dialogues (University Press of New England, 1989).  Translated by Judith R. Bush, Christopher Kelly and Roger D. Masters.\r\n\r\n* COLLECTED WRITINGS, Vol. 5: The Confessions and Correspondence, Including the Letters to Malesherbes (University Press of New England, 1995).  Translated by Christopher Kelly; edited by Christopher Kelly, Roger D. Masters, and Peter G. Stillman.\r\n\r\n* COLLECTED WRITINGS, Vol. 6: Julie, or The New Heloise (University Press of New England, 1997).  Translated and Annotated by Philip Stewart and Jean Vaché.\r\n\r\n* COLLECTED WRITINGS, Vol. 7: Essay on the Origin of Languages &amp; Writings Related to Music (University Press of New England, 1998).  Translated and Edited by John T. Scott.\r\n\r\n* COLLECTED WRITINGS, Vol. 9: Letter to Beaumont, Letters Written From the Mountain &amp; Related Writings (University Press of New England, 2001).  Translated by Christopher Kelly and Judith R. Bush.\r\n\r\n* COLLECTED WRITINGS, Vol. 11: The Plan for Perpetual Peace, On the Government of Poland &amp; Other Writings on History and Politics (University Press of New England, 2005).  Translated by Christopher Kelly and Judith R. Bush.\r\n\r\n* COLLECTED WRITINGS, Vol. 12: Autobiographical, Scientific, Religious, Moral, and Literary Writings (University Press of New England, 2007).  Translated and edited by Christopher Kelly.\r\n\r\n* THE CONFESSIONS (Penguin Classics, 1953).  Translated with an Introduction by J. M. Cohen. -- ePUB\r\n\r\n* THE DISCOURSES &amp; OTHER EARLY POLITICAL WRITINGS (Cambridge, 1997).  Edited by Victor Gourevitch.\r\n\r\n* ÉMILE, or ON EDUCATION (Basic Books, 1979).  Introduction, Translation, and Notes by Allan Bloom.\r\n\r\n* THE ESSENTIAL WRITINGS OF JEAN-JACQUES ROUSSEAU (Modern Library, 2013).  Translated by Peter Constantine; edited with an Introduction by Leo Damrosch.  -- ePUB\r\n\r\n* THE MAJOR POLITICAL WRITINGS (Chicago, 2012).  Translated and edited by John T. Scott. -- ePUB\r\n\r\n* ON THE ORIGIN OF LANGUAGE: Two Essays (Chicago, 1986).  Translated with Afterword by John H. Moran.  Included with Johann Gottfried Herder's &quot;Essay on the Origin of Language&quot;. -- ePUB\r\n\r\n* REVERIES OF THE SOLITARY WALKER (Penguin Classics, 2004).  Translated with an Introduction by Peter France. -- ePUB\r\n\r\n* THE SOCIAL CONTRACT &amp; DISCOURSE ON POLITICAL ECONOMY (Oxford World's Classics, 1994).  Translated with Introduction and Notes by Christopher Betts.\r\n\r\n* THE SOCIAL CONTRACT &amp; THE FIRST AND SECOND DISCOURSES (Yale University Press, 2002).  Edited with an Introduction by Susan Dunn, with contributions by Gita May, Robert N. Bellah, David Bromwich and Conor Cruise O'Brien.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\n&gt;&gt; CONTACT ME\r\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                \nhttps://pirates-forum.org/User-workerbee  \r\n\r\n&gt;&gt; PLEASE HELP TO SEED!\r\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:2fe41b04a83137e713c94a03d9c63030ee94319c","amp;dn":"Jean-Jacques+Rousseau+-+Philosophical+Works+%2817+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe41b04a83137e713c94a03d9c63030ee94319c","infoHashBuffer":{"type":"Buffer","data":[47,228,27,4,168,49,55,231,19,201,74,3,217,198,48,48,238,148,49,156]},"announce":[],"urlList":[]}}