{"title":"The Evil Dead (2013) - HD Bluray Rip X264 English - AC3","uid":8726311,"size":2307627746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3003587b9cdf235eeec93390c5d8104c13fc4332&amp;dn=The+Evil+Dead+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KidAtomic","files":1,"time":1374518576,"description":"\nThe Evil Dead (2013)\n\nFive twenty-something friends are staying in a remote cabin where they discover a Book of the Dead and unwittingly summon up demons that were lying dormant in the nearby woods. The demons possess each of the young friends in succession until only one is left sane and with the will to fight for survival.\n\n***SPOILER ALERT***\nCaptured in the woods, an injured girl (Phoenix Connolly) is restrained in a basement with many people present. Upon revealing she is demonically possessed, her father, Harold (Jim McLarty), sets her on fire and shoots her dead.\n\nSubsequently, a group of friends, Mia (Jane Levy), Mia's brother David (Shiloh Fernandez), Eric (Lou Taylor Pucci), Olivia (Jessica Lucas) and David's girlfriend, Natalie (Elizabeth Blackmore), arrange a getaway to an old, remote cabin in the woods, helping Mia to get clean after her severe drug addiction led to her clinical death.\n\nAt the cabin, a foul stench leads them to discover a cellar, hosting animal corpses, a double-barreled shotgun and a book titled Naturom Demonto, a Sumerian variation of the Book of the Dead. Ignoring warnings on the book's pages, Eric reads a passage aloud, summoning a demon which enters Mia's body. Terrified, Mia pleads to leave, but the group refuses, after agreeing with Mia to stay put and help her through her addiction. Possessed by the demon, Mia attempts to warn David, but the group dismiss her claims as an excuse to leave. After killing David's dog, Mia burns her face in the boiling hot shower, fulfilling a prophecy from the book. David rushes to get her to a hospital, but a flood blocks the roads.\n\nLater, Mia shoots David in the arm with the shotgun, as her demonic side threatens the group. She manages to possess Olivia and Natalie, who then fulfill the book's prophecy. Olivia stabs Eric and Natalie attacks both David and Eric with a nail gun and a crowbar. Eric beats Olivia's head to death with a broken sink piece and David shoots Natalie, leaving her dismembered arms to bleed to death. Attempts to destroy the book are futile, as it describes a prophecy by which a demon, referred to as a Taker of Souls, needs to devour five souls in order to free the Abomination from hell. To achieve this, the demon has taken possession of Mia's body, and the only ways to release her are to burn her, bury her alive or dismember her.\n\nDavid makes a plan to burn Mia, however he is emotional about Mia's lullaby and backs out. He then enters the cellar with tranquilizers, but Mia attacks him before Eric saves him. Eric finally dies from his wounds, David immobilizes Mia and buries her outside the cabin. After Mia dies, he digs her out and uses an improvised defibrillator to revive her free from possession. Back at the cabin, David is attacked by a revived and possessed Eric. Mortally wounded, David gives Mia the car keys to leave and locks her out of the house. Eric warns David about the Abomination's arrival. David shoots at gasoline to engulf the house in flames, killing both of them in the process.\n\nShortly after, the final stage of the prophecy from the book takes place. It begins to rain blood, and the Abomination crawls out of the ground and goes after Mia. During the pursuit, Mia is forced to rip off her hand when it becomes pinned under David's jeep. Mia then manages to kill the Abomination with a chainsaw, and its remains sink &quot;back to hell&quot;. The blood rain stops as dawn breaks, and Mia wanders away from the aftermath, oblivious to the Naturom Demonto on the ground as the book closes on its own.\n\nDuring the film's closing credits, audio is heard from the original film; Professor Raymond Knowby tells about his discovery of the Naturom Demonto. Then, in a brief post-credits scene, an older Ash Williams (Bruce Campbell) recites his iconic line from the original films, &quot;Groovy&quot;, under dim light, and turns to the audience.\n\nCast:\nJane Levy as Mia\nShiloh Fernandez as David\nLou Taylor Pucci as Eric\nJessica Lucas as Olivia\nElizabeth Blackmore as Natalie\nPhoenix Connolly as Teenager\nJim McLarty as Harold\nSian Davis as Old Woman\nStephen Butterworth as Toothless Redneck\nKarl Willetts as Long Haired Redneck\nRandal Wilson as Demonic/Abomination Mia\nRupert Degas as the Demon (voice)\n\nIn addition, using audio from the original film, Bob Dorian plays Professor Raymond Knowby during the credits and Ellen Sandweiss plays a voice cameo as Cheryl Williams. Bruce Campbell plays Ash Williams in an uncredited cameo appearance.\n\nThe initial letters of the five main characters' names (David, Eric, Mia, Olivia, Natalie) form an acrostic spelling out the word DEMON.\n","torrent":{"xt":"urn:btih:3003587b9cdf235eeec93390c5d8104c13fc4332","amp;dn":"The+Evil+Dead+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3003587b9cdf235eeec93390c5d8104c13fc4332","infoHashBuffer":{"type":"Buffer","data":[48,3,88,123,156,223,35,94,238,201,51,144,197,216,16,76,19,252,67,50]},"announce":[],"urlList":[]}}