{"title":"Sneaky Uses for Everyday Things And Science Tricks - How to Craf","uid":8297167,"size":41591553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30b88267545aa94ea4697b2ffe59a20e9869119e&amp;dn=Sneaky+Uses+for+Everyday+Things+And+Science+Tricks+-+How+to+Craf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MANTESH","files":4,"time":1364171174,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51I2h2p-p-L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51I2h2p-p-L.jpg&lt;/a&gt;\n\n\nSneakier Uses for Everyday Things : How to Turn a Calculator into a Metal Detector, Carry a Survival Kit in a Shoestring, Make a Gas Mask with a Balloon, Turn Dishwashng Liquid into a Copy Machine, Convert a Styrofoam Cup into a Speaker, and Make a James Bond Spy Jacket with Everyday Things  \n\nPublisher: Andrews McMeel Publishing\nCy Tymony\n2005\nLanguage: English\nISBN-10: 0740754963\nISBN-13: 978-0740754968\nEPUB \n160 pages  \n7.76 MB\n\nDid you know that your standard issue of Sports Illustrated magazine can be turned into over 20 useful gadgets? In author Cy Tymony's Sneakier Uses for Everyday Things, you'll learn how an average magazine can become many extraordinary gadgets such as a compass, hearing aid, magnifier, peashooter, and bottle opener.\n Sneakier Uses for Everyday Things covers 40 educational and unique projects that anybody can successfully complete with simple household items. The book includes a list of necessary materials, detailed sketches, and step-by-step instructions for each gadget and gizmo. Among the sneaky schemes are:\n * Creating a electroscope out of a glass jar\n * Turning a drinking cup into a speaker\n * Using an AM radio as a metal detector\n * Making a spy gadget jacket with over 20 individual sneaky uses ranging from a siren and whistle to a walkie-talkie and voice recorder\n These days, &quot;be prepared&quot; applies to more than just the Boy Scouts. Sneakier Uses for Everyday Things provides loads of practical ideas, science projects, and captivating solutions for dealing with life's unexpected challenges. Great fun for the curious, inventive, and creative of all ages.\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51zW0U67EqL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51zW0U67EqL.jpg&lt;/a&gt;\n\n\nSneakiest Uses for Everyday Things: How to Make a Boomerang with a Business Card, Convert a Pencil into a Microphone and more \n\n\nPublisher: Andrews McMeel Publishing \nCy Tymony\n2007\nLanguage: English\nISBN-10: 0740768743\nISBN-13: 978-0740768743\nEPUB \n192 pages\n10.8 MB\n\nFor folks who wonder why they keep tossing odds and ends in that junk drawer in the kitchen, Sneakiest Uses for Everyday Things offers evidence that technology doesn't always have to come from Best Buy, Amazon.com, or Microsoft.&quot; --U.S. News and World Report \n\n* Putterers, would-be inventers, and science-fair parents rejoice as Cy Tymony offers fifty new projects to bring out your inner MacGyver.\n In the third book in Cy Tymony's Sneaky Uses series you will learn how to turn a piece of paper into a Frisbee, a business card into a boomerang, a TV tray into a robot, and more.\n* Beginning with a complete list of materials and continuing through easy-to-follow step-by-step instructions paired with helpful illustrations, most projects will be completed in just minutes using common items found around the house.\n* Teachers, parents, scout leaders, and enterprising youngsters will use their ingenuity to turn ordinary, everyday objects into something extraordinary, like a pencil into a microphone, Walkman ear buds into an intercom, or a telephone cord into a motor. The book also includes bonus alternative-energy projects and a foreword by NPR's Science Friday host Ira Flatow.\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51BgHBnkPhL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51BgHBnkPhL.jpg&lt;/a&gt;\n\n\nSneaky Green Uses for Everyday Things: How to Craft Eco-Garments and Sneaky Snack Kits\n\n\nPublisher: Andrews McMeel Publishing;\nCy Tymony\n2009\nLanguage: English\nISBN-10: 0740779338\nISBN-13: 978-0740779336\nEPUB  \n144 pages\n10,6 MB\n\nIngenuity has met its match and his name is Cy Tymony. In his book, Sneaky Green Uses for Everyday Things, Cy combines the sneaky fun of his Sneaky Uses series with the growing interest in green living. The result is an easy-to-practice manual for conserving energy. \n\nThe book includes 40 projects using green techniques with step-by-step instructions, as well as illustrations and directions for an Earth-friendly existence. Projects are enjoyable for kids and also engaging for adults.\n* Made from 100 percent usable information that really does conserve energy and improve the way we live.\n* Contains sneaky things we can do to go green and includes a helpful energy reduction section that is full of tips and resources, making energy conservation easy.\n* &quot;I discovered Cy Tymony...There, amid the pages of hand-drawn illustrations, were the kinds of projects I hadn't seen in years...Thank you, Cy, for reinvigorating those creative juices [and] opening up the world of tinkering and creativity to a whole new generation of hobbyists looking to get their hands dirty with new and exciting projects.&quot; --Ira Flatow, host of NPR's Science Friday\n\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51%2BTxP691LL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51%2BTxP691LL.jpg&lt;/a&gt;\n\n\nSneaky Science Tricks: Perform Sneaky Mind-Over-Matter, Levitate Your Favorite Photos, Use Water to Detect Your Elevation, Navigate with Sneaky ... into a Collapsible Robot with Everyday Things\n\n\nPublisher: Andrews McMeel Publishing\nCy Tymony\n2010\nLanguage: English\nISBN-10: 0740773984\nASIN: B004E3XIE4\nEPUB \n160 pages \n10.3 MB\n\nAuthor and delightfully mad scientist Cy Tymony combines the fun of his Sneaky Uses series with a host of fascinating science facts and resourceful tricks in Sneaky Science Tricks, a uniquely entertaining and educational how-to guide for the sly and curious among us.\n\nThis time, Tymony has concocted an ingenious bag of tricks that includes a helicopter, a hand-powered fan, a clever moon direction trick, and many, many other shrewd navigation tools and tons of sneaky trivia on plants and animals, geography, and physics. \n\nEach nifty project in the book comes complete with detailed, easy-to-follow instructions and illustrations that fully demonstrate the step-by-step process, making Sneaky Science Tricks an ideal guidebook for sneaky scientists of all ages.\n\n","torrent":{"xt":"urn:btih:30b88267545aa94ea4697b2ffe59a20e9869119e","amp;dn":"Sneaky+Uses+for+Everyday+Things+And+Science+Tricks+-+How+to+Craf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b88267545aa94ea4697b2ffe59a20e9869119e","infoHashBuffer":{"type":"Buffer","data":[48,184,130,103,84,90,169,78,164,105,123,47,254,89,162,14,152,105,17,158]},"announce":[],"urlList":[]}}