{"title":"A Brief History Of Times by Stephen Hawking","uid":7277527,"size":1508627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3139aac2f138697424dfcb85f58c96d9ad85888a&amp;dn=A+Brief+History+Of+Times+by+Stephen+Hawking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"jo_100","files":1,"time":1337336674,"description":"A Brief History of Time (subtitled &quot;From the Big Bang to Black Holes&quot;) is a popular-science book written by British physicist Stephen Hawking and first published by the Bantam Dell Publishing Group in 1988. It became a best-seller and has sold more than 10 million copies. It was also on the London Sunday Times best-seller list for more than four years.\n\nA Brief History of Time attempts to explain a range of subjects in cosmology, including the Big Bang, black holes and light cones, to the nonspecialist reader. Its main goal is to give an overview of the subject but, unusual for a popular science book, it also attempts to explain some complex mathematics.\n\nThe author notes that an editor warned him that for every equation in the book the readership would be halved, hence it includes only a single equation: E = mc2. Early in 1983, Hawking approached Simon Mitton, the editor in charge of astronomy books at Cambridge University Press, with his ideas for a popular book on cosmology. Mitton was doubtful about all the equations in the draft manuscript, which he felt would put off the buyers in airport bookshops that Hawking wished to reach. It was with some difficulty that he persuaded Hawking to drop all but one equation. In addition to Hawking's notable abstention from presenting equations, the book also simplifies matters by means of illustrations throughout the text, depicting complex models and diagrams.","torrent":{"xt":"urn:btih:3139aac2f138697424dfcb85f58c96d9ad85888a","amp;dn":"A+Brief+History+Of+Times+by+Stephen+Hawking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3139aac2f138697424dfcb85f58c96d9ad85888a","infoHashBuffer":{"type":"Buffer","data":[49,57,170,194,241,56,105,116,36,223,203,133,245,140,150,217,173,133,136,138]},"announce":[],"urlList":[]}}