{"title":"Gustave Flaubert (Adam Thorpe, trans.) - Madame Bovary (epub, mo","uid":10465645,"size":1426286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3180ee0492fae1ff2c205e740e2342a7b134b760&amp;dn=Gustave+Flaubert+%28Adam+Thorpe%2C+trans.%29+-+Madame+Bovary+%28epub%2C+mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"pharmakate","files":-1,"time":1404186947,"description":"Gustave Flaubert (Adam Thorpe, trans.) - Madame Bovary (Vintage, 2011). retail epub, mobi conversion via calibre.\n\n\nThe newest translation of Madame Bovary, by a very fine English novelist. A distinctive feature of this version is the translator's decision to use only period language. Thorpe published a fascinating essay in The Guardian about this project; it's worth reading.\n\n\ndescription:\n\nOver 150 years since its first publication the power of Madame Bovary remains undiminished. Stunningly translated by Adam Thorpe, this edition brings us closer to Flaubert's original.\n\nWeaned on sentimental novels, Emma Bovary longs for a life of luxury and high romance. She is married to a kind but mediocre country doctor and is plagued by expectations of something more, some more intense experience, some wider horizon if she could only find it. She seeks to escape from boredom in extravagant shopping sprees and eventually, adultery. But even her affairs bring her disappointment and so begins her descent into ruin and despair.\n\nFirst published in 1857, Madame Bovary is one of the richest novels ever written; a mille-feuille of nuance, subtlety and psychological acuity. Linguistically meticulous, Thorpe delicately transposes the rhythms of Madame Bovary bringing us closer to Flaubert. This stunningly translated edition of Madame Bovary is destined to become the definitive English translation for our time.\n\n**\n\nAbout the Author\n\nGUSTAVE FLAUBERT grew up in Rouen and did not leave his birth city until he was nineteen when he went to study law in Paris. After three years, however, Flaubert abandoned law and began writing. His first finished work was November, a novella. In September 1849, Flaubert completed the first version of a novel, The Temptation of Saint Anthony. His exploration of themes of spiritual torment was just the beginning of Flaubert's controversial subject choices. His frank and realistic display of the sex, adultery and other goings-on in bourgeois France in Madame Bovary saw him go on trial for immorality, charges he only narrowly escaped. He died in 1880.\n\nADAM THORPE was born in Paris in 1956. His first novel, Ulverton, was published in 1992, and he has written eight others -- most recently The Standing Pool -- two collections of stories and five books of poetry. He lives in France with\nhis wife and family.\n\n-----\n\nMy scan of Adam Thorpe's Ulverton is available here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10299384&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10299384&lt;/a&gt;\n\nOther versions of Madame Bovary can be found in workerbee's torrent here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9194580&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9194580&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3180ee0492fae1ff2c205e740e2342a7b134b760","amp;dn":"Gustave+Flaubert+%28Adam+Thorpe%2C+trans.%29+-+Madame+Bovary+%28epub%2C+mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3180ee0492fae1ff2c205e740e2342a7b134b760","infoHashBuffer":{"type":"Buffer","data":[49,128,238,4,146,250,225,255,44,32,94,116,14,35,66,167,177,52,183,96]},"announce":[],"urlList":[]}}