{"title":"A Dictionary of Philosophy of Religion (2010) [PDF]","uid":10534282,"size":2571967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32dfa41a5558260871f03c1c807dee8395ac17bc&amp;dn=A+Dictionary+of+Philosophy+of+Religion+%282010%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405141414,"description":"Title: A Dictionary of Philosophy of Religion\nAuthor/Editor: Elsa J. Marty (Author), Charles Taliaferro (Editor)\nCategory: Academic/Religion/Philosophy \nPublisher: Bloomsbury Academic; 1 edition (August 19, 2010)\nLanguage: English\nISBN-10: 1441112383\nISBN-13: 978-1441112385\n\nReviews:\n&quot;Taliaferro and Marty have brought together a fine team of scholars to produce an up-to-date, concise philosophy of religion dictionary that will ably serve both the novice and the scholar. Besides the accessible, succinct entries, the dictionary contains certain bonus features: excellent introductory material, a useful philosophical/historical timeline, and an extensive bibliography for further reading. A terrific resource!&quot; -Paul Copan, Professor and Pledger Family Chair of Philosophy and Ethics, Palm Beach Atlantic University, USA, and co-editor of the Routledge Companion to Philosophy of Religion.\n\n&quot;This dictionary is informative, highly comprehensive, and a valuable research resource for students and scholars alike&quot; -Robert Audi, Professor of Philosophy, University of Notre Dame, USA, and General Editor of The Cambridge Dictionary of Philosophy.\n\n&quot;In conversation with some of the finest philosophical minds of our day, Taliaferro and Marty have crafted the quintessential philosophy of religion dictionary. Engaging, au courant, and filled with luminous definitions and clever examples, this unique and cross-cultural work offers a rich learning experience for both neophytes and experts. This resource is a truly outstanding accomplishment. &quot; -Chad V. Meister, Professor of Philosophy, Bethel College, USA, and author of Introducing Philosophy of Religion (Routledge)\n\nThis torrent contains a fully-indexed, browse-able and searchable copy of the paperback edition in PDF form. The front cover image is also included. Please seed, and enjoy.\n\nYou can find the Companion to this book here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10533239/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10533239/&lt;/a&gt;\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:32dfa41a5558260871f03c1c807dee8395ac17bc","amp;dn":"A+Dictionary+of+Philosophy+of+Religion+%282010%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32dfa41a5558260871f03c1c807dee8395ac17bc","infoHashBuffer":{"type":"Buffer","data":[50,223,164,26,85,88,38,8,113,240,60,28,128,125,238,131,149,172,23,188]},"announce":[],"urlList":[]}}