{"title":"Stephanie McCurry - Confederate Reckoning. Power and Politics in","uid":10265937,"size":1976747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33703deaa4cd12a9925d2e5bfdc82dacc54b07d3&amp;dn=Stephanie+McCurry+-+Confederate+Reckoning.+Power+and+Politics+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Anette14","files":-1,"time":1401525610,"description":"Description\nProduct Details\nBook Title: Confederate Reckoning: Power and Politics in the Civil War South\t\nBook Author: Stephanie McCurry\nHardcover: 456 pages\nPublisher: Harvard University Press; 1 edition (May 30, 2010)\nLanguage: English\nISBN-10: 0674045890\nISBN-13: 978-0674045897\n\n===================================================================================\nBook Description\nRelease date: May 30, 2010 | ISBN-10: 0674045890 | ISBN-13: 978-0674045897 | Edition: 1\nThe story of the Confederate States of America, the proslavery, antidemocratic nation created by white Southern slaveholders to protect their property, has been told many times in heroic and martial narratives. Now, however, Stephanie McCurry tells a very different tale of the Confederate experience. When the grandiosity of Southerners' national ambitions met the harsh realities of wartime crises, unintended consequences ensued. Although Southern statesmen and generals had built the most powerful slave regime in the Western world, they had excluded the majority of their own people-white women and slaves-and thereby sowed the seeds of their demise.\nWartime scarcity of food, labor, and soldiers tested the Confederate vision at every point and created domestic crises to match those found on the battlefields. Women and slaves became critical political actors as they contested government enlistment and tax and welfare policies, and struggled for their freedom. The attempt to repress a majority of its own population backfired on the Confederate States of America as the disenfranchised demanded to be counted and considered in the great struggle over slavery, emancipation, democracy, and nationhood. That Confederate struggle played out in a highly charged international arena.\nThe political project of the Confederacy was tried by its own people and failed. The government was forced to become accountable to women and slaves, provoking an astounding transformation of the slaveholders' state. Confederate Reckoning is the startling story of this epic political battle in which women and slaves helped to decide the fate of the Confederacy and the outcome of the Civil War.\n\n===================================================================================\nReviews\nCombining the best of the tradition of writing history &quot;from the bottom up,&quot;with prodigious research, and a red thread of analytical brilliance, Confederate Reckoning dramatically reshapes our understanding of the history of slavery and the Civil War. (Walter Johnson, author of Soul by Soul: Life Inside the Antebellum Slave Market)\n\nThis is a major book [that] permanently rewrites the history of the Confederacy. (James L. Roark, author of Masters Without Slaves: Southern Planters in the Civil War and Reconstruction)\n\nAnalyzing the experience of women, African Americans, and others often placed at the margins of Confederate history, McCurry powerfully challenges readers to get beyond high politics and storied military campaigns to engage a profoundly complicated, and often surprising, story of struggle and change amid seismic events. (Gary W. Gallagher, author of The Confederate War)\n\nMcCurry strips the Confederacy of myth and romance to reveal its doomed essence. Dedicated to the proposition that men were not created equal, the Confederacy had to fight a two-front war. Not only against Union armies, but also slaves and poor white women who rose in revolt across the South. Richly detailed and lucidly told, Confederate Reckoning is a fresh, bold take on the Civil War that every student of the conflict should read. (Tony Horwitz, author of Confederates in the Attic: Dispatches from the Unfinished Civil War)\n\n[McCurry] has written a staggeringly smart analysis of the politics of the Confederacy--indeed, she has written one of the most illuminating and creative studies of 19th-century American political life, period...I have been waiting for McCurry's second book to be published since I read Masters of Small Worlds over a decade ago; it is a triumph of political history, and it was well worth the wait. (Lauren Winner Books &amp; Culture 2010-04-28)\n\nForceful and elegantly written...this book [is] a landmark piece of Civil War historiography. (Jim Cullen History News Network 2010-06-11)\n\nGood history teaches readers about the past, excellent history offers perspective on the present. By this standard, Stephanie McCurry's Confederate Reckoning surely achieves excellence...McCurry offers a carefully researched and well-grounded frontal assault, examining secession's causes and actualities. She quickly disposes of the claims that the war was really about anything other than slavery, demonstrating that fanciful patinas such as &quot;states rights&quot; merely meant linguistic obfuscation of that brutal reality...As modern citizens decry government actions and hearken back to an ideal that never was, so too did the South assert a wish to return to a fictional revolutionary era utopia. This desire allowed them to not only ignore the long odds against their success, just as Tea Partiers fail to consider their program's (such as it is) absurd contradictions...McCurry shines a light on the South's brutal reality and thus encourages us to cast a cold analytical eye on our own. (Jordan Magill San Francisco Book Review 2010-06-22)\n\nThe sesquicentennial of the Civil War now looms on the horizon, promising its own deluge of books of every size, shape and description. We will be fortunate indeed if in sheer originality and insight they measure up to Confederate Reckoning...McCurry challenges us to expand our definition of politics to encompass not simply government but the entire public sphere. The struggle for Southern independence, she shows, opened the door for the mobilization of two groups previously outside the political nation--white women of the nonslaveholding class and slaves...Confederate Reckoning offers a powerful new paradigm for understanding events on the Confederate home front. (Eric Foner The Nation 2010-07-14)\n\nBuilding upon her work over almost two decades, McCurry presents a new history of the South's experience during the war. It is an account that foregrounds social history as contrasted with military history, and in this respect it is of a piece with much of the pathbreaking new scholarship on the war. It moves political history from the study of elected politicians and government institutions to an exploration of power in all its dimensions...Perhaps the highest praise one can offer McCurry's work is to say that once we look through her eyes, it will become almost impossible to believe that we ever saw or thought otherwise...Confederate Reckoning: Power and Politics in the Civil War South is a book about politics that stretches far beyond the ballot and the statehouse, all the way into plantations and farms and families and communities across the South...McCurry has helped to transform our understanding of the Confederacy--and of its impossibility...At the outset of the book, McCurry insists that she is not going to ask or answer the timeworn question of why the South lost the Civil War. Yet in her vivid and richly textured portrait of what she calls the Confederacy's &quot;undoing,&quot; she has in fact accomplished exactly that. And in doing so McCurry has written also a paean to social justice and to democracy, commitments and aspirations we would be well-served to make the heart of our Sesquicentennial commemorations. (Drew Gilpin Faust New Republic 2010-10-28)\n\n===================================================================================\nAbout the Author\nStephanie McCurry is Professor of History at the University of Pennsylvania.\n===================================================================================","torrent":{"xt":"urn:btih:33703deaa4cd12a9925d2e5bfdc82dacc54b07d3","amp;dn":"Stephanie+McCurry+-+Confederate+Reckoning.+Power+and+Politics+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33703deaa4cd12a9925d2e5bfdc82dacc54b07d3","infoHashBuffer":{"type":"Buffer","data":[51,112,61,234,164,205,18,169,146,93,46,91,253,200,45,172,197,75,7,211]},"announce":[],"urlList":[]}}