{"title":"Hypertension, A Clinical Guide- Venkata [PDF] [StormRG]","uid":11078278,"size":12788686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:338599a8784a7509a96c41a1a7b807059916b8eb&amp;dn=Hypertension%2C+A+Clinical+Guide-+Venkata+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":2,"time":1411363825,"description":"Author: C. Venkata S. Ram\nPaperback: 140 pages\nPublisher: CRC Press; 1 edition (January 13, 2014)\nLanguage: English\nISBN-10: 1840762012\nISBN-13: 978-1840762013\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_______________________________________________________________________________\n\n\nHypertension has become a major public health hazard not only in industrialized nations, but also in emerging economies. Early detection combined with effective treatment is imperative to reduce the risk of patients developing premature cardiovascular disease and accelerated atherosclerosis. A clear, concise resource, Hypertension: A Clinical Guide is of practical value to primary care doctors around the world who treat patients with hypertension every day.\n\nThe book explores both fundamental and practical aspects, including epidemiology, risk, treatment, and secondary causes. After discussing methods of diagnosis and evaluation, the book explores a range of pharmacological and non-pharmacological treatment options. Specialized chapters address topics such as hypertensive emergencies, hypertension in pregnancy and renal disease, renovascular hypertension, primary hyperaldosteronism, and pheochromocytoma. \n\nIllustrated with photos and tables, this volume is essential reading for physicians, nurses, and allied health professionals with an interest in hypertension whether in primary care, in hospitals, or in training.","torrent":{"xt":"urn:btih:338599a8784a7509a96c41a1a7b807059916b8eb","amp;dn":"Hypertension%2C+A+Clinical+Guide-+Venkata+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338599a8784a7509a96c41a1a7b807059916b8eb","infoHashBuffer":{"type":"Buffer","data":[51,133,153,168,120,74,117,9,169,108,65,161,167,184,7,5,153,22,184,235]},"announce":[],"urlList":[]}}