{"title":"F.I.G.H.T. - Fierce Israeli Guerilla Hand-to-hand Tactics","uid":4150966,"size":1369499472,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:33c7692ea2ab5fa2e8131476eeb372a14e15aef8&amp;dn=F.I.G.H.T.+-+Fierce+Israeli+Guerilla+Hand-to-hand+Tactics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"serpol","files":29,"time":1208939975,"description":"Integrated Defensive Fighting Systems, Inc. (IDFS) is proud to present the Fierce Israeli Guerilla Hand-to-hand Tactics (F.I.G.H.T.) program.\n\nThe F.I.G.H.T. program uses the most effective self-defense system available today - Haganah. Haganah is a Hebrew word meaning &quot;defense.&quot; The Haganah self-defense system is a complete Israeli Combative methodology based on both Israeli martial arts and Israeli military tactics used by Israeli Special Forces operatives in extremely hostile situations.\n\nThe Haganah system (and its components) was born out of a need to enable a state (or person) at a disadvantage - such as size or degree of armament - to defeat an adversary with an advantage.\n\nSince it&amp;#039;s declaration of statehood in 1948, Israel (which is smaller than most states in the U.S.) has been under constant military and terrorist attack. As a result of its constant engagement in various types of combat, and its ability to defeat much larger opponents, the Israel Defense Forces (IDF) is considered by many to be one of the best Armies in the world today. Special Forces members of the IDF are regarded around the globe as top of the line, due to their extensive hands on combat experience. The techniques incorporated into the system have been proven in violent hand-to-hand combat situations in Israel and have been carefully adapted to street oriented self-defense.\n\nThe Haganah system is far from being an ordinary Martial Art; it is the wave of the future in hand-to-hand combat and street fighting methodologies. It incorporates both unarmed and armed fighting methods. One of the most important features of the Haganah system is that, unlike many traditional martial arts systems, it is continuously enhanced. The IDF periodically updates its hand-to-hand and other combat techniques based upon its daily combat experience. Haganah integrates those updates after adapting them for use by civilians and law enforcement professionals. Additionally, we are constantly evaluating other methodologies such as those used by the various U.S. Special Forces to add in any of their techniques, which would strengthen the system. There is no ego in the Haganah system. It uses the best of the best in self-defense and combat methodologies.\n\nThe F.I.G.H.T. program encompasses the hand-to-hand and empty hand weapons defense components of the Haganah system.\n","torrent":{"xt":"urn:btih:33c7692ea2ab5fa2e8131476eeb372a14e15aef8","amp;dn":"F.I.G.H.T.+-+Fierce+Israeli+Guerilla+Hand-to-hand+Tactics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c7692ea2ab5fa2e8131476eeb372a14e15aef8","infoHashBuffer":{"type":"Buffer","data":[51,199,105,46,162,171,95,162,232,19,20,118,238,179,114,161,78,21,174,248]},"announce":[],"urlList":[]}}