{"title":"[Raymond Murray , Keith E. Holbert]Nuclear Energy, Seventh Editi","uid":11256387,"size":30744927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3486fb58a7f632867dceb20a6bf7abdddb1f9e06&amp;dn=%5BRaymond+Murray+%2C+Keith+E.+Holbert%5DNuclear+Energy%2C+Seventh+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413904641,"description":"Book Description\nPublication Date: January 28, 2014\n\nNuclear Energy is one of the most popular texts ever published on basic nuclear physics, systems, and applications of nuclear energy. This newest edition continues the tradition of offering a holistic treatment of everything the undergraduate engineering student needs to know in a clear and accessible way. The book presents a comprehensive overview of radioactivity, radiation protection, nuclear reactors, waste disposal, and nuclear medicine.\n\nThe seventh edition is restructured into three parts: Basic Concepts, Nuclear Power (including new chapters on nuclear power plants and introduction to reactor theory), and Radiation and Its Uses. Part Two in particular has been updated with current developments, including a new section on Reactor Safety and Security (with a discussion of the Fukushima Diiachi accident); updated information on naval and space propulsion; and revised and updated information on radioactive waste storage, transportation, and disposal. Part Three features new content on biological effects of radiation, radiation standards, and radiation detection.\n\n\n    Coverage of energy economics integrated into appropriate chapters\n    More worked examples and end of chapter exercises\n    Updated final chapter on nuclear explosions for current geopolitical developments\n\nEditorial Reviews\nReview\n&quot;This book presents basic concepts in nuclear energy in crisp and elegant fashion. Prof. Murray has done an excellent job with this fifth edition.&quot;\n-Shripad T. Revankar, Purdue University\n\nThis book is for beginners, and it is especially useful for the engineer or scientist who has no previous knowledge of nuclear energy but who wishes to get up to speed and become familiar with the general problems.\n\nThis is a fine book and will, I believe, help to show students that nuclear engineering, and its associated fields, are worthwhile areas in which to plan a career.\n-M.M.R Williams, Emeritus Professor of Nuclear Engineering, University of London\n\nespecially impressed with the inclusion of computer problems\nFrom the Publisher\nThis book provides nuclear engineers, plant designers and radiation physicists with a comprehensive overview of nuclear energy and its uses, and discusses potential problems and the outlook for the future. \n\nPublisher: Butterworth-Heinemann; 7 edition (January 28, 2014)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00IE70QKU","torrent":{"xt":"urn:btih:3486fb58a7f632867dceb20a6bf7abdddb1f9e06","amp;dn":"%5BRaymond+Murray+%2C+Keith+E.+Holbert%5DNuclear+Energy%2C+Seventh+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3486fb58a7f632867dceb20a6bf7abdddb1f9e06","infoHashBuffer":{"type":"Buffer","data":[52,134,251,88,167,246,50,134,125,206,178,10,107,247,171,221,219,31,158,6]},"announce":[],"urlList":[]}}