{"title":"Scott Joplin - The Entertainer TQMP","uid":4738715,"size":302705731,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:348fe2699b6d109298ef93521a53b11ada6eb02d&amp;dn=Scott+Joplin+-+The+Entertainer+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"zootallure","files":28,"time":1235432879,"description":"It is time to...what was that? Rag chew? Rag-doll? Rag-bolt? Rag-bag? Oh no, yes, ahhhaaa it is time for Ragtime! Or better, the King Of Ragtime: Scott Joplin!\n\nScott Joplin was an American musician and composer of ragtime music. He remains the best-known ragtime figure and is regarded as one of the three most important composers of classic ragtime, along with James Scott and Joseph Lamb. His music enjoyed a considerable resurgence of popularity and critical respect in the 1970s, especially for his most famous composition, &quot;The Entertainer&quot; which was featured as the main theme in the 1973 film The Sting.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinyl rips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)","torrent":{"xt":"urn:btih:348fe2699b6d109298ef93521a53b11ada6eb02d","amp;dn":"Scott+Joplin+-+The+Entertainer+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348fe2699b6d109298ef93521a53b11ada6eb02d","infoHashBuffer":{"type":"Buffer","data":[52,143,226,105,155,109,16,146,152,239,147,82,26,83,177,26,218,110,176,45]},"announce":[],"urlList":[]}}