{"title":"BBC Documentary - The Power of Nightmares","uid":4620000,"size":3220876124,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:34b6aa8322f6205f31026a8bc34cbaa101e500b7&amp;dn=BBC+Documentary+-+The+Power+of+Nightmares&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"FreedomLover","files":3,"time":1230995934,"description":"The Power of Nightmares: Three-part BBC documentary \n\n\nShould we be worried about the threat from organised terrorism or is it simply a phantom menace being used to stop society from falling apart? \n\nIn the past our politicians offered us dreams of a better world. Now they promise to protect us from nightmares. \n\nThe most frightening of these is the threat of an international terror network. But just as the dreams were not true, neither are these nightmares. \n\nIn a new series, the Power of Nightmares explores how the idea that we are threatened by a hidden and organised terrorist network is an illusion. \n\nIt is a myth that has spread unquestioned through politics, the security services and the international media. \n\n\nAt the heart of the story are two groups: the American neo-conservatives and the radical Islamists. \nBoth were idealists who were born out of the failure of the liberal dream to build a better world. \n\nThese two groups have changed the world but not in the way either intended. \n\n\nTogether they created today's nightmare vision of an organised terror network. \nA fantasy that politicians then found restored their power and authority in a disillusioned age. Those with the darkest fears became the most powerful. \n\nThe rise of the politics of fear begins in 1949 with two men whose radical ideas would inspire the attack of 9/11 and influence the neo-conservative movement that dominates Washington. \n\nBoth these men believed that modern liberal freedoms were eroding the bonds that held society together. \n\nThe two movements they inspired set out, in their different ways, to rescue their societies from this decay. But in an age of growing disillusion with politics, the neo-conservatives turned to fear in order to pursue their vision. \n\nThey would create a hidden network of evil run by the Soviet Union that only they could see. \n\nThe Islamists were faced by the refusal of the masses to follow their dream and began to turn to terror to force the people to &quot;see the truth&quot;'.\n\n=================================================================================\n\nAlso watch:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4607932/Pat_Condell__Anthology&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4607932/Pat_Condell__Anthology&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:34b6aa8322f6205f31026a8bc34cbaa101e500b7","amp;dn":"BBC+Documentary+-+The+Power+of+Nightmares","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34b6aa8322f6205f31026a8bc34cbaa101e500b7","infoHashBuffer":{"type":"Buffer","data":[52,182,170,131,34,246,32,95,49,2,106,139,195,76,186,161,1,229,0,183]},"announce":[],"urlList":[]}}