{"title":"Encyclopedia of Inland Waters - Gene E. Likens","uid":15576749,"size":89483259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34c5b14a8891651f2bfa3a8566c15f6ef3ccd698&amp;dn=Encyclopedia+of+Inland+Waters+-+Gene+E.+Likens&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1471348269,"description":"Encyclopedia of Inland Waters - Gene E. Likens (AP, 2009).pdf\r\n\r\nInland aquatic habitats occur world-wide at all scales from marshes, swamps and temporary puddles, to ponds, lakes and inland seas; from streams and creeks to rolling rivers. Vital for biological diversity, ecosystem function and as resources for human life, commerce and leisure, inland waters are a vital component of life on Earth. The Encyclopedia of Inland Waters describes and explains all the basic features of the subject, from water chemistry and physics, to the biology of aquatic creatures and the complex function and balance of aquatic ecosystems of varying size and complexity.\r\n\r\nUsed and abused as an essential resource, it is vital that we understand and manage them as much as we appreciate and enjoy them. This extraordinary reference brings together the very best research to provide the basic and advanced information necessary for scientists to understand these ecosystems - and for water resource managers and consultants to manage and protect them for future generations.\r\n\r\n\r\n\r\nEncyclopedic reference to Limnology - a key core subject in ecology taught as a specialist course in universities Over 240 topic related articles cover the field\r\nGene Likens is a renowned limnologist and conservationist, Emeritus Director of the Institute of Ecosystems\r\nResearch, elected member of the American Philosophical Society and recipient of the 2001 National Medal of Science\r\nSubject Section Editors and authors include the very best research workers in the field","torrent":{"xt":"urn:btih:34c5b14a8891651f2bfa3a8566c15f6ef3ccd698","amp;dn":"Encyclopedia+of+Inland+Waters+-+Gene+E.+Likens","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34c5b14a8891651f2bfa3a8566c15f6ef3ccd698","infoHashBuffer":{"type":"Buffer","data":[52,197,177,74,136,145,101,31,43,250,58,133,102,193,95,110,243,204,214,152]},"announce":[],"urlList":[]}}