{"title":"Puppet Master Movie Collection 1-9 - DVDRip avi","uid":5739995,"size":6472782458,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34e89dc53b96a1002f149cc8a709d3d425a6d06c&amp;dn=Puppet+Master+Movie+Collection+1-9+-+DVDRip+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"neon","files":-1,"time":1280967885,"description":"Puppet Master (1989) : IMDB http://www.imdb.com/title/tt0098143/\nAndrÃƒÂ© Toulon is a puppet maker and the best of the kind. One day he happens upon an old Egyptian formula able to create life, so he decides to give life to his puppets. The Nazis seek to use this knowledge to their advantage and in desperation, Toulon commits suicide. Some years later four psychics get on the trail of a former colleague who suddenly commits suicide, and they decide to investigate the mansion he killed himself in. Along with his widow, they uncover the secrets of the Puppet Master.\n\n===============================\n\nPuppet Master II (1991) : IMDB http://www.imdb.com/title/tt0100438/\nThe puppets return the original master, AndrÃƒÂ© Toulon, back to life inorder for him to help them kill and collect brains for more fluid for them to live off for another half century. And when a inspective group come to the hotel believe in nothing but Alex Whitakers stories they keep watch, and throughout the movie they are hunted down one by one for their brains and when AndrÃƒÂ© sees Carolyn Bramwell who looks just like his dead wife Elsa, everything goes to hell.\n\n\n===============================\n\nPuppet Master III - Toulons Revenge (1991) : IMDB http://www.imdb.com/title/tt0102728/\nSet in Berlin during WWII, the Nazi regime is attempting to develop a drug that will animate the dead, in order to use in the war effort. Toulin arouses suspicion as a Nazi dissident, and his secret is discovered. During a Nazi raid on his home, Toulins beautiful wife is murdered. Toulin vows revenge, with the help of his animated puppets. This movie gives a new perspective on Toulin and his \\&quot;friends\\&quot;.\n\n===============================\n\nPuppet Master 4 (1993) : IMDB http://www.imdb.com/title/tt0107899/\nA young scientist working on an artificial intelligence project is the target of strange gremlin-like creatures, who are out to kill him and thus terminate his research. By coincidence, in one of the rooms he uses, there\\'s a mysterious case containing the puppets of the &quot;puppet master&quot;. When the puppets are brought to life, they help destroy the creatures.\n\n===============================\n\nPuppet Master 5 - The Final Chapter (1994) : IMDB http://www.imdb.com/title/tt0110916/\nAfter having his demon destroyed, an anciet evil creates a puppet of himself to release on the world. With the help of Toulons spirit the Risk Myers destroys the demon and becomes the new puppet master.\n\n\n===============================\n\nCurse of the Puppet Master (1998 : IMDB http://www.imdb.com/title/tt0132451/\nBack for retribution, the living puppets of AndrÃƒÂ© Toulon are stirred to action, mounting a crusade to foil the diabolical plans of their new master. Can they stop the dastardly Dr. Magrew before he transforms another unwitting victim into the newest member of the puppet lineage? Companion action figures sold separately! \n\n===============================\n\nRetro Puppet Master (1999) : IMDB http://www.imdb.com/title/tt0189047/\nIt\\'s 1892 and Sutekh is hopping mad. It seems a 3,000 year old Egyptian sorcerer has stolen one of the God\\'s secrets of life - that of instilling the souls of the dying into inanimate things. Sutekh raises three mummified former high priests, led by the villainous \\&quot;First Servant\\&quot;, and charges them with recovering both the Sorceror and his secret. There is no lack of victims for the 3 high-faluting, stylish villains as they pursue their prey to 19th century Paris, and the very young puppeteer, AndrÃƒÂ© Toulon. Toulon runs a puppet theatre in the heart of Paris, and meets the sorcerer (the mysterious Afzel) when he is found by the lovely Swiss Ambassadors daughter Ilsa, after being nearly killed. It is there and then that we find the seed of things to come, and the origin of the Puppetmaster series of tales.\n\n===============================\n\nPuppet Master - The Legacy (2004) : IMDB http://www.imdb.com/title/tt0390393/\nComprised mostly of clips from the previous features, the film centers around Eric Weiss (Jacob Witkin) the little boy saved by toymaker AndrÃƒÂ© Toulon in Puppet Master 3. Now a grown man in pursuit of Toulons secret for animating objects, Weiss relates the puppets history--through flashbacks and archival footage from the first six sequels--to a woman named Maclain (Kate Orsini), unaware that the mysterious beauty is really an assassin out to destroy the puppet masters legacy.\n\n\n===============================\n\nPuppet Master vs Demonic Toys (2004) : IMDB http://www.imdb.com/title/tt0431340/\nRobert Toulon and his daughter Alex have discovered a brought back the puppets of Roberts ancestor. But when Christmas draws near Sharpe Industries ceo Erica Sharpe has made a deal with a demon named Bael. They bring forth a number of vicious killer toys to get the mysterious Secret of Life from Robert Toulon. When the puppets are unable to defeat them, the toys rain supreme, until that is the new Puppet Master repairs four of the puppets into new Cyber Mechanic defenders willing to rage war against their stringless counterparts\n\n===============================\n &lt;a href=&quot;\nhttp://img580.imageshack.us/slideshow/webplayer.php?id=pmoq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img580.imageshack.us/slideshow/webplayer.php?id=pmoq.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:34e89dc53b96a1002f149cc8a709d3d425a6d06c","amp;dn":"Puppet+Master+Movie+Collection+1-9+-+DVDRip+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e89dc53b96a1002f149cc8a709d3d425a6d06c","infoHashBuffer":{"type":"Buffer","data":[52,232,157,197,59,150,161,0,47,20,156,200,167,9,211,212,37,166,208,108]},"announce":[],"urlList":[]}}