{"title":"Michael Jackson Thriller Album 320k (musicfromrizzo) +bonus","uid":6782308,"size":111725191,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3536f8e18bb883135d5ce24de0daf6e6efef2cc5&amp;dn=Michael+Jackson+Thriller+Album+320k+%28musicfromrizzo%29+%2Bbonus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"musicfromrizzo","files":-1,"time":1319952783,"description":"Michael Jackson - Thriller (converted from FLAC) 320k + bonus track\n\nWe compared a number of different versions of this album out\nthere - even flac from DTS, related wav files, remastered mp3s, regular\nflacs, mp3s etc and found distortion all too often at high levels in the\nsamples we found.\n\nFinally we came across great sounding flac iles which were huge and bulky\nand had too much other material in the folder - so here we are with just\nas great a sound quality in my own view with this experience too, with\nthis set of mp3s instead. With what you save on bandwidth using these mp3s\nrather than bulky flacs, we managed a great bonus track of a beautiful song.\n\nThriller was one of the best albums of its time and belongs with the stuff\nof disco as part of the same overall memory for those of that period of\ngrowing up - or having fun!\n\nMichael Rizzo Chessman\nmusicfromrizzo\n\n\nMichael Jackson - Baby Be Mine (Thriller album - mp3 converted from FLAC)\nMichael Jackson - Beat It (Thriller album - mp3 converted from FLAC)\nMichael Jackson - Billie Jean (Thriller album - mp3 converted from FLAC)\nMichael Jackson - Human Nature (Thriller album - mp3 converted from FLAC)\nMichael Jackson - P.Y.T. (Pretty Young Thing) (Thriller album - mp3 converted from FLAC)\nMichael Jackson - The Girl Is Mine (Thriller album - mp3 converted from FLAC)\nMichael Jackson - The Lady In My Life (Thriller album - mp3 converted from FLAC)\nMichael Jackson - Thriller (Thriller album - mp3 converted from FLAC)\nMichael Jackson - Wanna Be Startin' Somethin' (Thriller album - mp3 converted from FLAC)\n \nbonus item \nMichael Jackson - Ain't No Sunshine when she's gone\n\n\nmy thanks to kitelope of tdb for the source flac file posting ","torrent":{"xt":"urn:btih:3536f8e18bb883135d5ce24de0daf6e6efef2cc5","amp;dn":"Michael+Jackson+Thriller+Album+320k+%28musicfromrizzo%29+%2Bbonus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3536f8e18bb883135d5ce24de0daf6e6efef2cc5","infoHashBuffer":{"type":"Buffer","data":[53,54,248,225,139,184,131,19,93,92,226,77,224,218,246,230,239,239,44,197]},"announce":[],"urlList":[]}}