{"title":"Freedom Downtime (2004 version) - Story of Hacker Kevin Mitnick","uid":3429504,"size":916499732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35551d756f8fa5f753ab32cf7b9966377e048306&amp;dn=Freedom+Downtime+%282004+version%29+-+Story+of+Hacker+Kevin+Mitnick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Lobais","files":3,"time":1136782005,"description":"I noticed we had an older torrent of this, but it seems to have petered out.\n\nThis is a documentary of Kevin Mitnick's 5-year imprisonment without trial during the 1990's and the movement associated with it. This one includes an interview with Mitnick as well as the original documentary.\n\n2600's description:\n\nFREE KEVIN\n\nThe Story They Wouldn't Tell You\n\nAround the world, computer hackers are being portrayed as the newest brand of terrorists.  This is a story of a hacker named Kevin Mitnick, imprisoned without bail for nearly five years.  Freedom Downtime tries to uncover the reasons why the authorities are so scared of Mitnick as well as define what exactly he did.  Surprisingly, no real evidence is ever presented by t he authorities to back up the sensationalist claims in mass media.  But when a Hollywood studio decides to make a movie about Mitnick's life through the eyes of one of his accusers, hackers turn to activism to get their message out.  Through interviews with relatives, friends, lawyers, and experts in the computer and civil liberties arena, a picture of a great injustice becomes apparent.  A cross-country journey uncovers some realities of the hacker culture as well as the sobering fact that so many technically young adept people are being imprisoned.  \n\nThis is the 2004 release, containing more footage than the original cut in 2001.  Also included is an interview with Kevin. \n\nProduced by 2600 Films\nBroadcasting, Netcasting, and Copying Are Encouraged as Long as it's Free \n \nDVDRip DivX5.0\nMovie runtime 02:01:46 699mb\nInterview          01:18:06 174mb \n\n","torrent":{"xt":"urn:btih:35551d756f8fa5f753ab32cf7b9966377e048306","amp;dn":"Freedom+Downtime+%282004+version%29+-+Story+of+Hacker+Kevin+Mitnick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35551d756f8fa5f753ab32cf7b9966377e048306","infoHashBuffer":{"type":"Buffer","data":[53,85,29,117,111,143,165,247,83,171,50,207,123,153,102,55,126,4,131,6]},"announce":[],"urlList":[]}}