{"title":"Franco: A Personal and Political Biography (2014) pdf","uid":11660229,"size":4568533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35983c07ceb6c6cde3db7a248ca83ad6f3a44a1f&amp;dn=Franco%3A+A+Personal+and+Political+Biography+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1417987560,"description":"General Francisco Franco ruled Spain for nearly forty years, as one of the most powerful and controversial leaders in that nation's long history. He has been the subject of many biographies, several of them more than a thousand pages in length, but all the preceding works have tended toward one extreme of interpretation or the other. This is the first comprehensive scholarly biography of Franco in English that is objective and balanced in its coverage, treating all three major aspects of his life - personal, military, and political. The coauthors, both renowned historians of Spain, present a deeply researched account that has made extensive use of the Franco Archive (long inaccessible to historians). They have also conducted in-depth interviews with his only daughter to explain better his family background, personal life, and marital environment, as well as his military and political career. Franco: A Personal and Political Biography depicts his early life, explains his career and rise to prominence as an army officer who became Europe's youngest interwar brigadier general in 1926, and then discusses his role in the affairs of the troubled Second Spanish Republic (1931-36). Stanley G. Payne and Jesus Palacios examine in detail how Franco became dictator and how his leadership led to victory in the Spanish Civil War that consolidated his regime. They also explore Franco's role in the great repression that accompanied the Civil War--resulting in tens of thousands of executions - and examine at length his controversial role in World War II. This masterful biography highlights Franco's metamorphoses and adaptations to retain power as politics, culture, and economics shifted in the four decades of his dictatorship","torrent":{"xt":"urn:btih:35983c07ceb6c6cde3db7a248ca83ad6f3a44a1f","amp;dn":"Franco%3A+A+Personal+and+Political+Biography+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35983c07ceb6c6cde3db7a248ca83ad6f3a44a1f","infoHashBuffer":{"type":"Buffer","data":[53,152,60,7,206,182,198,205,227,219,122,36,140,168,58,214,243,164,74,31]},"announce":[],"urlList":[]}}