{"title":"Conversations With God - An Uncommon Dialogue Books 1, 2 and 3 (","uid":9641046,"size":3173118,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:360e734d3bd867ea9ceb8f0f853e8278d55dacfe&amp;dn=Conversations+With+God+-+An+Uncommon+Dialogue+Books+1%2C+2+and+3+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"GoonerTPB","files":6,"time":1392926832,"description":"* Book 1\nConversations with God Book 1 began a series that has been changing millions of lives for more than ten years. Finally, the bestselling series is now a movie, starring Henry Czerny (The Pink Panther and Clear and Present Danger) and Ingrid Boulting (The Last Tycoon). Produced and directed by Stephen Simon (producer of Somewhere in Time and What Dreams May Come) and distributed by Samuel Goldwyn Films and Fox Home Entertainment, the theatrical release is set for October 27, 2006. The movie is the true account of Walsch (played by Cierny), who went from an unemployed homeless man to an &quot;accidental spiritual messenger&quot; and author of the bestselling book\n\n* Book 2\nResuming the dialogue where Book 1 left off, Conversations with God, Book 2 moves from personal issues to more global and political concerns. Included are questions about the nature of time and space and human sexuality, as well as geophysical and geopolitical considerations of worldwide implication.\n\n* Book 3\nThe sequel to the bestselling Books One and Two of &quot;Conversations with God&quot;, this powerful and inspirational dialogue expands as readers enter into an adventurous exploration of life, gain a better understanding of the universe, and fully develop a personal relationship with God.\n","torrent":{"xt":"urn:btih:360e734d3bd867ea9ceb8f0f853e8278d55dacfe","amp;dn":"Conversations+With+God+-+An+Uncommon+Dialogue+Books+1%2C+2+and+3+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"360e734d3bd867ea9ceb8f0f853e8278d55dacfe","infoHashBuffer":{"type":"Buffer","data":[54,14,115,77,59,216,103,234,156,235,143,15,133,62,130,120,213,93,172,254]},"announce":[],"urlList":[]}}