{"title":"The Jonathan Meades Collection 01of13 Introduction DVDrip x264 A","uid":10786309,"size":173191514,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:361bea8df6491661071e7c32b1c5bae209861431&amp;dn=The+Jonathan+Meades+Collection+01of13+Introduction+DVDrip+x264+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MVGroup","files":1,"time":1408214003,"description":"The Jonathan Meades Collection\n\nArts Documentary hosted by Jonathan Meades, published by BBC in 2008 - English narration\n\n\n\nInformation\n------------------------------\n\nJonathan Meades' shows are unlike anyone else's. They belong to a genre of their own. They are heavy entertainment. They combine topographical analysis with performance art, high seriousness with low comedy, visual trickery with hymns to the overlooked, polemical argument with scathing wit. They take you to places you'll never have been before - most of them located in the byways of Meades' imagination. They show how the world seems to him and they may even persuade you to look again ...\nThe collection includes eleven of his best and an interview with Mark Lawson in which he talks about his working methods, the relationship of his television shows to his fiction, and his journalism, censorship, maximalism, gastronomy etc.\n\n\n1)  Introduction \nThis collection includes eleven shows from the fifty or so that Joanathan Meades has written and performed since in 1990. He provides a brief intro to each in turn. (14 min 2008)\n\n2)  Severn Heaven \nJust north of Bewdley in Worcestershire, beside the Severn Valley Railway, is the largest surviving interwars 'plotland' settlement in Britain. This is a village of dwellings built by their owners from improvised materials: old railway carriages, chicken coops, the fuselages of gliders etc. Decried as an instant slum and opposed by planning authorities it is today regarded as a valuable manifestation of working class history. (30 min Abroad In Britain 1990)\n\n3)  In Search of Bohemia \nThere are a surprising number of places in Britain called Bohemia. Even more surprising is the fact that two of them - in Hastings and the New Forest - have connections to the artistic bohemia of such painters as Augustus John, two of whose studios demonstrate how much domestic design would take from this type of building. Features a red Lada that's a mobile tip. (30 min Abroad In Britain 1990)\n\n4)  Get High \nAn investigation of vertigo and the compulsion to jump. Meades crawls across Brunei's Clifton Suspension Bridge, rashly takes a boat over Telford's Pont Cysyllte aqueduct, rides a roller coaster which goes over the sea and quivers with fear inside Richard Rogers's Lloyds building. The supporting cast includes Miss Wrexham and a lifesize inflatable Meades doll. (30 min Further Abroad 1994)\n\n5)  Belgium \nThe butt of jokes in both France and Holland, Belgium is so routinely bizarre that this show proposes that Magritte, far from being a surrealist, was simply a reportorial observer of his compatriots' mores. Includes vertical archery, finch sport, horse meat, the museums of underwear and ironing, a man dressed as a penguin, Europe's most spectacular suburbs. (30 min Further Abroad 1994)\n\n6)  Remember the Future \nThe white heat of the technological revolution...the high point of British architectural modernism. The 1960s was the age of Big Tech. It took a machine the size of a bungalow to do what a palmtop can do today. Our surroundings were dramatically changed by transmitter masts, listening stations, radio telescopes and sculpturally audacious buildings. These monuments of a distant age are tracked down with the help of a Bennometer, named in honour of Harold Wilson's Minister of Technology, Anthony Wedgwood Benn (as he then was). (30 min Even Further Abroad 1997)\n\n7)  The Absentee Landlord \nIn the secular postwar years when congregations were diminishing, both the Roman Catholic and Anglican confessions built numerous new churches. Some -like the most famous of them, Coventry Cathedral - replaced buildings lost to bombs. Many, however, were devised to accommodate the liturgical demands of Vatican II. The very idea of what sort of building a church should be was called into question. An architectural free for all ensued: churches like fossils, churches like fruit machines, churches like marquees. (30 min Further Abroad 1997)\n\n8)  Double Dutch \nNo part of England looks so un-English as the fens of Norfolk, Cambridgeshire and Lincolnshire. Dead flat, often below sea level, drained by unerringly straight canals that rise above the black earth, they present epic landscapes, skyscrapers and waterscapes which are closer to the sublime that the picturesque. What does this environment do to the people who live and work there in what seems like a rectilinear factory without a roof? Why should this thrillingly grim place be the English Mecca of lowbrow American pursuits such as stock car racing and line dancing? (30 min Further Abroad 1997)\n\n9)  Fast Food \nTwo metre tall burgers, Christopher Biggins sweating in a kitchen, a pig singing about its forthcoming transubstantiation into sausage...this show is self-evidently a protracted revue sketch rather than an analysis of Britain's peculiar relationship to what it eats. Nonetheless it does make the point that the relentlessly mediated gastronomic revolution (fresh organic produce, decent restaurants etc) is enjoyed by a tiny fragment of the population - it is atypical of the common experience: most Britons eat industrial grot because that's all they can afford. (30 min Meades Eats 2003)\n\n10)  Father to the Man \nAn autobiographical piece about how the writer's interest in place was triggered by being driven around south Wiltshire, west Hampshire and north Dorset by his father, a biscuit salesman. The infant Meades would wander round down in a spirit of untutored curiosity and amazement at everyday things. Loci include the 'floated' meadows of the Avon valley, Sherborne Castle, Southampton Water, sunken lanes, B-roads to nowhere and Mudeford, home of the crab sandwich. (50 min Abroad Again 2007)\n\n11)  Magnetic North Part 1 \nIn Meades's opinion the north begins where grain spirit and beer replace wine as the staple drink because the climate is hostile to vines. Beginning in French Flanders he heads north trying to define northerness, trying to locate its essential qualities. He fails. But ...\n\n12)  Magnetic North Part 2 \n... along the way he takes in the gothic and the grotesque, the vitality of Hamburg and its monument to the Unknown Pimp, the creepiness of German woods, Polish fortresses, the Brezhnev Plays Vegas style of late Soviet architecture, Tallinn's beauty, Finland's uterine nostalgia. Many scenes in bars, many herrings eaten. (2x 60 min 2008)\n\n13)  Interview \nMark Lawson talks to Jonathan Meades (40 min 2008)\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC High @L3.0\n * Video Bitrate: 1698 kbit/s\n * Video Aspect Ratio: 4:3 and 16:9\n * Video Resolution: varies\n * Audio Codec: AAC\n * Audio: English\n * Audio Bitrate: 192 kbit/s CBR 48kHz\n * Audio Channels: 2\n * Run-Time: 30 minutes\n * Framerate: 25 frame/s\n * Number of Parts: 13\n * Container: mkv\n * Part Size: 364 MB\n * Source: DVD\n * Encoded by: PFT\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jonathan_Meades&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jonathan_Meades&lt;/a&gt; &lt;a href=&quot;\nhttp://jonathanmeades.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jonathanmeades.co.uk/&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Jerry%20Building%3A%20Unholy%20Relics%20of%20Nazi%20Germany&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Jerry%20Building%3A%20Unholy%20Relics%20of%20Nazi%20Germany&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Bunkers%20Brutalism%20and%20Bloodymindedness&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Bunkers%20Brutalism%20and%20Bloodymindedness&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Joy%20of%20Essex&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Joy%20of%20Essex&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Abroad%20Again&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Abroad%20Again&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:361bea8df6491661071e7c32b1c5bae209861431","amp;dn":"The+Jonathan+Meades+Collection+01of13+Introduction+DVDrip+x264+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361bea8df6491661071e7c32b1c5bae209861431","infoHashBuffer":{"type":"Buffer","data":[54,27,234,141,246,73,22,97,7,30,124,50,177,197,186,226,9,134,20,49]},"announce":[],"urlList":[]}}