{"title":"The Penguin Atlas of Medieval History","uid":5491061,"size":84416818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36303eb292ed3c197121593ad00925235480d3c1&amp;dn=The+Penguin+Atlas+of+Medieval+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"artpepper","files":-1,"time":1271001622,"description":"The Penguin Atlas of Medieval History by by Colin McEvedy \n\n\nPenguin Books, Ltd. | 1961 (reprinted 1976) | ISBN 0140708227 | 96 pgs. | PDF | 85MB\n\n\nThis is truly a superb book for anyone with even the slightest interest in history. It has two main advantages:\n\n1) It covers 1,000 years in barely 100 pages. You could read it in an afternoon.\n\n2) It covers the entire sweep of European and Middle Eastern history together, so that every major event can be seen in its context.\n\n\nThe main body of the book consists of political maps - the same basic map every time - showing the medieval world at roughly 30-year intervals. Turn the pages fast enough and empires rise and fall like a cartoon show (quite a long show in the case of the Byzantine Empire). \n\nThe book also pauses occasionally to show the growth of the major religions, trade and population.\n\nBut an unexpected bonus comes with the writing. McEvedy writes with informal clarity and a deft use of language that makes every paragraph engaging and brings the story to life in a way quite unlike most history books (the Kwarizm Shah, he writes, &quot;fell back to rest against the teeth of the Mongolian dragon&quot;; &quot;the King of France was a lunatic, the Duke of Burgundy open-minded about his loyalties and the French nobility as confused as ever about the difference between tournaments and tactics&quot;). Reading him is a pleasure.","torrent":{"xt":"urn:btih:36303eb292ed3c197121593ad00925235480d3c1","amp;dn":"The+Penguin+Atlas+of+Medieval+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36303eb292ed3c197121593ad00925235480d3c1","infoHashBuffer":{"type":"Buffer","data":[54,48,62,178,146,237,60,25,113,33,89,58,208,9,37,35,84,128,211,193]},"announce":[],"urlList":[]}}