{"title":"Journey - The Essential [2 CD's][2001][320 KBPS","uid":10472422,"size":331812215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3672d8fb34c2e46d05ecaa48ce22a9b3ff3ddb87&amp;dn=Journey+-+The+Essential+%5B2+CD%27s%5D%5B2001%5D%5B320+KBPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"LameDuck69","files":41,"time":1404267799,"description":"Journey - The Essential [2 CD's][2001]\n\n\n\n\nDisc 1 \n\n \n01. Only The Young  \n02. Don't Stop Believin'  \n03. Wheel In The Sky  \n04. Faithfully  \n05. Any You Want It  \n06. Ask The Lonely  \n07. Who's Crying Now  \n08. Separate Ways (Worlds Apart)  \n09. Lights  \n10. Lovin', Touchin', Squeezin'  \n11. Open Arms  \n12. Girl Can't Help It  \n13. Send Her My Love  \n14. When You Love A Woman  \n15. I'll Be Alright Without You  \n16. After The Fall\n \n\n\n \nDisc 2 \n\n \n01. Chain Reaction  \n02. Message Of Love  \n03. Somethin' To Hide  \n04. Line Of Fire  \n05. Anytime  \n06. Stone In Love  \n07. Patiently  \n08. Good Morning Girl  \n09. The Eyes Of A Woman  \n10. Be Good To Yourself  \n11. Still They Ride  \n12. Baby I'm A Leavin' You  \n13. Mother, Father  \n14. Just The Same Way  \n15. Escape  \n16. The Party's Over (Hopelessly In Love)  \n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nJourney is an American rock band formed in San Francisco in 1973 by former members of Santana and Frumious Bandersnatch. The band has gone through several phases; its strongest commercial success occurred between 1978 and 1987, after which it temporarily disbanded. During that period, the band released a series of hit songs, including 1981's &quot;Don't Stop Believin'&quot;, which in 2009 became the top-selling catalog track in iTunes history. Its parent studio album, Escape, the band's eighth and most successful, reached No. 1 on the Billboard 200 and yielded another of their most popular singles, &quot;Open Arms&quot;. Its 1983 follow-up, Frontiers, was almost as successful in the United States, reaching No. 2 and spawning several successful singles; it broadened the band's appeal in the United Kingdom, where it reached No. 6 on the UK Albums Chart. Journey enjoyed a successful reunion in the mid-1990s, and later regrouped with a series of lead singers.\n\nSales have resulted in two gold albums, eight multi-platinum albums, and one diamond album (including seven consecutive multi-platinum albums between 1978 and 1987). They have had eighteen Top 40 singles in the US (the second most without a Billboard Hot 100 number one single behind Electric Light Orchestra with 20) six of which reached the Top 10 of the US chart and two of which reached No. 1 on other Billboard charts, and a No. 6 hit on the UK Singles Chart in &quot;Don't Stop Believin'&quot;. Originally a progressive rock band, Journey was described by Allmusic as having cemented a reputation as &quot;one of America's most beloved (and sometimes hated) commercial rock/pop bands&quot; by 1978, when they redefined their sound by embracing traditional pop arrangements on their fourth album, Infinity. According to the Recording Industry Association of America, Journey has sold 47 million albums in the US, making them the 28th best selling band. Their worldwide sales have reached over 75 million records, making them one of the world's best-selling bands of all time. A 2005 USA Today opinion poll named Journey the fifth best American rock band in history. Their songs have become arena rock staples and are still played on rock radio stations across the world.\n\n--------------------------------------------------------------------------------\n\nThe Essential Journey is a compilation of songs from the rock band Journey. Released on October 16, 2001, it is part of Sony BMG's &quot;Essential&quot; series of compilation albums. The album includes most of Journey's major and minor hits that have charted on Billboard Hot 100. It covers material recorded while Steve Perry was lead singer of the band, from the album Infinity of 1978 to 1996's Trial by Fire, neglecting Journey albums recorded before and after his membership.\n\nThe Essential Journey was certified as Platinum in the United States on February 2, 2005, and has sold 1,156,000 copies in the US as of August 2013.","torrent":{"xt":"urn:btih:3672d8fb34c2e46d05ecaa48ce22a9b3ff3ddb87","amp;dn":"Journey+-+The+Essential+%5B2+CD%27s%5D%5B2001%5D%5B320+KBPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3672d8fb34c2e46d05ecaa48ce22a9b3ff3ddb87","infoHashBuffer":{"type":"Buffer","data":[54,114,216,251,52,194,228,109,5,236,170,72,206,34,169,179,255,61,219,135]},"announce":[],"urlList":[]}}