{"title":"The Art of Natural Building,2nd Ed (ePUB,Retail) {32Skulls}","uid":11894872,"size":67680859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36ba41a9799839fd5557582e495a4edd9c2399c5&amp;dn=The+Art+of+Natural+Building%2C2nd+Ed+%28ePUB%2CRetail%29+%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"32Skulls","files":1,"time":1431127576,"description":"The Art of Natural Building: Design, Construction, Resources (2nd Edition)\n\n\nThe popularity of natural building has grown by leaps and bounds, spurred by a grassroots desire for housing that is healthy, affordable, and environmentally responsible. While there are many books available on specific methods such as straw-bale construction, cob, or timber framing, there are few resources which introduce the reader to the entire scope of this burgeoning field.\n\nFully revised and updated, The Art of Natural Building is the complete and user-friendly introduction to natural building for everyone from the do-it-yourselfer to architects and designers. This collection of articles from over fifty leaders in the field is now stunningly illustrated with over two-hundred full-color photographs of natural buildings from around the world. Learn about:\nThe case for building with natural materials, from the perspectives of sustainability, lifestyle, and health\n\nWhat you need to know to plan and design your own beautiful and efficient natural home\n\nExplanations of thirty versatile materials and techniques, with resources on where to go for further information on each\n\nHow these techniques are being used to address housing crises around the world.\nClearly written, logically organized, and beautifully illustrated, The Art of Natural Building is the encyclopedia of natural building.\n\nJoseph F. Kennedy is a designer, builder, writer, artist, educator, and co-founder of Builders Without Borders.\n\nMichael G. Smith is a respected workshop instructor, consultant, and co-author of the best-selling book The Hand-Sculpted House.\n\nCatherine Wanek is a co-founder of Builders Without Borders and author/photographer of The Hybrid House and The New Straw Bale Home.\n\nEPUB,Retail:480 pages\nPublisher: New Society Publishers; Revised Edition edition (March 17, 2015)\nLanguage: English\nISBN-10: 0865717710\nISBN-13: 978-0865717718","torrent":{"xt":"urn:btih:36ba41a9799839fd5557582e495a4edd9c2399c5","amp;dn":"The+Art+of+Natural+Building%2C2nd+Ed+%28ePUB%2CRetail%29+%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36ba41a9799839fd5557582e495a4edd9c2399c5","infoHashBuffer":{"type":"Buffer","data":[54,186,65,169,121,152,57,253,85,87,88,46,73,90,78,221,156,35,153,197]},"announce":[],"urlList":[]}}