{"title":"The History of Jazz -Gioia- Epub/Mobi [Slender]","uid":10159168,"size":6040248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36db709e73cd6f982c90306f2d6ef799382c8c48&amp;dn=The+History+of+Jazz+-Gioia-+Epub%2FMobi+%5BSlender%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"K-Slender","files":4,"time":1400222693,"description":"Publisher: Oxford University Press, USA; 2 edition (April 8, 2011)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B004Y4UT5Y\n\nTed Gioia's History of Jazz has been universally hailed as a classic--acclaimed by jazz critics and fans around the world. Now Gioia brings his magnificent work completely up-to-date, drawing on the latest research and revisiting virtually every aspect of the music, past and present.\nGioia tells the story of jazz as it had never been told before, in a book that brilliantly portrays the legendary jazz players, the breakthrough styles, and the world in which it evolved. Here are the giants of jazz and the great moments of jazz history--Jelly Roll Morton, Louis Armstrong, Duke Ellington at the Cotton Club, cool jazz greats such as Gerry Mulligan, Stan Getz, and Lester Young, Charlie Parker and Dizzy Gillespie's advocacy of modern jazz in the 1940s, Miles Davis's 1955 performance at the Newport Jazz Festival, Ornette Coleman's experiments with atonality, Pat Metheny's visionary extension of jazz-rock fusion, the contemporary sounds of Wynton Marsalis, and the post-modernists of the current day. Gioia provides the reader with lively portraits of these and many other great musicians, intertwined with vibrant commentary on the music they created. He also evokes the many worlds of jazz, taking the reader to the swamp lands of the Mississippi Delta, the bawdy houses of New Orleans, the rent parties of Harlem, the speakeasies of Chicago during the Jazz Age, the after hours spots of corrupt Kansas city, the Cotton Club, the Savoy, and the other locales where the history of jazz was made. And as he traces the spread of this protean form, Gioia provides much insight into the social context in which the music was born. ","torrent":{"xt":"urn:btih:36db709e73cd6f982c90306f2d6ef799382c8c48","amp;dn":"The+History+of+Jazz+-Gioia-+Epub%2FMobi+%5BSlender%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36db709e73cd6f982c90306f2d6ef799382c8c48","infoHashBuffer":{"type":"Buffer","data":[54,219,112,158,115,205,111,152,44,144,48,111,45,110,247,153,56,44,140,72]},"announce":[],"urlList":[]}}