{"title":"Highland Sparks Clan Grant Series Keira Montclair","uid":15890044,"size":778080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3724a0410d3626e2ac2b4825a375fc2547854e42&amp;dn=Highland+Sparks+Clan+Grant+Series+Keira+Montclair&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"KiwiSue49","files":3,"time":1474717243,"description":"DESCRIPTION: (courtesy of Amazon)\r\n\r\nGwyneth of the Cunninghams has one goal: to kill Duff Erskine, the corrupt merchant who murdered her father and brother. The last thing she needs is a distraction, but fate deals her one in the form of Logan Ramsay, a maddeningly handsome Highlander who waylays her mission. Logan and his brother-in-law seek her help in rescuing two bairns and spiriting them away to the Highlands. When Gwyneth agrees to help, she little expects Logan to assist her with her own mission…\r\n\r\nLogan Ramsay never thought a lass would steal his heart. But Gwyneth of the Cunninghams poses an intriguing challenge from the moment he meets her. As fierce a warrior as any man of his acquaintance, the lithe, dark-haired beauty dresses only in tunics and leggings and spends her days practicing archery. She’s one of a kind. Determined to make her his own, Logan will do anything to help her overcome the wounds of her past…even if it means allowing her to endanger herself in a final confrontation with her nemesis.\r\n\r\nThe sparks between Gwyneth and Logan are immediate and blinding, but if they survive their mission to take down Erskine, they face another challenge: Will they find it in their wild hearts to relinquish their independence and build a life together? \r\n\r\n\r\nEnjoy","torrent":{"xt":"urn:btih:3724a0410d3626e2ac2b4825a375fc2547854e42","amp;dn":"Highland+Sparks+Clan+Grant+Series+Keira+Montclair","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3724a0410d3626e2ac2b4825a375fc2547854e42","infoHashBuffer":{"type":"Buffer","data":[55,36,160,65,13,54,38,226,172,43,72,37,163,117,252,37,71,133,78,66]},"announce":[],"urlList":[]}}