{"title":"Deer Tick...War Elephant(2007)[FLAC]","uid":5996863,"size":333400472,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3759c5670bfdd7091738321daddaf16a14d337e0&amp;dn=Deer+Tick...War+Elephant%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":19,"time":1291052930,"description":"2007 War Elephant  FARGO FR21218\n\n1 Ashamed   2:14 \n2 Art Isn't Real (City of Sin)   2:50 \n3 Standing at the Threshold   2:27 \n4 Dirty Dishes   3:18 \n5 Long Time   3:47 \n6 Nevada   2:46 \n7 Baltimore Blues No. 1   3:02 \n8 These Old Shoes   2:21 \n9 Not So Dense   4:22 \n10 Spend the Night   2:28 \n11 Diamond Rings 2007   4:41 \n12 Sink or Swim   4:55 \n13 Christ Jesus   5:19 \n14 What Kind of Fool Am I?   3:33 \n\n\n\nThere is plenty about Deer Tick's debut album, War Elephant, to suggest that frontman John McCauley has seen more than his 21 birthdays. The gruff pipes, languid alt-country arrangements, and tears-in-his-beers lyrics-- &quot;Maybe I'll see better days/ But I'm not so sure I will,&quot; just two songs into his debut album-- all point towards a sagely source. Consider that McCauley has spent the previous two years touring, has collaborated with Jason Anderson and Jana Hunter, and now has his own band; it's tough to fathom just what makes him unsure of better days. This isn't to needlessly drag Deer Tick into the endless pissing contest that is authenticity in country music, just to note that McCauley is a bit of an old hound, a lithe songwriter with a black lung and a bad liver. On War Elephant, he sets his old ways against a meld of country and alt-rock signifiers, one appropriate for his age but only occasionally a fit for his songwriting.\n\nThough ostensibly an alt-country act, no amount of Telecaster bends or fiddle breaks are going to disguise Deer Tick's indie-rock core: McCauley, in both composition and performance, owes more to the Shins, Modest Mouse, and early Bright Eyes than he does even to halfway country acts like Uncle Tupelo. Overdrive pedals get stomped and larynxes strained, and War Elephant is probably the better for it: when McCauley crushes too hard on traditional tunes-- &quot;Spend the Night&quot; mimics Hank Williams' &quot;Hey, Good Lookin'&quot;-- he acquires an unpleasant kid brother-ness. McCauley works best in abbreviated stretches, and about half of War Elephant stays under the three-minute mark. His voice is a nasal, corroded squeak that finds a pleasant middle ground between gargling water and Eric Bachmann on the heels of a good melody.\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/15/deer-tick/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/15/deer-tick/&lt;/a&gt;","torrent":{"xt":"urn:btih:3759c5670bfdd7091738321daddaf16a14d337e0","amp;dn":"Deer+Tick...War+Elephant%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3759c5670bfdd7091738321daddaf16a14d337e0","infoHashBuffer":{"type":"Buffer","data":[55,89,197,103,11,253,215,9,23,56,50,29,173,218,241,106,20,211,55,224]},"announce":[],"urlList":[]}}