{"title":"Missing Microbes - Martin J. Blaser - Audiobook MP3","uid":11322006,"size":251890200,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37696164a183aa0f5cde59dcc081eb0cc254cace&amp;dn=Missing+Microbes+-+Martin+J.+Blaser+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1414607091,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nMissing Microbes: How the Overuse of Antibiotics Is Fueling Our Modern Plagues\n\nWritten by: Martin J. Blaser\nNarrated by: Patrick Lawlor\nLength: 8 hrs and 43 mins\nUnabridged Audiobook\nRelease Date:09-30-14\n\nTracing one scientist's journey toward understanding the crucial importance of the microbiome, this revolutionary book will take listeners to the forefront of trail-blazing research while revealing the damage that overuse of antibiotics is doing to our health: contributing to the rise of obesity, asthma, diabetes, and certain forms of cancer. In Missing Microbes, Dr. Martin J. Blaser invites us into the wilds of the human microbiome, where for hundreds of thousands of years bacterial and human cells have existed in a peaceful symbiosis that is responsible for the health and equilibrium of our body. Now this invisible eden is being irrevocably damaged by some of our most revered medical advances-antibiotics-threatening the extinction of our irreplaceable microbes with terrible health consequences. Taking us into both the lab and deep into the fields where these troubling effects can be witnessed firsthand, Blaser not only provides cutting-edge evidence for the adverse effects of antibiotics, he tells us what we can do to avoid even more catastrophic health problems in the future","torrent":{"xt":"urn:btih:37696164a183aa0f5cde59dcc081eb0cc254cace","amp;dn":"Missing+Microbes+-+Martin+J.+Blaser+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37696164a183aa0f5cde59dcc081eb0cc254cace","infoHashBuffer":{"type":"Buffer","data":[55,105,97,100,161,131,170,15,92,222,89,220,192,129,235,12,194,84,202,206]},"announce":[],"urlList":[]}}