{"title":"Lonely Planet - Southern Italy - 3rd Edition (2016) Gooner","uid":14716630,"size":75655440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37a54da46e3b2d6dc6c8ea32658d80d40bde3fa2&amp;dn=Lonely+Planet+-+Southern+Italy+-+3rd+Edition+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1464474628,"description":"Lonely Planet - Southern Italy (Travel Guide) - 3rd Edition (2016) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: Lonely Planet; 3 edition (11 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 1743216874\r\nISBN-13: 978-1743216873\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Southern Italy is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Wander the streets of Pompeii, a town frozen in time, wake up to the sound of a Neapolitan street market, or gaze at the Mediterranean; all with your trusted travel companion. Get to the heart of Southern Italy and begin your journey now!\r\n\r\nInside Lonely Planet Southern Italy Travel Guide:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - including customs, history, religion, art, architecture, politics, cuisine, and wine\r\n\r\n* Over 41 colour maps\r\n\r\n* Covers Naples, Pompeii, Campania, Puglia, Basilicata, Calabria, Sicily, the Amalfi Coast, Palermo, the Aeolian Islands, the Ionian Coast, Syracuse, Agrigento, Matera, Alberobello, Lecce, Capri, and more\r\n\r\nThe Perfect Choice: Lonely Planet Southern Italy , our most comprehensive guide to Southern Italy, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for a guide focused on Naples, Pompeii and the Amalfi Coast or Sicily? Check out our Lonely Planet Naples, Pompeii &amp; the Amalfi Coast guide or Sicily guide for a comprehensive look at all these areas have to offer.\r\n\r\n* Looking for more extensive coverage? Check out our Lonely Planet Italy guide for a comprehensive look at all the country has to offer or Lonely Planet Discover Italy, a photo-rich guide to the country's most popular attractions.\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:37a54da46e3b2d6dc6c8ea32658d80d40bde3fa2","amp;dn":"Lonely+Planet+-+Southern+Italy+-+3rd+Edition+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a54da46e3b2d6dc6c8ea32658d80d40bde3fa2","infoHashBuffer":{"type":"Buffer","data":[55,165,77,164,110,59,45,109,198,200,234,50,101,141,128,212,11,222,63,162]},"announce":[],"urlList":[]}}