{"title":"Interpol - Discography 2000-2014 [FLAC]","uid":14320815,"size":6439540747,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37a6cfb1151db049e4cf8b5e8c0717297422805e&amp;dn=Interpol+-+Discography+2000-2014+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rudown78","files":317,"time":1460602276,"description":"Interpol - Discography 2000-2014 [FLAC]\r\n\r\n\r\nOne of the leading post-punk revivalists of the 2000s and 2010s, Interpol took their cues from Joy Division and the Chameleons, fashioning a darkly atmospheric sound helmed by intricate guitars and Paul Banks' somber baritone. The group also had a striking visual presence marked by the members' fondness for suits, which only strengthened their stately, British-influenced appeal. Nevertheless, the band remained rooted in America, where guitarist Daniel Kessler and drummer Greg Drudy first struck up a musical partnership while attending New York University. Carlos Dengler, another NYU student who had previously played guitar, joined as the group's bassist -- and by sheer coincidence, Kessler later bumped into Banks, a guitarist/vocalist whom Kessler had spent time with in France. Having settled on an initial lineup, Interpol became a fully active band in 1998 and began issuing a series of eight-track recordings. After the band's first gigs in early 2000, Drudy vacated his position and was replaced by drummer Sam Fogarino.\r\n\r\nRegular appearances at New York venues like Brownie's and the Mercury Lounge helped endear Interpol to local audiences. Meanwhile, a brief U.K. tour in April 2001 was punctuated by a radio session for John Peel's BBC program, which expanded the band's audience overseas. The year 2001 also saw the band releasing its third EP, Precipitate, and appearing on the compilation album This Is Next Year, a double-disc set of Brooklyn-area acts. Matador Records signed the band in early 2002; by the end of the year, the independent label had issued both a three-song single and the band's debut LP, Turn on the Bright Lights. The album turned Interpol into a successful indie rock act, providing further proof that New York City had become a hub of marketable post-punk revivalism in the early 21st century.\r\n\r\nExtensive touring followed, including international dates and television appearances. The band also opened for the Cure as part of that band's Curiosa Festival; soon after, Interpol released their second album, 2004's Antics. Three songs entered the Top 40 charts in the U.K., where the record later went gold. Following a major-label upgrade to the roster of Capitol Records, Interpol returned in 2007 with Our Love to Admire. Along with their Interpol duties, the band's members kept busy with other projects: Fogarino joined forces with Swervedriver's Adam Franklin as the Setting Suns (who later changed their name to Magnetic Morning), while Banks embarked on a solo career as Julian Plenti, releasing the 2009 album Julian Plenti Is Skyscraper. Dengler ventured into writing film scores. The bandmembers began recording their fourth album in early 2009, and in spring 2010, it was announced that Dengler was leaving Interpol; around that time, the band self-released the single &quot;Lights.&quot; Dave Pajo was announced as the touring bassist for the group's shows with U2 in Europe that summer.\r\n\r\nInterpol, which marked the band's return to Matador, arrived in September 2010. Following the tour for that album, the bandmembers announced an extended hiatus to &quot;refresh&quot; as well as to concentrate on their solo projects. These included Banks' solo material under the Julian Plenti moniker (2012's Julian Plenti Lives... EP) and his own name (his second album Banks, also from 2012), and Fogarino's EmptyMansions project, a collaboration with the Jesus Lizard's Duane Denison that issued 2013's snakes/vulture/sulfate. For 2014's back-to-basics fifth album, El Pintor (an anagram of Interpol), frontman Banks took over bass duties while touring member Brandon Curtis played keyboards.\r\n\r\n\r\n2000 - Fukd I.D. #3 [EP]\r\n2001 - Precipitate [EP]\r\n2002 - Interpol [EP]\r\n2002 - Turn on the Bright Lights\r\n2003 - The Black EP\r\n2004 - Antics\r\n2005 - Remix [EP]\r\n2007 - Our Love to Admire\r\n2007 - Live in Astoria [EP]\r\n2010 - Interpol\r\n2012 - Turn on the Bright Lights [Tenth Anniversary Edition] (2CD+DVD)\r\n2014 - EL Pintor\r\n\r\n\r\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:37a6cfb1151db049e4cf8b5e8c0717297422805e","amp;dn":"Interpol+-+Discography+2000-2014+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a6cfb1151db049e4cf8b5e8c0717297422805e","infoHashBuffer":{"type":"Buffer","data":[55,166,207,177,21,29,176,73,228,207,139,94,140,7,23,41,116,34,128,94]},"announce":[],"urlList":[]}}