{"title":"Alias [ADULT] (Marvel Comics)","uid":4938888,"size":697761403,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:37a8bfdc6ac0f168340cbb4acd270b9d8fafc328&amp;dn=Alias+%5BADULT%5D+%28Marvel+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"brodahisou","files":-1,"time":1244375814,"description":"Alias follows Jessica Jones, a former costumed superhero named Jewel who left that avocation to become a private investigator. The running thread is Jessica's character development, as the layers of her past and personality are revealed to the reader while, simultaneously, she tries to come to terms with them herself.\n\nAlias was created by writer Brian Michael Bendis and artist Michael Gaydos, who illustrated the book for most of it's 28 issue run. The covers were providedby David Mack.\nAlias was one of the titles that launched Marvel's &quot;R-Rated&quot; MAX imprint, and was reported to have been one of the reasons the imprint was created. Marvel Publishing President Bill Jemas read a draft of the script for the first issue of Alias (which, characteristically, starts with the word &quot;f**k&quot;) and exclaimed &quot;Why couldn't we publish this?&quot;\nBeing under the MAX imprint imposed certain other limitations on what the creators could do in the series. They were not allowed, for example, to use many of Marvel's most famous characters, such as Spider-Man (with the exception of one cameo). Bendis gave this as one reason in afterword to Alias #28 for ending the series and moving the characters to The Pulse.\n\nThe series won the Comics Buyer's Guide Award for Favorite Comic Series in 2003, and the Harvey Award for Best New Series in 2002.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:37a8bfdc6ac0f168340cbb4acd270b9d8fafc328","amp;dn":"Alias+%5BADULT%5D+%28Marvel+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a8bfdc6ac0f168340cbb4acd270b9d8fafc328","infoHashBuffer":{"type":"Buffer","data":[55,168,191,220,106,192,241,104,52,12,187,74,205,39,11,157,143,175,195,40]},"announce":[],"urlList":[]}}