{"title":"Eco, Umberto - The Name of the Rose","uid":3936134,"size":568218067,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37c27787a066d1d9c241392fde736a39dfc29677&amp;dn=Eco%2C+Umberto+-+The+Name+of+the+Rose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Aine76","files":17,"time":1197818040,"description":"Read by: Alexander Adams\n64 Kbps\n\nAlong with his apprentice Adso of Melk (named after the Benedictine abbey Stift Melk), the Franciscan friar William of Baskerville journeys to an abbey where a murder has been committed.\n\nAs the plot unfolds, several other people mysteriously die. The protagonists explore a labyrinthine medieval library, the subversive power of laughter, and come face to face with the Inquisition. It is left primarily to William&amp;#039;s enormous powers of logic and deduction to solve the mysteries of the abbey.\n\nOn one level, the book is an excellent exposition of the scholastic method which was very popular in the 14th century. William demonstrates the power of deductive reasoning, especially syllogisms. He refuses to accept the diagnosis of simple demonic possession despite demonology being the traditional monastic explanation. Despite the abbey being under the misapprehension that they are experiencing the last days before the second coming of Christ (a topic closely examined in the book), William, through his empirical mindset, manages to show that the murders are, in fact, committed by a more corporeal instrument. By keeping an open mind, collecting facts and observations, following pure intuition and the dialectic method, he makes decisions as to what he should investigate, exactly as a scholastic would do. The story also demonstrates the crucial importance of chance in any investigative endeavor. Though William&amp;#039;s theorized solutions do not exactly match the actual events of the cases, he could not have solved the abbey&amp;#039;s mysteries without them.\n\n(Info taken from Wikipedia)","torrent":{"xt":"urn:btih:37c27787a066d1d9c241392fde736a39dfc29677","amp;dn":"Eco%2C+Umberto+-+The+Name+of+the+Rose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37c27787a066d1d9c241392fde736a39dfc29677","infoHashBuffer":{"type":"Buffer","data":[55,194,119,135,160,102,209,217,194,65,57,47,222,115,106,57,223,194,150,119]},"announce":[],"urlList":[]}}