{"title":"How to Photograph Wildlife Like a Pro","uid":11472398,"size":11081443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:380522b85afb585e9f571b70470ebb0f84670d44&amp;dn=How+to+Photograph+Wildlife+Like+a+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"elissa.swansi009","files":-1,"time":1416108090,"description":"Steve Rutherford | 2013 | PDF | 157 pages | 10 Mb\n \nSeries: How to Photograph Anything like a Pro\nWritten by International Multi Award Winning Australian Pro Photographer, Trainer and Best Selling Author Steve Rutherford the &quot;How to Photograph Wildlife like a Pro&quot; book is part of the best selling &quot;How to Photograph Anything&quot; photography book series. This book will show you how to capture stunning photos of wildlife, it is an easy step by step guide where you will discover;\n* The SECRETS pro photographers use to capture great wildlife photos every time.\n* The tricks and techniques pro photographers use for every wildlife shot.\n* Which camera will turn your shots from boring to amazing.\n* How to save time and money using the right equipment.\n* How to turn your wildlife photography passion and creativity into an income.\nFinding the best resource to better your photographic skills can often be like looking for a needle in a haystack, but the &quot;How to Photograph Anything like a Pro&quot; Book Series, has been built to GIVE YOU the very best tools and step by step resources to help you take great photos every time with ease","torrent":{"xt":"urn:btih:380522b85afb585e9f571b70470ebb0f84670d44","amp;dn":"How+to+Photograph+Wildlife+Like+a+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"380522b85afb585e9f571b70470ebb0f84670d44","infoHashBuffer":{"type":"Buffer","data":[56,5,34,184,90,251,88,94,159,87,27,112,71,14,187,15,132,103,13,68]},"announce":[],"urlList":[]}}