{"title":"Mega Man X 8 [PS2] [NTSC]","uid":5286415,"size":861953911,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:382fdd1a63fb1313ac05e1466d6e789f677ac47b&amp;dn=Mega+Man+X+8+%5BPS2%5D+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"thenoobish","files":20,"time":1263739865,"description":"Mega Man X 8\n*******************************************************************************\n\n-------------------------------------------------------------------------------\nGeneral Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: PS2\nPart Size............: 50,000,000 bytes\nNumber of Parts......: 18\nCompression Format...: RAR\nFile Validation......: SFV\nImage Format.........: .iso\nImage Created with...: img\n\n\n\n\n-------------------------------------------------------------------------------\nPost Information\n-------------------------------------------------------------------------------\nPosted by............: Capcom\nPosted on............: 07/12/2004\n\n-------------------------------------------------------------------------------\nRelease Notes\n-------------------------------------------------------------------------------\n* Capcom\n* 2D Platformer\n* Release: Dec 7, 2004 Ã‚Â»\n* ESRB: Everyone\n\n\n\nThe Good\n\n* A return to the old ways of classic Mega Man gameplay\n* X7's horrible camera has been replaced by a far more functional one\n* Legitimate challenge.\n\nThe Bad\n\n* The classic Mega Man gameplay, while nice, feels dated\n* Unimpressive visuals\n* Mostly bad voice acting\n* Uninspired, trial-and-error-heavy level designs\n* Dumb, dumb bosses.\n\nLast year's Mega Man X7 marked the premiere of Capcom's loveable, heroic blue\nrobot boy on the PlayStation 2. Unfortunately, the game proved to be a pretty\ninauspicious debut for the company's vaunted mascot, as it strayed from the\nseries' tried-and-true mechanics and replaced them with frustrating new ones.\nMega Man X8, the aptly titled follow-up, returns the series to a more\ntraditional style of gameplay and eliminates some of the annoyances of its\npredecessor. However, while that's all well and good, X8 can still often be an\nintensely frustrating game, and still isn't especially fun.\n\nThe Blue Bomber is back for yet another PlayStation 2 adventure. Unfortunately,\nit's yet another second-rate PlayStation 2 adventure.\n\nLike X7, Mega Man X8's setup is a mostly throwaway tale of good robots versus\nbad robots that dabbles in a lot of nonsensical anime-style ramblings about\nthings that are of little importance to the actual game. In actuality, all you\nreally need to care about is the process of shooting up a bunch of robot bosses,\ntaking their weapons, and moving on to the next round, much like in the olden\ndays of Mega Man. Of course, it isn't all quite so simple, as the additional\ncharacters introduced into the X series previously, Zero and Axl, are playable\nonce again. You'll begin each stage by picking two of the three characters, each\nof whom has unique strengths and weaknesses. Mega Man (or X, as he's referred to\nin this series) has his usual abilities, including his charge blast and the\nability to acquire special weapons from fallen foes. Axl can shoot in multiple\ndirections and angles, and can hover in midair. And Zero is good in close\ncombat, and can double-jump. Of course, since nearly all the enemies you'll be\nup against are best fought from long range, X and Axl are usually your best\nbets.\n\nThe basic gameplay in X8 should be pretty familiar to any Mega Man fan. Rather\nthan the sort of 2D-3D mishmash found in the last game, X8 is mostly a 2D-style\nside-scroller, with a couple of little Viewtiful Joe-like 3D elements thrown in\nfor good measure. You'll run around the game's levels, shooting up bad-guy\nrobots, solving some occasional puzzles, and then shooting up boss robots. While\nthis might sound wholly appealing to the nostalgia-focused crowd, the execution\nof this classic brand of action platforming isn't nearly as solid as it should\nbe. This is mainly because the level designs just aren't very good. While you'll\nrun into no shortage of challenging and occasionally intelligent platforming\npuzzles, far too many of them can be surmounted only through trial and error,\nrequiring you to run through them repeatedly to memorize where all the different\ninstant-kill spike pits are in relation to the jumps and drops you'll have to\nmake, and so on and so forth. This is pretty frustrating on its own, but the\nfact that the game employs a limited continue system on all difficulty levels\nbut the easiest makes it even more so.\n\nAnother problem is that the combat simply isn't all that interesting. Despite\nthe fact that all three playable robots can earn new weapons and abilities over\nthe course of the game, it isn't often that these new weapons ever really feel\nall that necessary. There are certainly specific situations and bosses where a\nparticular weapon is most effective, but more often than not you can get by just\nfine using the default weaponry. The one nice thing is that since you have two\ncharacters to control, you can switch between them on the fly by tapping the L2\nbutton. Additionally, the game features a special combo attack that can be\nperformed by pressing the R2 button at just the right time during a battle.\nDoing so sends you into a cutscene, where your two characters stand in a The\nMatrix-looking environment, complete with green computer code shooting all over\nthe place, and blast the hell out of a bad guy. However, while the combos are\nreasonably effective, they really don't look very cool, and they really don't\ninflict enough damage to make them truly worthwhile.\n\nMega Man X8 isn't purely the age-old brand of Mega Man gameplay the entire way\nthrough, either, as there are a few stages that deviate from the norm. A couple\nof levels include vehicular combat, where you're in a ship, traveling along a\nrail and shooting everything that comes into your path. While flying these\nships, you can boost or brake suddenly, depending on the situation. But apart\nfrom that, you rarely ever need to do anything other than hammer on the fire\nbutton, and that tends to get old rather quickly. Even some of the side-\nscrolling missions shift away from typicality, such as one stage where you'll\nfind yourself having to engage in some cheap stealth action, dodging a bunch of\nmoving spotlights to avoid setting off alarms that bring forth scads of enemies.\nUnfortunately, like the ship stuff, this stealth section (and pretty much every\narea that shies away from the purest of 2D action) tends to get very dull very\nquickly.\n\nHowever, the most disappointing aspects of the gameplay are the boss battles.\nWhile the bosses can be plenty difficult, that's about the only thing they have\ngoing for them. The actual designs of the bosses are just plain silly. For\ninstance, you have the Burn Rooster, a flame-inducing chicken, and you have the\nOptic Sunflower--Plant Man, anyone? The designs themselves might have been\nforgivable if the fights were interesting, but they never are. The patterns used\nby each boss are easy to decipher, and the only real challenge comes from the\nfact that their attacks tend to do a lot of damage. Granted, the fight patterns\nof Mega Man bosses have never been extremely complex, but this brand of boss\nfight just doesn't hold up as well as it did back in the 8- and 16-bit days, and\nthese new character designs aren't as good as the old ones.\n\nEven if this were the late '80s, bosses like the Burn Rooster would still be\nmocked ruthlessly.\n\nThe only other aspect of Mega Man X8's gameplay that bears mentioning is its\ncharacter-upgrade system. In between every level, you'll have the opportunity to\nshop for upgrades for your characters, including additional energy tanks, new\nweapons, and new attacks. Cool idea in concept, but again, the game doesn't\nreally execute this system very well. The energy tanks are of course useful, but\na lot of the character-specific upgrades really aren't. Many of the weapons and\nattacks just seem useless, and even the few useful ones rarely come into play.\nMainly, the whole thing just seems tacked on.\n\nMega Man X8 just isn't that appealing from a visual standpoint, either. Though\nthe horrible camera issues that plagued much of X7 are absent here, the overall\nlook of the game is bland and supremely uninspired. In addition to the lousy\nboss designs (and two other robot designs that are rip-offs of Boba Fett and M.\nBison, respectively), the game's various stages lack any remarkable\ncharacteristics, and mostly just look like rehashes of the same kinds of things\nthe series has been doing for years now. Even worse, the game's frame rate can\nbe quite erratic, despite the modest graphics, leading to a lot of areas where\nthe action simply slows to a crawl. The audio in the game also conspires to\nbring down the entire experience, mostly thanks to the generally poor voice\nwork. It's all cheese-ball anime-style voice acting that overemphasizes just\nabout everything, and it only serves to distract, rather than entertain. None of\nthe music tracks really bring much to the table either, unfortunately.\n\nIs Mega Man X8 a more playable game than X7 was? Sure, absolutely. Is Mega Man\nX8 particularly fun? No, not really. The shift back to the gameplay style that\nreigned during the golden era of Mega Man doesn't work to the game's advantage,\nand, as a whole, the game is beset by so much frustration and banality that it's\ndifficult to recommend. If you're on the hunt for an old-school Mega Man\nexperience, go grab a copy of Mega Man Anniversary Collection, as it will serve\nyou far better than X8.\nBy Alex Navarro, GameSpotPosted Dec 9, 2004 3:52 pm PT ","torrent":{"xt":"urn:btih:382fdd1a63fb1313ac05e1466d6e789f677ac47b","amp;dn":"Mega+Man+X+8+%5BPS2%5D+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"382fdd1a63fb1313ac05e1466d6e789f677ac47b","infoHashBuffer":{"type":"Buffer","data":[56,47,221,26,99,251,19,19,172,5,225,70,109,110,120,159,103,122,196,123]},"announce":[],"urlList":[]}}