{"title":"IDRISI Selva 17.00","uid":8139955,"size":428493370,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:38437767db62ad02194f319c5d674221c5a00746&amp;dn=IDRISI+Selva+17.00&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Bidox91","files":4,"time":1360789683,"description":"IDRISI is an integrated geographic information system (GIS) and remote sensing software developed by Clark Labs at Clark University for the analysis and display of digital geospatial information. IDRISI is a PC grid-based system that offers tools for researchers and scientists engaged in analyzing earth system dynamics for effective and responsible decision making for environmental management, sustainable resource development and equitable resource allocation.\n\nKey features of IDRISI include:\n\na complete GIS analysis package for basic and advanced spatial analysis, including tools for surface and statistical analysis, decision support, land change and prediction, and image time series analysis;\n\na complete Image Processing system with extensive hard and soft classifers, including machine learning classifiers such as neural networks and classification tree analysis, as well as image segmentation for classification;\n\nintegrated modeling environments including the Earth Trends Modeler for image time series of environmental trends and Land Change Modeler for land change analysis and prediction.\n","torrent":{"xt":"urn:btih:38437767db62ad02194f319c5d674221c5a00746","amp;dn":"IDRISI+Selva+17.00","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38437767db62ad02194f319c5d674221c5a00746","infoHashBuffer":{"type":"Buffer","data":[56,67,119,103,219,98,173,2,25,79,49,156,93,103,66,33,197,160,7,70]},"announce":[],"urlList":[]}}