{"title":"Econometrics, 5th Edition","uid":10308678,"size":4401334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3859422a45282abd7512aa8f69c71c163ca000c7&amp;dn=Econometrics%2C+5th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1402162945,"description":"ABOUT THIS BOOK\n-Useful introduction and solid training in Econometrics\n-With applications and hands-on exercises\n-Provides econometric methods for estimating, testing, and forecasting to applied economists and social scientists\n-Illustrates methods with practical software including Stata and EViews\nThis textbook teaches some of the basic econometric methods and the underlying assumptions behind them. It also includes a simple and concise treatment of more advanced topics in spatial correlation, panel data, limited dependent variables, regression diagnostics, specification testing and time series analysis. Each chapter has a set of theoretical exercises as well as empirical illustrations using real economic applications. These empirical exercises usually replicate a published article using Stata or Eviews.\n\nABOUT THE AUTHOR\nBadi H. Baltagi is distinguished Professor of Economics, and Senior \nResearch Associate at the Center for Policy Research, Syracuse \nUniversity. He received his Ph.D. in Economics at the University of \nPennsylvania in 1979. Before joining Syracuse University, he served on the faculty at the University of Houston and Texas A&amp;M University. He is a fellow of the Journal of Econometrics and a recipient of the Multa and Plura Scripsit Awards from Econometric Theory.","torrent":{"xt":"urn:btih:3859422a45282abd7512aa8f69c71c163ca000c7","amp;dn":"Econometrics%2C+5th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3859422a45282abd7512aa8f69c71c163ca000c7","infoHashBuffer":{"type":"Buffer","data":[56,89,66,42,69,40,42,189,117,18,170,143,105,199,28,22,60,160,0,199]},"announce":[],"urlList":[]}}