{"title":"Generation Kill - Evan Wright","uid":4372888,"size":2386301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38b9eb8d78c45b857fb8d6ba8f02e6ee522cbd47&amp;dn=Generation+Kill+-+Evan+Wright&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"brisken","files":1,"time":1220252280,"description":"Generation Kill by Evan Wright.\n\n----------------------------------------------------------------------------------\n\nWright rode into Iraq on March 20, 2003, with a platoon of First Reconnaissance Battalion Marines--the Marine Corps' special operations unit whose motto is &quot;Swift, Silent, Deadly.&quot; These highly trained and highly motivated First Recon Marines were the leading unit of the American-led invasion force. Wright wrote about that experience in a three-part series in Rolling Stone that was hailed for its evocative, accurate war reporting. This book, a greatly expanded version of that series, matches its accomplishment. Wright is a perceptive reporter and a facile writer. His account is a personality-driven, readable and insightful look at the Iraq War's first month from the Marine grunt's point of view. It jibes with other firsthand reports of the first phase of the Iraqi invasion (including David Zucchino's Thunder Run), showing the unsettling combination of feeble and vicious resistance put up by the Iraqi army, the Fedayeen militiamen and their Syrian allies against American forces bulldozing through towns and cities and into Baghdad. Wright paints compelling portraits of a handful of Marines, most of whom are young, street-smart and dedicated to the business of killing the enemy. As he shows them, the Marines' main problem was trying to sort out civilians from enemy fighters. Wright does not shy away from detailing what happened when the fog of war resulted in the deaths and maimings of innocent Iraqi men, women and children. Nor does he hesitate to describe intimately the few instances in which Marines were killed and wounded. Fortunately, Wright is not exposing the strengths and weaknesses of a new generation of American fighting men, as the misleadingly hyped-up title and subtitle indicate. Instead, he presents a vivid, well-drawn picture of those fighters in action on the front lines in the blitzkrieg-like opening round of the Iraq War.\n\n----------------------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:38b9eb8d78c45b857fb8d6ba8f02e6ee522cbd47","amp;dn":"Generation+Kill+-+Evan+Wright","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b9eb8d78c45b857fb8d6ba8f02e6ee522cbd47","infoHashBuffer":{"type":"Buffer","data":[56,185,235,141,120,196,91,133,127,184,214,186,143,2,230,238,82,44,189,71]},"announce":[],"urlList":[]}}