{"title":"Leonard Cohen - Songs of Leonard Cohen","uid":5535219,"size":285293417,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:38ea3df4cef83563662445f2e115246b15cbbb2f&amp;dn=Leonard+Cohen+-+Songs+of+Leonard+Cohen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"nmoscar","files":12,"time":1273049826,"description":"Enjoy!\n\nPiero Scaruffi on Leonard Cohen's Songs of Leonard Cohen:\n\nBesides being a professional poet, Leonard Cohen also created a body of musical work that proves him one of music's supreme poets. The fact that his lyrics are among the most accomplished in musical history is actually a mere footnote. What makes him such a great musician is the gentle and shy atmosphere that emanates from his folk ballads. Cohen watches life go by &quot;like a bird on a wire&quot;, but turns the stories he sees into metaphysical visions of a Dante-esque world and into profound meditations on the human condition. His existential philosophy found in his colloquial style a vastly more effective medium than the convoluted prose of many of his century's philosophers. The Songs Of Leonard Cohen (1968) were drenched in infinite tenderness, barely whispered and discreetly arranged. Cohen's unique style triumphed in the fragile lullabies of Winter Lady (flute, harpsichord) and Sisters Of Mercy (rattles, accordion, xylophone), that sound like good-night songs for children. Turning from social tragedies to individual tragedies, Cohen merged the tone of the medieval minstrel (Donovan) and the tone of the visionary preacher (Dylan). \n\nAll Apple Lossless (ALAC)","torrent":{"xt":"urn:btih:38ea3df4cef83563662445f2e115246b15cbbb2f","amp;dn":"Leonard+Cohen+-+Songs+of+Leonard+Cohen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ea3df4cef83563662445f2e115246b15cbbb2f","infoHashBuffer":{"type":"Buffer","data":[56,234,61,244,206,248,53,99,102,36,69,242,225,21,36,107,21,203,187,47]},"announce":[],"urlList":[]}}