{"title":"Many Lives, Many Masters (PDF+Audiobook)(gnv64)","uid":7041916,"size":35901507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39683ca590f26d3cffe6ac90d1d93b4c14a341ce&amp;dn=Many+Lives%2C+Many+Masters+%28PDF%2BAudiobook%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"gnv65","files":-1,"time":1329578312,"description":"Many Lives, Many Masters: The True Story of a Prominent Psychiatrist, His Young Patient, and the Past-Life Therapy That Changed Both Their Lives\nBy Dr. Brian L. Weiss &lt;a href=&quot;\nhttp://www.amazon.com/Many-Lives-Masters-Prominent-Psychiatrist/dp/0671657860&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Many-Lives-Masters-Prominent-Psychiatrist/dp/0671657860&lt;/a&gt;\nscanned to PDF by me\n\nIn 1980, Weiss, head of the psychiatry department at Mount Sinai Medical Center in Miami Beach, began treating Catherine, a 27-year-old woman plagued by anxiety, depression and phobias. When Weiss turned to hypnosis to help Catherine remember repressed childhood traumas, what emerged were the patient's descriptions of a dozen or so of her hitherto unknown 86 past lives, as well as philosophical messages channeled from &quot;Master Spirits.&quot; Catherine's anxieties and phobias soon disappeared, says Weiss, and she was able to end therapy. The previously nonspiritual, scientific Weiss, awed by Catherine's and the masters' revelations, has written this book to share his new-found knowledge about &quot;immortality and the true meaning of life.&quot; Whether or not one believes in reincarnation and channeling, Weiss's book will disappoint. Catherine's descriptions of her past lives are not particularly compelling or insightful. Moreover, the teachings of the Master Spirits (&quot;We are not to kill. . . . Only God can punish,&quot; &quot;Charity, hope, faith, love . . . we must all know these things,&quot; and &quot;Our body is just a vehicle for us while we're here. It is our soul and our spirit that last forever&quot;), while admirable and comforting, are little more than restatements of traditional religious values.\n\nMany Lives, Many Masters by Brian L. Weiss, M.D. was an easy, enjoyable read. Well written and fast paced, I read it in one sitting. Most of the subject matter covered will not be new to a long-time student of reincarnation. This book is geared for readers new to the subject, as Dr. Weiss was at the time the events he describes took place. His analysis of events may annoy those who don't require concrete proof of spiritual realities. He offered no verifiable scientific proof of what he presented anyway. It was encouraging to see a serious scientist open his mind to faith without proof. Dr. Weiss' enlightenment on the subject (in this, his first book) is limited to one patient he regressed through 12 of her 86 past lives. The ones that are delved into aren't described in much depth. Though the regressions reveal personal insight into her present life difficulties, there's not much applicable universally. Some &quot;Masters&quot; he quotes seem a little too judgmental to be enlightened spirits: &quot;Humans just destroy. They will eventually destroy themselves.&quot; Much of their wisdom offered little new in the way of insight: &quot;Wisdom is achieved very slowly.&quot; The methods he describes using to obtain this material don't rule out contact with less enlightened spirits, which Dr. Weiss admits at one point. So the &quot;many masters&quot; may not have been masters at all. He does show how past life regression can be a powerful tool in healing emotional problems and phobias.\n\nMy searches showed that this book has not been uploaded in PDF format before. So I have scanned my copy &amp; also included the audiobook that had been uploaded few years back.","torrent":{"xt":"urn:btih:39683ca590f26d3cffe6ac90d1d93b4c14a341ce","amp;dn":"Many+Lives%2C+Many+Masters+%28PDF%2BAudiobook%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39683ca590f26d3cffe6ac90d1d93b4c14a341ce","infoHashBuffer":{"type":"Buffer","data":[57,104,60,165,144,242,109,60,255,230,172,144,209,217,59,76,20,163,65,206]},"announce":[],"urlList":[]}}