{"title":"Titan.Quest.Anniversary.Edition-PLAZA","uid":15728338,"size":5943820288,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:397ba6d6bb5062e90f8353e5c912d3bfa7277993&amp;dn=Titan.Quest.Anniversary.Edition-PLAZA&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Tenguken","files":1,"time":1472749404,"description":"Titan Quest Anniversary Edition (c) THQ Nordic\r\n\r\nRelease Date :  08/2016              Protection : Steam\r\nDiscs        :  1                    Genre      : Action\r\n\r\nFor  its  10  year  anniversary,  Titan  Quest will  shine  in  new\r\nsplendour. This Anniversary Edition combines both Titan  Quest  and\r\nTitan Quest Immortal  Throne in  one game,  and has  been  given  a\r\nmassive  overhaul  for  the  ultimate  ARPG  experience.Anniversary\r\nEdition update  Restored and  improved  multiplayer  functionality,\r\nincluding new features like a built-in voice chat and NAT resolving\r\nfor best multiplayer  connectivity Support  for  more  resolutions,\r\nlarger camera distance and scaleable UI size  Improved  performance\r\nand  general  stability Support  for modders  through  new  modding\r\noptions and  a fully  integrated Steam  Workshop  Complete  balance\r\nrework with improvements to  all Masteries,  damage  types,  unique\r\nitems  and  sets  Countless  bug  fixes  and   other  improvements,\r\nincluding ten years worth of community fixes  Increased  challenges\r\nand rewards for  larger parties  and on  higher  difficulty  levels\r\nDozens of new heroes and bosses to encounter Improved enemy and pet\r\nAI Quality of life features like higher stack  limits,  quick  item\r\npickup, a larger stash and a speed setting  Reduced  cheating  with\r\ncurbed  exploits,  removal  of test  items and  mod  comparison  in\r\nmultiplayer Steam Friend Invites Steam Achievements  Steam  Trading\r\nCardsDiscover the Courage that Turns Heroes Into Legends  From  Age\r\nof Empires co-creator Brian Sullivan and Braveheart  writer Randall\r\nWallace comes an innovative action role playing game set in ancient\r\nGreece, Egypt and Asia.\r\n\r\nFor more info go to : http://store.steampowered.com/app/475150/\r\n\r\n1. Extract release\r\n2. Mount ISO\r\n3. Install the game\r\n4. Copy crack from the PLAZA folder\r\n5. Play!\r\n\r\nGeneral Notes:\r\n- Block the game's exe in your firewall to prevent the game from\r\ntrying to go online ..\r\n- If you install games to your systemdrive, it may be necessary\r\nto run this game with admin privileges instead","torrent":{"xt":"urn:btih:397ba6d6bb5062e90f8353e5c912d3bfa7277993","amp;dn":"Titan.Quest.Anniversary.Edition-PLAZA","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397ba6d6bb5062e90f8353e5c912d3bfa7277993","infoHashBuffer":{"type":"Buffer","data":[57,123,166,214,187,80,98,233,15,131,83,229,201,18,211,191,167,39,121,147]},"announce":[],"urlList":[]}}