{"title":"Sarah Crossan - Breathe (Breathe #1)","uid":12398630,"size":256136436,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3a4e06c93eca6d438058d45fde0c73987bde89b8&amp;dn=Sarah+Crossan+-+Breathe+%28Breathe+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Cybotage","files":1,"time":1441987987,"description":"The world has no air. If you want to survive, you pay to breathe. But what if you can't? And what if you think everything could be different? Three teens will leave everything they know behind in Sarah Crossan's gripping and original dystopian teen novel of danger, longing, and glimmering hope that will appeal to fans of Patrick Ness and Veronica Roth.\n\nNational Book Award Finalist Kathleen Duey called Breathe &quot;An amazing story! Sit down. Inhale. Now, while you still can.&quot; Ever since the Switch, when the oxygen levels plummeted and most of humanity died, the survivors have been protected in glass domes full of manufactured air. Protected . . . or trapped? Or controlled? Alina's a revolutionary who believes we can save the environment. Quinn's a Premium who's never had to worry about having enough air. His best friend, Bea, is an Auxiliary who's never worried about anything but having enough air. When the three cross paths, they will change everything. Sarah Crossan's thrilling and provocative novel is about passion, about yearning for something better, and about breaking free for the very first time. The Bulletin of the Center for Children's Books proclaims it an &quot;action-packed dystopian series opener to watch out for.&quot;\n\n\nRead by Anna Parker-Naples\nFormat: MP3","torrent":{"xt":"urn:btih:3a4e06c93eca6d438058d45fde0c73987bde89b8","amp;dn":"Sarah+Crossan+-+Breathe+%28Breathe+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4e06c93eca6d438058d45fde0c73987bde89b8","infoHashBuffer":{"type":"Buffer","data":[58,78,6,201,62,202,109,67,128,88,212,95,222,12,115,152,123,222,137,184]},"announce":[],"urlList":[]}}