{"title":"Mulan 1998 1080p BluRay x264","uid":8143660,"size":7080196077,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3a76e26b35c9f67ac46b1df28f94e2ce127bd281&amp;dn=Mulan+1998+1080p+BluRay+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"rassouli5","files":-1,"time":1360861397,"description":"Mulan is a 1998 American animated comedy-drama martial arts musical film directed by Tony Bancroft and Barry Cook, with story by Robert D. San Souci and screenplay by Rita Hsiao, Philip LaZebnik, Chris Sanders, Eugenia Bostwick-Singer, and Raymond Singer. It was produced by Walt Disney Feature Animation and released by Walt Disney Pictures on June 19, 1998. Ming-Na, Eddie Murphy, Miguel Ferrer and BD Wong star in the English version, while Jackie Chan provided his voice for the Chinese dubs of the film. The 36th animated feature in the Walt Disney Animated Classics, and a part of the Disney Renaissance, the film is based on the Chinese legend of Hua Mulan.\n\n\nMulan is set in China during the Han Dynasty. The film's protagonist, Fa Mulan, is the only daughter of aged warrior Fa Zhou. She impersonates a man and takes her father's place during a general conscription to counter a fictitious Hun invasion led by Shan Yu. Along with her guardian dragon Mushu, her captain, Li Shang, a lucky cricket, &quot;Cri-kee,&quot; and her companions, Yao, Ling, and Chien-Po, she battles the invading Hun army.\n","torrent":{"xt":"urn:btih:3a76e26b35c9f67ac46b1df28f94e2ce127bd281","amp;dn":"Mulan+1998+1080p+BluRay+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a76e26b35c9f67ac46b1df28f94e2ce127bd281","infoHashBuffer":{"type":"Buffer","data":[58,118,226,107,53,201,246,122,196,107,29,242,143,148,226,206,18,123,210,129]},"announce":[],"urlList":[]}}