{"title":"The Virgin Queen - Part 3  (BBC 2005)","uid":4950072,"size":734017536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3af11fcd7201a3f2d08354997bb2ff853b7275c8&amp;dn=The+Virgin+Queen+-+Part+3++%28BBC+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"eddie1969","files":1,"time":1244844648,"description":"The Virgin Queen is a 2005 BBC and Power co-production, four-part miniseries based upon the life of Queen Elizabeth I, starring Anne-Marie Duff. \n\nAs a drama, it focused heavily on Elizabeth's private life - particularly her relationship with Robert Dudley (Tom Hardy), and explored the politics of her reign in rather less depth.\n\nIt was originally intended to air first on the BBC in September 2005, but as the date would have coincided with the release of the Channel 4 two-part mini Elizabeth I (starring Helen Mirren), it was decided to delay the BBC release until January 2006, two months after the US opening in November 2005 on PBS' Masterpiece Theatre.\n\nDespite being a biopic of Elizabeth's life and reign, the series presented its main character with particular interest in several themes, most notably the emotional impact of her mother's execution and her love for Robert Dudley, 1st Earl of Leicester.\n\nThe drama played up the ambiguity of Elizabeth's virginity, featuring a scene where Elizabeth fantasizes about making love to Dudley. However, Anne-Marie Duff later stated that the director and scriptwriter explicitly told her to play the queen as a life-long virgin.","torrent":{"xt":"urn:btih:3af11fcd7201a3f2d08354997bb2ff853b7275c8","amp;dn":"The+Virgin+Queen+-+Part+3++%28BBC+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af11fcd7201a3f2d08354997bb2ff853b7275c8","infoHashBuffer":{"type":"Buffer","data":[58,241,31,205,114,1,163,242,208,131,84,153,123,178,255,133,59,114,117,200]},"announce":[],"urlList":[]}}