{"title":"Spycraft - The Great Game GOG","uid":7802216,"size":1381553823,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3b2e4c3b6d7860ddb099bfa5d23a97191859356b&amp;dn=Spycraft+-+The+Great+Game+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"AN0NYMOUS142857","files":3,"time":1352309201,"description":"Spycraft - The Great Game GOG\n\nGenre: Adventure / Simulation / Espionage\n\nRelease date: February 29, 1996\n\nCompatible with: Windows XP, Windows Vista, Windows 7\n\nDeveloper / Publisher: Activision\n\nGame modes: single-player\n\nESRB Rating: Teen with Mild Language, Realistic Violence\n\nIn Spycraft: The Great Game, you take on the role of a CIA operative who must attempt to unravel an assassination plot that could topple the fragile peace established by the Cold War. Blending fact and fiction to create a contemporary story tied to real-world events, the game thrusts you into a dangerous world of intrigue where you must make significant moral choices and face the consequences of your actions. As you begin your investigation, you'll discover that a Russian presidential candidate has been assassinated and the CIA has received a tip that the life of the US president could be in serious jeopardy.\n\nSpycraft: The Great Game is one of the first interactive entertainment titles to blend 35mm film, digital video footage, still photographs and actual stock footage from the CIA with intricate 3-D puzzles based on real-life covert tactics and operations. Are you ready to make the first move in the great game?\n\nFeatures:\n\n - William Colby (a former CIA director) and Oleg Kalugin (former Major General of the KGB) reveal secrets from the 'great game' of espionage.\n - Master the tools of a CIA operative, surveil double agents, and intercept radio transmissions to infiltrate a web of rogue spies.\n\nÂ  Â  - Actual CIA footage along with Hollywood actors portray the intrigue and skulduggery.\n\nIncludes: \n * manual\n * reference card\n\nEnjoy!!\n","torrent":{"xt":"urn:btih:3b2e4c3b6d7860ddb099bfa5d23a97191859356b","amp;dn":"Spycraft+-+The+Great+Game+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b2e4c3b6d7860ddb099bfa5d23a97191859356b","infoHashBuffer":{"type":"Buffer","data":[59,46,76,59,109,120,96,221,176,153,191,165,210,58,151,25,24,89,53,107]},"announce":[],"urlList":[]}}