{"title":"Untangling the Web: What the Internet si doing to YOU (2013)","uid":11807952,"size":313809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b35800455369d75975f5543f8bcc4f9404c4779&amp;dn=Untangling+the+Web%3A+What+the+Internet+si+doing+to+YOU+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1428666057,"description":"2013 epub\n\nThe World Wide Web is the most revolutionary innovation of our time. In the last decade, it has utterly transformed our lives. But what real effects is it having on our social world? What does it mean to be a modern family when dinner table conversations take place over smartphones? What happens to privacy when we readily share our personal lives with friends and corporations? Are our Facebook updates and Twitterings inspiring revolution or are they just a symptom of our global narcissism? What counts as celebrity, when everyone can have a following or be a paparazzo? And what happens to relationships when love, sex and hate can be mediated by a computer? Social psychologist Aleks Krotoski has spent a decade untangling the effects of the Web on how we work, live and play. In this groundbreaking book, she uncovers how much humanity has - and hasn't - changed because of our increasingly co-dependent relationship with the computer. In Untangling the Web, she tells the story of how the network became woven in our lives, and what it means to be alive in the age of the Internet","torrent":{"xt":"urn:btih:3b35800455369d75975f5543f8bcc4f9404c4779","amp;dn":"Untangling+the+Web%3A+What+the+Internet+si+doing+to+YOU+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b35800455369d75975f5543f8bcc4f9404c4779","infoHashBuffer":{"type":"Buffer","data":[59,53,128,4,85,54,157,117,151,95,85,67,248,188,196,249,64,76,71,121]},"announce":[],"urlList":[]}}