{"title":"David Attenborough - Life Stories Audio Documentary (BBC)","uid":11400217,"size":67937740,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b36baf8129bd0e7ed92e4b18b05e4e5f570dd30&amp;dn=David+Attenborough+-+Life+Stories+Audio+Documentary+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"davieboy1966","files":21,"time":1415410328,"description":"Audio Books : Educational : Other quality : English\n\n\nDavid Attenborough - Life Stories Audio Documentary (Unabridged) - Read by David Attenborough\n\n\nSource Internet\nDuration approx 3:09 hours\nFhG MPEG 2 Layer III 48 Kbps CBR\n22050Hz, 16-bit, Mono\n\nFound during an Internet trawl, apart from file renaming and tagging it is untouched, treat as &quot;Bought as seen&quot;.\n\n\nThe book\n\nThe complete BBC Radio 4 series written and presented by Sir David Attenborough, featuring all 20 episodes about some of the strangest plants and creatures from around the world.\n\nOne of the nation's most popular presenters examines 20 marvels of the natural world from his extraordinary and pioneering experiences.\n\nWhat was Sir David's first pet? Which animal would he most like to be? What creature lays 'the biggest egg in the world'? How do you communicate with an ancient nomadic community in Fiji? And what did Sir David do when confronted by a ten-foot-long reptile?\n\nHis enthusiasm is as infectious as ever, and conveys a unique fascination on topics as diverse as the Sloth, Monstrous Flowers, the Platypus, Giant Birds, Dragons, the Fire Salamander, Faking Fossils, the Coelacanth, the Dodo, Bird's-nest Soup and the Large Blue Butterfly. So listen to these stories to find out the real reason why animals sing, the story behind a 150-million-year-old feather, and what it is about snakes that really unnerves Sir David.\n\n\nThe author and reader\n\nSir David Frederick Attenborough (born 8 May 1926) is an English broadcaster and naturalist.\n\nHis career as the face and voice of natural history programmes has endured for 60 years. He is best known for writing and presenting the nine Life series, in conjunction with the BBC Natural History Unit, which collectively form a comprehensive survey of all life on the planet. He is also a former senior manager at the BBC, having served as controller of BBC Two and director of programming for BBC Television in the 1960s and 1970s. He is the only person to have won BAFTAs for programmes in each of black and white, colour, HD and 3D.\n\nAttenborough is widely considered a national treasure in Britain, although he himself does not like the term. In 2002 he was named among the 100 Greatest Britons following a UK-wide vote. He is a younger brother of the director, producer and actor Richard Attenborough.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3b36baf8129bd0e7ed92e4b18b05e4e5f570dd30","amp;dn":"David+Attenborough+-+Life+Stories+Audio+Documentary+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b36baf8129bd0e7ed92e4b18b05e4e5f570dd30","infoHashBuffer":{"type":"Buffer","data":[59,54,186,248,18,155,208,231,237,146,228,177,139,5,228,229,245,112,221,48]},"announce":[],"urlList":[]}}