{"title":"John Fullbright - Songs (2014) [FLAC]","uid":10306090,"size":265984416,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3b45ccf14f068886a9751be7939b27f1c7e72dbc&amp;dn=John+Fullbright+-+Songs+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"dickspic","files":16,"time":1402133172,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Blue Dirt Records #290500\nCountry: USA\nYear: May 27, 2014\nGenre: americana,folk\nFormat: CD,Album\n\n\n\n1. Happy\n2. When You're Here\n3. Keeping Hope Alive\n4. She Knows\n5. Until You Were Gone\n6. Write a Song\n7. Never Cry Again\n8. Going Home\n9. All That You Know\n10. The One That Lives Too Far\n11. High Road\n12. Very First Time\n\n\n\n\nJohn Fullbright is a songwriter. Yeah, a lot of folks write songs, and some of those songs are pretty good, and some of them are big hits, and then some of them go nowhere at all commercially, but are still good songs, maybe just waiting for the right person to sing them. But not everyone is a songwriter, even if they write good songs now and then, at least not the way Fullbright is a songwriter. He's in the Townes Van Zandt, Merle Haggard, Randy Newman, Jimmy Webb mold when it comes to songwriting. It's what he does, and while he's a fine singer, guitarist, pianist, and, as it turns out, whistler, it's his songs that shine through with clarity, care, and thoughtfulness, each one a fully realized little gem, and it's no coincidence that his second studio album is simply called Songs. They're the stars here. Recorded with a sparse, open warmth, the album opens with a Neil Young-like &quot;Out on the Weekend&quot; shuffle called &quot;Happy&quot; (which even includes some pretty good plain old whistling from Fullbright) and gracefully builds from there, an intimate, sometimes confessional batch of songs that muse on life, love, and happiness with an easy familiarity, yet with an unexpected turn of phrase here or there that lifts them into something singular and special. &quot;She Knows&quot; is a brilliant love song, for instance, and when Fullbright sings the hook, &quot;She knows a thing or two about me,&quot; his verses have already proven that, and the song is revealed as a song about what Fullbright has learned about himself from her. Similarly, &quot;Until You Were Gone&quot; builds like a familiar I-didn't-know-what-I-had-until-it-was-gone song, but in Fullbright's hands, the realization feels actually lived in, absorbed, and learned. Fullbright has been labeled a whole lot of things already, from country to Americana, but what shines through most in this quiet, unassuming, but wonderfully precise and intimately comforting set is that, while his songs may individually fall into any of these genres, he is first and foremost a songwriter. Thankfully, that is what he does, and he does it as well as anyone in recent memory.","torrent":{"xt":"urn:btih:3b45ccf14f068886a9751be7939b27f1c7e72dbc","amp;dn":"John+Fullbright+-+Songs+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b45ccf14f068886a9751be7939b27f1c7e72dbc","infoHashBuffer":{"type":"Buffer","data":[59,69,204,241,79,6,136,134,169,117,27,231,147,155,39,241,199,231,45,188]},"announce":[],"urlList":[]}}