{"title":"Patricia Briggs Audiobook Collection - Mercy Thompson and more","uid":8634256,"size":8349104147,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b7299b7576cb8959ab75569e7224430a89546ee&amp;dn=Patricia+Briggs+Audiobook+Collection+-+Mercy+Thompson+and+more&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"katelynor","files":86,"time":1372707914,"description":"Mercedes Thompson\n\nUrban Fantasy\nMercedes is Volkswagen mechanic living in the Tri-Cities area of Washington. Her native american heritage has gifted her with the ability to take the form of a coyote at will. She's surrounded by far more powerful supernatural beings, including werewolves, vampires and an assortment of fey.\n\n1 Moon Called\n2 Blood Bound\n3 Iron Kissed\n4 Bone Crossed\n5 Silver Borne\n6 River Marked\n\n\nAlpha and Omega \n\nUrban Fantasy\nThis series is set in the same world as the Mercy Thompson Series, but on a slightly earlier time line. It begins with a novella titled Alpha and Omega published in the On the Prowl anthology. The decision to continue the story was made after the anthology had already been published, which has caused some confusion, since &quot;book 1&quot; is a actually a continuation of the short story. The series has plenty of action, but there's more emphasis on the romantic attraction between the hero and heroine. On a romance-readers scale, this series is sweet rather than steamy. \n\n1 Cry Wolf\n2 Hunting Ground\n3 Fair Game\n\n\nRaven Duology\n\nHigh Fantasy\nThis series is set in a medieval setting, with small clans of gypsy like people who often have magical talents. This series focuses on a retired warrior Tier, his traveler wife, Seraph, and their family. The first book can be read by itself, and resolves well. The sequel is best enjoyed after reading the first book.\n\n1 Raven's Shadow\n2 Raven's Strike\n\nHurog Duology\n\nFantasy\nThis is a two-book series. Dragon Bones is a stand-alone story, which resolves the major plot threads nicely. Dragon Blood depends on the reader having some knowledge of the world, and references events from the previous book, and is best read after Dragon Bones.\n\n1 Dragon Bones\n2 Dragon Blood\n\n\nSianim Series\n\nFantasy\nWolfsbane is a tightly-coupled sequel to Masques, and won't make much sense by itself. Other than Wolfsbane, this is a loosely-woven series, and the books can be read in any order. They share the same world, but each book is a stand-alone story with it's own cast of characters.\n\n1 Masques\n2 Wolfsbane\n\n\n\nNot my rips - just books I enjoyed.  My thanks to the original uploaders","torrent":{"xt":"urn:btih:3b7299b7576cb8959ab75569e7224430a89546ee","amp;dn":"Patricia+Briggs+Audiobook+Collection+-+Mercy+Thompson+and+more","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b7299b7576cb8959ab75569e7224430a89546ee","infoHashBuffer":{"type":"Buffer","data":[59,114,153,183,87,108,184,149,154,183,85,105,231,34,68,48,168,149,70,238]},"announce":[],"urlList":[]}}