{"title":"Kevin Morby - Harlem River [2013][WEB/FLAC]","uid":10569963,"size":286617504,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3b88816b8fa1b91bc9177400a6f0d3f163cca249&amp;dn=Kevin+Morby+-+Harlem+River+%5B2013%5D%5BWEB%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"dickspic","files":-1,"time":1405563304,"description":"FLAC / Lossless \nLabel/Cat#: Woodsist #\nCountry: USA\nYear: November 26, 2013\nGenre: americana\nFormat: WEB,Album\n\n[b]\n01 Miles, Miles, Miles\n02 Wild Side (Oh the Places You'll Go)\n03 Harlem River\n04 If You Leave and If You Marry\n05 Slow Train (feat. Cate Le Bon)\n06 Reign\n07 Sucker in the Void (The Lone Mile)\n08 The Dead They Don't Come Back\n\n\n\nWoods bassist and Babies singer Kevin Morby is in a reflective mood on his solo debut, Harlem River. Meandering like the eight-mile-long river of its namesake, the album is a brief journey through the New York that Morby called home for the five years prior to its recording. Now relocated to sunny California, the Kansas City-born Morby made it his first act of business to send a fond farewell to the city that has begun so many careers and inspired so many songs. Gone is the lo-fi experimentalism of Brooklyn's Woods and the uptempo city punk of the Babies. Instead, Morby employs a decidedly vintage aesthetic more in keeping with the ramshackle, folky bustle of Dylan's Blonde on Blonde or early Leonard Cohen records. Long, wistfully downcast poems about city life play out over a bed of warm, jangling guitars and chirping organ. Harlem River is a moody affair, head tucked into an old pea coat, walking into the wind. The songs are refreshingly personal and deep with echoes of 1960s Greenwich Village rather than the self-conscious stylings of Brooklyn's modern age. Sure, the intentionally retro production (courtesy of Babies producer Rob Barbato) is a styling of its own, but it only serves to class up the already well-written songs and doesn't come off as a blatant throwback without substance. It's the sound of an artist making the right choice for his material. No trendy cassette tape manipulation or pseudo-psych effects were needed to make songs like &quot;If You Leave and If You Marry&quot; and the excellent Cate Le Bon duet &quot;Slow Train&quot; stand out. Even the nine-minute title track rumbles along organically, seeming more like a meditative sojourn than mere lazy experimentalism. Harlem River is a journey worth taking and an excellent debut from an emerging singer/songwriter.","torrent":{"xt":"urn:btih:3b88816b8fa1b91bc9177400a6f0d3f163cca249","amp;dn":"Kevin+Morby+-+Harlem+River+%5B2013%5D%5BWEB%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b88816b8fa1b91bc9177400a6f0d3f163cca249","infoHashBuffer":{"type":"Buffer","data":[59,136,129,107,143,161,185,27,201,23,116,0,166,240,211,241,99,204,162,73]},"announce":[],"urlList":[]}}