{"title":"ZABKAT xplorer2 Pro v2.5.0.4 (32-64bit) ML Incl Keymaker-ZWT [To","uid":10418336,"size":4426401,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3bfe5e66e9a81103f5ce8ea2ebf11324349b585c&amp;dn=ZABKAT+xplorer2+Pro+v2.5.0.4+%2832-64bit%29+ML+Incl+Keymaker-ZWT+%5BTo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"TorDigger","files":13,"time":1403569576,"description":"ZABKAT xplorer2 Pro\n\nXplorer is what windows explorer should have been. We've kept the best bits and threw away the inconsistencies and irritations, all in a small and nimble, easy to use package. At first glance everything looks familiar: the classic tree/view user interface, clean and clutter free, should get you started immediately. xplorer? will get you in all places you keep your digital wealth, including namespace extensions like FTP, zipfolders, webfolders etc. xplorer? browsing model scales up well to large folders with thousands of files. It reads fast, offers visual filters and a variety of selection mechanisms that allow you to manage your files effectively.\n\nxplorer2 is a file and information manager that adheres to the philosophy &quot;efficiency through simplicity&quot;. Without reinventing the wheel, it integrates the best features of Windows' shell architecture in a small, resource efficient package that's instantly familiar to work with. But look a little closer and you'll discover a whole new world under the surface that offers power, precision and flexibility, and will boost your everyday productivity no end! All the shell goodies from windows explorer none of the hassle! Plus all the features you would expect from a powerful tabbed dual-pane file manager, including Omni-Finder, a find files module that simply outclasses all known search tools. Don't take our word for it, seeing is believing!\n\nxplorer is what windows explorer should have been. We've kept the best bits and threw away the inconsistencies and irritations, all in a small and nimble, easy to use package. At first glance everything looks familiar: the classic tree/view user interface, clean and clutter free, should get you started immediately. xplorer will get you in all places you keep your digital wealth, including namespace extensions like FTP, zipfolders, webfolders (webDAV) etc.\n\nMain features:\n\n-Browsing the shell namespace\n-Managing files and folders\n-Scrap containers\n-Examine and maintain your filesystem\n-Search for files and folders\n-Automation of DOS (and windows) commands\n-User Interface customization\n\nSupported OS:\n\nWindows All (32 &amp; 64 bit) 9x/NT/2000/XP/Vista/7/8\n\nHomepage: http://zabkat.com/index.htm\n\nInstallation Instructions: \n\n- Install program.\n- Use Keygen to get Valid serial for registering application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:3bfe5e66e9a81103f5ce8ea2ebf11324349b585c","amp;dn":"ZABKAT+xplorer2+Pro+v2.5.0.4+%2832-64bit%29+ML+Incl+Keymaker-ZWT+%5BTo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bfe5e66e9a81103f5ce8ea2ebf11324349b585c","infoHashBuffer":{"type":"Buffer","data":[59,254,94,102,233,168,17,3,245,206,142,162,235,241,19,36,52,155,88,92]},"announce":[],"urlList":[]}}