{"title":"VA - Saturday Night Fever OST (1977) [24 bit FLAC] vinyl","uid":9415169,"size":3134850437,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c28d83823d6ac00db16fe91ad0b3d445c2ce4d2&amp;dn=VA+-+Saturday+Night+Fever+OST+%281977%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":-1,"time":1388424583,"description":"\n  VA - Saturday Night Fever OST (1977) [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Style: Soundtrack\n  Source: UK Pressing (RSO / Polydor)\n  Codec: FLAC\n  Bitrate: ~ 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 192,000 Hz\n\n  01 Bee Gees - Stayin' Alive\n  02 Bee Gees - How Deep Is Your Love\n  03 Bee Gees - Night Fever \n  04 Bee Gees - More Than a Woman\n  05 Yvonne Elliman - If I Can't Have You\n  06 Walter Murphy - A Fifth of Beethoven\n  07 Travares - More Than A Woman \n  08 David Shire - Manhattan Skyline\n  09 Ralph McDonald - Calypso Breakdown\n  10 David Shire - Night On Disco Mountain\n  11 Kool And The Gang - Open Sesame\n  12 Bee Gees - Jive Talkin'\n  13 Bee Gees - You Should Be Dancing \n  14 K.C. And The Sunshine Band - Boogie Shoes\n  15 David Shire - Salsation \n  16 M.F.S.B. - K-Jee \n  17 The Trammps - Disco Inferno\n\n  Every so often, a piece of music comes along that defines a moment in popular culture history: Johann Strauss' operetta Die Fledermaus did this in Vienna in the 1870s; Jerome Kern's Show Boat did it for Broadway musicals of the 1920s; and the Beatles' Sgt. Pepper's Lonely Hearts Club Band album served this purpose for the era of psychedelic music in the 1960s. Saturday Night Fever, although hardly as prodigious an artistic achievement as those precursors, was precisely that kind of musical phenomenon for the second half of the '70s -- ironically, at the time before its release, the disco boom had seemingly run its course, primarily in Europe, and was confined mostly to black culture and the gay underground in America. Saturday Night Fever, as a movie and an album, and a brace of hit singles off of it, suddenly made disco explode into mainstream, working- and middle-class America with new immediacy and urgency, increasing its audience by five- or ten-fold overnight. \n\n  The Bee Gees had written &quot;Stayin' Alive&quot; (then called &quot;Saturday Night&quot;), &quot;Night Fever,&quot; &quot;How Deep Is Your Love,&quot; &quot;If I Can't Have You,&quot; and &quot;More Than a Woman&quot; for what would have been the follow-up album to Children of the World, and they might well have enjoyed platinum-record status with that proposed album. Instead, Robert Stigwood asked them in early 1977 to contribute songs to the soundtrack of a movie that he was financing, a low-budget picture called &quot;Tribal Rites on a Saturday Night.&quot; More out of loyalty to him than any belief in the viability of the film, they obliged; the group's involvement even survived the decision by the original director, John Avildsen, that he didn't want their music in the film -- instead, Stigwood fired him and brought in the very talented but much more agreeable John Badham, the movie's title was changed to Saturday Night Fever, The Bee Gees' music stayed, and the result was the biggest-selling soundtrack album in history, a 25 million copy monster whose sales, even as a more expensive double-LP, dwarfed the multi-million units sold of Children of the World and Main Course. Strangely enough, for all of the fixation of the movie and its audience on dancing, the Bee Gees' new songs were weighted equally toward ethereal ballads, which may be one reason for the soundtrack album's appeal -- it delivers what its audience expects, plus a &quot;bonus&quot; in the form of the soaring, lyrical romantic numbers that were, as with most ventures by the Gibb Brothers in this area, virtually irresistible. \n\n  Despite the presence of other artists, Saturday Night Fever is virtually indispensable as a Bee Gees album, not just for the presence of an array of songs that were hits in their own right -- and which became the de facto soundtrack to a half-decade of pop culture history -- but because it offered the Gibb Brothers as composers as well as artists, their work recorded by Yvonne Elliman (&quot;If I Can't Have You&quot;), and Tavares (&quot;More Than a Woman&quot;), and it placed their music alongside the work of Kool &amp; the Gang and MFSB; in essence, the layout of the soundtrack release was the culmination of everything they'd been moving toward since the Mr. Natural album. Even the presence of David Shire's &quot;Night on Disco Mountain&quot; and &quot;Salsation&quot; and Walter Murphy's &quot;A Fifth of Beethoven&quot; don't hurt, because these set a mood and a surrounding ambience for The Bee Gees' material that makes it work even better. Heard on CD as 79 minutes of music, Saturday Night Fever comes off like an idealized commercial-free radio set of late-'70s dance music (and, in that regard, the decision to leave Rick Dees' &quot;Disco Duck&quot; off the soundtrack album was a good one for all concerned, except Dees). [The album has been out several times on CD, including a Mobile Fidelity audiophile disc that's rarer than hen's teeth and 1995 remastered, newly annotated audiophile edition from Polydor.]","torrent":{"xt":"urn:btih:3c28d83823d6ac00db16fe91ad0b3d445c2ce4d2","amp;dn":"VA+-+Saturday+Night+Fever+OST+%281977%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c28d83823d6ac00db16fe91ad0b3d445c2ce4d2","infoHashBuffer":{"type":"Buffer","data":[60,40,216,56,35,214,172,0,219,22,254,145,173,11,61,68,92,44,228,210]},"announce":[],"urlList":[]}}