{"title":"Thee Oh Sees - Floating Coffin (2013) [FLAC]","uid":8383369,"size":280962072,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c879957d7b0e590be2eede4677d05be96f847cf&amp;dn=Thee+Oh+Sees+-+Floating+Coffin+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"politux","files":-1,"time":1366224489,"description":"\n  Thee Oh Sees - Floating Coffin (2013) [FLAC]\n\n  Released: 2013\n  Duration: 39:49\n  Genre: Pop/Rock\n  Style: Indie Rock, Alternative, Garage Punk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 I Come from the Mountain\n  02 Toe Cutter - Thumb Buster\n  03 Floating Coffin\n  04 No Spell\n  05 Strawberries 1 + 2\n  06 Maze Fancier\n  07 Night Crawler\n  08 Sweet Helicopter\n  09 Tunnel Time\n  10 Minotaur\n\n  The ever prolific John Dwyer isn't the kind of guy to let the grass grow between his toes and his band Thee Oh Sees release albums the way they used to -- one a year with singles in between. The 2013 entry in their extensive catalog, Floating Coffin, is a weird one. Not because it is experimental, psychedelic, or full of lo-fi wildness; any one of those things would be par for the course. What makes this record weird is that there isn't really anything weird about it. From beginning to end it's a hard-rocking, heavy album with heavy drums, heavy guitars, and a knockout punch that not many of their songs have had before. It's still based in basic garage punk mania and Dwyer's voice is still a yelpy, electric thing (though a much calmer here), but there's a solid, no-nonsense approach to the album that is as successful as it is shocking. Once you get past how simple the sound is, and how clean and clear everything is, you can let the songs sink in. \n\n  Dwyer has written a batch of songs that aren't immediately hooky in the way past efforts have been, but the power and control of writing fits that of the music perfectly. Whether rocking out hard as nails on tracks like &quot;Tunnel Time&quot; and &quot;I Come from the Mountain,&quot; slowing it down to a metallic creep on &quot;Strawberries 1+2,&quot; or letting the song unspool slowly like on the Wipers-y &quot;No Spell,&quot; there's a clarity to the music that is impressively immediate. A couple songs might even sound good on a movie soundtrack, like the Brigid Dawson-sung rave-up &quot;Maze Fancier,&quot; and that's not something one could have said about much of their previous work, as good as it was. Only the closing outer space doo wop of &quot;Minotaur&quot; breaks the spell a bit, but by then the heaviness has sunk in fully and a little break is just right. It may just be another one-shot experiment for Thee Oh Sees, and their next album might be a dubpunk concept album, but Floating Coffin will stand as a successful foray into the world of straight-ahead, heavy-rocking, non-weird alternative indie rock.","torrent":{"xt":"urn:btih:3c879957d7b0e590be2eede4677d05be96f847cf","amp;dn":"Thee+Oh+Sees+-+Floating+Coffin+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c879957d7b0e590be2eede4677d05be96f847cf","infoHashBuffer":{"type":"Buffer","data":[60,135,153,87,215,176,229,144,190,46,237,228,103,125,5,190,150,248,71,207]},"announce":[],"urlList":[]}}