{"title":"Neonatology at a Glance, 2E [PDF] [StormRG]","uid":10939347,"size":11554730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3db0e7f821d48a6ee313675f6533977f2527b98d&amp;dn=Neonatology+at+a+Glance%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":2,"time":1409484703,"description":"Author: Tom Lissauer (Author), Avroy A. Fanaroff (Author)\nPaperback: 200 pages\nPublisher: Wiley-Blackwell; 2 edition (February 21, 2011)\nLanguage: English\nISBN-10: 1405199512\nISBN-13: 978-1405199513\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe at a Glance series is popular among medical students, residents, junior doctors and health professionals for its concise and clear approach and excellent illustrations.\nEach topic is concisely covered in a double-page spread with color summary diagrams accompanied by explanatory text. Covering a wide range of topics, books in the at a Glance series are ideal as introductory subject texts or for revision purposes, and are useful throughout medical and nursing training and beyond.\n\nEverything you need to know about Neonatology... at a Glance!\n\nWritten by leading international experts, this accessible overview provides need-to-know information on perinatal medicine, the normal newborn infant, preterm infants and neonatal problems encountered in Intensive Care Units, and their management.\n\nNeonatology at a Glance:\n\nProvides coverage of the important conditions you will encounter\nAddresses ethical issues, the death of an infant, quality assurance and evidence-based medicine\nIncludes invaluable advice on practical procedures, in text and diagrammatic form\nHas been updated to reflect current practice in both the UK and US\nNeonatology at a Glance is the perfect guide for all health professionals looking after newborn infants, including paediatric trainees, medical students, neonatal nurse practitioners and neonatal nurses, therapists and midwives. For neonatologists, pediatricians and nurse tutors it is a valuable resource to assist with teaching.","torrent":{"xt":"urn:btih:3db0e7f821d48a6ee313675f6533977f2527b98d","amp;dn":"Neonatology+at+a+Glance%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db0e7f821d48a6ee313675f6533977f2527b98d","infoHashBuffer":{"type":"Buffer","data":[61,176,231,248,33,212,138,110,227,19,103,95,101,51,151,127,37,39,185,141]},"announce":[],"urlList":[]}}