{"title":"The Oxford History of World Cinema - Newell-Smith [Non-Fiction] ","uid":8867937,"size":16081203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3de872c3e7edfb8436557ef5596c6e841199cc4b&amp;dn=The+Oxford+History+of+World+Cinema+-+Newell-Smith+%5BNon-Fiction%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"K-Slender","files":5,"time":1377975420,"description":"From its humble beginnings as a novelty in a handful of cities, cinema has risen to become a billion-dollar industry and the most spectacular and original contemporary art form. In The Oxford History of World Cinema, an international team of film historians traces the history of this enduringly popular entertainment medium. Covering all aspects of its development, stars, studios, and cultural impact, the book celebrates and chronicles over one hundred years of diverse achievement from westerns to the New Wave, from animation to the avant-garde, and from Hollywood to Hong Kong.\nThe Oxford History of World Cinema tells the story of the major inventions and developments in the cinema business, its institutions, genres, and personnel, and they outline the evolution of national cinemas round the world--the varied and distinctive film traditions that have developed alongside Hollywood. A unique aspect of the book are the special inset features on the film-makers and personalities--Garbo and Godard, Keaton and Kurosawa, Bugs Bunny and Bergman--who have had an enduring impact in popular memory and cinematic lore. With over 280 illustrations, a full bibliography, and an extensive index, this is the buff's ultimate guide to cinema worldwide. ","torrent":{"xt":"urn:btih:3de872c3e7edfb8436557ef5596c6e841199cc4b","amp;dn":"The+Oxford+History+of+World+Cinema+-+Newell-Smith+%5BNon-Fiction%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de872c3e7edfb8436557ef5596c6e841199cc4b","infoHashBuffer":{"type":"Buffer","data":[61,232,114,195,231,237,251,132,54,85,126,245,89,108,110,132,17,153,204,75]},"announce":[],"urlList":[]}}