{"title":"Star Wars - A New Hope - Team Negative 1 35mm Silver Screen","uid":13245821,"size":23478625262,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3e40d664255000c624307999eae7cdcf54df91d9&amp;dn=Star+Wars+-+A+New+Hope+-+Team+Negative+1+35mm+Silver+Screen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"Horisarte","files":1,"time":1453099083,"description":"GOALS\r\n\r\nOur philosophy was to restore the print back to what it would have been viewed like\r\ntheatrically. It is not a pristine cleaned version. We have cleaned major dust and dirt,\r\nstabilized, deflickered, and color corrected it. It is also cropped theatrically,\r\nalthough there is slightly more image in the original scans which was not intended\r\nto be viewed in the theater.\r\n\r\nSOURCE INFORMATION AND DETAILS\r\n\r\nQ : What is this sourced from?\r\nA : This version is a digital recreation of Star Wars sourced from different 35mm prints.\r\n\r\nQ : What was used from which print?\r\nA : The primary source was a Spanish 35 mm LPP print.\r\nThe intro and crawl were from a faded English Eastman Kodak print. (Does not have Episode 4 in it)\r\nThe Han shoots first scene was sourced from a faded Eastman Kodak print.\r\nThere are also several replacement shots throughout the movie from faded Eastman Kodak prints.\r\n\r\nQ : What was it scanned at?\r\nA : The majority of it was taken from 2k scans, but some sections were scanned in 4k,\r\nand downsampled to 2k.\r\n\r\nQ : What is an LPP print.\r\nA : It is a type of print that is Low fade Positive Print, and retains colors better than\r\nthe Eastman Kodak types that fade.\r\n\r\nQ : Some shots look blurry and lower resolution?\r\nA : Any shot with effects will have lower resolution, due to multiple copies for that process.\r\n\r\nQ : There are dirt and some shots with marks on them?\r\nA : For our restoration, we chose to leave original marks, matte lines, and boxes in the film.\r\nSo keep an eye out for those, along with the reel change marks.\r\n\r\nQ : The bluray has more detail.\r\nA : Yes, the scans of these prints, will never be able to match that clarity due to multiple\r\nprocess used to produce a release print. However, many scenes are still as sharp or sharper.\r\n\r\nQ : How authentic are the colors.\r\nA : Although not a Technicolor, which is a different process. This version accurately matches\r\nthe colors of the print if it were being projected. We have compared this with projected versions,\r\nand the match is fairly close. Shots were color corrected scene by scene in a lot of the film.\r\n\r\nQ : How long did it take to do this?\r\nA : The project started 7 years ago, but 4 years is when the bulk of the work was done. With\r\nthe fine tuning and quality checks in the last year.\r\n\r\nQ : How many releases are there?\r\nA : Currently we have 1) MKV 1080p 2) Bluray 1080p ISO file versions. There may be more\r\ndownconverts, and a few updates, on the audio, images, and other items released\r\nlater on. We do not currently have plans for a Grindhouse version of this.\r\n\r\nQ : Do I have to pay for this?\r\nA : NO, this is a free fanedit restoration. Just make sure you support Disney, and Lucasfilm.\r\n\r\nQ : Where can I find it?\r\nA : Usenet groups(eventually), and private trackers like Myspleen, sharing site tehparadox.\r\n\r\nThanks for checking this out, and also look for the previously released Empire Strikes Back\r\nGrindhouse series (3 releases).\r\n\r\nFUTURE PLANS\r\n\r\nReturn of the Jedi, and a few more surprises are being worked on currently.\r\n\r\nOTHER RELEASES\r\n\r\nStar Wars 8mm\r\nStar Wars EIAJ tape\r\nStar Wars CED trilogy (pre-laserdisc)\r\nMay the Force be with You\r\n\r\nTeam Negative1","torrent":{"xt":"urn:btih:3e40d664255000c624307999eae7cdcf54df91d9","amp;dn":"Star+Wars+-+A+New+Hope+-+Team+Negative+1+35mm+Silver+Screen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e40d664255000c624307999eae7cdcf54df91d9","infoHashBuffer":{"type":"Buffer","data":[62,64,214,100,37,80,0,198,36,48,121,153,234,231,205,207,84,223,145,217]},"announce":[],"urlList":[]}}