{"title":"The Food Babe Way: Break Free from the Hidden Toxins","uid":12244996,"size":727933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ecd0cd9bde0ffeb8b38c0ea9034e4926bbed6a2&amp;dn=+The+Food+Babe+Way%3A+Break+Free+from+the+Hidden+Toxins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":1,"time":1439865767,"description":"\nThe Food Babe Way: Break Free from the Hidden Toxins in Your Food and Lose Weight, Look Years Younger, and Get Healthy in Just 21 Days! by Vani Hari\n\nOverview: Cut hidden food toxins, lose weight, and get healthy in just 21 days.\n\nDid you know that your fast food fries contain a chemical used in Silly Putty? Or that a juicy peach sprayed heavily with pesticides could be triggering your body to store fat? When we go to the supermarket, we trust that all our groceries are safe to eat. But much of what we're putting into our bodies is either tainted with chemicals or processed in a way that makes us gain weight, feel sick, and age before our time.\n\nLuckily, Vani Hari - aka the Food Babe - has got your back. A food activist who has courageously put the heat on big food companies to disclose ingredients and remove toxic additives from their products, Hari has made it her life's mission to educate the world about how to live a clean, organic, healthy lifestyle in an overprocessed, contaminated-food world, and how to look and feel fabulous while doing it","torrent":{"xt":"urn:btih:3ecd0cd9bde0ffeb8b38c0ea9034e4926bbed6a2","amp;dn":"+The+Food+Babe+Way%3A+Break+Free+from+the+Hidden+Toxins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ecd0cd9bde0ffeb8b38c0ea9034e4926bbed6a2","infoHashBuffer":{"type":"Buffer","data":[62,205,12,217,189,224,255,235,139,56,192,234,144,52,228,146,107,190,214,162]},"announce":[],"urlList":[]}}