{"title":"Blazblue Calamity Trigger (GOG)","uid":10380932,"size":8788069123,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f29213d1a60b2098a8e33682ddee786432b06cc&amp;dn=Blazblue+Calamity+Trigger+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"Sarah116","files":-1,"time":1403073541,"description":"Hey guys, here &quot;Blazblue Calamity Trigger&quot;. It includes all the bonus content. Hope you guys enjoy and please help seed.\n\n\n--------------------\n\n\nBonus content included for FREE with purchase:\n\n- Manual \n\n- Soundtrack (MP3) \n\n- 4 Avatars \n\n- 2 Wallpapers\n\n---------------------\n\n\nWhat's cool about it:\n\n\n- 12 unique batants to choose from! Choose a character that represents your own fighting style like the lightning-fast Taokaka or the wickedly powerful Tager.\n\n- Drive your way to victory! Use the unique Drive Attacks specific to each character to decimate your opponent. Depending on the character control the elements like wind and ice or even absorb the life force from your opponents.\n\n- Experience the beauty of high-resolution hand-drawn sprites on 3D backgrounds all in glorious high-definition.\n\n- Various modes: Arcade Mode, 2 player Versus Mode, Score Attack Mode, Training Mode, Gallery Mode and a pletely fleshed-out Story Mode that tells the tales of each character.\n\n- 2 CD's worth of OST included with a total of 42 music tracks!\n\n\nOverview:\nThe first hi-res 2D fighter from the creators of the Guilty Gear series! BlazBlue is a traditional 2D fighter where two characters participate in a duel. The story of the game involves dissent and destruction among a powerful council, known unofficially as &quot;the Library,&quot; which controls a great power that once saved humanity, but which now wields its power in protective, some say repressive, ways.\n\nA round is called a &quot;rebel&quot; and one match can consist of one to five &quot;rebels&quot;. To win a round, one player must incapacitate the other by reducing their opponent's health to zero or have more remaining health than their opponent when the clock runs out. Every character has a weak, medium, and strong attack. Also every one has a &quot;unique&quot; technique, called a Drive attack, which is different for each character.\n\nVersus Mode notice: Local multiplayer only. Two game pads are required to be connected to the same PC in order to make full use of this game mode.\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/blazblue_calamity_trigger&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/blazblue_calamity_trigger&lt;/a&gt;","torrent":{"xt":"urn:btih:3f29213d1a60b2098a8e33682ddee786432b06cc","amp;dn":"Blazblue+Calamity+Trigger+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f29213d1a60b2098a8e33682ddee786432b06cc","infoHashBuffer":{"type":"Buffer","data":[63,41,33,61,26,96,178,9,138,142,51,104,45,222,231,134,67,43,6,204]},"announce":[],"urlList":[]}}