{"title":"James Brown-Star Time (4-cd box)","uid":3404055,"size":567507354,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4006eafb4f903b6e45f6cce686c09683d618670e&amp;dn=James+Brown-Star+Time+%284-cd+box%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"bergmanwasa","files":84,"time":1130873514,"description":"James Brown: Star Time\n4-disc compilation\nmp3@256mbps\n\nDisc 1: Mr Dynamite\nDisc 2: The Hardest Working Man In Showbusiness\nDisc 3: Soul Brother No 1\nDisc 4: The Godfather of Soul\n\n&quot;When the four-disc Star Time box was released in 1991, James Brown's catalog \nsorely needed an overhaul; much of it was out of print, and what was available \nwas hardly befitting of his magnitude. Star Time got everything right: it put \nBrown's hugely influential career into striking perspective, helping to \ncomplete his critical renaissance, and the richness of its music set a \nstandard for box sets in general. It was no easy task to balance Brown's \nlengthy, multi-part funk workouts with the need to include all of his most significant tracks, and the compilers did an excellent job in deciding when \nand when not to truncate (&quot;Cold Sweat,&quot; for example, must be heard in \nits entirety). There's nothing from Live at the Apollo (which should be experienced start to finish), and his last hurrah on the pop charts, \n&quot;Living in America,&quot; is missing, but these 71 tracks cover all the other \nhigh points, and make an eloquent case for Brown as the greatest \nR&amp;B artist of all time. Disc One covers Brown's early R&amp;B years, when \nhis pleading intensity helped lay the groundwork for soul music. \nDisc Two, however, is where his genius truly crystallizes -- it basically chronicles the birth of funk, as Brown gradually discards song structure in \nfavor of working hard grooves; it also offers a picture of Brown's emergence \nas a bandleader and spokesman for black pride. Disc Three features Brown's hardest funk, including his much-revered material with the Bootsy Collins \nband. Disc Four traces Brown's later creative decline, yet he duplicated \nhis former glories often enough to make this disc a surprisingly solid \nlisten; plus, his massive impact on hip-hop is underlined on the last track, \nthe Afrika Bambaataa duet &quot;Unity.&quot; Star Time paved the way for several \nother excellent compilations which highlighted different parts of Brown's \nvast legacy, but as the definitive retrospective of one of the most important musicians of the 20th century (black or otherwise), it has yet to be equaled.&quot;\n\nallmusic.com review","torrent":{"xt":"urn:btih:4006eafb4f903b6e45f6cce686c09683d618670e","amp;dn":"James+Brown-Star+Time+%284-cd+box%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4006eafb4f903b6e45f6cce686c09683d618670e","infoHashBuffer":{"type":"Buffer","data":[64,6,234,251,79,144,59,110,69,246,204,230,134,192,150,131,214,24,103,14]},"announce":[],"urlList":[]}}