{"title":"An Artist in Treason: The Double Life of General James Wilkinson","uid":15796238,"size":1198374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4024f5c398971d736eb37c9dd39828249a9a7f9d&amp;dn=An+Artist+in+Treason%3A+The+Double+Life+of+General+James+Wilkinson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"marty14","files":1,"time":1473460460,"description":"An Artist in Treason: The Extraordinary Double Life of General James Wilkinson - Andro Linklater [epub]\r\n\r\nThe first modern biography of the greatest traitor―and one of the most colorful characters―in American history. \r\n\r\nPatriot, traitor, general, spy: James Wilkinson was a consummate contradiction. Brilliant and precocious, at age twenty he was both the youngest general in the revolutionary Continental Army, and privy to the Conway cabal to oust Washington from command. He was Benedict Arnold's aide, but the first to reveal Arnold's infamous treachery. By thirty-eight, he was the senior general in the United States army―and had turned traitor himself.\r\n\r\nWilkinson's audacious career as Agent 13 in the Spanish secret service while in command of American forces is all the more remarkable because it was anything but hidden. Though he betrayed America's strategic secrets, sought to keep the new country from expanding beyond the Mississippi, and almost delivered Lewis and Clark's expedition into Spanish hands, four presidents―Washington, Adams, Jefferson, and Madison―turned a blind eye to his treachery. They gambled that Wilkinson―by turns charming and ruthless―would never betray the army itself and use it to overthrow our nascent democracy―a fate every other democracy in the Western hemisphere endured. The crucial test came in 1806, when at the last minute Wilkinson turned the army against Aaron Burr and foiled his conspiracy to break up the Union.\r\n\r\nA superb writer and superlative storyteller, Andro Linklater captures with brio Wilkinson's charismatic ability to live a double life in public view. His saga shows, more clearly than any other, how fragile the young republic was and how its strength grew from the risks its leaders faced and the challenges they had to overcome","torrent":{"xt":"urn:btih:4024f5c398971d736eb37c9dd39828249a9a7f9d","amp;dn":"An+Artist+in+Treason%3A+The+Double+Life+of+General+James+Wilkinson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4024f5c398971d736eb37c9dd39828249a9a7f9d","infoHashBuffer":{"type":"Buffer","data":[64,36,245,195,152,151,29,115,110,179,124,157,211,152,40,36,154,154,127,157]},"announce":[],"urlList":[]}}