{"title":"(1987) Prince And The Revolution - Sign O' The Times [VinylRip 2","uid":10093265,"size":1873747743,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40d961970b92c5efba4b8845aca7bf3fe7364ef9&amp;dn=%281987%29+Prince+And+The+Revolution+-+Sign+O%27+The+Times+%5BVinylRip+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"100.XY","files":-1,"time":1399241949,"description":"(1987) Prince And The Revolution - Sign O' The Times\n\n\n\nReview by Rolling Stones site:\nPrince And The Revolution - Sign O' The Times occupies position 74 on 100 BEST ALBUMS OF THE EIGHTIES \nIt began as Dream Factory, a two-record set with major contributions from Revolution members Wendy and Lisa, then metamorphosed into Crystal Ball, a three-record extravaganza whose lengthy title track was to be Prince's masterwork. But by the time of its release it had once again become a two-disc set, not titled Sign o' the Times.\n\nHighlighted by the outstanding Curtis Mayfield-styled title track, one of Prince's strongest social statements, the album is his most diverse work, with material ranging from the steamy funk of &quot;Hot Thing&quot; and the jazzy balladry of &quot;Slow Love&quot; to more esoteric gems such as &quot;The Ballad of Dorothy Parker&quot; and the fanciful &quot;Starfish and Coffee.&quot; This was also the album that marked the return of Prince's more controversial side with the sexually provocative &quot;If I Was Your Girlfriend.&quot;\n\nProduced, arranged, composed and performed by Prince, Sign o' the Times found him back in complete control of every aspect of his music. He abandoned the neo-psychedelic qualities that had come to the fore on his previous albums, pursuing a tougher soul music, evident on the title track, &quot;Housequake&quot; and &quot;U Got the Look.&quot; &quot;He was hearing a different kind of music,&quot; says Alan Leeds, vice-president of Prince's Paisley Park Records.\n\nAt first, Dream Factory was to have been another band album like the preceding Purple Rain, Around the World in a Day and Parade, but along the way Prince disbanded the Revolution and put existing band tracks on the shelf. Instead, he holed up in the basement of his new house and began cutting solo tracks.\n\nAbout half the album was recorded at home; the rest was recorded at Sunset Sound, in Los Angeles. Prince played or sang nearly everything, although there were some contributions from Sheila E., former Revolution members Wendy and Lisa and a few others. The three-record Crystal Ball concept was followed all the way through to the mastering stage and included a suitelike twelve-minute title track. But Prince and Warner Bros. decided a three-record set wasn't the best move, coming after Parade, which had not been one of Prince's better sellers.\n\nWhat became the new title track was written toward the end of the recording sessions. &quot;He had begun to see the effect of crack and drugs on young people,&quot; says Leeds. &quot;He's not really a preacher, but it's certainly an antidrug song.&quot;\n\n&quot;U Got the Look,&quot; one of several hits, became a duet featuring Sheena Easton by accident. &quot;Sheena just happened to be around,&quot; says Susan Rogers, who engineered the album. &quot;He said, 'How'd you like to do this? Feel like singing?' It was very spontaneous.&quot;\n\n&quot;If I Was Your Girlfriend&quot; features a very personal lyric, directed at Susannah Melvoin, who had been Prince's girlfriend. &quot;Being Wendy's twin sister, she's very close to Wendy,&quot; says Rogers. &quot;It was a way of asking, 'Why can't I have the closeness you have with your sister? Why can't we be friends too?'&quot;\n\nIn retrospect, Sign o' the Times looks more and more like Prince's Exile on Main Street, one of the few two-disc sets by any artist that holds up through all four sides. &quot;There was a refreshing feeling about making his own music unencumbered [by the band] again,&quot; says Leeds. &quot;I think it showed an artist who had really grown.&quot;\n\n\nimage\n\n\n\nTrack List:\n\nLP1\nA1 Sign &quot;O&quot; The Times 5:02\nA2 Play In The Sunshine 5:05\nA3 Housequake 4:38\nA4 The Ballad Of Dorothy Parker 4:04\nB1 It 5:10\nB2 Starfish And Coffee 2:51\nB3 Slow Love 4:18\nB4 Hot Thing 5:39\nB5 Forever In My Life 3:38\n\nLP2\nC1 U Got The Look 3:58\nC2 If I Was Your Girlfriend 4:54\nC3 Strange Relationship 4:04\nC4 I Could Never Take The Place Of Your Man 6:31\nD1 The Cross 4:46\nD2 It's Gonna Be A Beautiful Night 8:59\nD3 Adore 6:29\n\n\n\nSummary:\nCountry: USA\nGenres: Pop rock, funk rock, R&amp;B\nStyles:\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : ~ 2.7 - 3.4 Mbps\nChannel(s) : 2 channels\nSampling rate : 96 KHz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:40d961970b92c5efba4b8845aca7bf3fe7364ef9","amp;dn":"%281987%29+Prince+And+The+Revolution+-+Sign+O%27+The+Times+%5BVinylRip+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d961970b92c5efba4b8845aca7bf3fe7364ef9","infoHashBuffer":{"type":"Buffer","data":[64,217,97,151,11,146,197,239,186,75,136,69,172,167,191,63,231,54,78,249]},"announce":[],"urlList":[]}}