{"title":"Android Native Development Kit Cookbook 2013","uid":8861878,"size":23727869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40e3baea55833c85e2019601b33a19941dee7baa&amp;dn=Android+Native+Development+Kit+Cookbook+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1377795955,"description":"Android Native Development Kit Cookbook - Quick Anwers to Common Problems\n\nBook Details:\n\nPaperback: 346 pages\nPublisher: Packt Publishing (March 2013)\nLanguage: English\nISBN-10: 1849691509\nISBN-13: 978-1849691505\nFormat: PDF, EPUB\n\nBook Description:\n\nBuilding Android applications would usually mean that you spend all of your time working in Java. There are however times when this is not the most efficient or best method for the application being built. This is where Android NDK comes in. Android NDK allows the developer to write in Native C/C++, giving you the power to reuse code and libraries and also, in most cases, increase the speed and efficiency of your application.\n\nThe Android Native Development Kit Cookbook will help you understand the development, building, and debugging of your native Android applications. We will discover and learn JNI programming and essential NDK APIs such as OpenGL ES, and the native application API. We will then explore the process of porting existing libraries and software to NDK. By the end of this book you will be able to build your own apps in NDK apps.\n\nAndroid Native Development Kit Cookbook begins with basic recipes that will help you in the building and debugging of native apps, and JNI programming. The recipes cover various topics of application development with Android NDK such as OpenGL programming and Multimedia programming. We will begin with a simple recipe, Hello NDK, before moving on to cover advanced topics with recipes on OpenGL ES that focus on 2D and 3D graphics, as well as recipes that discuss working with NDK and external APIs. If you are looking for ways to make your application available in Android and take measures to boost your applications performance, then this Cookbook is for you.\n\nWhat you will learn from this book:\n\nDevelop Android apps in C/C++ without a single line of Java\nProgram 2D/3D graphics with both OpenGL ES 1x and 2.0 in Android NDK\nWrite multi-threaded Android apps in Android NDK\nPort existing C/C++ libraries and applications to Android with NDK\nDevelop multimedia Android apps with Android NDK\n\nApproach:\n\nThis book is written in a Cookbook style, beginning with recipes which focus on helping developers make their software/application available in Android.\n\nWho this book is for?:\n\nAndroid developers who want to learn Android NDK programming, or develop multimedia and games in Android NDK will benefit from this book.\n","torrent":{"xt":"urn:btih:40e3baea55833c85e2019601b33a19941dee7baa","amp;dn":"Android+Native+Development+Kit+Cookbook+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e3baea55833c85e2019601b33a19941dee7baa","infoHashBuffer":{"type":"Buffer","data":[64,227,186,234,85,131,60,133,226,1,150,1,179,58,25,148,29,238,123,170]},"announce":[],"urlList":[]}}