{"title":"Mastering Fermentation (gnv64)","uid":8885976,"size":22475210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41374956c79ab4b41472db4887ad8d3586003d11&amp;dn=Mastering+Fermentation+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gnv65","files":-1,"time":1378459931,"description":"Mastering Fermentation: Recipes for Making and Cooking with Fermented Foods \nby Mary Karlin\nTen Speed Press | August 2013 | ISBN-10: 1607744384 | ePUB | 221 pages | 21.4 mb &lt;a href=&quot;\nhttp://www.amazon.com/Mastering-Fermentation-Recipes-Cooking-Fermented/dp/1607744384&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mastering-Fermentation-Recipes-Cooking-Fermented/dp/1607744384&lt;/a&gt;\n\nA beautifully illustrated and authoritative guide to the art and science of fermented foods, featuring 70+ recipes that progress from simple fermented condiments like vinegars and mustards to more advanced techniques for using wild yeast, fermenting meats, and curing fish.\nAlthough fermentation has an ancient history, fermented foods are currently experiencing a renaissance: kombucha, kefir, sauerkraut, and other potent fermentables appeal not only for their health benefits, but also because they are fun, adventurous DIY projects for home cooks of every level. Mastering Fermentation is a beautifully illustrated and authoritative guide to the art and science of fermented foods, featuring more than seventy recipes that allow you to progress from simple fermented condiments like vinegars and mustards to more advanced techniques for using wild yeast starters, fermenting meats, and curing fish.\nCooking instructor and author Mary Karlin begins with a solid introduction to the wide world of fermentation, explaining essential equipment, ingredients, processes, and techniques. The diverse chapters cover everything from fermented dairy to grains and breads; legumes, nuts, and aromatics; and fermented beverages. Last but not least, the book concludes with more than twenty globally-inspired recipes that incorporate fermented foods into enticing finished dishes like Grilled Lamb Stuffed with Apricot-Date Chutney and Saffron Yogurt Sauce. Offering an accessible, recipe-driven approach, Mastering Fermentation will inspire and equip you to facilitate the transformative, fascinating process of fermentation, with delicious results. \n\nAbout the Author &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/ca/ed/5c3ef552fcf70ad8956ecf.L._SX80_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/ca/ed/5c3ef552fcf70ad8956ecf.L._SX80_.jpg&lt;/a&gt;\nMary Karlin is a passionate cook, cooking teacher, cookbook author, and freelance food writer. She was a founding staff member, currently a visiting chef- instructor, at the award-winning Ramekins Culinary School in Sonoma, CA, where she has taught wood-fired cooking, cheese making, and Mediterranean-themed cooking classes for over ten years.\nMary is also a regular chef-instructor at The Fork at Point Reyes Farmstead Cheese, and The Cheese School of San Francisco, as well as other prominent culinary venues around the United States. She teaches an online course: Artisan Cheese Making: Chevre, Mozzarella, and Cheddar.\nMary's acclaimed books, Wood-Fired Cooking (2009), and Artisan Cheese Making at Home, (2011) are published by Ten Speed Press. Her third book, Mastering Fermentation, will also be published by Ten Speed Press August 27, 2013. When not traveling to teach, Mary splits her time between Northern California and Arizona where she makes cheese, ferments other foods, and cooks at her wood-fired oven.\n\nCONTENTS\nIntroduction\nCHAPTER 1 Fermentation Basics\nCHAPTER 2 Equipment, Ingredients, and Troubleshooting\nCHAPTER 3 Fermented Fruits and Vegetables\nCHAPTER 4 Legumes, Nuts, Seeds, and Aromatics\nCHAPTER 5 Fermented Dairy\nCHAPTER 6 Fermented Grains, Breads, and Flatbreads\nCHAPTER 7 Cured Meats and Fish\nCHAPTER 8 Fermented Beverages\nCHAPTER 9 Cooking with Fermented Foods\nAcknowledgments\nGlossary\nResources\nBibliography\nAbout the Author\nMeasurement Conversion Charts\nIndex","torrent":{"xt":"urn:btih:41374956c79ab4b41472db4887ad8d3586003d11","amp;dn":"Mastering+Fermentation+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41374956c79ab4b41472db4887ad8d3586003d11","infoHashBuffer":{"type":"Buffer","data":[65,55,73,86,199,154,180,180,20,114,219,72,135,173,141,53,134,0,61,17]},"announce":[],"urlList":[]}}