{"title":"Nas - Illmatic XX 20th Anniversary Edition (2014) [FLAC]","uid":10002907,"size":571050984,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41382670aa8af7f5f50bfcc520f08a393a477895&amp;dn=Nas+-+Illmatic+XX+20th+Anniversary+Edition+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"politux","files":-1,"time":1398007912,"description":"\n  Nas - Illmatic XX 20th Anniversary Edition (2014) [FLAC]\n\n  Genre: Hip-Hop\n  Styles: East Coast Rap, Hardcore Rap\n  Source: 2CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 The Genesis\n  02 N.Y. State of Mind\n  03 Life's a Bitch\n  04 The World Is Yours\n  05 Halftime\n  06 Memory Lane (Sittin' in da Park)\n  07 One Love\n  08 One Time 4 Your Mind\n  09 Represent\n  10 It Ain't Hard to Tell\n\n  01 I'm a Villain\n  02 The Stretch Armstrong and Bobbito Show on WKCR October 28, 1993\n  03 Halftime (Butcher Remix)\n  04 It Ain't Hard to Tell (Remix)\n  05 One Love (LG Main Mix)\n  06 Life's a Bitch (feat. AZ) [Arsenal Mix]\n  07 One Love (feat. Sadat X) [One L Main Mix]\n  08 The World Is Yours (Tip Mix)\n  09 It Ain't Hard to Tell (The Stink Mix)\n  10 It Ain't Hard to Tell (The Laidback Remix)\n\n\n  Often cited as one of the best hip-hop albums of the '90s, Illmatic is the undisputed classic upon which Nas' reputation rests. It helped spearhead the artistic renaissance of New York hip-hop in the post-Chronic era, leading a return to street aesthetics. Yet even if Illmatic marks the beginning of a shift away from Native Tongues-inspired alternative rap, it's strongly rooted in that sensibility. For one, Nas employs some of the most sophisticated jazz-rap producers around: Q-Tip, Pete Rock, DJ Premier, and Large Professor, who underpin their intricate loops with appropriately tough beats. But more importantly, Nas takes his place as one of hip-hop's greatest street poets -- his rhymes are highly literate, his raps superbly fluid regardless of the size of his vocabulary. He's able to evoke the bleak reality of ghetto life without losing hope or forgetting the good times, which become all the more precious when any day could be your last. \n\n  As a narrator, he doesn't get too caught up in the darker side of life -- he's simply describing what he sees in the world around him, and trying to live it up while he can. He's thoughtful but ambitious, announcing on &quot;N.Y. State of Mind&quot; that &quot;I never sleep, 'cause sleep is the cousin of death,&quot; and that he's &quot;out for dead presidents to represent me&quot; on &quot;The World Is Yours.&quot; Elsewhere, he flexes his storytelling muscles on the classic cuts &quot;Life's a Bitch&quot; and &quot;One Love,&quot; the latter a detailed report to a close friend in prison about how allegiances within their group have shifted. Hip-hop fans accustomed to 73-minute opuses sometimes complain about Illmatic's brevity, but even if it leaves you wanting more, it's also one of the few '90s rap albums with absolutely no wasted space. Nas is a great lyricist, in top form, meeting great production, and Illmatic remains a perennial favorite among serious hip-hop fans. [The 2014, &quot;XX&quot; version of Illmatic comes with an extra disc featuring demos, remixes, and radio appearances. The remixes come right from a run of 12&quot;s released between 1992 and 1994, making them a valuable addition for archivists. Hardcore fans will be most interested in the unreleased cut &quot;I'm a Villain&quot; along with Nas' appearance on the Stretch Armstrong and Bobbito Show which comes straight of the WKCR radio airwaves, circa 1993.]","torrent":{"xt":"urn:btih:41382670aa8af7f5f50bfcc520f08a393a477895","amp;dn":"Nas+-+Illmatic+XX+20th+Anniversary+Edition+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41382670aa8af7f5f50bfcc520f08a393a477895","infoHashBuffer":{"type":"Buffer","data":[65,56,38,112,170,138,247,245,245,11,252,197,32,240,138,57,58,71,120,149]},"announce":[],"urlList":[]}}