{"title":"Slayer - South Of Heaven 320k  mp3  ak2014","uid":10508293,"size":88675712,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:418c27c94748c33dde2ee0513c0152907a49e3c8&amp;dn=Slayer+-+South+Of+Heaven+320k++mp3++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"analogkid6103","files":10,"time":1404813635,"description":"Slayer - South Of Heaven 320k  mp3  ak2014 What we got Slayer....Slayer is an American thrash metal band formed in Huntington Park, California, in 1981, by guitarists Jeff Hanneman and Kerry King. Slayer rose to fame with their 1986 release Reign in Blood, and is credited as one of the &quot;Big Four&quot; thrash metal acts, along with Metallica, Megadeth and Anthrax.Slayer has never publicly revealed its worldwide sales, however between 1991 and 2004, the band sold more than 3.5 million albums in the U.S.\n\nSlayer's musical style involves fast tremolo picking, double bass drumming, riffs in irregular scales and shouted vocals. In the original line-up, King, bassist/vocalist Tom Araya and guitarist Jeff Hanneman contributed to the band's lyrics, and most of the band's music was created and arranged by King and Hanneman, with additional help from drummer Dave Lombardo and sometimes Araya. The band's lyrics and album art, which cover topics such as serial killers, necrophilia, Satanism, religion, anti-religion and warfare, have generated album bans, delays, lawsuits and criticism from religious groups and the public. Their music has been highly influential, often being cited by many bands as an influence musically, visually and lyrically.\n\nSince their debut album in 1983, the band has released two live albums, one box set, six videos, two extended plays, a covers album and ten studio albums, four of which have received gold certification in the United States. The band has received five Grammy nominations, winning one in 2007 for the song &quot;Eyes of the Insane&quot;, and one in 2008 for the song &quot;Final Six&quot; (both from 2006's Christ Illusion). Slayer has played music festivals worldwide, including Unholy Alliance, Download and Ozzfest.And many tours with various Metal act's. South of Heaven ......get it........ ","torrent":{"xt":"urn:btih:418c27c94748c33dde2ee0513c0152907a49e3c8","amp;dn":"Slayer+-+South+Of+Heaven+320k++mp3++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"418c27c94748c33dde2ee0513c0152907a49e3c8","infoHashBuffer":{"type":"Buffer","data":[65,140,39,201,71,72,195,61,222,46,224,81,60,1,82,144,122,73,227,200]},"announce":[],"urlList":[]}}