{"title":"The Mars Volta - Octahedron","uid":4973792,"size":110077869,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:420a774c0b52601e12cbdebd6781ade83d714dcd&amp;dn=The+Mars+Volta+-+Octahedron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Triggerlol","files":11,"time":1245894471,"description":"The Octahedron is the newest Mars Volta Album as of June 2009.\n\n\nNow, I could paste a review from another site but that's pretty annoying when I see it on other torrents; I feel users should review material themselves, as they see it, if at all. \n\nThat said, in my opinion The Mars Volta are pretty damn good when it comes to tying several songs together into one big experience (The album Frances the Mute is probably the best example) and, while this is one of their shorter albums, there are still some good stretches. For new listeners I'd recommend the whole album in chronological order, but for those who know the Volta I'd try jumping in at Teflon or Cotopaxi. Make sure you listen to Copernicus too for the vocal harmonies, and Teflon for the really cool guitar work in the latter half.\n\nAll in all, while Octahedron does give an overall &quot;emptier&quot; feeling than other albums by The Volta, it's a great addition to their discography and definitely earns a spot in my library. Hope you enjoy it!\n\n\n-\nThis version of Octahedron was preordered from the iTunes store, so you get the digital booklet pdf and a live version of Cotopaxi as added bonuses. All tracks are 256 kbps AAC VBR (Re-encoded from the downloaded tracks to remove my personal info) If you have any problems, leave a comment and I'll see what I can do.\n\nP.S. If people would be kind enough to seed to at least 1.5 uploaded ratio it would be much appreciated","torrent":{"xt":"urn:btih:420a774c0b52601e12cbdebd6781ade83d714dcd","amp;dn":"The+Mars+Volta+-+Octahedron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420a774c0b52601e12cbdebd6781ade83d714dcd","infoHashBuffer":{"type":"Buffer","data":[66,10,119,76,11,82,96,30,18,203,222,189,103,129,173,232,61,113,77,205]},"announce":[],"urlList":[]}}