{"title":"The Art of Electronics","uid":10378077,"size":170744613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:425d30788a993b146999ad3e4f5f12cc9bc7e796&amp;dn=The+Art+of+Electronics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"sonicsurf_71","files":1,"time":1403031065,"description":"\nThe Art of Electronics, by Paul Horowitz and Winfield Hill, is a popular textbook dealing with analog and digital electronics. The first edition was published in 1980, and the 1989 second edition has been regularly reprinted\n\n\n********************************************************************************\n\n\n\n&quot;I've hunted high and low for good electronics textbooks. This one is the best, bar none. No extraneous math, lots of insider's information ... and a huge range of topics covered clearly and thoroughly. So well written that I've had difficulty putting it down!&quot; -- CoEvolution Quarterly \n\n&quot;Full of clever circuits and sharp insights, but with a surprising minimum of mathematics... The depth is genuine, as is the richness of examples, data and apt tricks.&quot; \nScientific American\n\n&quot;Far and away the finest book on the subject of electronics ... in the last decade. I cannot recommend this book highly enough to anyone whose research or experiments require some electronics.&quot; \nOptical Engineering\n\n&quot;A delightful book...The circuits actually work, the schematics are all readable.&quot; \nReview of Scientific Instruments\n\n&quot;This book is filled with a tremendous diversity of valuable information. More importantly, this book is a joy to read...It's not at all like studying--it's too much fun.&quot; \nEDN (News Edition)\n\n&quot;This book provides a painless way to learn about electronic design. It is also a good read for those already experienced in electronics.&quot; \nEDN (Magazine Edition)\n\n&quot;..it comes as close as any book we've seen to fulfilling the promise inherent in its title...written as though to educate the novice, but practicing engineers will encounter many useful tidbits they didn't know, hadn't thought about, or had long forgotten.&quot; \nAnalog Dialogue\n\n&quot;...a refreshingly simple, practical and comprehensive textbook on the subject of electronic circuit behavior and design...one of the few contemporary practical reference handbooks on electronic design basics.&quot; \nPhysics in Canada\n\n&quot;A lovely book, it covers a wealth of electronic topics in a very readable style.&quot; \nRichard Morin, Sunexpert\n\n&quot;The second volume carries on une grande tradition as well as adding 400 new pages to the original (already massive) text. It is, without doubt, the book for the practical engineer. No cerebral theorizing here, no long sections of abstruse mathematical derivations; just page after page of solid empirical engineering. It is also light hearted and anecdotal, with some wonderful pages of bad ciruit 'howlers' that the authors have encountered.&quot; \nJohn V. Hatfield, IJEEE\n\n&quot;...an excellent general electronic textbook.&quot; \nPoptronics\n\n&quot;The best self-teaching book and reference book in electronics... The beauty and fun of electronics shows through.&quot; \nRadio Communication\n\n&quot;Another electronics textbook that became an international best-seller... the book is renowned for presenting the techniques that circuit designers actually use.&quot; \nIEEE Spectrum ","torrent":{"xt":"urn:btih:425d30788a993b146999ad3e4f5f12cc9bc7e796","amp;dn":"The+Art+of+Electronics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"425d30788a993b146999ad3e4f5f12cc9bc7e796","infoHashBuffer":{"type":"Buffer","data":[66,93,48,120,138,153,59,20,105,153,173,62,79,95,18,204,155,199,231,150]},"announce":[],"urlList":[]}}