{"title":"The German Army at Cambrai","uid":15744612,"size":15048966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4283843d3df8e5bfdd88b6737fde8fa77eeb697a&amp;dn=The+German+Army+at+Cambrai&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"marty14","files":1,"time":1472953362,"description":"The German Army at Cambrai by Jack Sheldon [epub]\r\n\r\nThis latest ‘German Army’ book by Jack Sheldon covers a shorter (three week) timeframe than his earlier works. After an introductory chapter tracing the development of the Hindenburg Line, the author concentrates on German aspects of the bitterly fought battle of Cambrai from 20 November to 6 December 1917.\r\n\r\nThe narrative splits easily into two parts. First the defensive battle 20 – 29 November followed by the counter-attack which saw the German Army regain not only most of the ground lost in the opening phase but more besides. Detailed descriptions are given of the struggle for Flesquières Ridge and the see-saw battles for key terrain, including Bourlon Wood, as the German Army rushed reinforcements to the sectors under attack before we witness the German offensive.\r\n\r\nAs with his other books full use is made of primary source material from the Munich Kriegsarchiv, the Hauptstaatsarchiv in Stuttgart, regimental histories and personal accounts. Of particular interest are the controversial interventions in operational matters of Ludendorf which were sharply criticized by Crown Prince Rupprecht. But for many the most fascinating aspect will be the experiences of the front line soldiers","torrent":{"xt":"urn:btih:4283843d3df8e5bfdd88b6737fde8fa77eeb697a","amp;dn":"The+German+Army+at+Cambrai","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4283843d3df8e5bfdd88b6737fde8fa77eeb697a","infoHashBuffer":{"type":"Buffer","data":[66,131,132,61,61,248,229,191,221,136,182,115,127,222,143,167,126,235,105,122]},"announce":[],"urlList":[]}}