{"title":"Braunwald's Heart Disease (9th Ed)(gnv64)","uid":7827471,"size":190595248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42b9cbbe2bda6c0d2f580168189dac3aae4ee541&amp;dn=Braunwald%27s+Heart+Disease+%289th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":-1,"time":1352969480,"description":"Braunwald's Heart Disease: A Textbook of Cardiovascular Medicine, 2-Volume Set (9th Ed)\nEditors: Robert O. Bonow MD, Douglas L. Mann MD FACC, Douglas P. Zipes MD and Peter Libby MD\nSaunders | March 2011 | ISBN-10: 1437727085 | PDF | 2136 pages | 179 mb &lt;a href=&quot;\nhttp://www.amazon.com/Braunwalds-Heart-Disease-Cardiovascular-Braunwald/dp/143772708&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Braunwalds-Heart-Disease-Cardiovascular-Braunwald/dp/143772708&lt;/a&gt;\n\nAn acclaimed reference plus a state-of-the-art web site where you can search the entire contents of the book, access weekly updates, and more...\nBraunwald's Heart Disease remains your indispensable source for definitive, state-of-the-art answers on every aspect of contemporary cardiology. Edited by Drs. Robert O. Bonow, Douglas L. Mann, Douglas P. Zipes, and Peter Libby, this dynamic, multimedia reference helps you apply the most recent knowledge in molecular biology and genetics, imaging, pharmacology, interventional cardiology, electrophysiology, and much more. Weekly updates online, personally selected by Dr. Braunwald, continuously keep you current on the most important new developments affecting your practice. Enhanced premium online content includes new dynamic cardiac imaging videos, heart sound recordings, and podcasts. With sweeping updates throughout, and contributions from a &quot;who's who&quot; of global cardiology, Braunwald's is the cornerstone of effective practice.\n\n- Continuously access the most important new developments affecting your practice with weekly updates personally selected by Dr. Braunwald, including focused reviews, &quot;hot off the press&quot; commentaries, and late-breaking clinical trials.\n- Practice with confidence and overcome your toughest challenges with advice from the top minds in cardiology today, who synthesize the entire state of current knowledge and summarize all of the most recent ACC/AHA practice guidelines.\n- Locate the answers you need fast thanks to a user-friendly, full-color design with more than 1,200 color illustrations.\n- Search the complete contents online at http://www.expertconsult.com.\n- Stay on top of the latest advances in molecular imaging, intravascular ultrasound, cardiovascular regeneration and tissue engineering, device therapy for advanced heart failure, atrial fibrillation management, structural heart disease, Chagasic heart disease, ethics in cardiovascular medicine, the design and conduct of clinical trials, and many other timely topics.\n- Hone your clinical skills with new dynamic cardiac imaging videos, heart sound recordings, and podcasts at &lt;a href=&quot; http://www.expertconsult.com.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.expertconsult.com.&lt;/a&gt;\n\nBraunwald's Heart Disease continues to provide THE BEST cardiology information with expanded premium multimedia features, extensively revised content, and new global experts.","torrent":{"xt":"urn:btih:42b9cbbe2bda6c0d2f580168189dac3aae4ee541","amp;dn":"Braunwald%27s+Heart+Disease+%289th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b9cbbe2bda6c0d2f580168189dac3aae4ee541","infoHashBuffer":{"type":"Buffer","data":[66,185,203,190,43,218,108,13,47,88,1,104,24,157,172,58,174,78,229,65]},"announce":[],"urlList":[]}}