{"title":"Panda Cloud Antivirus Free Edition 1.0.01","uid":5474745,"size":23787096,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43caabe43f4f62785ff634a7644e7d0fe7d1d0f9&amp;dn=Panda+Cloud+Antivirus+Free+Edition+1.0.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"nightstalker666","files":1,"time":1270073490,"description":"Download Panda Cloud Antivirus, the first free cloud-based antivirus thin-client. It consists of a lightweight antivirus agent that is connected in real-time to PandaLabs' online Collective Intelligence servers to protect faster against the newest malware variants while barely impacting PC performance. Thanks to Panda Security's Collective Intelligence malware and goodware online database, Panda Cloud Antivirus detects more malware than traditional signature-based solutions which take longer to detect the most recent, and therefore most dangerous, variants. Panda Cloud Antivirus protects you while you browse, play or work and you won't even notice it. It is extremely light as all the work is done online in the cloud. Panda Cloud Antivirus provides you with the fastest protection against the newest viruses thanks to its cloud-scanning from PandaLabs' servers. Panda Cloud Antivirus is truly install and forget. Don't worry about updates, configuration or complicated decisions ever again. With Panda Cloud Antivirus, Panda Security is introducing a new protection model that utilizes a thin-client agent and server architecture which processes and blocks malware more efficiently than locally installed signature-based products. Traditional antivirus products for PCs rely on multiple locally installed technologies which intercept each file at different layers (entry vector, file system and execution) and scan them using various techniques (antivirus, heuristics, intrusion prevention, behavioral analysis, etc.). This process results in heavy usage of local PC memory and CPU resources, negatively impacting performance Panda Cloud Antivirus includes local and remote antivirus, anti-spyware, anti-rootkit, heuristics and goodware cache, while only consuming an average of 22 MB of RAM and 50 percent of the PC performance impact as compared to the industry average.\n\nJust Install and forget about it 100% clean Enjoy","torrent":{"xt":"urn:btih:43caabe43f4f62785ff634a7644e7d0fe7d1d0f9","amp;dn":"Panda+Cloud+Antivirus+Free+Edition+1.0.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43caabe43f4f62785ff634a7644e7d0fe7d1d0f9","infoHashBuffer":{"type":"Buffer","data":[67,202,171,228,63,79,98,120,95,246,52,167,100,78,125,15,231,209,208,249]},"announce":[],"urlList":[]}}