{"title":"Battlefield Anthology [RG Mechanics]","uid":12587583,"size":70235989323,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4426303cadcc3c05fdead289896786780525005b&amp;dn=Battlefield+Anthology+%5BRG+Mechanics%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"Pirata","files":82,"time":1445046196,"description":"Battlefield Anthology [R.G. Mechanics] (Size: 65.41 GB)\n\n01. Battlefield 1942\n\n02. Battlefield Vietnam\n\n03. Battlefield 2\n\n04. Battlefield Bad Company 2\n\n05. Battlefield 3\n\n06. Battlefield 4\n\n07. Battlefield Hardline\n\nBattlefield 1942\n\nINFORMATION:\n\nYear: 2002\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: enclosing\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows XP, Windows Vista, Windows 7\n✔ Processor: Intel Pentium III 500 MHz\n✔ Memory: 128 MB\n✔ 32 MB video card ::\n✔ Sound Card: Sound device compatible with DirectX 8.1\n✔ Free hard drive space: 2 GB\n\nDESCRIPTION:\n\nStalingrad, Kursk, Berlin, Kharkov, to Guadalcanal, Tobruk, Wake Island ... The battles in this game takes place in all the &quot;hot spots&quot; known to us by the Second World. Imagine storming Omaha beach in the spirit of &quot;Saving Private Ryan,&quot; in which you could participate or release of Iwo Jima in the best tradition of films of the same name. Players have plenty of opportunities: from the management of the submarine to shooting enemies with a sniper rifle. Battles take place for the control points are placed on each of the cards. During the capture of these points side gets the advantage of technology and the emergence of a new spawn point. Each type of technology - a unique gameplay that will have to re-learn. In the aircraft exactly as the tank has its own strengths and weaknesses, to delve into that you will more than a dozen hours. In total, the game features more than 20 types of equipment for each of the 6 warring parties. 5 sets of infantry. 35 cards (including new ones).\n\nBattlefield: Vietnam\n\nINFORMATION:\n\nYear: 2004\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: THE JOKER SS\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows XP, Windows Vista, Windows 7\n✔ Processor: Intel Intel Pentium or AMD K6 933 MHz with a frequency\n✔ Memory: 256 MB\n✔ 64 MB video card ::\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard drive space: 2.2 GB\n\nDESCRIPTION:\n\nWelcome to the Vietnam-era one of the bloodiest conflicts of the XX century! In Battlefield Vietnam, the first full-fledged sequel to the popular action movie network, you will find literally a new universe: rich colors of tropical jungle, helicopter gunships, shedding the green fields of fire napalm rivers and fearless guerrillas, causing precise strikes right to the heart of American troops. Changing the theater of war completely changes the strategy and tactics of the game. The developers made hundreds of significant changes in the gameplay; completely redesigned graphics. Before you do a completely new game that is sure to succeed Battlefield 1942 as leader of today's network of entertainment!\n\nBattlefield 2\n\nNFORMATION:\n\nYear: 2005\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: Not required\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows XP, Windows Vista, Windows 7\n✔ Processor: Intel Pentium 4 1.7 GHz or equivalent AMD Performance\n✔ Memory: 512 MB\n✔ 128 MB Video Card ::\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard drive space: 3.7 GB\n\nDESCRIPTION:\n\nContinuation of one of the most popular network of military and strategic militants for PC - Battlefield, retaining all the best elements of Battlefield 1942 and Battlefield Vietnam, puts the player in cutting-edge, where military clashes involving only the most modern combat systems, better armored vehicles, planes, helicopters and huge stockpiles of small arms and explosives ...\n\nBattlefield: Bad Company 2\n\nINFORMATION:\n\nYear: 2010\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: Not required\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows XP, Windows Vista, Windows 7\n✔ Processor: Core 2 Duo processor with a frequency of 2.0GHz\n✔ Memory: 2 GB\n✔ Video Card 256 MB (Nvidia GeForce 7800 GT or ATI X1900)\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard drive space: 4.6 GB\n\nDESCRIPTION:\n\nRetaining all the best traditions of the series, Battlefield: Bad Company 2 offers fans the attention of a lot of games interesting new features. Fighting to be in very different circumstances: in the snowy forests and jungle, in the hot deserts and inaccessible mountains, which involves the use of appropriate tactics. Also, players will be able to realize the unique tactics, using in combat new types of equipment, including all-terrain vehicle (ATV) and helicopter UH-60. In addition, the project provided ample opportunities for modification of equipment and various devices that greatly expand the number of available sets of equipment, weapons and combat vehicles. Due to improvements made by developers in a unique graphics engine, Frostbite, the game used in modern visual effects, realistic damage system.\n\nBattlefield 3\n\nINFORMATION:\n\nYear: 2011\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: enclosing\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows Vista, Windows 7\n✔ Processor: Intel Pentium Core 2 Duo 2.4 Ghz / Athlon X2 2.7 Ghz\n✔ Memory: 1 GB (Nvidia GeForce GTX 560 / ATI Radeon 6950)\n✔ :: Video Card 256 MB (Nvidia GeForce 7800 GT or ATI X1900)\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard disk space: 24.5 GB\n\nDESCRIPTION:\n\nBattlefield 3 leaves behind all its competitors, thanks to the incredible power of the new game engine Frostbite ™ 2 from DICE. In this work of art based the entire Battlefield 3, offering the player a great quality graphics, locations of incredible magnitude, the total destruction of objects, dynamic sound and realistic character animation. You will be able to experience the battlefield like never before, with the whistling bullets around, crumbling walls and knocks you off your feet by explosions. In Battlefield 3, players will become an elite US Marine Corps and immerse yourself in the exciting task of single player and superb multiplayer battles across the world, including Paris, Tehran and New York.\n\nBattlefield 4\n\nINFORMATION:\n\nYear: 2013\nGenre: Action, Shooter, 1st Person\nDeveloper: DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: enclosing\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows Vista, Windows 7, Windows 8\n✔ Processor: Intel Core 2 Duo E6400 or equivalent AMD processor with a clock speed of 2.4 GHz or higher\n✔ Memory: 4GB\n✔ The card :: Nvidia GeForce 8800 GT or AMD Radeon HD 3870 and above\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard disk space: 23.5 GB\n\nDESCRIPTION:\n\nBattlefield 4 ™ - a defining genre, full of action fighter, known for its destructible, which has no equal. Based on a powerful and reliable graphics technology Frostbite ™ 3, Battlefield 4 offers dive into the gaming environment, is striking in its realism. Only in Battlefield you can destroy buildings, where the enemy is hiding. Only in Battlefield you will lead the assault, while on board combat boats. Battlefield gives you more freedom in actions and deeds, enabling to use their own advantages and pave the way to victory. In addition to the standard multiplayer, Battlefield 4 has a rich dramatic campaign with interesting characters that starts with the evacuation of American VIP-persons from Shanghai, and talks about the future of your team attempts to find a way home. It can not be compared to anything else. Immerse yourself in the wonderful chaos of total war, characteristic only for games in the series Battlefield.\n\nBattlefield: Hardline\n\nINFORMATION:\nYear: 2015\nGenre: Action, Shooter, 1st Person\nDeveloper: Visceral Games, DICE\nPublisher: Electronic Arts\nLanguage: RUS | ENG\nTablet: CPY\n\nSYSTEM REQUIREMENTS:\n\n✔ Operating system: Windows Vista, Windows 7, Windows 8 (x64 only)\n✔ Processor: IntelAthlon II / Phenom II 2,8 GHz, Intel Core I3 / I5 2,4 GHz\n✔ Memory: 4GB\n✔ The card :: ATI 5770 with 1 GB of video memory or better / Nvidia GTX260 with 896 MB of video memory or better (DirectX: 11.0)\n✔ Sound Card: Sound device compatible with DirectX 9\n✔ Free hard drive space: 37 GB\n\nDESCRIPTION:\n\nWho has long dreamed to try yourself in the role of the mafia or the police will be able to dream a reality in Battlefield ™ Hardline. Players are waiting for unrivaled multiplayer mode Battlefield and fascinating story in the setting reminiscent of modern crime drama. Battlefield ™ Hardline become your new field shootouts.\n\n\nFeatures repack / rips:\n\nBattlefield 1942\n \nGame Version - v1.61b\nDo not cut / recoded\n\nAdditions:\n\nThe Road To Rome Add-on;\nSecret Weapons of WWII Add-on\n\nBattlefield: Vietnam\n \nGame Version - v1.21\nDo not cut / recoded\nSewn crack text ZoG\n\nBattlefield 2\n \nGame Version - v1.50\nDo not cut / recoded\nSewn crack text ZoG\n\nBattlefield: Bad Company 2\n\nGame Version - v795745\nDo not recoded\nCut multiplayer\nAbility to select a combination of text and voice (voice selected from the game settings menu)\n\nAdditions:\n\nVietnam\n\nBattlefield 3\n\nGame Version - v1.6.0.0 (build: 1147186) [Update 9]\nDo not recoded\nCut out the multiplayer, co-op\nAbility to select a combination of text and voice (sound selected in the game settings menu)\n\nBattlefield 4\n \nGame Version - build.v.1.0.104788 [Update 11]\nDo not recoded\nCut multiplayer\nAbility to select a combination of text and voice (English voice acting in the game settings, select)\n\nBattlefield: Hardline\n \nGame Version - 1.07.15.00\nDo not cut / recoded\nAbility to select a combination of text and voice (English voice acting in the game settings, select)\nThe ability to download only the necessary voice acting (voices_ru.bin - Russian | voices_en.bin - English)\n\nAdditions:\n\n- Battle Set &quot;Universal&quot;: multi-purpose combat rifle, a unique camouflage for weapons and amplifier expertise;\n- Battle set of &quot;accuracy&quot;, one of the most accurate assault rifles, a unique camouflage for weapons and amplifier expertise;\n- Battle set of &quot;suppression&quot;: a rifle with the bulk store, a unique camouflage for all your weapons and experience of the amplifier;\n- 10 gold combat sets, each of which contains additional tools, patches and emblems, amplifiers experience and items for the character;\n- You will receive one set of gold per week for ten weeks from the date of activation of the game.\n\nThe solution to the passage of the 8th mission:\n\nWe found a nontrivial solution of this glitch.\nOn the steps:\n\n1. go to the farm and look katstsenku.\n2. Up to the end of the cutscene (until they have not withdrawn) go to options and unscrew the schedule for ultra high, set the field &quot;zoom&quot; and &quot;image field&quot; to maximum, turn vsync.\n3. Start log and wait until we throw into the camera. watch a cutscene where boomer opens the lock. I need to walk out the door.\n4. pass autosave and then can be played in the usual manner. simply resetting.\n\nConservation after it (who need):\n\nUnzip into C: / Users /% username% / Documents / BFH\nhttp://rghost.ru/6jhwQy7KF\nhttp://www22.zippyshare.com/v/zA5qkLXY/file.html\nhttp://multi-up.com/1062736[/code]","torrent":{"xt":"urn:btih:4426303cadcc3c05fdead289896786780525005b","amp;dn":"Battlefield+Anthology+%5BRG+Mechanics%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4426303cadcc3c05fdead289896786780525005b","infoHashBuffer":{"type":"Buffer","data":[68,38,48,60,173,204,60,5,253,234,210,137,137,103,134,120,5,37,0,91]},"announce":[],"urlList":[]}}