{"title":"An Abundance of Katherines by John Green","uid":5195280,"size":95693773,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:44700886112695d5247a8cb7cff62c4567da3c67&amp;dn=An+Abundance+of+Katherines+by+John+Green&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"songyet","files":6,"time":1259892856,"description":"Author John Green follows his Printz-winning Looking for Alaska (2005) with another sharp, intelligent story, this one full of mathematical problems, historical references, word puzzles, and footnotes. Colin Singleton believes he is a washed-up child prodigy. A graduating valedictorian with a talent for creating anagrams, he fears he'll never do anything to classify him as a genius. To make matters worse, he has just been dumped by his most recent girlfriend (all of them have been named Katherine), and he's inconsolable. What better time for a road trip! He and his buddy Hassan load up the gray Olds (Satan's Hearse) and leave Chicago. They make it as far as Gutshot, Tennessee, where they stop to tour the gravesite of Archduke Franz Ferdinand, and meet a girl who isn't named Katherine. It's this girl, Lindsey, who helps Colin work on a mathematical theorem to predict the duration of romantic relationships. The laugh-out-loud humor ranges from delightfully sophomoric to subtly intellectual, and the boys' sarcastic repartee will help readers navigate the slower parts of the story, which involve local history interviews. The idea behind the book is that everyone's story counts, and what Colin's contributes to the world, no matter how small it may seem to him, will, indeed, matter. An appendix explaining the complex math is &quot;fantastic,&quot; or as the anagrammatically inclined Green might have it, it's enough to make &quot;cats faint.&quot; \n\nRead by Jeff Woodman.\n\nUnabridged, approx. 7 hours.","torrent":{"xt":"urn:btih:44700886112695d5247a8cb7cff62c4567da3c67","amp;dn":"An+Abundance+of+Katherines+by+John+Green","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44700886112695d5247a8cb7cff62c4567da3c67","infoHashBuffer":{"type":"Buffer","data":[68,112,8,134,17,38,149,213,36,122,140,183,207,246,44,69,103,218,60,103]},"announce":[],"urlList":[]}}