{"title":"Elizabeth I  (2005)  -  Helen Mirren and Jeremy Irons","uid":4614099,"size":1469532207,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:447396d15c14cb8a16312455a9e69c79d564c677&amp;dn=Elizabeth+I++%282005%29++-++Helen+Mirren+and+Jeremy+Irons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"sheila6","files":3,"time":1230745664,"description":"Elizabeth I is a 2005 British television miniseries directed by Tom Hooper. The teleplay by Nigel Williams concentrates on the last 25 years of the nearly 45-year-long reign of Elizabeth I of England.\n\n\n\nPlot:\n\nPart One focuses on Elizabeth's close and volatile relationship with her oldest friend and confidant, the Earl of Leicester, as it survives her contemplated marriage to the considerably younger Duke of Anjou, the Babington Plot, war with Spain, and his exile from and eventual return to the court, finally ending with his death in 1588.\n\nPart Two follows Elizabeth through her later years, during which she has a passionate affair with the stepson of the Earl of Leicester, the much younger Earl of Essex, whose political ambitions frequently clash with his devotion and loyalty to the monarch. As Elizabeth finds her young lover's behaviour becoming increasingly worrisome, she draws closer to Robert Cecil, who is named Secretary of State following the death of Sir Francis Walsingham.\n\nChief among the problems facing the throne is the question of a successor, given Elizabeth has no heirs. Both the queen's first cousin, the imprisoned Mary, Queen of Scots, and Mary's son, James VI of Scotland, would like to usurp Elizabeth from her position, but she is determined neither one will take her place.\n\n\n\nHistorical Inaccuracies:\n\nAs in the 1800 play Mary Stuart by Friedrich Schiller, Elizabeth visits Mary, Queen of Scots in prison, although the cousins never met in real life.\n\nIn 1588, while waiting on the beach to see if the Spanish Armada is about to invade England, the Earl of Leicester uses a telescope to identify the flag on a ship sailing up the river. The telescope wasn't invented by Hans Lippershey until 1608.\n\nMary, Queen of Scots is beheaded in a courtyard, but according to accounts written at the time she actually was executed inside Fotheringhay Castle.\n\nRobert Cecil presents Elizabeth with a poem the Earl of Essex allegedly wrote just before his execution. The piece she reads aloud actually was the work of Chidiock Tichbourne, who wrote it in the Tower of London the day before he was hung, drawn and quartered for the role he played in the Babington Plot.\n\n\n\nCast:\n\n* Helen Mirren ..... Elizabeth I\n* Jeremy Irons ..... Earl of Leicester\n* Hugh Dancy ..... Earl of Essex\n* Toby Jones ..... Robert Cecil\n* Patrick Malahide ..... Sir Francis Walsingham\n* Ian McDiarmid ..... Lord Burghley\n* JÃƒÂ©rÃƒÂ©mie Covillault ..... Duke of Anjou\n* Barbara Flynn ..... Mary, Queen of Scots\n* Ewen Bremner ..... James VI, King of Scots\n* Toby Salaman ..... Dr Lopez\n* Charlotte Asprey ..... Frances Walsingham\n* Geoffrey Streatfield ..... Sir Anthony Babington\n* David Delve ..... Sir Francis Drake\n* Martin Marquez ..... Don Bernardino de Mendoza\n* Rimantas Bagdzevicius ..... Lord Howard of Effingham\n* Will Keen ..... Francis Bacon\n* Eddie Redmayne ..... Earl of Southampton\n* Ben Pullen ..... Sir Walter Raleigh\n* Diana Kent ..... Lady Essex","torrent":{"xt":"urn:btih:447396d15c14cb8a16312455a9e69c79d564c677","amp;dn":"Elizabeth+I++%282005%29++-++Helen+Mirren+and+Jeremy+Irons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"447396d15c14cb8a16312455a9e69c79d564c677","infoHashBuffer":{"type":"Buffer","data":[68,115,150,209,92,20,203,138,22,49,36,85,169,230,156,121,213,100,198,119]},"announce":[],"urlList":[]}}