{"title":"Miss Marple, The Body in the Library(2004)-Dvdrip-English--Wolfy","uid":4948978,"size":839327744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:447c0c03ffad75f922ee1fb26e9c1ffd191d69e5&amp;dn=Miss+Marple%2C+The+Body+in+the+Library%282004%29-Dvdrip-English--Wolfy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"wolfy100","files":1,"time":1244798877,"description":"Runtime:- 94 mins\n\nGenre:- Murder, Mystery&lt; Drama\n\nPlot:-\n\nA young woman's corpse is dumped in the library of Gossington Hall, home of Jane Marple's friend Dolly Bantry and her husband Arthur. Pompous Chief Constable Melchett suspects a connection with Basil Blake, an arty young man who lives locally but Blake is dismissive when Melchett visits him. Then Superintendent Harper rings from the coastal town of Danemouth. Ruby Keane, a young girl employed as a dancer at the Majestic Hotel there, has gone missing, and her cousin Josie Turner identifies the corpse as Ruby's. Ruby is in favour with millionaire Conway Jefferson, whose own son and daughter were killed in a wartime air raid, and he wants to adopt her. His son-in-law Mark Gaskell, and daughter-in-law Adelaide react variously to the news. Miss Marple is convinced that the solution to Ruby's murder may be found at the hotel and she and Dolly book into a suite to investigate. There is no shortage of suspects, not only family members but the handsome Raymond Starr, another of the hotel's dance professionals, and George Bartlett, the last person to see Ruby before her disappearance. \n\n\nPlease seed as long as possible.....\n\nPlease leaver a comment on quality for others to know. Thankyou.. Wolfy","torrent":{"xt":"urn:btih:447c0c03ffad75f922ee1fb26e9c1ffd191d69e5","amp;dn":"Miss+Marple%2C+The+Body+in+the+Library%282004%29-Dvdrip-English--Wolfy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"447c0c03ffad75f922ee1fb26e9c1ffd191d69e5","infoHashBuffer":{"type":"Buffer","data":[68,124,12,3,255,173,117,249,34,238,31,178,110,156,31,253,25,29,105,229]},"announce":[],"urlList":[]}}