{"title":"Engineering a Compiler, 2nd Edition {BBS}","uid":6813657,"size":8667894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4489dfcf9f783b19d710292b5c1091d3aaaa4e5a&amp;dn=Engineering+a+Compiler%2C+2nd+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321119243,"description":"The proliferation of processors, environments, and constraints on systems has cast compiler technology into a wider variety of settings, changing the compiler and compiler writer's role. No longer is execution speed the sole criterion for judging compiled code. Today, code might be judged on how small it is, how much power it consumes, how well it compresses, or how many page faults it generates. In this evolving environment, the task of building a successful compiler relies upon the compiler writer's ability to balance and blend algorithms, engineering insights, and careful planning. Today's compiler writer must choose a path through a design space that is filled with diverse alternatives, each with distinct costs, advantages, and complexities.\n\nEngineering a Compiler explores this design space by presenting some of the ways these problems have been solved, and the constraints that made each of those solutions attractive. By understanding the parameters of the problem and their impact on compiler design, the authors hope to convey both the depth of the problems and the breadth of possible solutions. Their goal is to cover a broad enough selection of material to show readers that real tradeoffs exist, and that the impact of those choices can be both subtle and far-reaching.\n\nAuthors Keith Cooper and Linda Torczon convey both the art and the science of compiler construction and show best practice algorithms for the major passes of a compiler. Their text re-balances the curriculum for an introductory course in compiler construction to reflect the issues that arise in current practice.\n\nÃ‚Â·Focuses on the back end of the compiler-reflecting the focus of research and development over the last decade.\nÃ‚Â·Uses the well-developed theory from scanning and parsing to introduce concepts that play a critical role in optimization and code generation.\nÃ‚Â·Introduces the student to optimization through data-flow analysis, SSA form, and a selection of scalar optimizations.\nÃ‚Â·Builds on this background to teach modern methods in code generation: instruction selection, instruction scheduling, and register allocation.\nÃ‚Â·Presents examples in several different programming languages in order to best illustrate the concept. \n\n\n# Hardcover: 824 pages\n# Publisher: Morgan Kaufmann; 2 edition (February 21, 2011)\n# Language: English\n# ISBN-10: 012088478X\n# ISBN-13: 978-0120884780","torrent":{"xt":"urn:btih:4489dfcf9f783b19d710292b5c1091d3aaaa4e5a","amp;dn":"Engineering+a+Compiler%2C+2nd+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4489dfcf9f783b19d710292b5c1091d3aaaa4e5a","infoHashBuffer":{"type":"Buffer","data":[68,137,223,207,159,120,59,25,215,16,41,43,92,16,145,211,170,170,78,90]},"announce":[],"urlList":[]}}