{"title":"GTA II v9.6 (2-click run)","uid":11897374,"size":314759619,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:44c8f60570afe661b9faaf3390090b284b012c84&amp;dn=GTA+II+v9.6+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"The_Duck1","files":4,"time":1431203772,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nSCREENSHOTS: &lt;a href=&quot;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=73868f082857e26db0b2e7398ffd41ec.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=73868f082857e26db0b2e7398ffd41ec.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=d3e44b3b89ba8e3e264ae5de201f0a4d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=d3e44b3b89ba8e3e264ae5de201f0a4d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=f14750e413e663b3d56fe54c15a38027.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://games.friendsinwar.com/infusions/image_hosting/v.php?id=f14750e413e663b3d56fe54c15a38027.png&lt;/a&gt;\n\nDESCRIPTION:\nGrand Theft Auto 2 retained the overhead viewpoint of Grand Theft Auto, as well as the car-stealing/telephone-answering formula of the original. The player has the ability to explore cities on foot or in various vehicles. The aim is to achieve a certain score. On achieving this goal the player then can proceed to the next level. Doing missions awards the player more points than any other method but are not essential for completion of the game.\n\nA new feature introduced in Grand Theft Auto 2 was doing missions for separate gangs, of which there are two new gangs for each of the three levels of the game, and one faction which is present in all levels. Being employed by one gang can cause distrust from others (working for gang #1 will incur the wrath of gang #2, working for gang #2 will cause enmity with gang #3, etc.). In the original Grand Theft Auto, only the local police pursued the player. In Grand Theft Auto 2, SWAT teams (4 Copheads) are introduced in the Downtown District, while Special Agents (5 Copheads) and the army (6 Copheads) are introduced in the Residential and Industrial Districts. These additional types of law enforcement begin chasing the player as his or her wanted level increases. The wanted level is represented by images of a cop's head, and vary between the Windows and PlayStation versions.\n\nGrand Theft Auto 2 introduced an improved saving technique, unlike the original game, which saved only when finishing a city. If the player entered a church with $50,000, a voice announced &quot;Hallelujah! Another soul saved!&quot;. This notified the player that the game had been saved. If the player did not have enough money, the voice would say &quot;Damnation! No donation, no salvation!&quot;. These messages are not heard on the PlayStation version.\n\nOther improvements pertain to city activity. Passing vehicles and pedestrians are no longer cosmetic parts of the environment, but actually play a role in gameplay. Sometimes pedestrians would occasionally enter and ride in taxis or buses. The game is noted for the behaviour of its non-player characters. Pedestrians, gang members and the police would occasionally engage in fights, and there are other carjackers (Green sweater) and muggers (Red sweater with white arms) in the city.[4]\n\nThis game introduces 'side missions' such as being a taxi driver, bus driver, and a semi-truck driver along with retrieving 'hidden' packages ('GTA2' Badges) or Wang Cars (play on 'wankers'), and a health meter. Being a taxidriver would earn roughly 1 dollar per second. When standing still, passengers could get out if they want to, and the earnings will stop. Wang Cars only appeared in the second district. They were well hidden and usually required the player to take a severe amount of highspeed jumps to reach the cars, some of them parked on top of buildings. When the car was entered, the player spawned at the Wang Cars garage, with the garagedoor of the collected car lighting up. Collecting all cars resulted in 8 bonus vehicles parked outside the garage. Among these were cars prepped with oilslicks, integrated machineguns and a firetruck, living up its name as its watercannon was replaced with a flamethrower.\n\nSome weapons in Grand Theft Auto 2 feature a &quot;Kill Frenzy&quot; mission when picked up, where a player has a limited amount of time to kill a certain number of people with a particular weapon loaded. Bonuses are rewarded if the mission is successful. Also if a player finds a tank and gets in it a &quot;Kill Frenzy&quot; mission also starts, and finally in random parts of the city are parked special cars, and if the player gets on one he has to either kill people by running them over or kill them with any extra weapon that the car has. There is a bug involving the Kill Frenzy as it is possible to save when having it. When the game is then reloaded, the Kill Frenzy ends, but the almost unlimited ammunition remains until that same weapon is picked up or a more than usually allowed amount of ammunition is wasted.\n\nThe PlayStation version of Grand Theft Auto 2 is toned down from the PC version, with lower quotas for the number of kills needed in rampage style missions, and containing no voice acting in the saving interface. The port also includes a feature where the player car will explode after the player kills a large number of gang members. One mission was also changed. Instead of the player tricking civilians into entering a bus to drive them to a meat processing plant to be cannibalised, the victims are Hare Krishna gang members.\n\nAs is the case with the original Grand Theft Auto and GTA London: 1969, the player receives bonuses for running his car over certain people without stopping or braking. A string of Elvis impersonators are sometimes spotted walking the streets. If a player can kill them in a short amount of time, they are awarded with a large money bonus, followed by the bold words &quot;ELVIS HAS LEFT THE BUILDING&quot;.\n\nGrand Theft Auto also features four multiplayer modes: Deathmatch, Team Deathmatch, Tag and Race.\n\nThere are trains in the PC version, which the players can ride on.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program","torrent":{"xt":"urn:btih:44c8f60570afe661b9faaf3390090b284b012c84","amp;dn":"GTA+II+v9.6+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c8f60570afe661b9faaf3390090b284b012c84","infoHashBuffer":{"type":"Buffer","data":[68,200,246,5,112,175,230,97,185,250,175,51,144,9,11,40,75,1,44,132]},"announce":[],"urlList":[]}}