{"title":"MOMS BANG TEENS - Brandi Love + Lia Lor - Mother Daughter Threes","uid":8782267,"size":463084392,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:455ab88ba024530db326954cb8111d534671b6c0&amp;dn=MOMS+BANG+TEENS+-+Brandi+Love+%2B+Lia+Lor+-+Mother+Daughter+Threes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"beta2008x","files":1,"time":1375742179,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=v90qu_soothing_sensation_b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=v90qu_soothing_sensation_b.jpg&lt;/a&gt;\n\nLia and her boyfriend, Seth, were doing research for an essay that was due the next day. They soon realized that they were missing a book that contained critical information needed to complete it. Fortunately, Seth's friend Mark had a copy of the book. Mark lived an hour away and after comforting Lia by reassuring her that his stepmom was really cool, Seth went to pick it up. Lia was curiously attracted to Mark's sexy stepmom, Brandi, so she crept around the house trying to find her. She wanted to get glimpse of Brandi's amazing hardbody but her plan went awry when she walked in the master bathroom and was caught red-handed by a naked horny stepmom who loves young pussy. Lia attempted to come up with an excuse as to why she was in the master bathroom when there were three other bathrooms but she was cut off mid sentence and pounced on by Brandi. Lia admitted that she was attracted to older women while she was getting her pretty pussy rubbed. Brandi had Lia wet and under her complete control so she took her into the bedroom and began tongue fucking her. Brandi was caught with her tongue in Lia's tight little asshole by her stepson who was in total shock. She immediately grabbed him and told him to man up, join the fun or leave. Soon after Seth realized that he was presented with an opportunity of a lifetime, he joined his stepmom and girlfriend in an all out orgy.","torrent":{"xt":"urn:btih:455ab88ba024530db326954cb8111d534671b6c0","amp;dn":"MOMS+BANG+TEENS+-+Brandi+Love+%2B+Lia+Lor+-+Mother+Daughter+Threes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"455ab88ba024530db326954cb8111d534671b6c0","infoHashBuffer":{"type":"Buffer","data":[69,90,184,139,160,36,83,13,179,38,149,76,184,17,29,83,70,113,182,192]},"announce":[],"urlList":[]}}