{"title":"Investment Psychology Explained: Classic Strategies to Beat the ","uid":9313028,"size":6175703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:459b5164b01e5336eab064fa01576233af3a5d44&amp;dn=Investment+Psychology+Explained%3A+Classic+Strategies+to+Beat+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386430356,"description":"Description\nExpert advice in a back-to-basics handbook on how to beat the market-the classic way\n\nIn Investment Psychology Explained Martin J. Pring, one of the most respected independent investment advisors in the world, argues that in the revisionist '90s there are no quick, magical paths to market success. Rather, he emphasizes the timeless values of hard work, patience, and self-discipline-and much more. Drawing on the wisdom of creative investors such as Jesse Livermore, Humphrey Neill, and Barnard Baruch, as well as his own experience, Pring shows how to:\n* Overcome emotional and psychological impediments that distort decision making\n* Map out an independent investment plan-and stick to it\n* Know when to buck herd opinion-and &quot;go contrarian&quot;\n* Dispense with the myths and delusions that drag down other investors\n* Resist the fads and so-called experts whose siren call to success can lead to disaster\n* Exploit fast-breaking news events that rock the market\n* Deal skillfully with brokers and money managers\n* Learn and understand the rules that separate the truly great investors and traders from the rest\n\nReading Investment Psychology Explained will give you a renewed appreciation of the classic trading principles that, through bull and bear markets, have worked time and again. You'll see, with the help of numerous illustrative examples, what goes into making an effective investor-and how you can work toward achieving that successful profile.\n\n\nTable of Contents\nKNOWING YOURSELF.\n\nThere Is No Holy Grail.\n\nHow to Be Objective.\n\nIndependent Thinking.\n\nPride Goes Before a Loss.\n\nPatience Is a Profitable Virtue.\n\nStaying the Course.\n\nTHE WALL STREET HERD.\n\nA New Look at Contrary Opinion.\n\nWhen to Go Contrary.\n\nHow to Profit from Newsbreaks.\n\nDealing with Brokers and Money Managers the Smart Way.\n\nSTAYING ONE STEP AHEAD.\n\nWhat Makes a Great Trader or Investor?\n\nNineteen Trading Rules for Greater Profits.\n\nMaking a Plan and Sticking to It.\n\nClassic Trading Rules.\n\nBibliography.\n\nIndex.\n\n\nAuthor Information\nMARTIN J. PRING is publisher of the highly regarded newsletter, The Pring Market Review. A frequent contributor to Barron's and other leading investment periodicals, he is the author of The All-Season Investor, the bestselling Technical Analysis Explained, and a number of other books on interest rates, international investing, and commodities and futures.","torrent":{"xt":"urn:btih:459b5164b01e5336eab064fa01576233af3a5d44","amp;dn":"Investment+Psychology+Explained%3A+Classic+Strategies+to+Beat+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"459b5164b01e5336eab064fa01576233af3a5d44","infoHashBuffer":{"type":"Buffer","data":[69,155,81,100,176,30,83,54,234,176,100,250,1,87,98,51,175,58,93,68]},"announce":[],"urlList":[]}}