{"title":"Aaron P. Nelson - Harvard Medical School Guide to Achieving Opti","uid":10033654,"size":3596869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45b962ae05e442fdd7bdb96f6424d8fa707e3c6e&amp;dn=Aaron+P.+Nelson+-+Harvard+Medical+School+Guide+to+Achieving+Opti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Anette14","files":-1,"time":1398371461,"description":"Description\nProduct Details\nBook Title: Harvard Medical School Guide to Achieving Optimal Memory (Harvard Medical School Guides)\t\nBook Author: Aaron Nelson (Author), Susan Gilbert (Author)\nSeries: Harvard Medical School Guides\nPaperback: 256 pages\nPublisher: McGraw-Hill; 1 edition (March 23, 2005)\nLanguage: English\nISBN-10: 007144470X\nISBN-13: 978-0071444705\n\n===================================================================================\nBook Description\nThis is the latest, best information on how to make your memory the best it can be, from a leading doctor in the field. It covers how much lifestyle factors such as sleep, nutrition, and exercise, affect memory, how to tell if you need to see a doctor, and gives proven ways to build your memory power. It is written by a world-renowned authority at Harvard Medical School and Brigham and Women's, consistently ranked as one of the leading hospitals in the U.S. It contains the latest, best, medical practices as well as what we know about alternative approaches, and a recommended lifestyle program. It covers the latest research on topics such as sleep's role in memory, what is &quot;normal&quot; memory as we age, and what to do about &quot;senior moments.&quot; It contains boxed items sprinkled throughout, on topics such as &quot;Medical Myths&quot; and &quot;Questions Patients Ask.&quot;\n===================================================================================\nFrom the Back Cover\nFrom a leading expert at one of the world's most respected medical schools--a complete program for achieving optimal memory, for life!\nEver find yourself walking into a room and forgetting why? Having trouble remembering that pesky password or your siblings' birthdays? Don't panic. Memory lapses like these are common, especially after age forty. But memory loss isn't inevitable or irreversible. You can achieve optimal memory at any age--and this book shows you how.\nDr. Aaron P. Nelson, a member of the Harvard Medical School faculty and a clinical neuropsychologist, has helped thousands of patients with memory and other cognitive problems. In his easy-to-understand guide you'll find:\n*** How to know if you've got a problem and how to have it evaluated\n*** How factors such as smoking, poor nutrition, and a sedentary lifestyle can hurt your memory\n*** A complete memory-optimizing program, including mental exercises, nutrition, tips for remembering important things, and more\n*** Current and future treatment options for serious memory impairment\n===================================================================================\nAbout the Harvard Medical School health guide series\nEach book from Harvard Medical School gives you the knowledge you need to understand and take control of your health. In every book, a world-renowned expert from Harvard Medical School provides you with the latest information on diagnosis, traditional and alternative treatments, home remedies, and lifestyle changes that can make a powerful difference in your health.\n===================================================================================\nAbout the Author\nAaron P. Nelson, Ph.D., is Chief of Neuropsychology, Division of Cognitive and Behavioral Neurology, Brigham and Women's Hospital, and an assistant professor of psychology in the Department of Psychiatry at Harvard Medical School. Susan Gilbert is a medical journalist who writes for the New York Times and other publications.\n===================================================================================","torrent":{"xt":"urn:btih:45b962ae05e442fdd7bdb96f6424d8fa707e3c6e","amp;dn":"Aaron+P.+Nelson+-+Harvard+Medical+School+Guide+to+Achieving+Opti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45b962ae05e442fdd7bdb96f6424d8fa707e3c6e","infoHashBuffer":{"type":"Buffer","data":[69,185,98,174,5,228,66,253,215,189,185,111,100,36,216,250,112,126,60,110]},"announce":[],"urlList":[]}}