{"title":"The Wheel of Time Series","uid":8750805,"size":8607785798,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:45e75681903e02c8506c4e2123de437082eb9d94&amp;dn=The+Wheel+of+Time+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"AN0NYMOUS142857","files":15,"time":1375027096,"description":"\nThe prequel novel New Spring takes place during the Aiel War and chronicles the end of that conflict and the discovery by the Aes Sedai that one of the Prophecies of the Dragon has been fulfilled, that the Dragon has been Reborn. Aes Sedai agents (including a young Moiraine Damodred) are dispatched to try to find the newborn child before servants of the Shadow can do the same.\n\n\nThe series proper commences almost twenty years later in the Two Rivers, a near-forgotten backwater district of the country of Andor. An Aes Sedai, Moiraine, and her Warder Lan, arrive mysteriously in the village of Emond's Field, secretly aware that servants of the Dark One are searching for one particular young man living in the area. Moiraine is unable to determine which of three youths (Rand al'Thor, Matrim Cauthon or Perrin Aybara) is the Dragon Reborn, so she takes all three of them out of the Two Rivers, along with their friend Egwene al'Vere. Nynaeve al'Meara, the unusually young village Wisdom (a healer or wise-woman figure), later meets up with them at the town of Baerlon. The men are mystified why Moiraine has allowed Egwene and Nynaeve to travel with them, until it is revealed that both of them can channel the One Power and learn to be Aes Sedai. A mysterious old gleeman named Thom Merrilin also travels with the group, claiming he wants to travel in safety when leaving the Two Rivers. The first novel depicts their flight from various agents of the Shadow and their attempts to escape to the Aes Sedai city of Tar Valon.\n\n\nFrom then on, the story expands and the original characters are frequently split into different groups and pursue different missions or agendas aimed at furthering the cause of the Dragon Reborn (revealed to be Rand al'Thor), sometimes thousands of miles apart. The original group of characters from the Two Rivers make new allies, gain experience and become figures of some influence and authority. As they struggle to unite the western kingdoms against the Dark One's forces, their task is complicated by rulers of the nations who refuse to give up their authority and by factions such as the Children of the Light, who do not believe in the prophecies, and the Seanchan, the descendants of a long-lost colony of Artur Hawkwing's empire across the western ocean (Hawkwing had once united the mainland continent under his rule, and sent his son across the ocean to unite those lands as well) who have returned, believing it is their destiny to conquer the world. The Aes Sedai also become divided over the overthrow of their previous leader (an Amyrlin Seat) Siuan Sanche and the installation of Elaida a'Roihan as the new leader. The two sides are split ideologically between those who believe the Aes Sedai should be kept together in this time of crisis and those who believe that Elaida became the Amyrlin Seat through illegal means and want to remove her as an unfit leader. As the story expands, new characters representing different factions are introduced: although this expansion of the narrative allows the sheer scale of the growing struggle to be effectively depicted, it has been criticized for slowing the pace of the novels and sometimes reducing the appearances of the original cast to extended cameos. By the eleventh novel, it has become clear that Tarmon Gai'don, or the Last Battle, caused when the Dark One is able to exert its influence directly on the world once more, is imminent.\n\n\n\n\n\n0. New Spring\n\n\n1. The Eye of the World\n\n\n2. The Great Hunt\n\n\n3. The Dragon Reborn\n\n\n4. The Shadow Rising\n\n\n5. The Fires of Heaven\n\n\n6. Lord of Chaos\n\n\n7. A Crown of Swords\n\n\n8. The Path of Daggers\n\n\n9. Winter's Heart\n\n\n10. Crossroads of Twilight\n\n\n11. Knife of Dreams\n\n\n12. The Gathering Storm\n\n\n13. Towers of Midnight\n\n\nThe files in this torrent were too many to be uploaded as it was so i had to zip them.\n\nUse the free application 7z that can be downloaded from :\n &lt;a href=&quot;\nhttp://www.7-zip.org/download.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.7-zip.org/download.html&lt;/a&gt;\n\nIts one of the best out there and can open rar files amongst other compression formats.\n\n","torrent":{"xt":"urn:btih:45e75681903e02c8506c4e2123de437082eb9d94","amp;dn":"The+Wheel+of+Time+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45e75681903e02c8506c4e2123de437082eb9d94","infoHashBuffer":{"type":"Buffer","data":[69,231,86,129,144,62,2,200,80,108,78,33,35,222,67,112,130,235,157,148]},"announce":[],"urlList":[]}}