{"title":"Hannibal - Season 3 (S03 HDTV x264)","uid":12306688,"size":2414374825,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4616f18cb584b846eb9ba0a99625e3f0de3f10ca&amp;dn=Hannibal+-+Season+3+%28S03+HDTV+x264%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"BillSimmons99","files":13,"time":1440812434,"description":"Filetype: mp4/x264\nSource: HDTV\n\nHannibal is an adaptation of the series of books featuring the character of Doctor Hannibal Lecter. Years before he became an iconic cinematic villain, Hannibal was introduced as a supporting character in the 1981 Thomas Harris novel Red Dragon. The story revolves around former FBI profiler Will Graham coming out of retirement to catch a killer, three years after he was scarred mentally and physically by Lecter. Instead of picking up here, Hannibal begins years earlier with Graham starting his profiling career and Lecter still free and practising psychiatry. The show establishes and puts a good deal of focus on the relationship between Hannibal and Will, extrapolating from the source material to show how much damage Hannibal does to Will. This is notable as not only do the two have no interaction prior to the initial meeting that led to Will's discovery and Hannibal's incarceration in the novel, but the character of Will Graham appears only in Red Dragon before the novels shift Hannibal's attention to the more recognised character of Clarice Starling.\n\nThe series is not a straight forward adaptation. While the series is a lead up to and covers the events of Red Dragon, elements of the other books in the series are also woven in with","torrent":{"xt":"urn:btih:4616f18cb584b846eb9ba0a99625e3f0de3f10ca","amp;dn":"Hannibal+-+Season+3+%28S03+HDTV+x264%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4616f18cb584b846eb9ba0a99625e3f0de3f10ca","infoHashBuffer":{"type":"Buffer","data":[70,22,241,140,181,132,184,70,235,155,160,169,150,37,227,240,222,63,16,202]},"announce":[],"urlList":[]}}