{"title":"The Top 50 Coolest Sharks in the World","uid":15632779,"size":4128302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:461f26306715605af7ef7752559c256ba76ce018&amp;dn=The+Top+50+Coolest+Sharks+in+the+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":1,"time":1471970502,"description":"http://ititli.com/images/uw8ZD76md.jpg\r\n\r\nSharks! Whether you fear them or love them, you can’t deny some very simple facts. These magnificent creatures are some of the most amazing, unique, beautiful, intelligent, and important species to have ever existed on planet Earth. We are incredibly passionate about sharks and it is our pleasure to bring this passion into your home. We know our love of sharks will show through on every page of this unique book.\r\nIs your child showing an interest in sharks? Want them to learn more? Look no further! This is the eBook you’ve been searching for! Better yet, it’s the perfect book to enjoy together! Not too childish, but not too technical. It’s just right. We left out all the fluff and only included the coolest and most interesting facts we could find. If that’s not enough to hold your child’s interest, don’t forget about the amazing pictures that are packed into this book, too!\r\n\r\nBy the way, if you’re an adult and still want this book for yourself, we won’t tell anyone! The information contained in this book is truly something that can be enjoyed no matter how old or young you are.\r\n\r\nThe Top 50 Coolest Sharks in the World! by Lisa Evans\r\nEnglish | 2013 |249 pages | ePUB | 3.90 MB","torrent":{"xt":"urn:btih:461f26306715605af7ef7752559c256ba76ce018","amp;dn":"The+Top+50+Coolest+Sharks+in+the+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461f26306715605af7ef7752559c256ba76ce018","infoHashBuffer":{"type":"Buffer","data":[70,31,38,48,103,21,96,90,247,239,119,82,85,156,37,107,167,108,224,24]},"announce":[],"urlList":[]}}