{"title":"Best Jobs for Ex-Offenders - 2nd Ed (2015) (Pdf and Epub) Gooner","uid":13864262,"size":2348532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:469f85a8f7856367ac9bd0db1b49a4271215a029&amp;dn=Best+Jobs+for+Ex-Offenders+-+2nd+Ed+%282015%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1458057613,"description":"Best Jobs for Ex-Offenders - 101 Opportunities to Jump-Start Your New Life - 2nd Edition (2015) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: Impact Publications; 2 edition (7 Oct. 2015)\r\nLanguage: English\r\nISBN-10: 1570233608\r\nISBN-13: 978-1570233609\r\n\r\nMany ex-offenders have difficulty finding stable jobs that lead to promising futures. Most lack information about opportunities appropriate for their red flag backgrounds. Once released, they often stumble from one low-paying and insecure &quot;hard labor&quot; job to another. Many have difficulty finding satisfying work and keeping a job for long. Unable to adequately support themselves as well as fulfill court-ordered financial obligations, many soon get into trouble that leads them back into prisons and jails. Not surprisingly, much of today s high recidivism rate (60-70%) directly relates to the issue of ex-offender employability and the ease of violating terms of release (fail to meet parole officer and/or pay child support). What they most need is a GOOD JOB to jump-start their new life! Here s the first book to examine jobs suitable for ex-offenders. Profiling 101 opportunities that are relatively open to people with not-so-hot backgrounds, this upbeat book gives renewed hope and direction to ex-offenders who are uncertain what they want to do, can do, and will do in the free world. It profiles 13 categories of jobs and occupations: - Construction trades and related jobs - Installation, maintenance, and repair occupations - Science, moth, engineering, and technology jobs - Production occupations - Transportation and material moving occupations - Travel and hospitality jobs - Computer and Internet jobs - Health and medical care jobs - Sales and related jobs - Sports, entertainment, and media jobs - Office and administrative support jobs - Military, government, and nonprofit jobs - Starting a business Examining most jobs in terms of employment outlook, nature of work, working conditions, education and training requirements, expected earnings, and recommended resources, the book serves as a handy directory for exploring numerous job options appropriate for ex-offenders. Includes summary charts of today s best jobs and separate chapters on transitional employment experiences, job restrictions on ex-offenders, and internal and external barriers to employment. The message throughout is very clear: Ex-offenders ARE employable. Given the right informational tools and an action plan, they CAN become successful. The perfect book for creating a new future filled with freedom, purpose, joy, and prosperity!&quot;","torrent":{"xt":"urn:btih:469f85a8f7856367ac9bd0db1b49a4271215a029","amp;dn":"Best+Jobs+for+Ex-Offenders+-+2nd+Ed+%282015%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"469f85a8f7856367ac9bd0db1b49a4271215a029","infoHashBuffer":{"type":"Buffer","data":[70,159,133,168,247,133,99,103,172,155,208,219,27,73,164,39,18,21,160,41]},"announce":[],"urlList":[]}}