{"title":"Fell (Warren Ellis) (High Quality Scans) (theProletariat-DCP)","uid":7567758,"size":196444714,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:47067fad747b1412753c5560320d39f6bfd46dbf&amp;dn=Fell+%28Warren+Ellis%29+%28High+Quality+Scans%29+%28theProletariat-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"RubrumPopulus","files":-1,"time":1345908695,"description":"Here is another set of rescans that were originally posted to Demonoid, but I see were not posted here.\nThis includes the entire all 9 issues (that have so far been published) of Warren Ellis' dark detective story, Fell.  With wonderful art by the always great Ben Templesmith, this book was an experiment by Ellis in terms of comic format and presentation.  It was an effort by him to compress his story telling into fewer number of pages, but more panels per page.  Giving you a much more dense story, but at a cheaper price due to the reduced page count.  It went on hiatus a few years ago because of Ellis' famous hard drive crash, and has only recently has work been resumed on the series. \nThese are ALL NEW SCANS of this classic story (well, they were new about a year and a half ago but as I said haven't been posted here).  All scans are done at 1680px width.\n========================================================\n\n\nWritten by Warren Ellis; Art by Ben Templesmith\n\nDetective Richard Fell is transferred over the bridge from the big city to Snowtown, a feral district whose police investigations department numbers three and a half people (one detective has no legs). Dumped in this collapsing urban trashzone, Richard Fell is starting all over again. In a place where nothing seems to make any sense, Fell clings to the one thing he knows to be true: everybody's hiding something.\n\n\n\nThanks goes to theProletariat for these scans.","torrent":{"xt":"urn:btih:47067fad747b1412753c5560320d39f6bfd46dbf","amp;dn":"Fell+%28Warren+Ellis%29+%28High+Quality+Scans%29+%28theProletariat-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47067fad747b1412753c5560320d39f6bfd46dbf","infoHashBuffer":{"type":"Buffer","data":[71,6,127,173,116,123,20,18,117,60,85,96,50,13,57,246,191,212,109,191]},"announce":[],"urlList":[]}}