{"title":"Chick Corea - The Chick Corea Elektric Band (1986) [Jazz][mp3 32","uid":5943793,"size":102721405,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:47114e6a1f68f876e9018e4779e3609ab34108b2&amp;dn=Chick+Corea+-+The+Chick+Corea+Elektric+Band+%281986%29+%5BJazz%5D%5Bmp3+32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"schon55","files":15,"time":1289280755,"description":"Chick Corea - The Chick Corea Elektric Band\nYear: 1986\nLabel: GRP Records\nQuality: CBR 320 kbps\n\nOriginal LP tracks\n\nThis is one of the best fusion albums to come out in the past twenty years. My only critism is that the synth's and electric guitar become a little to thick at times. Those of you who are die hard Chick Corea fans will love it. For people who have never listened to him before, this is a great place to start. Great compostions, and great players. As always Chick's incredible musicianship comes shining through all of the electronics. As for me though I still prefer hearing Chick Corea playing in an acoustic setting. ~ Nick S.\n\nThis was my first &quot;jazz&quot; album. I had seen the parody of Chick Corea (or Trick Corea as they called him) in Finnish TV-show and I decided to try this. The sounds and playing on this album are superb. \nCorea is the best fusion composer and his bandmates Weckl and Patitucci are sometimes even claimed to be the very best musicians on their instruments. I also love Carlos Rios' sound and I think that it is pity that Gambale replaced him later. Rios adds some elements to his fast jazz-scale playing that sound like claptonisque blues licks for me.\n\nSynthsounds of mid 80s are very funny. I have searched other fusion album like this but in vain. ~ Arhippa Kaurapuuro\n\nIf you want to hear the Elektric band, this is the album you just have to hear first! This album is the essence of everything Corea's trio was and probaly will be.  Besides just completely sounding straight out of the 1980's, the possibly worst decade for music; this album, musically is just fantastic.  Obviously the acoustic and straight ahead fans won't like this, and right from the title most of them are turned away. I was one of them. But then I got into this little thing called fusion and found out that over time, that it evolved in such a way to produce great albums like this.  The Chick Corea Elektric Band was one of those colorful jazz groups in the 80's to just turn on nice melodic jazz/rock/pop/fusion music. No matter how the critics and jazz purists try to catogorize this into flimsy worthless jazz idioms, I must say, as a lover of jazz of any kind (excluding that awful R&amp;B influenced popular radio deamed as 'smooth jazz') I aboslutely love the music on this disk.  All musicians were top notch at the time, and went on to become great successers. Chick is absolutely spoken for as John Pattitucci and Dave Weckl prove to be two of jazz's greatest rhythm team players.   I own a copy of this band playing a gig around the time this album came out, and the band was absolutely perfect. King Cockroach will always be my favorite. And India Town has one of those distinctive melodies. \n\nOverall, the album is just a nostalgic trip through the 80's, but never-the-less, it's great jazz! ~ Chris Covais\n\nChick Corea - The Chick Corea Elektric Band Tracks:\n01  Rumble \n02  Side Walk \n03  Cool Weasel Boogie  \n04  Got A Match?\n05  Elektric City\n06  No Zone\n07  King Cockroach &amp;  India Town","torrent":{"xt":"urn:btih:47114e6a1f68f876e9018e4779e3609ab34108b2","amp;dn":"Chick+Corea+-+The+Chick+Corea+Elektric+Band+%281986%29+%5BJazz%5D%5Bmp3+32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47114e6a1f68f876e9018e4779e3609ab34108b2","infoHashBuffer":{"type":"Buffer","data":[71,17,78,106,31,104,248,118,233,1,142,71,121,227,96,154,179,65,8,178]},"announce":[],"urlList":[]}}