{"title":"Primal's Taboo Sex - Cherie DeVille - Mom's the Only MILF for Me","uid":15605254,"size":1306620351,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4724659fc5a14b675de0d71362d50759a67aefb0&amp;dn=Primal%27s+Taboo+Sex+-+Cherie+DeVille+-+Mom%27s+the+Only+MILF+for+Me&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"distinc","files":1,"time":1471712545,"description":"Primal's Taboo Sex - Cherie DeVille - Mom's the Only MILF for Me - 720P\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=6676967759\r\n \nhttp://imagedisco.net/?g=8271496799\r\n\r\n\r\nPlot:\r\n\r\nMy mom is carrying my laptop and confronts me about the shocking discovery she found on it while trying to check her email. She cannot believe how much MILF porn I have been looking at. She wants to know if that is how I see her- as a sexy, mature woman who knows exactly what she is doing. She strips down to her sexy, black lingerie and asks me if this is what I want- a slutty older woman with big tits and a firm ass. She warns me that if I'm thinking about dating an older woman, then I better think again! She notices how large my erection is and demands that I take it out and stroke it like I do when I watch those filthy films. After watching me stroke my cock, she is surprisingly turned on. She insists that she help me as she gets excited but warns me that she better never catch me watching that smut again. She gets my cock wet with her mouth- she knows what they do in those smutty videos, she's not that naive. She knows that I love MILFs with large tits, so she takes her beautiful, big breasts out for me and slides my cock in between them. She makes me promise that I will never watch those videos again. She wants me to experience how an adult has a real orgasm, so she turns around and slides my rock hard cock in her hot pussy from behind. She wouldn't be the best mom if she didn't do the best that she could for me. My mom tells me that real men have to take charge sometimes so I take her while she's on her back, fucking her as she moans and her big tits bounce up and down. When I can't hold back anymore, I blow my huge load all over my mom's tits and chest. She is so very proud of me","torrent":{"xt":"urn:btih:4724659fc5a14b675de0d71362d50759a67aefb0","amp;dn":"Primal%27s+Taboo+Sex+-+Cherie+DeVille+-+Mom%27s+the+Only+MILF+for+Me","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4724659fc5a14b675de0d71362d50759a67aefb0","infoHashBuffer":{"type":"Buffer","data":[71,36,101,159,197,161,75,103,93,224,215,19,98,213,7,89,166,122,239,176]},"announce":[],"urlList":[]}}