{"title":"Los Simpsons El videojuego [PAL][Multi5][Spanish][PS3][www.conso","uid":5929942,"size":10246378158,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:476321f6c033bc79819b96e5fadffc45c3deab2e&amp;dn=Los+Simpsons+El+videojuego+%5BPAL%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.conso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":6,"uploader":"consolasatope","files":52,"time":1288738801,"description":"EmbÃƒÂ¡rquese en una divertidÃƒÂ­sima aventura con la primera familia de la comedia en Estados Unidos: los Simpson. AquÃƒÂ­ hay mucho mÃƒÂ¡s en juego que un par de rosquillas o una glaseada en Moe\\'s: Homero, Marge, Bart y Lisa deben conseguir poderes fabulosos y completamente nuevos para salvar del caos al mundo. Viaje por el mundo abierto de Springfield, y visite lugares icÃƒÂ³nicos y conocidos o mundos increÃƒÂ­bles mientras recoge cientos de elementos en el camino. EstÃƒÂ¡ en sus manos traer algo de normalidad de regreso a Evergreen Terrace.\n\nThe Simpsons Game cuenta con cuatro actos diferentes, mÃƒÂ¡s de 8,000 lÃƒÂ­neas de diÃƒÂ¡logo y 16 capÃƒÂ­tulos de una historia cÃƒÂ³mica. La innovadora tecnologÃƒÂ­a de 2D y 3D muestra una ambientaciÃƒÂ³n verdaderamente realista en Springfield con personajes de apariencia muy autÃƒÂ©ntica, entre los que se incluyen 100 personajes conocidos del programa. Cada miembro de esta fabulosa familia tiene poderes distintivos que crecen al completar batallas y recoger elementos. Acumule suficientes artÃƒÂ­culos de colecciÃƒÂ³n para ganarse algunos trofeos; despuÃƒÂ©s vÃƒÂ©alos a todos en la habitaciÃƒÂ³n de los premios. Complete hasta 16 desafÃƒÂ­os de tiempo y compita en modalidad de un solo jugador o con otros. Resuelva acertijos, interactÃƒÂºe en ambientes expandidos y rÃƒÂ­ase con divertidas parodias de la cultura pop y de asuntos actuales.\n\n","torrent":{"xt":"urn:btih:476321f6c033bc79819b96e5fadffc45c3deab2e","amp;dn":"Los+Simpsons+El+videojuego+%5BPAL%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.conso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"476321f6c033bc79819b96e5fadffc45c3deab2e","infoHashBuffer":{"type":"Buffer","data":[71,99,33,246,192,51,188,121,129,155,150,229,250,223,252,69,195,222,171,46]},"announce":[],"urlList":[]}}