{"title":"Your Ticket to the Universe - A Guide to Exploring the Cosmos (g","uid":8798161,"size":164255664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47ca3c1f74c36096c01d55c12390aba468b054b4&amp;dn=Your+Ticket+to+the+Universe+-+A+Guide+to+Exploring+the+Cosmos+%28g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":-1,"time":1376126658,"description":"Your Ticket to the Universe: A Guide to Exploring the Cosmos\nby Kimberly K. Arcand, Megan Watzke and Mario Livio\nSmithsonian Books | April 2013 | ISBN-10: 1588343758 | ePUB | 156 mb &lt;a href=&quot;\nhttp://www.amazon.com/Your-Ticket-Universe-Exploring-Cosmos/dp/1588343758&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Your-Ticket-Universe-Exploring-Cosmos/dp/1588343758&lt;/a&gt;\n\nAn entertaining and accessible trip to the most interesting stops in the cosmos. Accompanied by dramatic visuals, Your Ticket to the Universe is a hybrid coffee-table book and field guide.\nBeginning with our home planet, Your Ticket to the Universe embarks on an entertaining and accessible trip to the most interesting stops known in the cosmos. Learn about objects nearby within our Solar System (our backyard in space, so to speak) as well as wonders that are found throughout the Milky Way galaxy and beyond (the most distant and exotic lands to explore). Accompanied by brilliant photographs that bring the reading experience to vivid, immediate life, Your Ticket to the Universe is designed to make space exploration accessible to everyone. Your Ticket to the Universe outlines the essentials anyone needs to know, while piquing the reader's curiosity to learn more.\n\nAbout the Authors\nKIMBERLY K. ARCAND and MEGAN WATZKE have a combined 25 years of experience working to bring the wonders of the cosmos to the public. Arcand is the media coordinator and Watzke is the press officer for NASA's Chandra X-ray Observatory, which has its headquarters at the Smithsonian Astrophysical Observatory in Cambridge, Massachusetts. They are the award-winning creators of the &quot;From Earth to the Universe&quot; program, a series of 1,000 astronomy exhibitions and activities initiated in 2008 in public spaces such as gardens, metro stations, airports, hospitals, and town squares throughout the world. Arcand and Watzke are authors of dozens of published articles and scholarly journal articles. Their writings have appeared in the New York Times online, the Christian Science Monitor online, National Geographic online, SEED magazine online, Mercury magazine, Sky and Telescope's Beautiful Universe annual publication, and numerous professional journals. They are widely recognized as creative leaders in reaching out to the public and exposing new audiences to the wonders of astronomy. ","torrent":{"xt":"urn:btih:47ca3c1f74c36096c01d55c12390aba468b054b4","amp;dn":"Your+Ticket+to+the+Universe+-+A+Guide+to+Exploring+the+Cosmos+%28g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47ca3c1f74c36096c01d55c12390aba468b054b4","infoHashBuffer":{"type":"Buffer","data":[71,202,60,31,116,195,96,150,192,29,85,193,35,144,171,164,104,176,84,180]},"announce":[],"urlList":[]}}