{"title":"Great Speeches of the 20th Century","uid":4222297,"size":258674657,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4809016550d99b06234fd2b5a633ab936eb852f3&amp;dn=Great+Speeches+of+the+20th+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"rambam1776","files":79,"time":1212656300,"description":"As a history teacher, I have a large collection of historical materials. The majority of this file is from a boxed set called Great Speeches of the 20th Century &lt;a href=&quot; http://www.amazon.com/Great-Speeches-Century-Various-Artists/dp/B0000032HG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/Great-Speeches-Century-Various-Artists/dp/B0000032HG&lt;/a&gt;\n\nThere are also some odd speeches here I just keep in the same file. For those interested, other uploaders have already torrented speeches by MLK, Malcolm X, and others, so I have not included those collections in order to keep the size of this one smaller. Additionally, I have already and will continue to upload torrents containing rare historical music and other materials. That will depend largely on time and the response this torrent gathers. I only wish I still had all my civil war music, but a hard disc crash robbed me of most of that some time ago.  \n\nEditorial Reviews\nAmazon.com\nStudents and teachers of history, enthusiasts of speechmaking, and folks needing something different to spice up those mix tapes with will enjoy this inspired four-disc tour of a century. It's a bit heavy on events a baby boomer is most likely to be interested in, but there's nothing wrong with knowing one's audience. For the most part, these recordings make 20th-century history appear to be happening right now. It might sound clichÃƒÂ©d, but it really is a thrill to hear history in the making: Woodrow Wilson lying to the American Indians, Gloria Steinem addressing the National Organization for Women, the launch of sputnik, Dr. King delivering the &quot;I Have a Dream&quot; speech with intense clarity and emotion, Kennedy delivering his infamous address to the nation after being sworn in, the very first recording ever made on an Edison phonograph, Nixon resigning in shame, Hitler hatefully ranting about Germanic expansionism, Malcolm X powerfully speaking on black power, Babe Ruth saying good-bye to baseball, and Neil Armstrong uttering those famous words as he first steps onto the moon. --Mike McGonigal \n","torrent":{"xt":"urn:btih:4809016550d99b06234fd2b5a633ab936eb852f3","amp;dn":"Great+Speeches+of+the+20th+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4809016550d99b06234fd2b5a633ab936eb852f3","infoHashBuffer":{"type":"Buffer","data":[72,9,1,101,80,217,155,6,35,79,210,181,166,51,171,147,110,184,82,243]},"announce":[],"urlList":[]}}