{"title":"Clarence Carter - 1992 - Snatching It Back FLAC","uid":9686744,"size":323560132,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:486c80847731259c2fd37410f3e47083f73f769e&amp;dn=Clarence+Carter+-+1992+-+Snatching+It+Back+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"eika256","files":-1,"time":1393781481,"description":"Clarence Carter - 1992 - Snatching It Back (Best of)\n\nAmong the great soul artists who recorded for Atlantic Records during the 1960s, Clarence Carter was one of the few who left the label at the peak of his fame; while he'd previously enjoyed a handful of minor hits, &quot;Patches,&quot; his biggest crossover hit, broke in 1970, a year before Carter moved on to ABC, while Carter had his greatest latter-day success recording for Southern soul revival label Ichiban. Snatching It Back is a compilation that collects 21 classic sides from Carter's tenure at Atlantic, and by focusing strictly on his output for one label, this set misses the mark as a career retrospective (they could have at least tacked on Carter's lascivious jukebox classic &quot;Strokin'&quot; in the name of a more complete picture). But Snatching It Back does a superlative job of skimming the cream of Carter's Atlantic sides, which for the most part do represent his strongest work, and Carter's passionate, room-filling vocals and clean, blues-flavored guitar figures shine on each song, from the sentimental tale of &quot;Patches&quot; and the lover's lament &quot;Slip Away&quot; to the sassy &quot;Tell Daddy&quot; and &quot;Makin' Love (At the Dark End of the Street),&quot; which amusingly predates his more provocative material for Ichiban. Snatching It Back is a few notches short of the definitive Clarence Carter collection, but you could hardly ask for a better summation of his Atlantic material. (AllMusic)\n\nTrack list:\n01 - Step By Step\n02 - I Stayed Away Too Long\n03 - Tell Daddy\n04 - Looking For A Fox\n05 - I Can't See Myself\n06 - The Road Of Love\n07 - Slip Away\n08 - Back Door Santa\n09 - That Old Time Feeling\n10 - Too Weak To Fight\n11 - I'd Rather Go Blind\n12 - Making Love (At The Dark End Of The Street)\n13 - Snatching It Back\n14 - Soul Deep\n15 - I Smell A Rat\n16 - Doin' Our Thing\n17 - The Feeling Is Right\n18 - I Can't Leave Your Love Alone\n19 - Slipped, Tripped And Fell In Love\n20 - It's All In Your Mind\n21 - Patches\n\nPersonnel:\nClarence Carter (vocals, guitar); James Johnson, Albert Lowe, Duane Allman, Travis Wammack (guitar); Gene Miller, Wayne Jackson, Harrison Calloway Jr., Jack Peck (trumpet); Aaron Varnell (tenor &amp; baritone saxophone); Charles Chalmers, Andrew Love, Joe Arnold, Harvey Thompson (tenor saxophone); Floyd Newman, James Mitchell, Ronnie Eades (baritone saxophone); Clayton Ivey (piano, organ, keyboards); Barry Beckett (piano, organ); Linden Oldham (piano); Marvell Thomas (organ); David Hood, Jesse Boyce, Bob Wray, Jerry Masters (bass); Roger Hawkins, Freeman Brown, Fred Pouty, Cornell McFadden (drums); Donna Rhodes, Charles Chalmers, Sandy Rhodes (background vocals)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:486c80847731259c2fd37410f3e47083f73f769e","amp;dn":"Clarence+Carter+-+1992+-+Snatching+It+Back+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"486c80847731259c2fd37410f3e47083f73f769e","infoHashBuffer":{"type":"Buffer","data":[72,108,128,132,119,49,37,156,47,211,116,16,243,228,112,131,247,63,118,158]},"announce":[],"urlList":[]}}