{"title":"Talib Kweli - Reflection Eternal","uid":4990681,"size":65197090,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48b35f684846d4f0a49378ebfe8cd0f3cf3e247e&amp;dn=Talib+Kweli+-+Reflection+Eternal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"lewdigga","files":21,"time":1247018257,"description":"Release : 2000\n1 &quot;Experience Dedication&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Dave Chappelle, Talib Kweli \n2 &quot;Move Somethin'&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli\nNonye (background) \n3 &quot;Some Kind of Wonderful&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli \n4 &quot;The Blast&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Hi-Tek, Talib Kweli, Vinia Mojica \n5 &quot;This Means You&quot; Tony Cottrell, Talib Kweli Greene, Dante Smith Hi-Tek Mos Def, Talib Kweli \n6 &quot;Too Late&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Res, Talib Kweli \n7 &quot;Memories Live&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli\nBig Del (background), Donte (background) \n8 &quot;Africa Dream&quot; Tony Cottrell, Talib Kweli Greene, Weldon Irvine Talib Kweli, Weldon Irvine, Hi-Tek (co-producer) Talib Kweli \n9 &quot;Down for the Count&quot; Tony Cottrell, Talib Kweli Greene, Rashia Fisher, Alvin Joiner Hi-Tek Rah Digga, Talib Kweli, Xzibit \n10 &quot;Name of the Game&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli \n11 &quot;Ghetto Afterlife&quot; Tony Cottrell, Talib Kweli Greene, Nathaniel Wilson Hi-Tek Kool G Rap, Talib Kweli \n12 &quot;On My Way&quot; Tony Cottrell, E. Isaacs, J. Thomas Hi-Tek Kendra Ross, Tiye Phoenix, Vinia Mojica \n13 &quot;Love Language&quot; Tony Cottrell, Talib Kweli Greene, Helene Faussart, Celia Faussart Hi-Tek Les Nubians, Talib Kweli \n14 &quot;Love Speakeasy&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek  \n15 &quot;Soul Rebels&quot; Tony Cottrell, Talib Kweli Greene, Kelvin Mercer, David Jude Jolicoeur, Vincent Mason Hi-Tek Pasemaster Mase, Posdnuos, Talib Kweli, Trugoy the Dove \n16 &quot;Eternalists&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli \n17 &quot;Big Del From da Natti&quot; Tony Cottrell, Talib Kweli Greene, D. Geralds Hi-Tek Big Del, Talib Kweli \n18 &quot;Touch You&quot; Tony Cottrell, Talib Kweli Greene, D. Stanford Jr., Dave West Hi-Tek Dave Chappelle, Piakhan, Supa Dave West, Talib Kweli \n19 &quot;Good Mourning&quot; Tony Cottrell, Talib Kweli Greene Hi-Tek Talib Kweli \n20 &quot;Expansion Outro&quot; \n\n","torrent":{"xt":"urn:btih:48b35f684846d4f0a49378ebfe8cd0f3cf3e247e","amp;dn":"Talib+Kweli+-+Reflection+Eternal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b35f684846d4f0a49378ebfe8cd0f3cf3e247e","infoHashBuffer":{"type":"Buffer","data":[72,179,95,104,72,70,212,240,164,147,120,235,254,140,208,243,207,62,36,126]},"announce":[],"urlList":[]}}