{"title":"Spawn - n. 001-050, [Cbr - Ita] Fumetti - Cult Comis","uid":5960641,"size":1855386823,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:48c7a392b55b777ee9b7606df13e05ea07bc591f&amp;dn=Spawn+-+n.+001-050%2C+%5BCbr+-+Ita%5D+Fumetti+-+Cult+Comis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Cer8one","files":50,"time":1289941844,"description":"Spawn, per intero Hellspawn (covata/progenie infernale), il cui vero nome ÃƒÂ¨ Al Simmons, ÃƒÂ¨ un personaggio dei fumetti, creato da Todd McFarlane, disegnatore e sceneggiatore delle storie. ÃƒË† pubblicato dalla Image Comics, ma i diritti sono della Todd Mcfarlane Production. Gran parte dell'innovazione che portÃƒÂ² questo fumetto, sta qua! Infatti molti autori della Marvel Comics, negli anni novanta se ne andarono da questa &quot;sbattendo la porta&quot; per la poca libertÃƒÂ  creativa concessagli e perchÃƒÂ© dei loro personaggi non detenevano i diritti; si associarono e crearono l'Image Comics che ebbe un notevole successo.\nIn Italia le storie di SPAWN vengono proposte dalla Panini Comics, inizialmente sotto l'etichetta Cult Comics. La prima storia di Spawn, che registrÃƒÂ² un record di vendita negli USA, ÃƒÂ¨ uscita nel giugno del 1992.\nIl fumetto narra le avventure di Al Simmons e della sua maledizione! Egli torna alla vita per l'amore della sua Wanda e per farlo vende la sua anima al diavolo Malebolgia, tuttavia ÃƒÂ¨ inconsapevole del vero significato del patto e del cattivo scherzo del &quot;cattivo&quot; scherzo di cui ÃƒÂ¨ vittima: Egli torna si alla vita, ma sono ormai passati 5 anni dalla sua morte, la moglie ÃƒÂ¨ sposata con il suo miglior amico e ha una figlia, e inoltre il corpo con cui torna alla vita non ÃƒÂ¨ il suo ma quella di una creatura intrisa di potere infernale e dal viso deturpato! Simmons infatti ÃƒÂ¨ stato trasformato in un HellSpawn, un generale delle tenebre che guiderÃƒÂ  le orde infernale durante l'Armageddon lo scontro finale tra il Paradiso e l'Inferno! Tuttavia, il nostro anti-eroe per eccellenza Spawn, si dimostra piÃƒÂ¹ autonomo di quanto vogliano le due fazioni &quot;bibliche&quot;.\n\nL'edizione Panini comics parte dal numero 33 della serie regolare americana, i precedenti numeri sono stati pubblicati sempre dalla panini comics nella Spawn Collection. La Spawn Collection e la serie regolare Panini sono collegate dal numero 32 americano, pubblicato in italia nella mini Spawn Tenebre e che potete trovare QUI\n\n\nNazionalitÃƒÂ : ITA\nDati scan: 300 dpi 24 bit\nRisoluzione: 1280 x XXXX\nFormato file: CBR\nProgetto Comics Scan: Miao Films\nEd. Cult Comics/Panini Comics\nFormato: spillato 48 pg. (numeri 1/85), 72 pg. (dal num 86 in poi)\nnum 1/3: scan by opomas\nedit by FakkWylde\ndal num 4: scan + edit by opomas","torrent":{"xt":"urn:btih:48c7a392b55b777ee9b7606df13e05ea07bc591f","amp;dn":"Spawn+-+n.+001-050%2C+%5BCbr+-+Ita%5D+Fumetti+-+Cult+Comis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c7a392b55b777ee9b7606df13e05ea07bc591f","infoHashBuffer":{"type":"Buffer","data":[72,199,163,146,181,91,119,126,233,183,96,109,241,62,5,234,7,188,89,31]},"announce":[],"urlList":[]}}