{"title":"Chivalry.Medieval.Warfare-HI2U","uid":7734406,"size":2999109632,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:48f554fc66c12a4902ad4b966a6224ef173268d0&amp;dn=Chivalry.Medieval.Warfare-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"thenoobish","files":1,"time":1350428438,"description":"HI2U!\n\nChivalry: Medieval Warfare (c) Torn Banner Studios\n\nRelease Date : 16th October, 2012\nProtection   : Steam\nType         : Action / FPS\nSize         : 47 x 50mb\n\n\nRelease note:\n~~~~~~~~~~~~~\nWhile this is described as a game focused on multi-player, there is a single\nplayer training mode, and the other modes offers bots to play against, like in\nQuake 3.\n\nDescription:\n~~~~~~~~~~~~\n\nCHIVALRY: Medieval Warfare is a first-person slasher with a focus on\nmulti-player. Featuring competitive online combat that seeks to capture the\nexperience of truly being on a medieval battlefield. We've drawn our\ninspiration from the intensity and epicness of swordfighting movies such as\n300, Gladiator and Braveheart and we want to bring that experience to the\nhands of a gamer.\n\nThe game is skill-based and controls like a FPS, but instead of guns and\ngrenades, players are given swords, shields, maces, battleaxes and longbows.\nSet in a fictional yet gritty and realistic world, players will fight in fast\npaced online battles besieging castles, raiding medieval villages and fighting\nfor glory in the arena with up to 32 players.\n\n* Deep melee combat system provides players with a huge range of responsive\n  combat options\n* Adjust your attacks and blocks in real time with the mouse for precise and\n  full control of the action\n* Wield an arsenal of up to 60 brutal weapons ranging from broad swords and\n  battle axes to longbows and javelins\n* Dynamic objective system brings team tactics and strategy to the forefront\n  as players batter down gates, raid villages and assassinate enemy royalty to\n  achieve victory.\n* Use a variety of siege weapons ranging from catapults, boiling oil,\n  ballista, battering rams and more\n* Vast, lush environments that transport the player to a gritty and immersive\n  medieval world. \n* Offline play options that allow players to gain familiarity with the\n  controls and gameplay before being thrust into the action.\n\n\nInstall:\n~~~~~~~\nUnrar, mount/burn, install &amp; copy the contents of the Crack folder on the\nDVD to where you installed the game. Enjoy.","torrent":{"xt":"urn:btih:48f554fc66c12a4902ad4b966a6224ef173268d0","amp;dn":"Chivalry.Medieval.Warfare-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48f554fc66c12a4902ad4b966a6224ef173268d0","infoHashBuffer":{"type":"Buffer","data":[72,245,84,252,102,193,42,73,2,173,75,150,106,98,36,239,23,50,104,208]},"announce":[],"urlList":[]}}