{"title":"The Smiths - Studio Discography (1984-1987) [FLAC]","uid":6404448,"size":1141252470,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:492d5e70713a9d84c59c760cd86f03e958998391&amp;dn=The+Smiths+-+Studio+Discography+%281984-1987%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"politux","files":-1,"time":1305763620,"description":"Albums:\n\nThe Smiths - The Smiths (1984)\n\nArriving in an era dominated by synth pop and gloomy post-punk, the Smiths' eponymous debut was the bracing beginning of a new era. On the surface, the Smiths' sound wasn't radically different from traditional British guitar pop -- Johnny Marr's ringing, layered guitars were catchy and melodic -- but it was actually an astonishing subversion of the form, turning the structure inside out. Very few of the songs followed conventional verse-chorus structure, yet they were quite melodic within their own right. Marr's inventive songwriting was made all the more original and innovative by Morrissey's crooning and lyrics. Writing about unconventional topics, from homosexuality (&quot;Hand in Glove&quot;) to child molestation and murder, Morrissey had a distinctively ironic, witty, and literate viewpoint whose strangeness was accentuated by his off-kilter voice, which would move from a croon to a yelp in a matter of seconds. While the production of The Smiths is a little pristine, the songs are vital and alive, developing a new, unique voice within pop music. Though the Smiths continued to improve over the course of their career, their debut remains startling and exciting.\n\nReleased: 1984\nGenre: Rock\nStyle: Alternative\nQuality: Lossless\nCodec: FLAC\n\n  1. Rell Around The Fountain\n  2. You've Got Everything Now\n  3. Miserable Lie\n  4. Pretty Girls Make Graves\n  5. The Hand That Rocks The Cradle\n  6. This Charming Man\n  7. Still Ill\n  8. Hand In Glove\n  9. What Difference Does It Make?\n  10. I Don't Owe You Anything\n  11. Suffer Little Children\t\t\n\n\nThe Smiths - Meat Is Murder (1985)\n\nWith their second proper album Meat Is Murder, the Smiths begin to branch out and diversify, while refining the jangling guitar pop of their debut. In other words, it catches the group at a crossroads, unsure quite how to proceed. Taking the epic, layered &quot;How Soon Is Now?&quot; as a starting point (the single, which is darker and more dance-oriented than the remainder of the album, was haphazardly inserted into the middle of the album for its American release), the group crafts more sweeping, mid-tempo numbers, whether it's the melancholy &quot;That Joke Isn't Funny Anymore&quot; or the failed, self-absorbed protest of the title track. \n\nReleased: 1985\nGenre: Rock\nStyle: Alternative\nQuality: Lossless\nCodec: FLAC\n\n  1. The Headmaster Ritual\n  2. Rusholme Ruffians\n  3. I Want the One I Can't Have\n  4. What She Said\n  5. That Joke Isn't Funny Anymore\n  6. How Soon Is Now?\n  7. Nowhere Fast \n  8. Well I Wonder\n  9. Barbarism Begins at Home\n  10. Meat Is Murder\n\t\t\n\nThe Smiths - The Queen is Dead (1986)\n\nMeat Is Murder may have been a holding pattern, but The Queen Is Dead is the Smiths' great leap forward, taking the band to new musical and lyrical heights. Opening with the storming title track, The Queen Is Dead is a harder-rocking record than anything the Smiths had attempted before, but that's only on a relative scale -- although the backbeat is more pronounced, the group certainly doesn't rock in a conventional sense. Instead, Johnny Marr has created a dense web of guitars, alternating from the minor-key rush of &quot;Bigmouth Strikes Again&quot; and the faux rockabilly of &quot;Vicar in a Tutu&quot; to the bouncy acoustic pop of &quot;Cemetry Gates&quot; and &quot;The Boy With the Thorn in His Side,&quot; as well as the lovely melancholy of &quot;I Know It's Over&quot; and &quot;There Is a Light That Never Goes Out.&quot; And the rich musical bed provides Morrissey with the support for his finest set of lyrics. Shattering the myth that he is a self-pitying sap, Morrissey delivers a devastating set of clever, witty satires of British social mores, intellectualism, class, and even himself. He also crafts some of his finest, most affecting songs, particularly in the wistful &quot;The Boy With the Thorn in His Side&quot; and the epic &quot;There Is a Light That Never Goes Out,&quot; two masterpieces that provide the foundation for a remarkable album.\n\n\n\nReleased: 1986\nGenre: Rock\nStyle: Alternative\nQuality: Lossless\nCodec: FLAC\n\nTracks:\n\n  1. The Queen is Dead\n  2. Frankly, Mr Shankly\n  3. I Know It's Over\n  4. Never Had No One Ever \n  5. Cemetary Gates\n  6. Bigmouth Strike Again\n  7. The Boy With The Thorn In His Side\n  8. Vicar in a Tutu\n  9. There Is A Light That Never Goes Out\n  10. Somegirls Are Bigger Than Others\t\t\n\n\nThe Smiths - Strangeways, Here We Come (1987)\n\nRecorded as the relationship between Morrissey and Johnny Marr was beginning to splinter, Strangeways, Here We Come is the most carefully considered and elaborately produced album in the group's catalog. With producer Stephen Street, the Smiths created a subtly shaded and skilled album, one boasting a fuller production than before. Morrissey and Marr also labored hard over the songs, working to expand the Smiths' sound within their very real boundaries. For the most part, they succeed. &quot;I Started Something I Couldn't Finish,&quot; &quot;Girlfriend in a Coma,&quot; &quot;Stop Me if You Think You've Heard This One Before,&quot; and &quot;I Won't Share You&quot; are classics, while &quot;A Rush and a Push and the Land Is Ours,&quot; &quot;Death of a Disco Dancer,&quot; and &quot;Last Night I Dreamt That Somebody Loved Me&quot; aren't far behind. Strangeways is a graceful way to bow out. While it doesn't match The Queen Is Dead or The Smiths, it offers a summation of the group's considerable strengths.\n\nReleased: 1987\nLabel: Sire\nGenre: Rock\nStyle: Alternative\nQuality: Lossless\nCodec: FLAC\n\n  1. A Rush and a Push and the Land Is Ours\n  2. I Started Something I Couldn't Finish\n  3. Death of a Disco Dancer\n  4. Girlfriend in a Coma\n  5. Stop Me If You Think You've Heard This One Before\n  6. Last Night I Dreamt That Somebody Loved Me\n  7. Unhappy Birthday\n  8. Paint a Vulgar Picture\n  9. Death at One's Elbow\n  10. I Won't Share You","torrent":{"xt":"urn:btih:492d5e70713a9d84c59c760cd86f03e958998391","amp;dn":"The+Smiths+-+Studio+Discography+%281984-1987%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492d5e70713a9d84c59c760cd86f03e958998391","infoHashBuffer":{"type":"Buffer","data":[73,45,94,112,113,58,157,132,197,156,118,12,216,111,3,233,88,153,131,145]},"announce":[],"urlList":[]}}