{"title":"Propaganda Prints - A history of Art in The Service of Social an","uid":9594828,"size":32485142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49c88e536202ccfa12a858367e90c30495d59ae1&amp;dn=Propaganda+Prints+-+A+history+of+Art+in+The+Service+of+Social+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1391985816,"description":"Propaganda Prints: A History of Art in the Service of Social and Political Change By Colin Moore\nPublisher: A&amp;C Bla..ck 2011 | 200 Pages | ISBN: 1408105918 | PDF | 31 MB\n\n\n\nArt has been used in the service of social and political movements, for good and evil, from ancient times to the present day, and this unique book explores the history, cultural diversity, and artistic legacy of art works that have had far greater impact than political and social rhetoric and have served as key catalysts for change.\nColin Moore presents the art in themes such as political state control, opposition, revolution, politics, and social influence such as advertising and self-promotion, and provides historical context to explain the origin of the dreams and concerns that prompted mass movements.\nThree hundred images are explored representing five thousand years of civilization from the ancient Mesopotamians, Romans, Crusaders, Normans, Victorians; movements such as the Suffragettes, the Nazis and the Hippies; and revolutions in America, France, Russia, Mexico, China and Cuba. From Gutenberg's printing press to You Tube, from Alexander the Great to President Obama, this review of propaganda art reflects the best and the worst of how our common hopes and dreams can be guided and manipulated by powerful, persuasive art images.","torrent":{"xt":"urn:btih:49c88e536202ccfa12a858367e90c30495d59ae1","amp;dn":"Propaganda+Prints+-+A+history+of+Art+in+The+Service+of+Social+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c88e536202ccfa12a858367e90c30495d59ae1","infoHashBuffer":{"type":"Buffer","data":[73,200,142,83,98,2,204,250,18,168,88,54,126,144,195,4,149,213,154,225]},"announce":[],"urlList":[]}}