{"title":"Angels &amp; Airwaves Discography (2011)","uid":8354600,"size":391555569,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4a51528976d3a5779d6a13500c9ab08e9dd5146a&amp;dn=Angels+%26amp%3B+Airwaves+Discography+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Space-Rabbit","files":-1,"time":1365453274,"description":"Various bitrates between 192 and 320 kbps, I made all of the tags match (They're all labeled Angels &amp; Airwaves, not mixed between that and Angels and Airwaves, etc.). I could barely find a complete set from these guys, only ones with some albums and songs completely missing so I went ahead and uploaded it for you. I'll also be uploading the individual albums since I can not find some of the proper copies anywhere.\n\nThis includes the Angels and Airwaves discography from 2006 to 2011 (NOT the latest EP from 2012, Stomping The Phantom Break Pedal). Also includes a bonus track The Machine from &quot;We Don't Need to Whisper&quot; plus the rare track Hallucinations - The Mark Hoppus Octopus Remix from &quot;Love&quot;.\n\n&quot;When the album was first released, a version of the song 'Hallucinations' remixed by Mark Hoppus was given to fans who donated to the band. This remix is no longer available.&quot; - Wikipedia\n\n&quot;Angels &amp; Airwaves are an American alternative rock supergroup led by Blink-182 guitarist and vocalist Tom DeLonge. Other members are guitarist David Kennedy (from Over My Dead Body, Hazen Street and Box Car Racer), bassist Matt Wachter (from 30 Seconds to Mars) and drummer Ilan Rubin (from Lostprophets and Nine Inch Nails). Former original members are bass guitarist Ryan Sinn (formerly of The Distillers), who left the group in 2007 for reasons still unclear, as well as drummer Adam &quot;Atom&quot; Willard (formerly of The Offspring and Rocket from the Crypt), who amicably parted ways with the band in fall 2011 shortly before the release of their fourth album.&quot; - Wikipedia\n\nEnjoy.\n","torrent":{"xt":"urn:btih:4a51528976d3a5779d6a13500c9ab08e9dd5146a","amp;dn":"Angels+%26amp%3B+Airwaves+Discography+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a51528976d3a5779d6a13500c9ab08e9dd5146a","infoHashBuffer":{"type":"Buffer","data":[74,81,82,137,118,211,165,119,157,106,19,80,12,154,176,142,157,213,20,106]},"announce":[],"urlList":[]}}