{"title":"Maroon 5 - She Will Be Loved  (2nafish)","uid":5404150,"size":173608964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4b08e0f143d1b0f969c498b8c7fdb51f6b840c48&amp;dn=Maroon+5+-+She+Will+Be+Loved++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"2nafish","files":-1,"time":1267490174,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;She Will Be Loved&quot; is the third single from the Californian band Maroon 5's 2002 debut album, Songs About Jane. Released in 2004, the single peaked at #5 in the USA becoming Maroon 5's second Top 10 single; it also peaked at #4 in the UK. The song reached #1 in Australia and remained at the top for 5 non-consecutive weeks; it also peaked at #2 in Latin America becoming Maroon 5's second consecutive Top 3. The song also reached #1 on the world-wide chart. The single is noted for its music video which stars Kelly Preston. When the band was commissioned to perform at the AFI Life Achievement Award ceremony for George Lucas, this song was chosen in tribute to Lucas' children, mainly his oldest daughter. The song is also playable in rhythm game Band Hero in addition Levine also appears as a playable avatar in the game.\n\nThe music video for &quot;She Will Be Loved&quot; features a young man (played by lead singer Adam Levine) who falls in love with the mother (played by Kelly Preston) of his girlfriend (played by Corrine Carrey). The mother is not receiving love from her husband. Although this is a complicated situation he sings &quot;She will be loved&quot;.\n\nThe video uses the &quot;radio edit&quot;, an alternate and slightly slower take of the song which only appears on promotional CDs.\n\nProduced by Oil Factory, &quot;She Will Be Loved&quot; was directed by Sophie Muller.\n\nSongs About Jane is the debut album by Los Angeles rock/pop band Maroon 5. The album was released in June 2002 and by the end of 2004 it had reached the top 10 of the Billboard 200 charts.\n\nMaroon 5 is an American rock band. Since debuting in 2002, the band has sold over 10 million albums in the United States and nearly 15 million worldwide. While they were in high school, the four original members of Maroon 5 played in a garage band called Kara's Flowers, which was active from 1994 to 2001. In 2002, the band members reformed as Maroon 5 and released their debut album Songs About Jane, but the album first topped Billboard charts in the US in 2004. Songs About Jane contained four hit singles: &quot;Harder to Breathe&quot;, &quot;This Love&quot;, &quot;She Will Be Loved&quot; and &quot;Sunday Morning&quot;.\n\nOriginal drummer Ryan Dusick left Maroon 5 in 2006, citing injuries, and was replaced by Matt Flynn. Maroon 5's second album It Won't Be Soon Before Long came out in 2007, with singles &quot;Makes Me Wonder&quot;, &quot;Won't Go Home Without You&quot; and &quot;Wake Up Call&quot;. The band performed throughout the summer and fall of 2007, including a North American tour with The Hives. They followed that with a world tour with New Found Glory. Beginning March 28, 2008, they toured with Counting Crows and Sara Bareilles. In 2005, they won a Grammy Award for Best New Artist.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4b08e0f143d1b0f969c498b8c7fdb51f6b840c48","amp;dn":"Maroon+5+-+She+Will+Be+Loved++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b08e0f143d1b0f969c498b8c7fdb51f6b840c48","infoHashBuffer":{"type":"Buffer","data":[75,8,224,241,67,209,176,249,105,196,152,184,199,253,181,31,107,132,12,72]},"announce":[],"urlList":[]}}