{"title":"Alexandra David-Neel - The Secret Teachings in Tibetan Sects (14","uid":11428111,"size":6642859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b4421202c8c380feb2156fc14dae703796b0115&amp;dn=Alexandra+David-Neel+-+The+Secret+Teachings+in+Tibetan+Sects+%2814&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Inua1","files":1,"time":1415683991,"description":"Title: The Secret Oral Teachings in Tibetan Buddhist Sects\nAuthors: Alexandra David-Neel and lama Yongden\nISBN-10: 0872860124\nISBN-13: 978-0872860124\n\nThis is an account of the Madhyamika (Middle Way) school of Buddhism, a method of mediation and enlightenment that was developed by the great Indian teacher Nagarjuna. In a collaboration between the Frenchwoman Alexandra David-Neel and her friend, the Tibetan lama Aphur Yongden, these teaching are presented clearly and elegantly, intended for the layman who seeks a way to practice and experience the realization of oneness with all existence.\n\nAlexandra David-Neel was born in 1868 in Paris. In her youth she wrote an incendiary anarchist treatise and was an acclaimed opera singer; then she decided to devote her life to exploration and the study of world religions, including Buddhist philosophy. She traveled extensively to in Central Asia and the Far East, where she learned a number of Asian languages, including Tibetan. In 1914, she met Lama Yongden, who became her adopted son, teacher, and companion. In 1923, at the age of fifty-five, she disguised herself as a pilgrim and journeyed to Tibet, where she was the first European woman to enter Lhasa, which was closed to foreigners at the time. In her late seventies, she settled in the south of France, where she lived until her death at 101 in 1969","torrent":{"xt":"urn:btih:4b4421202c8c380feb2156fc14dae703796b0115","amp;dn":"Alexandra+David-Neel+-+The+Secret+Teachings+in+Tibetan+Sects+%2814","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b4421202c8c380feb2156fc14dae703796b0115","infoHashBuffer":{"type":"Buffer","data":[75,68,33,32,44,140,56,15,235,33,86,252,20,218,231,3,121,107,1,21]},"announce":[],"urlList":[]}}