{"title":"Incas - Lords of gold and glory (History Arts Ebook).pdf","uid":11005356,"size":33822634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b49e8729f6f9cbc0bd0b77426fe3face7b57be0&amp;dn=Incas+-+Lords+of+gold+and+glory+%28History+Arts+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1410218268,"description":"Pdf / English / 168 pag / 1992 / Time-Life Lost Civilization Series / 32.2 MB\n\nI've been reading a few books on Peru and the Incas lately. Some are classics, others lesser travel offerings. If you want a single book, with a marvelous set of pictures, a good map or two, and a lot of information in clear, succinct form, I don't think you'll do better than to get hold of this book. It's a TIME/LIFE book, so OK, don't expect leftwing political views, but this one is part of a series on lost civilizations. Though the peoples who formed the Inca Empire are still very much around in Ecuador, Peru, and Bolivia, their ancient civilization was crushed. I was very impressed by the way the editors started with the conquest and destruction of the Inca world by the Spanish conquistadors, then went on to Machu Picchu and the creation of the Inca Empire by Pachacuti, one of those Napoleonic/Alexander the Great-type figures that appear every so often in human history. The authors then write about the cultures like Chimu, Moche and Tiahuanaco, to name three, which preceeded the Incas and provided a cultural foundation for them to build on. The last part of the book focusses on the many cultural achievements, religion, economy, and political organization in the Inca world. Every topic is at least touched on, from roads and jewelry to mining and agriculture. You can find a very interesting `aside', with many photos, on mummies. No doubt the book contains a lot of information and cannot go into deep detail, but it is extremely well-presented. It's not academic; it's meant for anyone interested in the subject. I highly recommend it.\n\nAmazon\n\n","torrent":{"xt":"urn:btih:4b49e8729f6f9cbc0bd0b77426fe3face7b57be0","amp;dn":"Incas+-+Lords+of+gold+and+glory+%28History+Arts+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b49e8729f6f9cbc0bd0b77426fe3face7b57be0","infoHashBuffer":{"type":"Buffer","data":[75,73,232,114,159,111,156,188,11,208,183,116,38,254,63,172,231,181,123,224]},"announce":[],"urlList":[]}}