{"title":"Vinyl Acetate Emulsion Polymerization and Copolymerization with ","uid":12436979,"size":4790587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b813413415f8582be598df59be597d7eba1f98f&amp;dn=Vinyl+Acetate+Emulsion+Polymerization+and+Copolymerization+with+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1442523475,"description":"Vinyl Acetate Emulsion Polymerization and Copolymerization with Acrylic Monomers (CRC, 2000).pdf\n\nISBN 0-8493-2303-7\n\nThe versatility of the emulsion copolymerization reaction and the ability to control the properties of the final latices have led to rapid expansion both in the quantity of polyvinylacetate and vinyl acetate-acrylic copolymer latices and in their applications. Vinyl Acetate Emulsion Polymerization and Copolymerization with Acrylic Monomers provides a collection and logical organization of the published data - much of it formerly found fragmented throughout various journals and little of it referenced in general emulsion polymerization books. To date, no one source has offered chemists and polymer, surface, or colloid specialists the &quot;big picture&quot; of polyvinylacetate-based latices.\n\nIntegrating established knowledge with the latest research developments, this book provides the background for understanding the mechanism and kinetics of emulsion polymerization initiated in the aqueous phase and some of the practical problems of latex production. The author presents an overview of industrial practices, new applications, and all of the fundamental material - avoiding theoretical controversies.\n\nWith in-depth discussion of the ingredients found in most industrial recipes, Vinyl Acetate Emulsion Polymerization and Copolymerization with Acrylic Monomers helps eliminate costly and time-consuming &quot;trial and error&quot; practices. It serves not only as an introduction for those new to the field, but also as a valuable reference for researchers and applied scientists in both industry and academia","torrent":{"xt":"urn:btih:4b813413415f8582be598df59be597d7eba1f98f","amp;dn":"Vinyl+Acetate+Emulsion+Polymerization+and+Copolymerization+with+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b813413415f8582be598df59be597d7eba1f98f","infoHashBuffer":{"type":"Buffer","data":[75,129,52,19,65,95,133,130,190,89,141,245,155,229,151,215,235,161,249,143]},"announce":[],"urlList":[]}}