{"title":"The Penguin Book of Russian Poetry by Robert Chandler","uid":12111799,"size":1423800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b819c2fa981de20156909ec2dc313a4526741ec&amp;dn=The+Penguin+Book+of+Russian+Poetry+by+Robert+Chandler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":2,"time":1436594169,"description":"An enchanting collection of the very best of Russian poetry, edited by acclaimed translator Robert Chandler together with poets Boris Dralyuk and Irina Mashinski.\n\nIn the late eighteenth and early nineteenth centuries, poetry's pre-eminence in Russia was unchallenged, with Pushkin and his contemporaries ushering in the 'Golden Age' of Russian literature. Prose briefly gained the high ground in the second half of the nineteenth century, but poetry again became dominant in the 'Silver Age' (the early twentieth century), when belief in reason and progress yielded once more to a more magical view of the world. During the Soviet era, poetry became a dangerous, subversive activity; nevertheless, poets such as Osip Mandelstam and Anna Akhmatova continued to defy the censors. This anthology traces Russian poetry from its Golden Age to the modern era, including work by several great poets - Georgy Ivanov and Varlam Shalamov among them - in captivating modern translations by Robert Chandler and others. The volume also includes a general introduction, chronology and individual introductions to each poet.\n\nAbout the Authors\nRobert Chandler is an acclaimed poet and translator. His many translations from Russian include works by Aleksandr Pushkin, Nikolay Leskov, Vasily Grossman and Andrey Platonov, while his anthologies of Russian Short Stories from Pushkin to Buida and Russian Magic Tales are both published in Penguin Classics.\n\nIrina Mashinski is a bilingual poet and co-founder of the StoSvet literary project. Her most recent collection is 2013's Ophelia i masterok [Ophelia and the Trowel].\n\nBoris Dralyuk is a Lecturer in Russian at the University of St Andrews and translator of many books from Russian, including, most recently, Isaac Babel's Red Cavalry (2014)","torrent":{"xt":"urn:btih:4b819c2fa981de20156909ec2dc313a4526741ec","amp;dn":"The+Penguin+Book+of+Russian+Poetry+by+Robert+Chandler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b819c2fa981de20156909ec2dc313a4526741ec","infoHashBuffer":{"type":"Buffer","data":[75,129,156,47,169,129,222,32,21,105,9,236,45,195,19,164,82,103,65,236]},"announce":[],"urlList":[]}}