{"title":"The Beatles - Get Back [original promo].VOB","uid":9758802,"size":154157056,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4ba25044c5d1da98d4877eadf0851bbbd1b9641d&amp;dn=The+Beatles+-+Get+Back+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1394780771,"description":"The Beatles - Get Back [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Get Back&quot; is a song by the Beatles, originally released as a single on 11 April 1969 and credited to &quot;the Beatles with Billy Preston.&quot; A different mix of the song later became the closing track of Let It Be (1970), which was the Beatles' last album released just after the group split. The single version was later issued on CD on the second disc of the Past Masters compilation.\n\nThe single reached number one in the United Kingdom, the United States, Ireland, Canada, New Zealand, Australia, France, West Germany, and Mexico. It was the Beatles' only single that credited another artist at their request. &quot;Get Back&quot; was the Beatles' first single release in true stereo in the US. In the UK, the Beatles' singles remained monaural until the following release, &quot;The Ballad of John and Yoko&quot;.\n\nThe released version of the song is composed of two verses, with an intro, outro, and several refrains. The first verse tells the story of a man named Jojo, who leaves his home in Tucson, Arizona, for some 'California grass'. McCartney's soon-to-be wife Linda had attended the University of Arizona in Tucson, where the couple later owned a spacious ranch. The second verse is about a sexually ambiguous character named &quot;Loretta Martin&quot;, who &quot;thought she was a woman, but she was another man.&quot; The single version includes a coda urging Loretta to &quot;get back&quot; to where she once belonged.\n\nBilly Preston joined the Beatles on keyboards from 22 January, having been recruited by Harrison partly with a view to deter bickering among the Beatles.\n\nIn 1980, Lennon stated that &quot;there's some underlying thing about Yoko in there&quot;, saying that McCartney looked at Yoko Ono in the studio every time he sang &quot;Get back to where you once belonged.&quot;\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Get_Back&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Get_Back&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/haLfCAAFK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/haLfCAAFK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7500kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:02:36\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:4ba25044c5d1da98d4877eadf0851bbbd1b9641d","amp;dn":"The+Beatles+-+Get+Back+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ba25044c5d1da98d4877eadf0851bbbd1b9641d","infoHashBuffer":{"type":"Buffer","data":[75,162,80,68,197,209,218,152,212,135,126,173,240,133,27,187,209,185,100,29]},"announce":[],"urlList":[]}}