{"title":"Vaughan Williams: The Collector's Edition","uid":4606292,"size":8923079023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c935e71c10275e49aef27a95c9d315ac28fcfc0&amp;dn=Vaughan+Williams%3A+The+Collector%5C%27s+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"eddie1969","files":649,"time":1230482537,"description":"Celebrated as the musical poet of the English landscape, Vaughan Williams was also a visionary composer of enormous range: from the pastoral lyricism of The Lark Ascending and the still melancholy of Silent Noon to the violence of the Fourth Symphony and the grand ceremonial of All people that on earth do dwell, he assumed the mantle of Elgar as our national composer. This edition, released to mark the 50th anniversary of his death, presents all the major orchestral, chamber, vocal and stage works, as well as many lesser pieces and rarities, in the finest interpretations. All your favourite Vaughan Williams is here, in over 34 hours of music on 30 CDs.\n\nVolumes 1-6 contain the nine symphonies played by the RLPO conducted by Vernon Handley, together with the Oboe Concerto played by Jonathan Small and the Serenade to Music (Choral version, with the RLP Choir). \n\nDisc 7 has the Wasps Suite and Piano Concerto, one-piano version (Piers Lane and the RLPO/Handley again), plus the Prelude and Fugue in C minor originally written for organ, but here in its impressive orchestral guise. \n\nDisc 8 starts with the two-piano version of the Piano Concerto, then Job, both under Boult, but with different orchestras (LPO/LSO). \n\nDisc 9 has the 16 soloist version of the Serenade to Music under Boult (sublime!) the English Folksong Suite in its orchestral guise with the LSO, the Norfolk Rhapsody No.1 with the New Philharmonia, the Fantasia on Greensleeves with the LSO, In the Fen Country with the New Philharmonia, and perhaps the most famous recording of The Lark Ascending with Hugh Bean as soloist. \n\nOn Disc 10, we have the Tallis Fantasia with the Bournemouth SO under Silvestri (a shame that EMI didn't include the Barbirolli recording), the March Sea Songs and Folksong Suite (again) both in their wind band versions (played by the Central Band of the Royal Air Force), Dawn Patrol from the film Coastal Command with the RLPO under Charles Groves, the Concerto Grosso with the LPO under Boult, the famous recording of the Romance for harmonica and strings with the dedicatee, Larry Adler(+ BBCSO/Sargent) and the Tuba Concerto with the LSO/Barbirolli. \n\nDisc 11, which is devoted to recordings by the Northern Sinfonia of England and Sinfonia Chorus under Richard Hickox, begins with the orchestral version of the Serenade to Music, the Overture to The Poisoned Kiss, Old King Cole, Five Mystical Songs (a shame they didn't use the Willcox/Shirley Quirk version instead, which is more attuned with the spirit of the music), Prelude on an Old Carol Tune, The Running Set, prelude to 49th Parallel and the Sea Songs March (orchestral version). \n\nDisc 12 has the orchestral version (by Gordon Jacob) of the Brass Band Variations, with the Bournemouth SO under Brendan O'Brien (a good and little known piece), Two Hymn Tune Preludes, the Concerto Accademico (Violin Concerto) with Bradley Creswick as soloist, Three Preludes on Welsh Hymn Tunes in its orchestral guise (what a good piece!), these last three with the Northern Sinfonia under Hickox, then as a slightly different filler, the String Quartet No. 1 in G minor with the Britten Quartet (what a fantastic and underrated piece of chamber music this is!). \n\nDisc 13 continues the chamber music theme, with the Violin Sonata, the Phantasy Quintet, 6 Studies in English Folksong in its cello and piano version, and the String Quartet No. 2 (Music Group of London). \n\nDisc 14 is a compilation of old favourite recordings conducted by Boult, with Toward the Unknown Region, Dona Nobis Pacem, the Fantasia Concertante on the Old 104th and the (beautifully Holstian) Magnificat with Helen Watts as soloist. \n\nIt gets better... Disc 15 begins with John Westbrook as speaker in An Oxford Elegy, then there's the Whitsuntide Hymn from Three Choral Hymns sung by Robin Doveton, Flos Campi with Cecil Aronowitz and the Jacques Orchestra, and a quite superb performance of Sancta Civitas with the LSO/Shirley Quirk/ Partridge with the Bach Choir and the LSO/David Willcocks (what a neglected VW gem this is...). \n\nCan it continue? Yes it can, as disc 16 is a cornucopia of wonderful Willcocks, with his magical recordings of Five Tudor Portraits, the Benedicite and Five Variants of Dives and Lazarus. \n\nDisc 17 turns to Christmas fare, with the Fantasia on Christmas Carols (strings and organ version) with the City of Guildford Orchestra/Barry Rose, and then it's back to Willcocks and the Bach Choir (and Janet Baker) in the Christmas cantata Hodie - if you're still in doubt, try &quot;It was the winter wild&quot; or &quot;The Oxen&quot;. \n\nJust in case you haven't had enough Christmas music, the full orchestral version of the Fanstasia on Christmas Carols (with the LSO/Hickox) begins disc 18, then there is We've been awhile a-wandering in a choral/orchestral version (Bach Choir/Willcocks) and the choral suite derived from VW's opera Sir John in Love, In Windsor Forest (Bournemouth SO/Bournemouth Symphony Choir/ del Mar). Then two real classics, Songs of Travel in its orchestral version with Thomas Allen and On Wenlock Edge with Robert Tear, both with the City of Birmingham Symphony Orchestra/Simon Rattle (what a shame he hasn't yet recorded the symphonies yet...). \n\nThen we are on to a really good and diverse selection of miscellaneous choral pieces on disc 19, including (among other things) the Mass in G minor (King's College Choir/Willcocks), the Te Deum in G, O taste and see, and two versions of All people that on earth do dwell. \n\nDiscs 20 and 21 are devoted to songs - with Ian Patridge taking the palm for his brilliant singing of the Four Hymns (for voice, viola and piano), Merciless Beauty, Ten Blake Songs and On Wenlock Edge (have any of these ever been sung more affectingly?). Anthony Rolfe Johnson then sings The House of Life and the Songs of Travel, the latter in its original voice and piano version. \n\nDiscs 23 and 24 contain a variety of oddments, including the London Madrigal Singers in folk songs, Janet Baker singing Linden Lea, and also a choral version of Linden Lea with the Choristers of St Paul's Cathedral. Solo-voice folk song arrangements with Robert Tear and Philip Ledger (piano) are on disc 23 - just listen and wonder at How cold the wind doth blow - and this disc is rounded off with Boult conducting VW's post-WW2 commemorative piece, A Song of Thanksgiving. \n\nDisc 24 starts with the cantata Epithalamion (LPO/Bach Choir/Willcocks), and then the rest of the box is devoted to VW's operas - Riders to the Sea (the Meredith Davies version - unequalled), Hugh the Drover (discs 25 and 26 - RPO/Groves), Sir John in Love (discs 27 and 28 - NPO/Meredith Davies) and, if all the rest were not enough, The Pilgrim's Progress in the recording by the LPO with Boult/John Noble, which in my view is the best-ever recorded performance (so far) of this masterpiece, including (at the very end) some rehearsal extracts, which are worth hearing maybe once. \n\n","torrent":{"xt":"urn:btih:4c935e71c10275e49aef27a95c9d315ac28fcfc0","amp;dn":"Vaughan+Williams%3A+The+Collector%5C%27s+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c935e71c10275e49aef27a95c9d315ac28fcfc0","infoHashBuffer":{"type":"Buffer","data":[76,147,94,113,193,2,117,228,154,239,39,169,92,157,49,90,194,143,207,192]},"announce":[],"urlList":[]}}