{"title":"Discovery.Channel.World.War.II.In.HD.Colour.09of13.Overlord.XviD","uid":6392343,"size":855029760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4cc2f4a4dc180b3a592e6e661cac3f659175c6f5&amp;dn=Discovery.Channel.World.War.II.In.HD.Colour.09of13.Overlord.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1305393513,"description":"Nugus Martin Productions has accumulated probably the best collection of rare and unseen footage of World War II in the world. By using the very latest colorization techniques it is now possible to show the full story of World War II as it has never been fully seen before. With the very latest satellite delivered terrain mapping and state of the art graphics this story can now be told with the very latest access to information which was not previously available to other older series.\n\nConventional wisdom has recently changed as more and more secrets have been revealed particularly in the last five to ten years as documents, files and photographs have been released. Code breaking revelations, and newly released government papers on both sides of the Atlantic have added a very insightful new dimension to the understanding of this the worlds' greatest ever conflict. Narrated by English actor Robert Powell, WORLD WAR II IN HD COLOUR is a vivid, in-depth experience that provides viewers with new insights and information.\n\nAlso Known As: World War II in Colour and HD\n\nColourisation and Restoration : Westwing Studios Inc.\nExecutive Producer : Matthew Barrett\n\nNugus/Martin Productions (2009)\n\n\nEpisode 9 : Overlord\n\nToday it is easy to see D-Day as inevitable - a straightforward victory against a German army that was already all but defeated. This film explodes that myth. It charts the careful planning of the campaign, the development of specialised equipment needed for the amphibious landing. It reveals the deception plan that wrong footed Hitler. It shows how the Americans were very nearly driven off Omaha beach. If that had happened, the whole operation might have failed. The film ends with the Liberation of Paris, as the Free French forces led by Charles de Gaulle matched down the streets of the capital.\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2016 kbps\nVideo Resolution: 608x352\nVideo Aspect Ratio: 1.727:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 51:27.720\nNumber Of Parts: 13\nPart Size: 855,058,432 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:4cc2f4a4dc180b3a592e6e661cac3f659175c6f5","amp;dn":"Discovery.Channel.World.War.II.In.HD.Colour.09of13.Overlord.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc2f4a4dc180b3a592e6e661cac3f659175c6f5","infoHashBuffer":{"type":"Buffer","data":[76,194,244,164,220,24,11,58,89,46,110,102,28,172,63,101,145,117,198,245]},"announce":[],"urlList":[]}}