{"title":"Rancid - Discography (1992-2008) [FLAC]","uid":9164261,"size":3271767269,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4cc48b16be9e235ee356f35ca3a9880d6794e8e5&amp;dn=Rancid+-+Discography+%281992-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"politux","files":-1,"time":1383938797,"description":"\n  Rancid - Discography (1992-2008) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk, Alternative, Ska-Punk\n  Source: CD, vinyl\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1992 Give 'Em The Boot (Demo)\n  1992 Rancid (7&quot;)\n  1993 Rancid\n  1994 Let's Go\n  1995 ... And Out Come The Wolves\n  1998 Life Won't Wait\n  2000 Let Me Go EP\n  2000 Rancid\n  2002 BYO Series 3: NOFX/Rancid Split\n  2003 Indestructible\n  2008 B sides and C sides\n\n  One of the cornerstone bands of the '90s punk revival, Rancid's unabashedly classicist sound drew heavily from the Clash's early records, echoing their left-leaning politics and fascination with ska, while adding a bit of post-hardcore crunch. While some critics dismissed Rancid as derivative, others praised their political commitment, surging energy, and undeniable way with a hook. And, regardless of critical debate over their significance, the band's strengths made them perhaps the most popular neo-punk band after Green Day and the Offspring. Their third album, 1995's ...And Out Come the Wolves, made them a platinum-selling sensation and an inescapable presence on MTV and modern rock radio. While they never translated that success into an enormous blockbuster record (like the aforementioned bands who hit the mainstream first), that wasn't necessarily their ambition, choosing to stay with the independent punk label Epitaph and the creative freedom it allowed them. That decision helped them retain a large, devoted core audience as revivalist punk-pop began to slip off the mainstream's musical radar.\n\n  Rancid were formed in 1991 by San Francisco Bay Area punk scenesters Tim Armstrong (guitar/vocals) and Matt Freeman (bass). Lifelong friends and longtime punk fans, the two had grown up together in the small, working-class town of Albany, near Berkeley; they'd also played together in the legendary ska-punk band Operation Ivy, Armstrong as &quot;Lint&quot; and Freeman as Matt McCall. After Op Ivy disbanded in 1989, Armstrong and Freeman spent a few weeks in the ska-punk outfit Dance Hall Crashers, as well as Downfall; Freeman later briefly joined the hardcore band MDC. Meanwhile, Armstrong was waging a battle with alcoholism (but, fortunately, winning), and to help keep his friend occupied, Freeman suggested they escape their day jobs by forming a new band, which became Rancid. The duo added drummer Brett Reed, Armstrong's roommate and a familiar presence on the Gilman Street scene where Operation Ivy had cut their teeth. Just a couple of months later, Rancid were performing live around the area, and in 1992 they released a five-song debut EP on Lookout! Records.\n\n  The EP caught the attention of Epitaph Records founder/Bad Religion guitarist Brett Gurewitz, and Epitaph signed Rancid to a highly favorable contract guaranteeing the group a generous amount of creative control. The band's eponymously titled, first full-length album arrived in 1993, pursuing an up-tempo, hardcore/skatepunk style with few hints of early British punk. Rancid had been seeking a second guitarist, and Green Day's Billie Joe Armstrong even played live with the group at one show. They pursued Lars Frederiksen, a Bay Area resident who'd joined a later incarnation of U.K. Subs and was performing with the band Slip; Frederiksen initially declined Rancid's invitation to join, but when Slip disbanded, he quickly changed his mind and came along on Rancid's first tour. Frederiksen made his recording debut on the early-1994 EP Radio Radio Radio, a side dalliance on Fat Wreck Chords. Released later that year, Let's Go was the album that made Rancid's name in the punk underground. It marked the beginnings of their fascination with the 1977-era London punk scene, particularly the Clash, and it also provided their first widespread exposure when MTV picked up on the video for the single &quot;Salvation.&quot; Let's Go quickly went gold, and with the breakout mainstream success of Green Day and the Offspring that year, major-label interest in Rancid quickly escalated into a full-fledged bidding war (even Madonna's Maverick imprint got in on the action). Ultimately, Rancid decided that no major could offer them the level of decision-making power that Epitaph had given them, and stayed right where they were.\n\n  Rancid scored a major success with their next album, 1995's ...And Out Come the Wolves, whose title was a reference to the near-predatory interest in signing the band. The Clash fetish was even more pronounced, augmented with a greater interest in the original Two-Tone ska revival the Clash had helped influence (bands like the Specials). &quot;Ruby Soho&quot; was a major MTV and radio hit, and &quot;Time Bomb&quot; and &quot;Roots Radicals&quot; were hits in their own right. The album went platinum and made Rancid one of the most visible punk bands around. They played the 1996 Lollapalooza Tour, and afterward took a short break, their first since becoming a quartet. During that time, Freeman played with former X singer Exene Cervenka in Auntie Christ, while Armstrong set up the Epitaph subsidiary Hellcat; he and Frederiksen both began doing production work for other bands they hoped to spotlight.","torrent":{"xt":"urn:btih:4cc48b16be9e235ee356f35ca3a9880d6794e8e5","amp;dn":"Rancid+-+Discography+%281992-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc48b16be9e235ee356f35ca3a9880d6794e8e5","infoHashBuffer":{"type":"Buffer","data":[76,196,139,22,190,158,35,94,227,86,243,92,163,169,136,13,103,148,232,229]},"announce":[],"urlList":[]}}