{"title":"Aircraft Communications and Navigation Systems: Principles, Main","uid":10994659,"size":49243531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d0a03910cbbeb361e4a612ce48a756a879d50f0&amp;dn=Aircraft+Communications+and+Navigation+Systems%3A+Principles%2C+Main&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"thilanga123","files":1,"time":1410050931,"description":"Aircraft Communication and Navigation Systems, Principles Maintenance and Operation\nby Michael H. Tooley, David Wyatt\n\n\n\nProduct Details\n\nPaperback: 336 pages\nPublisher: A Butterworth-Heinemann Title; 1 edition (Sept. 14 2007)\nLanguage: English\nISBN-10: 0750681373\nISBN-13: 978-0750681377\n\n\nReview\nButterworth-Heinemann's Aircraft Engineering Principles and Practice Series provides students, apprentices and practicing aerospace professionals with the definitive resources to advance their aircraft engineering maintenance studies and career.\n\nThis book provides an introduction to the principles of communications and navigation systems. It is written for anyone pursuing a career in aircraft maintenance engineering or a related aerospace engineering discipline, and in particular will be suitable for those studying for licensed aircraft maintenance engineer status. The book systematically addresses the relevant sections (ATA chapters 23/34) of modules 11 and 13 of part-66 of the EASA syllabus. It is ideal for anyone studying as part of an EASA and FAR-147 approved course in aerospace engineering.\n\n* Delivers the essential principles and knowledge base required by Airframe and Propulsion (A&amp;P) Mechanics for Modules 11 and 13 of the EASA Part-66 syllabus and BTEC National awards in aerospace engineering\n* Supports Mechanics, Technicians and Engineers studying for a Part-66 qualification\n* Comprehensive and accessible, with self-test questions, exercises and multiple choice questions to enhance learning for both independent and tutor-assisted study\n\nSEED as long as you can\n\n","torrent":{"xt":"urn:btih:4d0a03910cbbeb361e4a612ce48a756a879d50f0","amp;dn":"Aircraft+Communications+and+Navigation+Systems%3A+Principles%2C+Main","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d0a03910cbbeb361e4a612ce48a756a879d50f0","infoHashBuffer":{"type":"Buffer","data":[77,10,3,145,12,187,235,54,30,74,97,44,228,138,117,106,135,157,80,240]},"announce":[],"urlList":[]}}