{"title":"Guns N' Roses - Chinese Democracy (2008) WMA320","uid":6163438,"size":186556264,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d1407c8916f6d2bb8a3435c4fb4e5ff3b273902&amp;dn=Guns+N%5C%27+Roses+-+Chinese+Democracy+%282008%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297298036,"description":"There's a reason why some people can't quite get their minds around Guns N' Roses' latest offering: Axl Rose didn't make a traditional rock n' roll album, he made a movie soundtrack. And the movie is the version of Axl's life that's playing inside his head. \n\nLike other folks, I didn't know what to make of Chinese Democracy the first couple listens. My initial response was, &quot;Take a familiar GNR album, Appetite for Destruction for example, dial down the guitars, drop in layers of pianos, strings, choirs and all manner of excess, splice in a kitchen sink's worth of odd background voice and sound bits, then compress the mix until it's almost unrecognizable as a GNR product.&quot; No wonder many folks' reaction upon release was, &quot;What a disappointment.&quot; Upon the third or fourth listening, however, it dawned on me: movie soundtrack. \n\nApproach the album in that context, listen to it a few more times, and after a while you'll conclude, &quot;Wow, this is a pretty good album. In fact, this is a pretty good Guns N' Roses album.&quot; Listen to it eight or ten times and you might even conclude, &quot;Wow, Axl's lyrics are much better than people gave him credit for. There's some brilliant songwriting here.&quot; That's because in the context of a movie soundtrack, songs that initially don't make sense become standouts, both musically and lyrically: &quot;Chinese Democracy&quot; opens the film with explosive action, a sonic and verbal kick in the teeth: &quot;...all I got is precious time&quot;. After &quot;Shackler's Revenge&quot; we settle down for some serious drama: &quot;Better&quot; is a powerful examination of an individual's inner heartbreak, pain, and eventual self realization, Axl singing, &quot;No one ever told me when I was alone. They just thought I'd know better, better.&quot; &quot;Street of Dreams&quot; explores a similar theme of loss and bitter disillusionment: &quot;What I thought was true before were lies I couldn't see. What I thought was beautiful is only memories.&quot; \n\nMany reviewers have raved about &quot;If the World&quot; and rightly so - it's a good song, but they slough off &quot;There Was a Time&quot; as too long and derivative. I beg to differ; the last 2 Ã‚Â½ minutes of this 6-minute opus make the build-up well worth it. Axl wails &quot;There was a time I would do anything for you...&quot; as Buckethead lays down guitar lines just as good as anything Slash put on a GNR record (sacrilege!).&quot;Catcher in the Rye&quot; and &quot;Scraped&quot; I can pass on, a spot where the movie gets a little bogged down if you will, but &quot;Riad and the Bedouins&quot; is a nice return to film action. &quot;Sorry&quot; is a kind of opposite of &quot;Better&quot; or &quot;Street of Dreams&quot;, an outward emotional reveal, if a little obvious: &quot;I'm sorry for you, not sorry for me.&quot; \n\nThat out of the way, the movie rocks to its conclusion, with Axl threatening in &quot;IRS&quot; to not just fight back, but to stomp you out. &quot;Madagascar&quot; is the movie's climactic scene: a declaration of newfound strength, dignity, and optimism for the future. It is a brilliant song, kitchen sink and all. \n\nThen it's over - or at least you think it is. &quot;This I Love&quot; is the song playing as the credits roll and you fish for your coat and keys. A bit sappy and overdramatic, it could easily fit into one of Tim Rice's bombastic musicals (&quot;Didn't I hear that in Phantom of the Opera?&quot;) It's okay, though, `cause you're leaving and it's just music over the credits. You're already several feet out the door when you realize that Axl didn't leave. He has one more thing to say in &quot;Prostitute&quot;: &quot;Ask yourself what would I choose: To prostitute myself, to live with fortune and shame? Oh, yeah. When you should have turned to the hearts of the ones that you could not save?&quot; YOU can go now, but the movie plays on in Axl's head. \n\nby  Terrence E. Martau\n\nTRACKLIST:\n\n01 - Chinese Democracy.wma                             \n02 - Shackler's Revenge.wma                            \n03 - Better.wma                                        \n04 - Street Of Dreams.wma                              \n05 - If The World.wma                                  \n06 - There Was A Time.wma                              \n07 - Catcher In The Rye.wma                            \n08 - Scraped.wma                                       \n09 - Riad N' The Bedouins.wma                          \n10 - Sorry.wma                                         \n11 - I.r.s.wma                                         \n12 - Madagascar.wma                                    \n13 - This I Love.wma                                   \n14 - Prostitute.wma     \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:4d1407c8916f6d2bb8a3435c4fb4e5ff3b273902","amp;dn":"Guns+N%5C%27+Roses+-+Chinese+Democracy+%282008%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d1407c8916f6d2bb8a3435c4fb4e5ff3b273902","infoHashBuffer":{"type":"Buffer","data":[77,20,7,200,145,111,109,43,184,163,67,92,79,180,229,255,59,39,57,2]},"announce":[],"urlList":[]}}