{"title":"The Complete Repairman Jack Series (21 Novels) By F. Paul Wilson","uid":8320514,"size":34860022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d9e44cfe44d5d1d9173a815d74d44d60fef3708&amp;dn=The+Complete+Repairman+Jack+Series+%2821+Novels%29+By+F.+Paul+Wilson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"maxdesolate","files":103,"time":1364659753,"description":"epub,mobi and txt.\n\nseries info - http://www.repairmanjack.com/forum/content.php?s=84977219fa4bb21f13ad75edfbd308cb&amp;4-published-fiction\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Repairman_Jack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Repairman_Jack&lt;/a&gt;\n\nRepairman Jack is a self-titled &quot;fix-it&quot; man, but not in the common workshop sense. He is something of an underground mercenary, hired by everyday people to fix situations that cannot be dealt with through legal means (e.g. by blackmail). He is careful about who he agrees to do fix-its for, preferring innocent, desperate citizens being victimized with no one else to turn to. These fix-its usually begin simply, but grow into complex problems that begin to involve more and more science-fiction and supernatural elements as the novels continue. The second novel, Legacies, is the only one that is completely free of any overtly supernatural elements.\n\nAll of Jack's fix-its are immediately relevant problems in today's world, covering topics such as conspiracy groups, grassroots movements, designer drugs, public shootings, terrorists, legal dealings and scientific and biological experiments. Jack relies on his brain, wits, experience and real-life weapons and techniques to do battle, and though he makes increasing use of supernatural sources of information (a spiritual medium), he has so far not used supernatural weapons or abilities in battle.\n\nJack hides his identity from the government and does his best to not leave behind traces of his identity when out and about. He advertises his services strictly by word of mouth and via an anonymous website.\n\nplease keep seeding and dont let the torrent die. ","torrent":{"xt":"urn:btih:4d9e44cfe44d5d1d9173a815d74d44d60fef3708","amp;dn":"The+Complete+Repairman+Jack+Series+%2821+Novels%29+By+F.+Paul+Wilson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d9e44cfe44d5d1d9173a815d74d44d60fef3708","infoHashBuffer":{"type":"Buffer","data":[77,158,68,207,228,77,93,29,145,115,168,21,215,77,68,214,15,239,55,8]},"announce":[],"urlList":[]}}