{"title":"Ingmar Bergman The Life and Films of the Last Great European Dir","uid":11459844,"size":1642829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d9f94fb4b75cb104da8376ee09b538050d885c6&amp;dn=Ingmar+Bergman+The+Life+and+Films+of+the+Last+Great+European+Dir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415974408,"description":"Ingmar Bergman was the last and arguably the greatest of the old-style European auteurs and his influence across all areas of contemporary cinema has continued to be considerable since his death in July 2007. Drawing on interviews with collaborators and original research, this book puts Bergman's career into the context of his life and offers a new and revealing portrait of this great filmmaker.\n\nGeoffrey Macnab explores the often painfully autobiographical nature of his work, while also looking in detail at Bergman as a craftsman. He considers Bergman's working relationship with his actors (especially the actresses he helped make into international stars), his passion for theatre, literature and classical music and his obsession with death and cruelty. The book traces his traumatic childhood, asking how his experiences growing up as the son of a strict Lutheran pastor fed into his later writing and filmmaking. It also looks at his political life, chronicling his teenage flirtation with Nazi-sm, his bitter spat in the mid-70s with the Swedish authorities over his tax affairs and his often vexed relationship with his fellow Swedes. Geoffrey Macnab also considers how Bergman's work was financed and distributed, his relationship with US agents and how close he came to working in Hollywood.\n\nPublisher: I. B. Tauris; 1 edition (August 4, 2009)\nLanguage: English\nISBN-10: 1848850468\nISBN-13: 978-1848850460","torrent":{"xt":"urn:btih:4d9f94fb4b75cb104da8376ee09b538050d885c6","amp;dn":"Ingmar+Bergman+The+Life+and+Films+of+the+Last+Great+European+Dir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d9f94fb4b75cb104da8376ee09b538050d885c6","infoHashBuffer":{"type":"Buffer","data":[77,159,148,251,75,117,203,16,77,168,55,110,224,155,83,128,80,216,133,198]},"announce":[],"urlList":[]}}