{"title":"Seconds 1966 w/ Rock Hudson.avi","uid":5231949,"size":730470400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4db1c3fed9aed0681c431f7895c695feab2ca87e&amp;dn=Seconds+1966+w%2F+Rock+Hudson.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"sharpsponge","files":1,"time":1261365344,"description":"SECONDS (1966) DVDRIP\nGreat John Frankenheimer film finds Rock Hudson actually doing some acting! &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060955/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060955/&lt;/a&gt;\n\nIMDB rating: 7.6/10 out of 4,018 votes \nSynopsis: What if someone offered you the chance to begin again, with a new life that was organized to be exactly what you wanted it to be? That's what the organization offers some wealthy people. They find a life that is what their clients would have wanted, artist, writer, politician, kill the person who is to be replaced and surgically alter their clients to take their places. We follow a new client from first contact, through his staged death, to surgery, recovery and replacement. Of course thats when things become complicated.\n\nAmazon rating: 4.5 out of 5 stars / 69 customer ratings\nSynopsis: Rock Hudson stars in this unsettling look at second chances. Banker Arthur Hamilton (John Randolph) lives a comfortable, stifling life until he is contacted by a mysterious caller offering &quot;what every middle-aged man wants: complete freedom.&quot; Hamilton, with the help of an enigmatic corporation, fakes his own death and starts over in his new swinging-bachelor persona (now played by Rock Hudson). A change of life, though, is not just a change of scenery, and Seconds, for all its thriller aspects, contains some sad and disturbing meditations on the way we make our own prisons. Director John Frankenheimer uses skewed angles, bizarre close-ups, and fisheye lenses to underscore the film's off-kilter tension, and Rock Hudson gives a performance that is light-years removed from Pillow Talk. Well worth watching twice.","torrent":{"xt":"urn:btih:4db1c3fed9aed0681c431f7895c695feab2ca87e","amp;dn":"Seconds+1966+w%2F+Rock+Hudson.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4db1c3fed9aed0681c431f7895c695feab2ca87e","infoHashBuffer":{"type":"Buffer","data":[77,177,195,254,217,174,208,104,28,67,31,120,149,198,149,254,171,44,168,126]},"announce":[],"urlList":[]}}