{"title":"The Jayhawks - Sound Of Lies (Remastered 2014) MP3VBR Beolab1700","uid":10495447,"size":149199141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4dce1c7f9f3c5b05add55a03c7d5995404f70c0d&amp;dn=The+Jayhawks+-+Sound+Of+Lies+%28Remastered+2014%29+MP3VBR+Beolab1700&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Beolab1700","files":19,"time":1404611058,"description":"[center]\n\n[size=5]The Jayhawks - Sound Of Lies (Remastered 2014) MP3VBR Beolab1700[/size]\n\n[IMG]http://i.imgur.com/e3TNQDi.jpg[/IMG]\n\n---------------------------------------------------------------------\n                    The Jayhawks - Sound Of Lies\n---------------------------------------------------------------------\n\nArtist...............: The Jayhawks\nAlbum................: Sound Of Lies\nGenre................: Rock\nSource...............: CD\nYear.................: 2014\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.98\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 235kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: \n\nPosted by............: Beolab1700 on 06/07/2014\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. The Jayhawks - The Man Who Loved Life                   [04:59]\n   2. The Jayhawks - Think About It                           [05:36]\n   3. The Jayhawks - Trouble                                  [04:49]\n   4. The Jayhawks - It's Up To You                           [03:38]\n   5. The Jayhawks - Stick In The Mud                         [03:35]\n   6. The Jayhawks - Big Star                                 [04:24]\n   7. The Jayhawks - Poor Little Fish                         [03:55]\n   8. The Jayhawks - Sixteen Down                             [05:22]\n   9. The Jayhawks - Haywire                                  [05:21]\n  10. The Jayhawks - Dying On The Vine                        [05:51]\n  11. The Jayhawks - Bottomless Cup                           [04:14]\n  12. The Jayhawks - Sound Of Lies                            [04:00]\n  13. The Jayhawks - I Hear You Cry                           [03:48]\n  14. The Jayhawks - Sleepyhead                               [03:30]\n  15. The Jayhawks - Kirby's Tune (Studio Outtake)            [05:36]\n  16. The Jayhawks - It's Up To You (Alternate Version)       [03:39]\n  17. The Jayhawks - Sound Of Lies (Rough Mix)                [04:24]\n\nPlaying Time.........: 01:16:50\nTotal Size...........: 129.28 MB\n\n\n---------------------------------------------------------------------\n\nREQUESTED UPLOAD\n\nHailed as pioneers of the alt-country/Americana sound, the Jayhawks emerged from Minneapolis' mid-'80s scene with a soaring combination of folksy harmonies and power-pop melodies. The band's status as a major influence, as well as that of being one of the best bands of its generation, are richly deserved.\n\nThe July 1st release of expanded versions of 1997's SOUND OF LIES, 2000's SMILE and 2003's RAINY DAY MUSIC complete the band's remastering of its entire back catalog. All three American Recordings/UME releases contain bonus tracks, new liner notes and expanded booklets. The albums also chronicle the band's evolution into crunchier rock, purer pop and a sort of twangy, psychedelic vibe before coming full-circle with a spare country-rock sound.\n\nSOUND OF LIES, SMILE and RAINY DAY MUSIC will also be released August 5th as deluxe, 2 LP vinyl editions to ensure maximum fidelity. The deluxe vinyl reissues will be remastered on 180 gram heavyweight vinyl and also include the bonus tracks.\n\nThe Jayhawks formed in 1985 when Gary Louris was in the decidedly small crowd at the first show future songwriting partner Mark Olson did with bassist Marc Perlman and Norm Rogers (the first in a string of drummers, at least until Tim O'Reagan joined in 1995). A self-titled album was released on a local indie label and Minneapolis' Twin/Tone released some of the band's demos as &quot;Blue Earth&quot; in 1989. Legend has it that producer George Drakoulias (Black Crowes) heard the music in the background during a phone call to the label; Drakoulias eventually signed the band to Rick Rubin's Def American records and produced &quot;Hollywood Town Hall&quot; (1992) and &quot;Tomorrow The Green Grass&quot; (1995), making the Jayhawks staples on the then-emerging adult-alternative radio format.\n\nOlson, the folksier member of the songwriting team, abruptly left the band in 1995. The band regrouped and kept the name, but Olson's departure and a divorce colored Louris' dark lyrics of the subsequent Jayhawks album, &quot;Sound of Lies.&quot; With pianist Karen Grotberg as a permanent addition and harmony partner, Louris took advantage of his newfound freedom to experiment with '60s pop and a more electric sound, even getting a little crunchy around the edges on &quot;Think About It.&quot;\n\nLouris' lyrics took a more optimistic, albeit cautiously so, turn on the ambitious &quot;Smile,&quot; produced by Bob Ezrin (Pink Floyd, Lou Reed, KISS, Alice Cooper). Jen Gunderman stepped in when Grotberg left to raise a family, and this time Louris' ventures into contemporary pop featured looping and overdubs, turning downright trip-hop on &quot;Queen of the World,&quot; &quot;Somewhere in Ohio&quot; and &quot;(In My) Wildest Dreams.&quot; It may have been an artistic triumph, but even with the twangy &quot;Better Days&quot; and &quot;I'm Gonna Make You Love Me,&quot; the album proved to be a bit much for fans of the Jayhawks' earlier sound and came after the decline of the adult-alternative format. The headline on a New York Times story about the band asked, &quot;What If You Made a Classic, and No One Cared?&quot;\n\nIt was after an acoustic tour that Louris, Perlman, O'Reagan and guitarist Stephen McCarthy recorded 2003's &quot;Rainy Day Music,&quot; a seeming return to form. The first four tracks are a mini masterpiece -- the gently chiming &quot;Stumbling Through the Dark&quot; (written by Louris and Matthew Sweet), the twang-meets-&quot;Eve of Destruction&quot; feel of the soaring &quot;Tailspin,&quot; the country gospel harmonies of &quot;All the Right Reasons&quot; and the catchy, bittersweet &quot;Save It for a Rainy Day&quot; (if you're trolling the songs on YouTube, that is indeed Mary-Louise Parker in the video). Instead of the earnest folk of the Jayhawks' early days, there's a sophisticated, spare sound and a Byrds/CSNY/Buffalo Springfield vibe. Producer Ethan Johns' credits speak for themselves -- CSN, Ryan Adams, Kings of Leon, Ray LaMontagne, Crowded House, Laura Marling just to name a few.\n\nIt will be the basic lineup from the band's 1997 shows -- Louris, Perlman, O'Reagan, Grotberg and Kraig Johnson -- that will tour in support of the reissues. Much of July and part of August will be spent on a mix of headlining and festival dates in Europe, followed by a fall tour of the U.S. and Canada. Confirmed dates follow; for a current list of shows go to\n\n---------------------------------------------------------------------\n\n\n[/center]","torrent":{"xt":"urn:btih:4dce1c7f9f3c5b05add55a03c7d5995404f70c0d","amp;dn":"The+Jayhawks+-+Sound+Of+Lies+%28Remastered+2014%29+MP3VBR+Beolab1700","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dce1c7f9f3c5b05add55a03c7d5995404f70c0d","infoHashBuffer":{"type":"Buffer","data":[77,206,28,127,159,60,91,5,173,213,90,3,199,213,153,84,4,247,12,13]},"announce":[],"urlList":[]}}