{"title":"007 Spectre 2015 HDTS X264 AC3-CPG","uid":12782944,"size":1996923649,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ddbaf6e7b61b5573f869ac063554bc81da80f4e&amp;dn=007+Spectre+2015+HDTS+X264+AC3-CPG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"xxxlavalxxx","files":5,"time":1447824620,"description":"http://extraimago.com/image/e2z\r\n \nhttp://www.imdb.com/title/tt2379713/\r\n\r\n\r\nA cryptic message from Bond's past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.\r\n\r\nDirector: Sam Mendes\r\nWriters: John Logan (screenplay), Neal Purvis (screenplay)\r\nStars: Daniel Craig, Christoph Waltz, Léa Seydoux \r\nGenres: Action | Adventure | Thriller\r\nCountry: UK | USA\r\nLanguage: English | Spanish | Italian | German | French\r\n\r\n\r\nREAD NOTES\r\n\r\nyap its me HELLOO.. How Are You! adele is so addicted man.. Anyways\r\nwe saw lot of complaints on previous release i mean seriously ppl really expect big from First CAMs. nonetheless we still stand by our words that was good early cam regardless what others think. anyways here is a lil bit story behind this release...\r\n\r\nwe have one source with HC Subs for days but was incomplete, we waited much but nothing show up until yesterday a good TC got out with Subs but was jerky as hell.. so i what i did is that,  combined both sources to get Full One,\r\n1.hr and few mins has HC Subs and second half has None but constant blur at bottom right side, luckily most of the parts are night scenes so you wont see that blur much.\r\ni spend some hours on blurring and removing frames etc of watermarks. Now there are none. big fat 0.\r\ndid usual stuff on both sources, bright, rgb, sharpness, crop, resize blah blah... and some of our magic on it. then synced TC audio to it... spent some Quality time on it. all buttsynced i mean lipsynced. LMAO\r\nThere are no audio cuts or oos, line audio from start to end. i check twice this time. sorry about last time was caught up in hurry..\r\nDark scenes are great, easy to see,  a bit of flicker on first half i did removed a lil but not much because i don't want to washed out the details and bit jerky at second half, luckily its not that much but its there.\r\n\r\nNOW TO Complainers and smart a$$ comments by unrelated group members.. we have spent much man hours on it and put every detail that needed above in notes and added 3 video samples including dark scene. i suggest you all check those samples first. CAM/TS are always on take it or leave it...  if you think you can do better then instead of complaining show your work or move along no-one telling you to download this.\r\n\r\nwe have worked on 720p it needed colors work and all that, its 14hrs of encode, will drop that soon.\r\n\r\nEnjoy or Don't .... i Will \r\n\r\n\r\nVideo: x264 2 Passes @ 1550kbps\r\nResolution: 720x320 @ 25fps\r\nAudio: AC3 @ 192kbps 2.0\r\nLanguage: English\r\nSubtitles: 1hr of HC foreign Subs Plus Hardcoded English subs for foreign parts where needed.\r\nSample: 3 included in torrent, check them first.\r\nSources: Multi CAM Sources. read notes above.\r\nEncoder: CPG\r\n\r\n \nhttp://extraimago.com/image/BQx \nhttp://extraimago.com/image/BQ6 \nhttp://extraimago.com/image/BQV \nhttp://extraimago.com/image/BQu \nhttp://extraimago.com/image/BQv \nhttp://extraimago.com/image/BQA \nhttp://extraimago.com/image/BQW","torrent":{"xt":"urn:btih:4ddbaf6e7b61b5573f869ac063554bc81da80f4e","amp;dn":"007+Spectre+2015+HDTS+X264+AC3-CPG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ddbaf6e7b61b5573f869ac063554bc81da80f4e","infoHashBuffer":{"type":"Buffer","data":[77,219,175,110,123,97,181,87,63,134,154,192,99,85,75,200,29,168,15,78]},"announce":[],"urlList":[]}}