{"title":"Refrigeration Systems and Applications 2nd ed","uid":12066312,"size":5569890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e48b3bca36ac1b9fee752e2f3b5b02313cb0b6e&amp;dn=Refrigeration+Systems+and+Applications+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1435396459,"description":"ISBN 9780470747407\n\nRefrigeration Systems and Applications, 2nd edition offers a comprehensive treatise that addresses real-life technical and operational problems, enabling the reader to gain an understanding of the fundamental principles and the practical applications of refrigeration technology. New and uniqueanalysis techniques (including exergy as a potential tool), models,correlations, procedures and applications are covered, and recent developments in the field are included - many of which aretaken from the author's own research activities in this area. Thebook also includes some discussion of global warming issues and its potential solutions. * Enables the reader to gain an understanding of the fundamental principles and the practical applications of refrigeration technologies. * Discusses crucial industrial technical and operational problems, as well as new performance improvement techniques and tools for better design and analysis. * Includes fundamental aspects of thermodynamics, fluid flow, and heat transfer; refrigerants; refrigeration cycles and systems;advanced refrigeration cycles and systems, including some novel applications; heat pumps; heat pipes; and many more. * Provides easy to follow explanations, numerous new chapter-endproblems and worked-out examples as learning aids for students and instructors.\nRefrigeration is extensively used in a variety of thermal engineering applications ranging from the cooling of electronic devices to food cooling processes. Its wide-ranging implications and applications mean that this industry plays a key role innational and international economies, and it continues to be anarea of active research and development. Refrigeration Systems and Applications, 2nd edition forms a useful reference source for graduate and postgraduate students and researchers in academia and as well as practicing engineers working in this important field who are interested in refrigeration systems and applications and the methods and analysis tools for their analysis, design and performance improvement","torrent":{"xt":"urn:btih:4e48b3bca36ac1b9fee752e2f3b5b02313cb0b6e","amp;dn":"Refrigeration+Systems+and+Applications+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e48b3bca36ac1b9fee752e2f3b5b02313cb0b6e","infoHashBuffer":{"type":"Buffer","data":[78,72,179,188,163,106,193,185,254,231,82,226,243,181,176,35,19,203,11,110]},"announce":[],"urlList":[]}}