{"title":"A Treatise Of Human Nature - David Hume.pdf","uid":8974866,"size":1761178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4eaf32caa6b45e442bfae6e6508fe11b708e545a&amp;dn=A+Treatise+Of+Human+Nature+-+David+Hume.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Agricola","files":-1,"time":1380411665,"description":"A Treatise of Human Nature \n\nAuthor - David Hume\n\nFormat - pdf\n\nRequested\n\nA Treatise of Human Nature (1739-40), David Hume's comprehensive attempt to base philosophy on a new, observationally grounded study of human nature, is one of the most important texts in Western philosophy. It is also the focal point of current attempts to understand 18th-century philosophy. The Treatise first explains how we form such concepts as cause and effect, external existence, and personal identity, and to form compelling but unconfirmable beliefs in the entities represented by these concepts. It then offers a novel account of the passions, explains freedom and necessity as they apply to human choices and actions, and concludes with detailed explanations of how we distinguish between virtue and vice and of the different kinds of virtue. Hume's Abstract of the Treatise, also included in the volume, outlines his 'chief argument' regarding our conception of, and belief in, cause and effect. The texts printed in this volume are those of the critical edition of Hume's philosophical works now being published by the Clarendon Press. The volume includes a substantial introduction explaining the aims of the Treatise as a whole and of each of its ten parts, extensive annotations, a glossary of terms, a comprehensive index, and suggestions for further reading.","torrent":{"xt":"urn:btih:4eaf32caa6b45e442bfae6e6508fe11b708e545a","amp;dn":"A+Treatise+Of+Human+Nature+-+David+Hume.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eaf32caa6b45e442bfae6e6508fe11b708e545a","infoHashBuffer":{"type":"Buffer","data":[78,175,50,202,166,180,94,68,43,250,230,230,80,143,225,27,112,142,84,90]},"announce":[],"urlList":[]}}