{"title":"A-PDF splitter 2.9 with key [Eagerforcc]","uid":6190522,"size":1779859,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:50c0671907cd80652fdb8eaecb8af73dd9fc5a64&amp;dn=A-PDF+splitter+2.9+with+key+%5BEagerforcc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"FatFreddy436","files":2,"time":1298264419,"description":"A-PDF Split is a very simple, lightning-quick desktop utility program that lets you split any Acrobat pdf file into smaller pdf files. It provides complete flexibility and user control in terms of how files are split and how the split output files are uniquely named. A-PDF Split provides numerous alternatives for how your large files are split - by pages, by bookmarks and by odd/even page. Even you can extract or remove part of a PDF file. A-PDF Split also offers advanced defined splits that can be saved and later imported for use with repetitive file-splitting tasks. A-PDF Split represents the ultimate in file splitting flexibility to suit every need.\n\nA-PDF Split works with password-protected pdf files, and can apply various pdf security features to the split output files. If needed, you can recombine the generated split files with other pdf files using a utility such as A-PDF Merger to form new composite pdf files.\n\nA-PDF Split does NOT require Adobe Acrobat, and produces documents compatible with Adobe Acrobat Reader Version 5 and above.\n\n------------------------------------------------------------------\nJust install and register with the given license code...\nKey is in the text file in the torrent...\nScannned by kaspersky internet security 2011, no threat detected...\nEnjoy from Eagerforcc...","torrent":{"xt":"urn:btih:50c0671907cd80652fdb8eaecb8af73dd9fc5a64","amp;dn":"A-PDF+splitter+2.9+with+key+%5BEagerforcc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50c0671907cd80652fdb8eaecb8af73dd9fc5a64","infoHashBuffer":{"type":"Buffer","data":[80,192,103,25,7,205,128,101,47,219,142,174,203,138,247,61,217,252,90,100]},"announce":[],"urlList":[]}}