{"title":"Ab Blast Workout with Bernadette Giorgi x264 aac [MP4]","uid":11821004,"size":1184281389,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5253b3653cce4d2a470ed5cc05d910114d16bcda&amp;dn=Ab+Blast+Workout+with+Bernadette+Giorgi+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"elessedilgirl","files":3,"time":1429260659,"description":"Just b Live - AB BLAST WORKOUT - The Just b Live AB BLAST DVD presents a focused workout aimed at strengthening your abdominals. Use an optional weighted ball or light hand-weight to help further engage the abdominals as well as to define and strengthen your entire core. A bonus BALLET workout is also present on this DVD, which is designed to give you a total body workout focusing on toning legs and butt while working on coordination and balance. The Just b Live series is an innovative new series of DVD workouts that puts YOU right into the studio with Bernadette Giorgi, the creator of the Just b method. These DVDs are the next best thing to taking a master class with Bernadette - each workout contains clear instructions and precise cuing for maximum results. Bernadette Giorgi is a certified Pilates and Fitness Instructor with a black belt in Soo Bahk Do Karate and has held national titles in forms and kick boxing. A former dancer with the Ballets Elan and Joffrey Ballet, Bernadette is a QVC-TV and Danskin Fitness Expert as well as the creator of the Just b Method.\n\nVideo; x264; 720*480 (16:9); 1744 kbps; 29.970 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:5253b3653cce4d2a470ed5cc05d910114d16bcda","amp;dn":"Ab+Blast+Workout+with+Bernadette+Giorgi+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5253b3653cce4d2a470ed5cc05d910114d16bcda","infoHashBuffer":{"type":"Buffer","data":[82,83,179,101,60,206,77,42,71,14,213,204,5,217,16,17,77,22,188,218]},"announce":[],"urlList":[]}}