{"title":"Tom Waits - Burma Shave (2006) DVDR NLT-Release (divx)","uid":6783532,"size":464746830,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:525ff15fbe6e270915bfb266453602c970dcca66&amp;dn=Tom+Waits+-+Burma+Shave+%282006%29+DVDR+NLT-Release+%28divx%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"luiehond69","files":-1,"time":1320001775,"description":"Tom Waits - Burma Shave (2006) DVDR NLT-Release (divx)\n\nThomas Alan &quot;Tom&quot; Waits (born December 7, 1949) is an American singer-songwriter, composer, and actor. Waits has a distinctive voice, described by critic Daniel Durchholz as sounding &quot;like it was soaked in a vat of bourbon, left hanging in the smokehouse for a few months, and then taken outside and run over with a car.&quot; With this trademark growl, his incorporation of pre-rock music styles such as blues, jazz, and vaudeville, and experimental tendencies verging on industrial music, Waits has built up a distinctive musical persona. He has worked as a composer for movies and musical plays and as a supporting actor in films, including Down By Law and Bram Stoker's Dracula. He was nominated for an Academy Award for his soundtrack work on One from the Heart.\n\nLyrically, Waits' songs frequently present atmospheric portrayals of grotesque, often seedy characters and places - although he has also shown a penchant for more conventional ballads. He has a cult following and has influenced subsequent songwriters despite having little radio or music video support. His songs are best-known through cover versions by more commercial artists: &quot;Jersey Girl&quot;, performed by Bruce Springsteen, &quot;Ol' '55&quot;, performed by the Eagles, and &quot;Downtown Train&quot;, performed by Rod Stewart. Although Waits' albums have met with mixed commercial success in his native United States, they have occasionally achieved gold album sales status in other countries. He has been nominated for a number of major music awards and has won Grammy Awards for two albums, Bone Machine and Mule Variations. In 2011,\n=======================================================\nThomas Alan &quot;Tom&quot; Waits (geboren 07 december 1949) is een Amerikaanse singer-songwriter, componist en acteur. Waits heeft een karakteristieke stem, die door criticus Daniel Durchholz als klinkende &quot;als het was gedrenkt in een vat met bourbon, links opknoping in de rookkamer voor een paar maanden, en daarna naar buiten genomen en lopen over met een auto.&quot; Met deze handelsmerk gegrom, zijn integratie van pre-rock muziek stijlen zoals blues, jazz en vaudeville, en experimentele tendensen grenst op industriÃƒÂ«le muziek, Waits heeft opgebouwd een opvallende muzikale persoonlijkheid. Hij werkte als componist voor films en muziek speelt en als een ondersteunende acteur in films, Down By Law en Bram Stoker's Dracula inclusief. Hij was genomineerd voor een Academy Award voor zijn soundtrack werk op Een vanuit het Hart.\n\nTekstueel, Waits 'liedjes vaak sfeervolle portretten van groteske, vaak slonzige personages en plaatsen aanwezig zijn - hoewel hij laat ook een voorliefde voor meer conventionele ballads. Hij heeft een cultus volgende en heeft invloed gehad op latere songwriters ondanks het feit dat weinig radio of muziek video-ondersteuning. Zijn liedjes zijn het best bekend door covers van meer commerciÃƒÂ«le kunstenaars: &quot;Jersey Girl&quot;, uitgevoerd door Bruce Springsteen, &quot;Ol ''55', uitgevoerd door de Eagles, en&quot; Downtown Train &quot;, uitgevoerd door Rod Stewart. Hoewel Waits 'albums hebben ontmoet met gemengd commercieel succes in zijn geboorteland de Verenigde Staten, hebben ze af en toe bereikt gouden album omzet status in andere landen. Hij is genomineerd voor een aantal grote muziek-awards en won Grammy Awards voor twee albums, Bone Machine en Mule Variations. In 2011,\n\nTracks\n1. Medley - Summertime Blues/Burma Shave (11:10)\n2. Medley - Annie's Back In Town/I Wish I Was In New Orleans/Ain't Gonna Rain (7:24)\n3. Bullets (7:29)\n4. On The Nickel (6:05)\n5. Romeo Is Bleeding (4:41)\n6. Medley - Silent Night/Christmas Card From A Hooker In Minneapolis (5:29)\n7. Medley - Small Change/Hey Big Spender/Small Change (8:38)\n8. Digital Greetings From Hell (Instrumental) (2:17)\n\nGEGEVENS:\ncategorie: Music\nkwaliteit: DVDr\njaar: 2006\ntijdsduur: 54 min\nbestand: Divx\nvideo codec: XVID\nbitrate: 1128 Kbps\nafmetinge: 640 X 480\ngeluidsindeling: mp3 lame 128kbps\n\nINFO:\nYouTube:gOiAQtLBJLA\nNLT is weer terug bezoek ons op het nieuwe adres: &lt;a href=&quot;\nhttp://www.nlt-release.nl/forum&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl/forum&lt;/a&gt;\n=================================================================================================== &lt;a href=&quot;\nhttp://www.nlt-release.nl/forum&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl/forum&lt;/a&gt;\nENJOY THE SHOW ","torrent":{"xt":"urn:btih:525ff15fbe6e270915bfb266453602c970dcca66","amp;dn":"Tom+Waits+-+Burma+Shave+%282006%29+DVDR+NLT-Release+%28divx%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"525ff15fbe6e270915bfb266453602c970dcca66","infoHashBuffer":{"type":"Buffer","data":[82,95,241,95,190,110,39,9,21,191,178,102,69,54,2,201,112,220,202,102]},"announce":[],"urlList":[]}}