{"title":"Gimme Indie Rock - 500 Essential American Underground Rock Album","uid":11198314,"size":6982021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52b2373a98201fc5c3f6cb0fd085a06426ee301c&amp;dn=Gimme+Indie+Rock+-+500+Essential+American+Underground+Rock+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"interuniversal","files":-1,"time":1413131742,"description":"\nGimme Indie Rock: 500 Essential American Underground Rock Albums 1981-1996\n\nAuthor:Earles, Andrew\n\nPublisher:Voyageur Press\n\n\n\nThe ultimate guide to one of the most revered periods and movements in American rock history.\n\nThe 1980s are one of the most ridiculed and parodied epochs in popular musica??what with all the skinny lapels, synthesizers, spandex, and Aqua Net. However, music fans in the know recognize that beneath the glossy veneer broiled a revolutionary movement of self-directed, anti-corporate, punk-influenced bands that created a nationwide network from the ground up, thanks to independently recorded releases, photocopied fanzines, and self-financed tours.\n\nIn Gimme Indie Rock, music journalist Andrew Earles describes 500 essential indie-rock albums released by 308 bands and artists from coast to coast in markets large and small. From giants of the movement (Black Flag, the Minutemen, Mission of Burma, Fugazi, Superchunk, Melvins, Dead Kennedys, Minor Threat, Husker Du, the Replacements, Sonic Youth, Mudhoney, Dinosaur Jr., Big Black, the Pixies), to more obscure bands which nonetheless made their own impacts (Jesus Lizard, Cows, Low, Mercury Rev, Polvo, Squirrel Bait, Karp, Bongwater, Naked Raygun, Sun City Girls, and many others) and scores of artists who still await their proper due (Fly Ashtray, Dumptruck, Truly, Man-Sized Action, Steel Pole Bathtub, godheadSilo, Sorry, Team Dresch, Further, Grifters, World of Pooh, Trumans Water, Malignus Youth, Eggs, and many more), Earles provides an exhaustive album guide to the era. Earles also features those bands that cut their teeth on the indie circuit but graduated to a greater degree of mainstream recognition in the late 1980s and early 1990s (acts like R.E.M., Soul Asylum, Urge Overkill, Hole, Smashing Pumpkins, and Nirvana), making Gimme Indie Rock is the definitive manual for the best of American indie music made between 1981 and 1996.","torrent":{"xt":"urn:btih:52b2373a98201fc5c3f6cb0fd085a06426ee301c","amp;dn":"Gimme+Indie+Rock+-+500+Essential+American+Underground+Rock+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b2373a98201fc5c3f6cb0fd085a06426ee301c","infoHashBuffer":{"type":"Buffer","data":[82,178,55,58,152,32,31,197,195,246,203,15,208,133,160,100,38,238,48,28]},"announce":[],"urlList":[]}}