{"title":"Jake Book 4 The Highland Clan by Keira Montclair","uid":15889367,"size":1032099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53117a8f446d8e0a19cb90bdb527a39d30a62228&amp;dn=Jake+Book+4+The+Highland+Clan+by+Keira+Montclair&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KiwiSue49","files":3,"time":1474705671,"description":"JAKE by Keira Montclair\r\n\r\nBook 4 of The Highland Clan\r\n\r\nJake Ramsay, eldest son of the chief of Clan Grant, has always felt the weight of his sire’s shadow. Tales of Alexander Grant’s prowess are whispered throughout the Highlands, and Alex’s loving marriage to Jake’s mother, Maddie, is equally legendary. Jake’s not sure he can live up to his birthright, but when he rescues a beautiful, strong-willed lass from a horrible fate, such concerns start to seem inconsequential. He becomes consumed with the need to protect the lass, Aline, and punish the man who hurt her. The past two years of Aline’s life have been pure misery. A wicked man stole her from her home and then controlled and used her. But when Jake, the handsome Highlander who rescued her, brings her to the Grant keep, she feels like she’s entered a fairy tale. The Grants welcome her into their hearts and home, but while she wishes more than anything to stay, her abuser is not the only one she left behind. She must return to the wretch’s keep. In his quest to save Aline, Jake discovers her abuser is in league with another man, one with violent ambitions in the Highlands. In order to save his clan and his love, he will have to stop worrying about his sire’s legacy and start creating one of his own","torrent":{"xt":"urn:btih:53117a8f446d8e0a19cb90bdb527a39d30a62228","amp;dn":"Jake+Book+4+The+Highland+Clan+by+Keira+Montclair","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53117a8f446d8e0a19cb90bdb527a39d30a62228","infoHashBuffer":{"type":"Buffer","data":[83,17,122,143,68,109,142,10,25,203,144,189,181,39,163,157,48,166,34,40]},"announce":[],"urlList":[]}}