{"title":"The Enigma of Kaspar Hauser","uid":4511042,"size":686240507,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:532c6038fa4df084256c468937458c194624245f&amp;dn=The+Enigma+of+Kaspar+Hauser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Willams","files":7,"time":1226778596,"description":"Jeder fur sich und Gott gegen Alle aka The Enigma of Kaspar Hauser (1974)\n\n\nThe Enigma of Kaspar Hauser (1974) is a West German film written and directed by Werner Herzog about the legend of Kaspar Hauser. Its original German title is Jeder fÃƒÂ¼r sich und Gott gegen alle, which means &quot;Every man for himself and God against them all&quot;.\n\nThe film tells the story of Kaspar Hauser (played by Bruno S.), who lived for the first 17 years of his life chained in a tiny cellar with only a toy horse to occupy his time, devoid of all human contact except for a stranger who feeds him. One day in 1828, the same stranger takes Kaspar out of his cell, teaches him a few phrases and how to walk, and then leaves him in the town of Nuremberg. Kaspar is the subject of the curiosity and is even exhibited in a circus before being rescued by Herr Daumer (Walter Ladengast) who patiently attempts to transform him. Kaspar soon learns to read and write and develops unorthodox approaches to religion and logic, but music is what pleases him most. He attracts the attention of clerics, academics, and nobility, but he is attacked by persons unknown who leave him unconscious with a bleeding head. He recovers but is again mysteriously attacked, stabbed in the chest possibly by the same man who brought him to Nuremberg. Kaspar rests in bed describing visions he had of nomadic Berbers in the Sahara Desert, and he dies shortly thereafter. An autopsy reveals an enlarged liver and cerebellum.\n\nThe film follows the real story of Kaspar Hauser quite closely, using the text of actual letters found with Hauser, and following many details in the opening sequence of Hauser&amp;#039;s confinement and release. One departure is his age: the historical Hauser was 17 when he was discovered in Nuremberg. The film does not specify Kaspar&amp;#039;s age, but Bruno was 41 years old at the time of filming.\n\nThe torrent contains posters of the film and English subtitle in srt format.\n\nIMDB: 8.1/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071691/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071691/&lt;/a&gt;","torrent":{"xt":"urn:btih:532c6038fa4df084256c468937458c194624245f","amp;dn":"The+Enigma+of+Kaspar+Hauser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"532c6038fa4df084256c468937458c194624245f","infoHashBuffer":{"type":"Buffer","data":[83,44,96,56,250,77,240,132,37,108,70,137,55,69,140,25,70,36,36,95]},"announce":[],"urlList":[]}}