{"title":"The Story of Film - Mark Cousins","uid":9392612,"size":6287225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5331b49c403e65436f24a33356ec03e5660a7823&amp;dn=The+Story+of+Film+-+Mark+Cousins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387913173,"description":"The Story of Film presents the history of the movies in a way never told before. Mark Cousins's chronological journey through the worldwide history of film is told from the point of view of filmmakers and moviegoers. Weaving personalities, film technology, and production with engaging descriptions of groundbreaking scenes, Cousins uses his experience as film historian, producer, and director to capture the shifting trends of movie history. We learn how filmmakers influenced each other; how contemporary events influenced them; how they challenged established techniques and developed new technologies to enhance their medium. Striking images reinforce the reader's understanding of cinematic innovation, both stylistic and technical. The images reveal astonishing parallels in global filmmaking, thus introducing the less familiar worlds of African, Asian, and Middle Eastern cinema, as well as documenting the fortunes of the best Western directors. The Story of Film presents Silent (1885-1928), Sound (1928-1990), and Digital (1990-present), spanning the birth of the moving image; the establishment of Hollywood; the European avant-garde movements, personal filmmaking; world cinema; and recent phenomena like Computer Generated Imagery and the ever-more &quot;real&quot; realizations of the wildest of imaginations. The Story of Film explores what has today become the world's most popular artistic medium.","torrent":{"xt":"urn:btih:5331b49c403e65436f24a33356ec03e5660a7823","amp;dn":"The+Story+of+Film+-+Mark+Cousins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5331b49c403e65436f24a33356ec03e5660a7823","infoHashBuffer":{"type":"Buffer","data":[83,49,180,156,64,62,101,67,111,36,163,51,86,236,3,229,102,10,120,35]},"announce":[],"urlList":[]}}