{"title":"Wind Energy Explained - Theory, Design and Application 2nd Editi","uid":8700709,"size":6426798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:534eee29bc8f72ed686b3e0dedd0ffccdf5a76c5&amp;dn=Wind+Energy+Explained+-+Theory%2C+Design+and+Application+2nd+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1374060340,"description":"Wind energyÃƒÂ¯Ã‚Â¿Ã‚Â½s bestselling textbook- fully revised.\nThis must-have second edition includes up-to-date data, diagrams, illustrations and thorough new material on:\n\nthe fundamentals of wind turbine aerodynamics;\nwind turbine testing and modelling;\nwind turbine design standards;\noffshore wind energy;\nspecial purpose applications, such as energy storage and fuel production.\nFifty additional homework problems and a new appendix on data processing make this comprehensive edition perfect for engineering students.\n\nThis book offers a complete examination of one of the most promising sources of renewable energy and is a great introduction to this cross-disciplinary field for practising engineers.\n\nÃƒÂ¯Ã‚Â¿Ã‚Â½provides a wealth of information and is an excellent reference book for people interested in the subject of wind energy.ÃƒÂ¯Ã‚Â¿Ã‚Â½ (IEEE Power &amp; Energy Magazine, November/December 2003)\n\nÃƒÂ¯Ã‚Â¿Ã‚Â½deserves a place in the library of every university and college where renewable energy is taught.ÃƒÂ¯Ã‚Â¿Ã‚Â½ (The International Journal of Electrical Engineering Education, Vol.41, No.2 April 2004)\n\nÃƒÂ¯Ã‚Â¿Ã‚Â½a very comprehensive and well-organized treatment of the current status of wind power.ÃƒÂ¯Ã‚Â¿Ã‚Â½ (Choice, Vol. 40, No. 4, December 2002)\n\nAuthor Information\n\n\nJames Manwell is a professor of Mechanical Engineering the University of Massachusetts and the Director of the Wind Energy Center there. He hold an M.S. in Electrical and Computer engineering and a Ph.D. in Mechanical Engineering. he has been involved with a wide range of wind energy research areas since the mid 1970's. These range from wind turbine dynamics to wind hybrid power systems. His most recent research has focused on the assessment of external conditions related to the design of offshore wind turbines. he has participated in activities of the International Energy Agency, the International Electrotechnical Commission and the International Science Panel on Renewable Energies. He lives in Conway, Massachusetts.\nJohn McGowan a professor Mechanical Engineering at the University of Massachusetts and the co-Director of the Wind Energy Center there. He holds an M.S. and a Ph.D. in Mechanical Engineering. During his forty plus years at the University he has developed and taught a number of fundamental undergraduate/graduate engineering courses in renewable energy and energy conversion. His research and graduate student supervision at UMass has produced approximately 200 technical papers in a wide range of energy conversion applications. His recent research interests in wind engineering have been concentrated in the areas of wind system siting, hybrid systems modeling, economics, and offshore wind engineering. Professor McGowan is a Fellow of the American Society of Mechanical Engineers (ASME) and editor of Wind Engineering journal. He lives in Northfield, Massachusetts.\n\nAnthony Rogers holds both and M.S. and Ph.D. in Mechanical Engineering from the University of Massachusetts and was formerly a senior research engineer in the Renewable Energy Research Laboratory (now the Wind Energy center) there. He is presently a senior engineer at DNV Global Energy Concepts. He has had a long career in the wind energy field, and has been involved with a wide range of topics. These have included wind turbine monitoring and control and the application of remote sensing devices. He lives in Amherst, Massachusetts.\n","torrent":{"xt":"urn:btih:534eee29bc8f72ed686b3e0dedd0ffccdf5a76c5","amp;dn":"Wind+Energy+Explained+-+Theory%2C+Design+and+Application+2nd+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"534eee29bc8f72ed686b3e0dedd0ffccdf5a76c5","infoHashBuffer":{"type":"Buffer","data":[83,78,238,41,188,143,114,237,104,107,62,13,237,208,255,204,223,90,118,197]},"announce":[],"urlList":[]}}