{"title":"Madonna - The Confessions Tour 2007 [FLAC] - Kitlope","uid":9873129,"size":564555983,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53615f1c9bd67b6e9fc46b6b26c06b709d9c79ee&amp;dn=Madonna+-+The+Confessions+Tour+2007+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Kitlope","files":16,"time":1396398017,"description":"PC Software: Windows 8.1 Pro \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nReupload of a previous torrent: No\nTracker(s): udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, udp://tracker.istole.it:80\nTorrent Hash: 53615F1C9BD67B6E9FC46B6B26C06B709D9C79EE\nFile Size: 538.40 MB\nYear: 2007\nLabel: Warner Bros. \nCatalog #: 44489-2\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\nMadonna Louise Ciccone (born August 16, 1958) is an American singer-songwriter, actress, and entrepreneur. One of the most prominent cultural icons for over three decades, she has achieved an unprecedented level of power and control for a woman in the entertainment industry. She attained immense popularity by pushing the boundaries of lyrical content in mainstream popular music and imagery in her music videos, which became a fixture on MTV. Madonna is known for continuously reinventing both her music and image, and for retaining a standard of autonomy within the recording industry. Music critics have praised her diverse and innovative musical productions which have also been known to induce controversy. Cited as an influence among numerous artists around the world, she is often referred to as the &quot;Queen of Pop&quot;.\n\nBorn in Bay City, Michigan, Madonna moved to New York City in 1977 to pursue a career in modern dance. After performing in the music groups Breakfast Club and Emmy in the late 1970s and early 1980s, she signed with Sire Records (an affiliate of Warner Bros. Records) in 1982 and released her self-titled debut album the following year. She followed it with a series of commercially successful albums, including the Grammy Award winners Ray of Light (1998) and Confessions on a Dance Floor (2005). Throughout her career, she has written and produced most of her songs, with many of them having hit number one on the record charts, including &quot;Like a Virgin&quot;, &quot;Into the Groove&quot;, &quot;Papa Don't Preach&quot;, &quot;Like a Prayer&quot;, &quot;Vogue&quot;, &quot;Frozen&quot;, &quot;Music&quot;, &quot;Hung Up&quot;, and &quot;4 Minutes&quot;.\n\nMadonna's popularity was further enhanced by her critically successful role in film Desperately Seeking Susan (1985). However, most of her film appearances received harsh feedback. She garnered critical acclaim and a Golden Globe Award for Best Actress in Motion Picture Musical or Comedy for Evita (1996). Her other ventures include: fashion design, writing children's books, and film directing and producing. She has been acclaimed as a businesswoman, most notably after she founded entertainment company Maverick (including the label Maverick Records) in 1992 as a joint venture with Time Warner. In 2007, she signed an unprecedented US $120 million 360 deal with Live Nation.\n\nMadonna has sold more than 300 million records worldwide and is recognized as the best-selling female recording artist of all time by Guinness World Records. According to the Recording Industry Association of America (RIAA), she is the best-selling female rock artist of the 20th century and the second best-selling female artist in the United States, with 64.5 million certified albums. Billboard ranked her at number two, behind only The Beatles, on the Billboard Hot 100 All-Time Top Artists, making her the most successful solo artist in the history of American singles chart. The magazine also declared her as the top-touring female artist of all time. Madonna topped the VH1's list of &quot;100 Greatest Women in Music&quot; and was selected among the &quot;25 Most Powerful Women of the Past Century&quot; by Time. She became one of the five founding members of the UK Music Hall of Fame and was inducted into the Rock and Roll Hall of Fame in her first year of eligibility. \n\n\n\nThe Confessions Tour 2007\n\n\nThe Confessions Tour is the second live album by American singer-songwriter Madonna. It was released on January 26, 2007 by Warner Bros. Records. Directed by Jonas Ã…kerlund, the album chronicles Madonna's 2006 Confessions Tour. It was recorded at Wembley Arena during the London dates of the tour, and was released in both CD and DVD format. The DVD contains the entire concert and the CD includes thirteen live songs only. The album became the first release from Semtex Films, a production company founded by Madonna in 2006.\n\nThe Confessions Tour received generally positive reviews from contemporary critics and won the Best Long Form Music Video category at the 50th Grammy Awards. After its release, the release reached number one on the official charts in Australia, Belgium, Czech Republic, Hungary, Italy, Portugal and Spain. It received moderate success in her native country, peaking at number fifteen on the U.S. Billboard 200 albums chart. The Confessions Tour has sold more than 1.2 million copies worldwide.\n\nTracks: \n\n1.\t&quot;Future Lovers&quot; / &quot;I Feel Love&quot;  \n2.\t&quot;Like a Virgin&quot;  \n3.\t&quot;Jump&quot;  \n4.\t&quot;Confessions&quot;  \n5.\t&quot;Isaac&quot;  \n6.\t&quot;Sorry&quot;  \n7.\t&quot;Sorry&quot; (Remix)\n8.\t&quot;I Love New York&quot;  \n9.\t&quot;Let It Will Be&quot;  \n10.\t&quot;Music Inferno&quot;  \n11.\t&quot;Erotica&quot;  \n12.\t&quot;Lucky Star&quot;  \n13.\t&quot;Hung Up&quot;  \n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:53615f1c9bd67b6e9fc46b6b26c06b709d9c79ee","amp;dn":"Madonna+-+The+Confessions+Tour+2007+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53615f1c9bd67b6e9fc46b6b26c06b709d9c79ee","infoHashBuffer":{"type":"Buffer","data":[83,97,95,28,155,214,123,110,159,196,107,107,38,192,107,112,157,156,121,238]},"announce":[],"urlList":[]}}