{"title":"Audio Hijack Pro 2.9.11 incl. serial MAC Osx DeGun TPB 2011","uid":6366276,"size":10556487,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5374db56500106be58b31cd07c2111103519ef8f&amp;dn=Audio+Hijack+Pro+2.9.11+incl.+serial+MAC+Osx+DeGun+TPB+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"DeGun","files":-1,"time":1304520518,"description":"    Improved VoiceOver Audio Hijack Pro's VoiceOver effect has been improved to have reduced latency.\n\n    ID3 Tag Editing Edit recordings' ID3 tags with the Recording Bin's Inspector.\n\nRecording Any Audio\n\n    VoIP Recording A one-click call recorder for Skype or iChat? Yup!\n    Create Great Podcasts Record microphones, Skype, iTunes and more into 1 file.\n    Record AM/FM Radio Too Recording support for Griffin's RadioShark.\n\n    Record All Audio Record all audio to one file with System Audio.\n    Digitize Your Analog Bring tapes, vinyl records and more into iTunes.\n    Audio Device Recording Pull from a mic, record player or any other audio device.\n\n    Pull It All In Application Mixer pulls in audio from multiple apps.\n    Snack On Sound Bites Pull audio from DVDs and other movie files.\n\n\n\nPowerful Recording Options\n\n    Recording Options Record to the MP3, AAC, Apple Lossless, or AIFF audio formats.\n    BulletProof Recording Use MP3 or AIFF and never lose recordings due to a system crash.\n\n    Unlock Your Audio Free yourself from the chains of restrictive audio formats and DRM.\n    Quick Recording Start recording the foremost app with just one keystroke.\n\n    Metadata, Metacool Tag all your recordings with ID3 tags for easy organization and searching.\n    The Sounds Of Silence Remove audio, split or stop recordings when silence occurs.\n\nOrganize With The Recording Bin\n\n    Recording Bin Easy file organization built right in.\n    Preview Recordings Play back your recordings with a single click.\n\n    Easily Send To iTunes Pass your recordings off to iTunes instantly.\n     \n\n    Burn Audio CDs CD Burning right from the Recording Bin.\n     \n\nEven More Features!\n\n    Fully AppleScriptable Control and enhance Audio Hijack Pro with AppleScripts.\n    Wake Up! Turn any application into an alarm clock with a Timer.\n\n    Audio Plugin Standards Works with hundreds of VST and Audio Unit plugins.\n     \n    Powerful Audio Effects Use over 50 built-in plugins to adjust audio.\n\n    Levels Of Level Meters Precise level meters, VU meters, and even Menu Bar meters.\n    Check Your Disk Status Use the Disk Status window to track disk space availability.\n\n                      WHATS NEW IN Audio Hijack Pro 2.9.11\n                         &lt;a href=&quot; http://www.rogueamoeba.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.rogueamoeba.com&lt;/a&gt; \n\n    An issue where the Instant On component could fail to install properly has been fixed. If you receive a notice of an update to Instant On, be sure to install it.\n    A bug where effects were not applied to local playback of System Audio has been corrected.\n\n    ______)          _____                        ______         \n   (, /  /)         (, /   ) ,                   (, /    )       \n     /  (/    _      _/__ /    __  _  _/_  _       /---(  _      \n  ) /   / )__(/_     /     _(_/ (_(_(_(___(/_   ) / ____)(_(_(_/_\n (_/              ) /                          (_/ (        .-/  ( DeGun 2011\n                 (_/                                       (_/   \t\t\n\n                     &lt;a href=&quot; HTTP://THEPIRATEBAY.ORG/USER/DeGun&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; HTTP://THEPIRATEBAY.ORG/USER/DeGun&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5374db56500106be58b31cd07c2111103519ef8f","amp;dn":"Audio+Hijack+Pro+2.9.11+incl.+serial+MAC+Osx+DeGun+TPB+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5374db56500106be58b31cd07c2111103519ef8f","infoHashBuffer":{"type":"Buffer","data":[83,116,219,86,80,1,6,190,88,179,28,208,124,33,17,16,53,25,239,143]},"announce":[],"urlList":[]}}