{"title":"Whole Earth Catalogs (1968 &amp; 1984) (Requested) Pdf Gooner","uid":12151366,"size":53212372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53837b8c5b509857147782e603bb1fff3807120f&amp;dn=Whole+Earth+Catalogs+%281968+%26amp%3B+1984%29+%28Requested%29+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1437644453,"description":"Both Scans: Not the best due to their age but well worth the DL!\n\nPublisher: Quantum Press/Doubleday (1984)\nLanguage: English\nISBN-10: 0385191669\nISBN-13: 978-0385191661\n\nSTEWART BRAND: Computers and their programs are &quot;embodiments of mind&quot; (Warren McCulloch). Valuing thouglit, we value machines that mimic, enhance, accelerate thought. (We mistrust acceleration, with excellent reason). Something interesting and consequential is going on. The human frame of reference is ashift.\n\nComputers and their programs are tools. They empower. They estrange. Their power was first generated and employed by institutions, originally in the various conceptual theaters of World War II (decrypting, weapon-aiming, command and control, bomb-blast modeling). Their power grew with governmental and commercial institutions after the war; they became a tool of institutional science and a major industrial product. But every few years they became ten times faster, smarter, smaller, and cheaper, and they still are doing that. By 1976 an individual could make one from a kit and try to put it to use.\n\nWith the coming of personal computers came a shift in the power balance. It may be that more accumulated code is stirring in the interests of individuals now than in the interests of institutions. It may be that more significant invention is coming from the hands of individuals. That's news that stays news, and good news at that, in the main. But there's a hilarious obstacle.\n\nFor new computer users these days the most daunting task is not learning how to use the machine but shopping.\n\nHence this book.\n\nThe impossible (and unachieved) task of the Whoie Earth Software Catalog is to identify and comparatively describe all of the best personal computer products - especially software, where the most confusion reigns. Part of the impossibility is that those who know a program well don't have sufficient comparative experience; at the same time, the professional wide comparers don't have the deeper use experience. The only relief from the paradox is sustained discussion, gossip, and argument among the enraptured deeps and the cynical wides, and that's all this book is. It came to greater convergence of opinion than we expected.\n\nPersonal computers are skill machines. We took that as the organizing principle of the research and the book. Playing, Writing, Analyzing, Organizing, Accounting, Managing, Drawing, Telecommunicating, Learning, and that profoundest of skills, Et Cetera. For each, Barbara Robertson found and directed a Domain Editor to be responsible for all that appeared and failed to appear in that section, and to collaborate fully with the other Domain Editors. Thanks to talent and luck, it worked pretty well. One reader (you), one computer marketplace, one book - not an anthology\n\nIn our software library are some 1,900 programs. We recommend 362 in the book. In our offices 25 assorted computers work for our living. We made the book with them.\nThe first question to ask any computer book is, &quot;How out of date is it?&quot; Publishing is much slower than the buzzing, blooming computer business, where last week's scoop is this week's shrug. Of course, we focus on the best, not the newest, and Doubleday did the printing in a breakneck six weeks - but how out of date? Mid-June, 1984, research congealed permanently toward ink.\n\nSoftware has new versions all the time - version 1.3, then 1.4, then a major rewrite to version 2.0. Why can't a book do that? It can if the book is fully supported by a magazine, and this one is. Our Whole Earth Software Review comes out quarterly If this Catalog is version 1.0, then the November '84 Review (our fourth issue) is version 1.1, followed by 1.2,1.3,1.4, and then a whole new Catalog in Fall '85, version 2.0. The book is part magazine","torrent":{"xt":"urn:btih:53837b8c5b509857147782e603bb1fff3807120f","amp;dn":"Whole+Earth+Catalogs+%281968+%26amp%3B+1984%29+%28Requested%29+Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53837b8c5b509857147782e603bb1fff3807120f","infoHashBuffer":{"type":"Buffer","data":[83,131,123,140,91,80,152,87,20,119,130,230,3,187,31,255,56,7,18,15]},"announce":[],"urlList":[]}}