{"title":"Sniper.Elite.3.(1.02).Repack-R.G.Mechanics","uid":10490514,"size":8174318516,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53d32726cd3841f5430ea520cb9ac703e26e7203&amp;dn=Sniper.Elite.3.%281.02%29.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"Taker009","files":-1,"time":1404534063,"description":"Sniper.Elite.3.Repack-R.G.Mechanics\n\n\n\nYear: 2014\nGenre: Action (Shooter) / 3D / 3rd Person / Stealth\nDeveloper: Rebellion\nPublisher: Rebellion\nPublication Type: RePack\nGame Language: Eng | Rus\nVoice Language: Eng | Rus\nCrack: RELOADED\n\n\n\n\nSystem requirements:  \n==========================================\n\nOperating System: Microsoft Windows Vista (Service Pack 2) or Windows 7 (Service Pack 1)\nor Windows 8 or Windows 8.1. Windows XP is NOT supported.\nProcessor: Dual-core CPU with SSE3 (Intel Pentium D 3GHz / AMD Athlon 64 X2 4200) or better\nMemory: 2 GB\nVideo: Microsoft DirectX 10.0 compatible graphics card with 256 MB of memory\n(NVIDIA GeForce 8800 series / ATI Radeon HD 3870) or better\nDirectX: Version 11\nSound Card: Sound device compatible with DirectX 10.0\nFree space on hard disk: 29.5 GB\n\nGame information:  \n========================================\n\nAction Sniper Elite 3 takes place during the Second World War.\nIn the role of American agent Charles Fairbairn you have to go\nto North Africa to help the Allied forces to cope with the onslaught\nof the Nazis. In parallel, the hero learns of a secret program to\ndevelop tanks, realizing that Germany will be able to decide the outcome of the war.\n\nThe game is notable for non-linear gameplay, unfolding in an open area.\nYou wait for the fierce battle with melee weapons, as well as shooting\nfrom distance. Bustling cities and remote villages - your invaluable\nassistant in tactical planning and displacements. Updated camera gives\nthe ability to destroy armored vehicles and tanks with just one well-aimed\nshot into the gas tank. Luggage X-Ray detailed manner will show you how the\nbullets fired from the destroyed muscle and circulatory system. Moreover,\nSniper Elite 3 includes cooperative transmission mode and multiplayer.\n\nGame Features:  \n====================================:\n\nCo-op mode that allows two players to try to unite their efforts for\nthe passage or story campaign mode Over Watch. Also available is the\nnewest and zudobrobitelny mode Survival Mission, in which you have\nto break through tests prepared by the German Afrika Korps.\n\nMultiplayer mode presented five options: Deathmatch, Team Deathmatch,\nDistance King, Team Distance King, No Cross. Last almost completely\ncopies Team Deathmatch, but the only difference is that the teams\nare melee and unlikely.\n\nCompletely redesigned AI: enemies become much more smartest tactically,\nso that each of your thoughtless action now can go sideways.\n\nSystem X-Ray Kill-Cam - a kind of X-ray, clearly demonstrating the\ndamage you caused. You can see how fired bullet destroy bone,\nmuscle tissue, touches the internal organs and so on.\n\nAdvanced combat system. You will be given a detailed guide that\nexplains each type of weapon. So it will be easier to understand\nwhich of them is better fit for the melee, and what - for long.\nModified stealth system will allow you to avoid many encounters\nwith the enemies: be smart, you can kill them before they can find you.\n\n\nRepack Features:  \n====================================\n\nSniper Elite 3\nGame Version - v1.02\nDo not cut / recoded\nAbility to select a combination of text and voice\n\nAdditions:  \n========================\n\nTarget Hitler: Hunt the Grey Wolf\nAllied Reinforcement Outfits Pack\nCamouflage Weapons Pack\nHunter Weapons Pack","torrent":{"xt":"urn:btih:53d32726cd3841f5430ea520cb9ac703e26e7203","amp;dn":"Sniper.Elite.3.%281.02%29.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d32726cd3841f5430ea520cb9ac703e26e7203","infoHashBuffer":{"type":"Buffer","data":[83,211,39,38,205,56,65,245,67,14,165,32,203,154,199,3,226,110,114,3]},"announce":[],"urlList":[]}}