{"title":"Programming Languages Theory Book Collection","uid":9676621,"size":1071744089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53f70a405feaa5d38f503deabb2e2906c35111ae&amp;dn=Programming+Languages+Theory+Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"KodoTheDon264","files":89,"time":1393573434,"description":"Programming Languages Theory Book Collection\n--------------------------------------------\n\nAddison Wesley: Compiler Design: Formal Syntax And Semantics Of Programming Language (1995) (PDF)\nAho, Lam, Sethi, Ullman: Compilers: Principles, Techniques, and Tools 2e (PDF)\nAho, Ullman: The theory of parsing, translation, and compiling. Vol.2.. Compiling (DJVU)\nAiserman, Gusev: Logic, Automata, and Algorithms 1971 (DJVU)\nAkira Maruoka: Concise Guide to Computation Theory (PDF)\nAlan P. Parkes: A Concise Introduction to Languages and Machines (PDF)\nAlexander Meduna: Elements of Compiler Design (1420063235) (PDF)\nAndrew Appel: Modern Compiler Implementation in ML (DJVU)\nAndrew W. Appel: Modern Compiler Implementation in C 0521607655 (DJVU)\nArthur Gill: Introduction to the theory of Finite-State Machines (PDF)\nBenjamin C. Pierce: Advanced Topics in Types and Programming Languages (PDF)\nBill Smyth: Computing Pattern in Strings (DJVU)\nBob Morgan: Building an Optimizing Compiler (PDF)\nCambridge University Press: Computation and Automata 1985 (DJVU)\nCarroll, Long: Theory of Finite Automata With an Introduction to Formal Languages (PDF)\nColin de la Higuera: Grammatical Inference. Learning Automata and Grammars (PDF)\nComon, Dauchet, Gilleron, et al: Tree Automata Techniques and Applications (PDF)\nCompiler Design: Compilers and Compiler Generators in C++ (PDF)\nCompilers: Principles, Techniques, and Tools (PDF)\nCrochemore, Rytter: Jewels of Stringology (PDF)\nCS143 Notes: Introduction and lexical analysis: David L. Dill (PDF)\nD. A. Cruse: Lexical Semantics (DJVU)\nDexter C. Kozen: Automata and Computability (DJVU)\nDoug Brown, John Levine, Tony Mason: Lex and Yacc (PDF)\nDovek, Levy: Introduction to the Theory of Programming Languages (PDF)\nDu, Ko. Wiley: Problem Solving in Automata, Languages, and Complexity (PDF)\nFisher, Grodzinsky: The Anatomy of Programming Languages (PDF)\nFriedman, Wand: Essentials of Programming Languages. 3rd (PDF)\nGanesh Gopalakrishnan: Computation Engineering. Applied Automata Theory and Logic (PDF)\nGiles Dowek: Principles of Programming Languages (PDF)\nGoyavaerts, Levithan: Regular Expressions Cookbook, 2nd Edition (EPUB)\nGoyavaerts, Levithan: Regular Expressions Cookbook, 2nd Edition (PDF)\nGoyvaerts, Levithan: Regular Expressions Cookbook (EPUB)\nGoyvaerts, Levithan: Regular Expressions Cookbook (PDF)\nGrune, Bal, Jacobs, Langendoen: Modern compiler design 2000 (DJVU)\nGrune, Bal, Jacobs, Langendoen: Modern Compiler Design 2001 (PDF)\nGrune, Bal, Jacobs, Langendoen: Modern Compiler Design 2012. 2nd (PDF)\nGrune, Jacobs: Parsing Techniques. A Practical Guide. 2nd (PDF)\nHamburger, Richards: Logic and Language Models for Computer Science (PDF)\nHanne Riis Nielson, Flemming Nielson: Semantics with Applications: An Appetizer (PDF)\nHaruo Hosoya: Foundations of XML Processing. The Tree-Automata Approach (PDF)\nHopcroft, Motwani, Ullman: Introduction to Automata Theory, Languages, and Computation 2nd (PDF)\nHoward Straubling: Finite Automata, Formal Logic, and Circuit 1994 (DJVU)\nIto, Kobayashi, Shoji: Automata, Formal Languages and Algebraic Systems (PDF)\nJean-Paul Tremblay, Paul G. Sorenson: The Theory and Practice of Compiler Writing (PDF)\nJeffrey E.F. Friedl: Mastering Regular Expressions 2006. 3rd (PDF)\nJ.E.Hopcroft, et al: Introduction to automata theory, languages, and computation. 2nd edition (DJVU)\nJohn A. N. Lee: The Anatomy Of A Compiler 2ed 0442247338 (DJVU)\nJohn C. Martin: Introduction to Languages and the Theory of Computation (PDF)\nJohn C. Reynolds: Theories of Programming Languages (PDF)\nJohn Levine: Flex &amp; Bison (PDF)\nKeith D. Cooper, Linda Torczon: Engineering A Compiler 2nd (PDF)\nKeith D. Cooper, Linda Torczon: Engineering A Compiler (PDF)\nKernighan, Plauger: The Elements of Programming Style (DJVU)\nKing Su Fu: Syntactic Pattern Recognition and Applications (DJVU)\nMalcom Mclean: Minibasic. How to write BASIC interpreter (PDF)\nMarko van Eekelen: Trends in Functional Programming Vol. 6 (PDF)\nMartin Gardner: Logic Machines And Diagrams (PDF)\nMaurizio Gabbrielli, Simone Martini: Programming Languages Principles and Paradigms (PDF)\nMichael Fitzerald: Introducing Regular Expressions (EPUB)\nMichael Fitzerald: Introducing Regular Expressions (PDF)\nMichael L. Scott: Programming Language Pragmatics (PDF)\nM. Joseph: Elements of Compiler Design (PDF)\nNiel P. Chapman: LR Parsing Theory and Practice (DJVU)\nPerrin, Pin: Infinite Words Automata, Semigroups, Logic and Games (DJVU)\nPeter Linz: Introduction to Formal Languages and Automata 3rd.tar.gz\nPeter Sestoft: Programming Language Concepts (PDF)\nPetra Hofstedt: Multiparadigm constraint programming languages (PDF)\nRajiv Gupta: Compiler Construction (PDF)\nReps, Sagiv, Bauer: Program Analysis and Compilation, Theory and Practice (PDF)\nRobert McNaughton: Elementary Computability, Formal Languages, and Automata (DJVU)\nRobert W. Sebesta: Concepts of Programming Languages 10th (PDF)\nRobert W. Sebesta: Concepts of Programming Languages. 7th (PDF)\nRobert W. Sebesta: Concepts of Programming Languages (PDF)\nRonald Mak: Writing Compilers and Interpreters. A Software Engineering Approach (EPUB)\nSamuel Eilenberg: Automata, languages, and machines. Volume A (DJVU)\nSamuel P. Midkiff: Automatic Parallelization. An Overview of Fundamental Compiler Techniques (PDF)\nSeidl, Wilhelm, Hack: Compiler Design. Analysis and Transformation (PDF)\nSrikant, Shankar: The Compiler Design Handbook. 2nd 2007 (PDF)\nStefano Crespi Reghizzi: Formal Languages and Compilation (PDF)\nSu, Yan: Principles of Compilers (PDF)\nTerrence Parr: Pragmatic Language Implementation Patterns 2009 (PDF)\nThomas J. Begin, Richard G. Gibson: History of Programming Languages, Volume 2 (PDF)\nTony Stubblebine: Regular Expression. Pocket Reference. O'Reilly (PDF)\nTorgen Aegidius Mogensen: Introduction to Compiler Design (PDF)\nWilhelm, Seidl: Compiler design: Virtual machines (PDF)\nWilhelm, Seidl, Hack: Compiler Design. Syntactic and Semantic Analysis (PDF)\nWillem J.M. Levelt: An Introduction to the Theory of Formal Languages and Automata (PDF)\nWorldware: Write Your Own Programming Language Using C++ (CHM)","torrent":{"xt":"urn:btih:53f70a405feaa5d38f503deabb2e2906c35111ae","amp;dn":"Programming+Languages+Theory+Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f70a405feaa5d38f503deabb2e2906c35111ae","infoHashBuffer":{"type":"Buffer","data":[83,247,10,64,95,234,165,211,143,80,61,234,187,46,41,6,195,81,17,174]},"announce":[],"urlList":[]}}