{"title":"The True Story of the Beatles' Rise to the Top(epub){Zzzzz}","uid":11414059,"size":1650741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54252f543bbc1c2f7dd1039c388564c9523ec636&amp;dn=The+True+Story+of+the+Beatles%27+Rise+to+the+Top%28epub%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415558331,"description":"When They Were Boys: The True Story of the Beatles' Rise to the Top\n\nThis is the story of the Beatles' harrowing rise to fame: focusing on that seven-year stretch from the time the boys met as teenagers to early 1964, when the Fab Four made their momentous first appearance on The Ed Sullivan Show. From the boys' humble beginnings in Liverpool, to the cellars of Hamburg, When They Were Boys includes stories never before told, including the heartbreaks and the lucky breaks. Included are an eyewitness account of that first meeting between Lennon and McCartney, the inside story of how Ringo replaced Pete Best, an exploration of the brilliant but troubled soul of manager Brian Epstein, and the real scoop on their disastrous first visit to Germany and the death of Stu Sutcliffe. With an eye for life in Liverpool during the 50's and 60's and over 65 eyewitness accounts from those closest to the Beatles, Larry Kane brings to life the evolution of the group that changed music forever.\n\nProduct Description\n\nReview\nLike The Dew &quot;An insightful and revealing study of the act we've known for all these years...goes beyond the who, what, when, where, why and how found in the best reporting. Kane establishes a deliberate, you-are-there pace, bringing clarity to the Beatles' successes as well as the early setbacks. Kirkus Reviews &quot;A spirited jump down the rabbit hole to the early years of what would become the Beatles, from TV news anchor and Beatles chronicler Kane (Lennon Revealed, 2005, etc.)...A shimmering...report that should fill in many of the cracks in readers' knowledge of pop-music history.&quot; Publishers Weekly &quot;Kane (Ticket to Ride), a longtime Philadelphia journalist and author who covered the Beatles' first tour in the U.S. in 1964 and subsequent tours, works by mosaic in piecing together the shards of &quot;the boys' &quot; early stories in Liverpool... Many roiling, conflicting voices are brought together.&quot; Library Journal &quot;This reexamination of the Beatles' teenage years, which focuses not on the band members themselves but rather on those who nurtured and influenced them through their pivotal first few years together, will inform popular-music scholars and delight fans.&quot; The Christian Science Monitor &quot;Larry Kane was the only broadcast journalist to travel with the Beatles on their triumphant 1964 and '65 North American tours. He chronicled those heady experiences in his 2003 book, Ticket to Ride. Now he's back with When They Were Boys: The True Story of the Beatles' Rise to the Top. Combining the results of some deep digging and revealing interviews with those who knew them best, Kane unearths fascinating details from the earliest days of the boys' growing up in hardscrabble Liverpool in the 1950s to the eve of their world conquest in 1964.&quot; Denny Somach, author of Get The Led Out: How Led Zeppelin Became the Biggest Band in the World and well-known rock historian &quot;The book is excellent...Larry has gotten into nooks and crannies of Beatles history that other books have scarcely touched...When They Were Boys completes a fantastic trilogy.&quot; Chris Carter, Breakfast with the Beatles -- Sirius/Xm Radio --KLOS Radio Los Angeles &quot;...is there anything left to learn about the Beatles? Well, if you happen to be a Beatles fan looking for a new book full of information NOT found in any of the other pages on the nearby shelf...well When They Were Boys just may be the book for you! See, Larry Kane not only knew the boys personally, (they knew him by name!), he also knows how to tell a damn good story. Larry Kane delivers his best yet, his Beatles-book hat-trick is now complete! Buy two!&quot; John Lorinc, former CNN correspondent and Producer/Reporter at WABE-FM (NPR) &quot;When They Were Boys is Larry Kane's Sgt. Pepper. Larry's previous books on the Beatles are, well Fab, but this book sheds light...a lot of light...on an era that isn't as familiar as the &quot;eye of the hurricane&quot; days of Beatlemania. Even though I've literally read hundreds of books on the Beatles over the years, there were more than just a few new things I learned from Boys. Larry is a true insider of the Beatles, and that's why he's able to get the scoop from others WHO WERE ACTUALLY THERE AND ACTUALLY KNOW THE FACTS. That's the difference, and it's a big difference. Larry Kane is a great writer, and he tells the story about a group of Liverpool scruffs who eventually became people who reached first-name-only-needed status across the globe. Larry Kane, once again, passed the audition.&quot; Shelley Germeaux, Correspondent, Beatles Examiner &quot;Larry Kane's newest book, When They Were Boys is the most comprehensive and fascinating account to date of all four Beatles' lives in the youthful prelude to fame. Larry's account exudes incredible depth, compassion, and a sense of down-to-earth reality about John, Paul, George and Ringo. When They Were Boys provides a glimpse into who they were at that time--just boys with a shared dream--a dream that was about to change their lives forever. His in-depth interviews with those who were there at the time this was all happening, such as Bill Harry, Allan Williams, Tony Bramwell, and John's sister Julia Baird, make this a most remarkable read. It takes you back to the unfolding of the Beatles and how they became the sensation they did.&quot; Steve Marinucci, Beatles Examiner &quot;Larry Kane's Ticket To Ride is one of the best looks at the Beatles and Beatlemania because, as a journalist, he told it like it was. When They Were Boys continues that tradition, except it's about the Beatles' beginnings in Liverpool. If anyone has the true story, it's Larry. &quot; Bill Harry, founder of Mersey Beat, friend of John, Paul and George, and the most respected journalist and analyst of the Beatle years &quot;Larry Kane is a legend in the Beatles fraternity -- and beyond. His latest work is diligently researched, atmospherically written in a way which makes you hang onto every word of information you've never read before, which makes its appearance on the pages. Larry travelled America with the Beatles and became one of their close friends. As for myself, I grew with them at every stage of their early career from the beginning of their musical odyssey and Larry has recreated the landscape and excitement of those heady early days, which takes me back in memory to how it really happened. This is one of the great page-turners in Beatles history, brought alive at last.&quot; Ron Ellis, award winning Beatles researcher who knew all of the Beatles &quot;Told in Larry Kane's inimitable journalese style, When They Were Boys is a breath-taking, roller-coaster ride through the early days of The Beatles, given new perspective by the passage of time by a celebrated reporter who was able to observe them at both ends of the spectrum. A serious and invaluable work for students of popular music history and, with more 'secrets' emerging over the years, a must-buy for Beatles fans all over the world.&quot; David Bedford, author of Liddypool and famous Liverpool native &quot;Larry Kane knew The Beatles and became a trusted friend, so to now be invited to read some of their memories about the early history of The Beatles is fascinating. However, this is not just a re-telling of the same old stories. Larry has done what he does best as an investigative journalist and re-examined the key events and talked to the people who were there to take a fresh look at how this group of lads from Liverpool became the most famous pop group in history. This is a compelling read for any fan of the Fab Four.&quot; Jude Southerland Kessler, author of The John Lennon Series &quot;For years, my favorite Beatles book has overwhelmingly been Jim O'Donnell's The Day John Met Paul. It was the only book that I felt captured the true spirit of the Liverpool I know. But now, Larry Kane's When They Were Boys has stepped up and equaled the essence of Merseyside in a volume of artistic writing that is in a class all by itself! Readers who have hundreds of Beatles books will not want to miss Larry Kane's new one. His other books are very, very, very good. This one is off-the-charts-great.&quot; Psychobabble &quot;Every Beatles biography begins with familiar tales. When They Were Boys distinguishes itself from most of these books by focusing exclusively on these rough and tumble early years and doing so from a uniquely personal point of view. Kane does not have to rely on a wealth of outside sources to bring his book to life. The vast majority of quotes, whether they come from the Fabs or Yoko Ono or Mal Evans or Pete Best, were spoken to the author directly.&quot;\nAbout the Author\nLarry Kane: Larry Kane is the &quot;dean of Philadelphia television news anchors,&quot; with a 45-year career covering domestic and world events. He was the only American reporter to travel with the Beatles on every stop of their 1964 and 1965 tours of America, an experience which he recounted in his bestselling book Ticket to Ride. He is also the author of the New York Times bestseller Lennon Revealed . He lives in Philadelphia.\n\nPublisher: Running Press,U.S.; 1 edition (25 July 2013)\nLanguage: English\nISBN-10: 0762440147\nISBN-13: 978-0762440146","torrent":{"xt":"urn:btih:54252f543bbc1c2f7dd1039c388564c9523ec636","amp;dn":"The+True+Story+of+the+Beatles%27+Rise+to+the+Top%28epub%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54252f543bbc1c2f7dd1039c388564c9523ec636","infoHashBuffer":{"type":"Buffer","data":[84,37,47,84,59,188,28,47,125,209,3,156,56,133,100,201,82,62,198,54]},"announce":[],"urlList":[]}}