{"title":"The Magician's Lie - Greer Macallister","uid":11700186,"size":1241950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:545eae557ac2820f5847b5c5de11a9726cbeff08&amp;dn=The+Magician%27s+Lie+-+Greer+Macallister&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1423903954,"description":"&quot;Smart, intricately plotted...a richly imagined thriller.&quot;- PEOPLE magazine\n\n&quot;This is a book in which storylines twist, spiral and come together again in an ending as explosive as a poof of smoke from your chimney...or a top hat.&quot; - Oprah.com\n\n&quot;It's a captivating yarn.... Macallister, like the Amazing Arden, mesmerizes her audience. No sleight of hand is necessary. An ambitious heroine and a captivating tale are all the magic she needs.&quot; - *Washington Post *\n\nWater for Elephants meets The Night Circus in The Magician's Lie, a debut novel in which the country's most notorious female illusionist stands accused of her husband's murder - and she has only one night to convince a small-town policeman of her innocence.\n\nThe Amazing Arden is the most famous female illusionist of her day, renowned for her notorious trick of sawing a man in half on stage. One night in Waterloo, Iowa, with young policeman Virgil Holt watching from the audience, she swaps her trademark saw for a fire ax. Is it a new version of the illusion, or an all-too-real murder? When Arden's husband is found lifeless beneath the stage later that night, the answer seems clear.\n\nBut when Virgil happens upon the fleeing magician and takes her into custody, she has a very different story to tell. Even handcuffed and alone, Arden is far from powerless-and what she reveals is as unbelievable as it is spellbinding. Over the course of one eerie night, Virgil must decide whether to turn Arden in or set her free... and it will take all he has to see through the smoke and mirrors.\n\n&quot;This debut novel is historical fiction that blends magic, mystery, and romance.&quot; - Boston Globe, Pick of the Week","torrent":{"xt":"urn:btih:545eae557ac2820f5847b5c5de11a9726cbeff08","amp;dn":"The+Magician%27s+Lie+-+Greer+Macallister","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"545eae557ac2820f5847b5c5de11a9726cbeff08","infoHashBuffer":{"type":"Buffer","data":[84,94,174,85,122,194,130,15,88,71,181,197,222,17,169,114,108,190,255,8]},"announce":[],"urlList":[]}}