{"title":"Dungeon Defenders v7.48b + DLC, standalone no crack needed","uid":9396041,"size":6280769775,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5524f1b3996becae7c10ac3f20493a6a59789a2f&amp;dn=Dungeon+Defenders+v7.48b+%2B+DLC%2C+standalone+no+crack+needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"djowent","files":1,"time":1387984339,"description":"This download includes:\n\nDungeon Defenders v7.48b, Dungeon Defenders Halloween Costume Pack, Dungeon Defenders Halloween Mission Pack, Dungeon Defenders: Penny Arcade Character Pack, Dungeon Defenders The Great Turkey Hunt! Mission &amp; Costumes, Dungeon Defenders New Heroes DLC, Dungeon Defenders Warping Core Challenge Mission Pack, Dungeon Defenders - Etherian Holiday Extravaganza, Dungeon Defenders - Quest for the Lost Eternia Shards Part 1, Dungeon Defenders - Quest for the Lost Eternia Shards Part 2, Dungeon Defenders: Quest for the Lost Eternia Shards Part 3, Dungeon Defenders - Quest for the Lost Eternia Shards Part 4, Dungeon Defenders: Assault Mission Pack, Dungeon Defenders: Barbarian Hero DLC, Dungeon Defenders: Etherian Festival of Love, Dungeon Defenders - President's Day Surprise, Dungeon Defenders Lucky Costume Pack, Dungeon Defenders: Series EV Hero DLC, Dungeon Defenders - Karathiki Jungle Mission Pack, Dungeon Defenders: City in the Cliffs Mission Pack, Dungeon Defenders: Summoner Hero DLC, Dungeon Defenders: Talay Mining Complex Mission Pack, Dungeon Defenders: Jester Hero DLC, Dungeon Defenders Anniversary Pack\n\nThis is a standalone version (does not require steam or a crack) and does not work with trendynet. The online multi-player works through a gamspay account. There are not mutch servers online at the moment because the steam version is a newer version and does not allow joining from older versions.\n\nThis game is awsome when played width a couple of friends.\n\nOfficial site: &lt;a href=&quot;\nhttp://dungeondefenders.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dungeondefenders.com/&lt;/a&gt;\n\nHave fun defending defending dungeons.","torrent":{"xt":"urn:btih:5524f1b3996becae7c10ac3f20493a6a59789a2f","amp;dn":"Dungeon+Defenders+v7.48b+%2B+DLC%2C+standalone+no+crack+needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5524f1b3996becae7c10ac3f20493a6a59789a2f","infoHashBuffer":{"type":"Buffer","data":[85,36,241,179,153,107,236,174,124,16,172,63,32,73,58,106,89,120,154,47]},"announce":[],"urlList":[]}}