{"title":"Wang Chung - Greatest Hits (1997) 320 vtwin88cube","uid":6081034,"size":151102056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:555453bb0c73464d1eb3c1c935279df77fd5a1ac&amp;dn=Wang+Chung+-+Greatest+Hits+%281997%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1294121566,"description":"Wang Chung\nEverybody Wang Chung Tonight\nWang Chung's Greatest Hits (1997)\n\nThe London-based new wave group Wang Chung had a handful of hits in the mid-'80s, achieving their greatest popularity in the U.S. Originally called Huang Chung, the band consisted of vocalist/guitarist Jack Hues, bassist Nick Feldman, and drummer Darren Costin. The band recorded four tracks for 101 Records in the late '70s, all of which appeared on a pair of compilation albums. Huang Chung released their first single, &quot;Isn't It About Time We Were on Television?,&quot; in 1980; the record led to a contract with Arista Records. The group released their first album, Huang Chung, in 1982. By the time they recorded 1984's Points on a Curve, the band had changed their name to Wang Chung. &quot;Dance Hall Days&quot; was a small hit in Britain, yet the band hit the Top 40 twice in America -- &quot;Don't Let Go&quot; made it to number 36, while &quot;Dance Hall Days&quot; reached number 16. From this point on, Wang Chung ignored the U.K. market, choosing to concentrate on the U.S. &quot;To Live and Die in L.A.,&quot; the theme song from William Friedken's thriller, just missed making the Top 40 in 1985. That same year, Wang Chung switched from Geffen Records to A&amp;M and Costin left the band. Hues and Feldman continued as a duo and released Mosaic in 1986. The album was their biggest hit, launching the number two hit &quot;Everybody Have Fun Tonight&quot; and the Top Ten &quot;Let's Go!&quot; Wang Chung returned in 1989 with The Warmer Side of Cool, which spent a mere six weeks on the charts, spawning the minor hit, &quot;Praying to a New God.&quot; After the relative disappointment of the album, the group quietly stopped touring and recording.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop\t\t\nM3U Playlist:\t\tYes\n\nEverybody Wang Chung Tonight: Wang Chung's Greatest Hits does a good job in collecting all of Wang Chung's 1980s hits. In fact, this well-assembled collection doesn't miss a beat -- it includes all eight of the duo's charted singles. A hybrid of 1980s post-punk pop/rock and new wave, Wang Chung's music was at times somewhat middle of the road (a case in point: the Top Ten hit &quot;Let's Go&quot;) but, when at their edgy best, they produced some of the decade's most memorable hits. Among these is the swingin' 1984 Top 20 smash &quot;Dance Hall Days,&quot; the eerie, mid-tempo &quot;To Live and Die in L.A.,&quot; and the unforgettable &quot;Everybody Have Fun Tonight,&quot; one of 1986's biggest hits. Also included in this collection is the interesting &quot;Fun Tonight: The Early Years,&quot; which is &quot;Everybody Have Fun Tonight&quot;'s original demo (in ballad form) and was the single's B-side (and is quite a good recording in its own right). &quot;Space Junk&quot; is a groovy, shuffling, hip-hop-infused new track (at times reminiscent of Portishead) and one of the album's definite highlights. Finally, an updated and surprisingly good house/techno mix of &quot;Dance Hall Days&quot; rounds out this collection, which, for the casual fan, manages to include all of the duo's essential recordings and then some. If only all greatest-hits albums could be this thorough.\n\n01.Dance Hall Days\n02.Don't Let Go\n03.Don't Be My Enemy\n04.Hypnotize Me\n05.Let's Go!\n06.Praying To A New God\n07.What's So Bad About Feeling Good\n08.Wait\n09.To Live And Die In L.A.\n10.Big World\n11.Fun Tonight The Early Years\n12.Everybody Have Fun Tonight\n13.Space Junk\n14.Dance Hall Days (Flashing Back To Happiness 7&quot; Mix)\n\n\nCheers!","torrent":{"xt":"urn:btih:555453bb0c73464d1eb3c1c935279df77fd5a1ac","amp;dn":"Wang+Chung+-+Greatest+Hits+%281997%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"555453bb0c73464d1eb3c1c935279df77fd5a1ac","infoHashBuffer":{"type":"Buffer","data":[85,84,83,187,12,115,70,77,30,179,193,201,53,39,157,247,127,213,161,172]},"announce":[],"urlList":[]}}