{"title":"The Cartel_ A Novel - Don Winslow.epub","uid":12958006,"size":728861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:556cc53ccfe03a4ac026a6e7393a62dd85bac5e0&amp;dn=The+Cartel_+A+Novel+-+Don+Winslow.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mr_mando","files":1,"time":1449810046,"description":"The Cartel: A Novel - Don Winslow\r\n\r\nFrom the internationally best-selling author of the acclaimed novel The Power of the Dog comes The Cartel, a gripping, true-to-life, ripped-from-the-headlines epic story of power, corruption, revenge, and justice spanning the past decade of the Mexican-American drug wars.\r\n\r\nIt’s 2004. DEA agent Art Keller has been fighting the war on drugs for thirty years in a blood feud against Adán Barrera, the head of El Federación, the world’s most powerful cartel, and the man who brutally murdered Keller’s partner. Finally putting Barrera away cost Keller dearly—the woman he loves, the beliefs he cherishes, the life he wants to lead.\r\n\r\nThen Barrera gets out, determined to rebuild the empire that Keller shattered. Unwilling to live in a world with Barrera in it, Keller goes on a ten-year odyssey to take him down. His obsession with justice—or is it revenge?—becomes a ruthless struggle that stretches from the cities, mountains, and deserts of Mexico to Washington’s corridors of power to the streets of Berlin and Barcelona. Keller fights his personal battle against the devastated backdrop of Mexico’s drug war, a conflict of unprecedented scale and viciousness, as cartels vie for power and he comes to the final reckoning with Barrera—and himself—that he always knew must happen.\r\n\r\nThe Cartel is a story of revenge, honor, and sacrifice, as one man tries to face down the devil without losing his soul. It is the story of the war on drugs and the men—and women—who wage it","torrent":{"xt":"urn:btih:556cc53ccfe03a4ac026a6e7393a62dd85bac5e0","amp;dn":"The+Cartel_+A+Novel+-+Don+Winslow.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556cc53ccfe03a4ac026a6e7393a62dd85bac5e0","infoHashBuffer":{"type":"Buffer","data":[85,108,197,60,207,224,58,74,192,38,166,231,57,58,98,221,133,186,197,224]},"announce":[],"urlList":[]}}