{"title":"Why.Knot.How.to.Tie.More.than.Sixty.Ingenious.Useful.Beautiful.L","uid":10666281,"size":5722828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55e069bc91faa3a9b5fbbdd8cbf697a95a2f7332&amp;dn=Why.Knot.How.to.Tie.More.than.Sixty.Ingenious.Useful.Beautiful.L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"wildturkey00","files":2,"time":1406804060,"description":"Format: EPUB\nGenre: Knot tiyig /tutorial\nPublished: 2013\n\nBook Description: On August 7, 1974, Philippe Petit stepped out on a wire illegally rigged between the New York World Trade Center's twin towers, where he performed for nearly an hour. During this history-making walk, and many others throughout his celebrated career, knots have always been indispensable components-the guardian angels protecting his life in the sky.\nAfter years of hands-on research, Philippe presents Why Knot?, a guide to tying his essential knots. Philippe's own practical sketches illustrate original methods and clear, clever tying instructions. Photographs in which special knots were used during spectacular high-wire walks, quirky knot trivia, personal anecdotes, helpful tips, magic tricks, and special tying challenges ensure that, if you're not already nuts for knots, Petit will transform you into a knot aficionado.\n\nPraise for Why Knot?:\n?\n&quot;In reading Philippe's book we are cogently reminded that without the ability to secure a rope, or tether a goat, or make fast the sheets of a galley, much of the civilization that we take for granted would disappear as easily as a slipknot in the hands of a Vegas conjuror.&quot; -Sting\n?\n&quot;Philippe Petit is an artist of knots: We get taken and sprung free at the same time. This is a dynamic book, eclectic, fun, and practical. From Nabokov to the World Trade Center to improvised handcuffs! Wonderful.&quot; -Colum McCann\n?\n&quot;Read this book and pop it in your pocket. . . . One day it may save your life!&quot; -Melissa Leo\n?\n&quot;This is not your normal book for Boy Scouts. This is for those with a sense of poetry-the poetry and the mystery of the Bowline in the Bight, the Highwayman's Hitch, and the Monkey's Fist-revealed to us by a man whose life depends on ropes and knots.&quot; -Werner Herzog\n?\n&quot;Petit's distinct and deeply insightful philosophy through the guise of mere knots forever binds us to surprising new joys.&quot; -Elizabeth Streb\n\n&quot;The book describes, among other things, the kind of knots that held fast when was high up without a net-the 'locked constrictor' he used at the trade center, the 'farmer's loop' he fastened to the Sydney Harbour Bridge in Australia in 1973, the 'jug sling' he cast before he walked between Avery Fisher Hall and what was then the New York State Theater in Lincoln Center in 1987.&quot; -The New York Times\n?\n&quot;Petit's illustrated guide to some of his favorites, like the slipped clove hitch he used to anchor the wire on which he walked across New York's Grand Central Terminal.. [He] carried a length of rope in his pocket in order to perform tricks at a moment's notice. The book comes equipped with a section of cord so readers can do the same.&quot; -WIRED\n\n&quot;In explaining the purpose and creation of knots, Mr. Petit earns perfect marks. Thanks to those flawless drawings, I relearned the bowline in record time.&quot; -Wall Street Journal\n\n&quot;Petit, who knows how to tie 200 knots and has a knot library of 200 volumes, is a poetic and passionate instructor.&quot; -Boston Globe\n\n&quot;His newest book celebrates the unsung heroes of his work: knots. This beautifully packaged hardcover comes complete with a practice rope coiled in the title's O.&quot; - Mental Floss\n\n&quot;Thank you for this very smart book, everyone needs one!&quot; -Charlie Rose\n?\n&quot;Mr. Petit is the perfect teacher. His descriptions are clear, he deploys humor frequently and he makes his points with anecdotes that are colorful and memorable. Explaining the purpose and creation of knots and thanks to those flawless drawings Mr. Petit earns perfect marks.&quot; -Wall Street Journal\n?\n&quot;For famed high-wire walker Philippe Petit, a well-tied knot is more than a thing of beauty-it's a matter of life and death","torrent":{"xt":"urn:btih:55e069bc91faa3a9b5fbbdd8cbf697a95a2f7332","amp;dn":"Why.Knot.How.to.Tie.More.than.Sixty.Ingenious.Useful.Beautiful.L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e069bc91faa3a9b5fbbdd8cbf697a95a2f7332","infoHashBuffer":{"type":"Buffer","data":[85,224,105,188,145,250,163,169,181,251,189,216,203,246,151,169,90,47,115,50]},"announce":[],"urlList":[]}}