{"title":"Crysis 2 -FLT","uid":11915822,"size":8205963339,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:566e30ceb9faaeadb7e8dec7cdc459bae7b65e76&amp;dn=Crysis+2+-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Bozyhe","files":2,"time":1431536484,"description":"In Their 24th Year Of Glory, FairLight Released #1001\n\nCrysis 2 (c) Electronic Arts\n\n:  Supplied by: FAIRLIGHT            : : Release Date: 24/03/2011\nCracked by:  FAIRLIGHT              Game Type: FPS\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: SolidShield\n\nDVD1: flt-cry2.001 - flt-cry2.076\n\nGame information\n=================\n\nCrysis 2 is the sequel to one of the greatest PC  first-person shooters yet\ncreated. Featuring  futuristic war, gorgeous destruction  and the chance to\nkick alien  butt on the grandest stage of all,  New York City,  Crysis 2 is\ndestined  at  the  least  to  equal  its  predecessor,  if not  surpass it\nAdditional features include:  challenging  AI enemies in  the single player\ncampaign, 12-player support online,  new and improved upgradable Nanosuit 2\ntechnology and more\n\nThe world has been ravaged by a series of climatic disasters and society is\non the verge of total breakdown.  Now the aliens have returned, with a full\ninvasion force bent on nothing less than the total annihilation of mankind,\nstarting by trying to rip the heart out of Earth's most iconic city\n\nIn New York, terrifying  alien invaders  stalk the  streets and a nightmare\nplague strikes  down  the city's  myriad inhabitants with  brutal  epidemic\nspeed.  The  city's systems  are in chaos,  its  streets  and  skyline  are\nsmashed and in  flaming ruin. This is  New York City like you've never seen\nit before. Neither  paramilitary  law  enforcement  nor the might of the US\nmilitary machine can stand  against the invaders, and all who choose not to\nflee are dead men walking.  Just to survive in this maelstrom of death will\nrequire technology beyond anything any modern soldier has ever seen\n\nYet one man will inherit that  means to survive. One supersoldier, wielding\nthe combat enhancement technology of the  future with Nanosuit 2, will make\nthe last stand  to save  humanity from destruction in the urban jungle that\nis New York City.\n\nFeatures\n\nNew York New York - Crysis set the visual benchmark for PC games that\nstill stands today. Crysis 2 redefines the benchmark on console and PC\nplatforms, shifting their attention to the rich urban jungle of\nNew York City\nAmazing Aliens and AI - Challenging best-in-class AI with unique group\ncoordination and group behavior systems which give realistic responses\nto your actions\nNanosuit 2 - Adapt your combat tactics by customizing your Nanosuit and\nweapons in real time with revised modes, unlocking a variety of\nsupersoldier abilities\nMultiplayer - World-renowned multiplayer shooter studio Crytek\nUK reinvents multiplayer with the dynamic intensity of Nanosuit 2\nBy using Nanosuit technology the player has nearly unlimited ways to\napproach the dynamic combat environment. 1-12 players are supported online\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall game\nCopy crack from FairLight folder on DVD to gamedir\nPlay\nBuy the game if you enjoy it","torrent":{"xt":"urn:btih:566e30ceb9faaeadb7e8dec7cdc459bae7b65e76","amp;dn":"Crysis+2+-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"566e30ceb9faaeadb7e8dec7cdc459bae7b65e76","infoHashBuffer":{"type":"Buffer","data":[86,110,48,206,185,250,174,173,183,232,222,199,205,196,89,186,231,182,94,118]},"announce":[],"urlList":[]}}