{"title":"Manuel GÃƒÂ¶ttsching: E2-E4","uid":5564629,"size":92058710,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5681b61ac0e9db06a3ca63643bd0d8bafe6bf41d&amp;dn=Manuel+G%C3%83%C2%B6ttsching%3A+E2-E4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"tiblan","files":5,"time":1273936738,"description":"Both as a founding member of the Krautrock group Ash Ra Tempel and through his later solo work, Manuel GÃƒÂ¶ttsching was among the true innovators of the musical aesthetic later dubbed electronica, with his 1984 release E2-E4 remaining a seminal building block in the subsequent development of styles ranging from techno to house to contemporary ambient music.\n\nE2-E4, one of the few records GÃƒÂ¶ttsching released under his own name, has earned its place as one of the most important, influential electronic records ever released. It's also the earliest album to set the tone for electronic dance music; simply put, it just sounds like the mainstream house produced during the next two decades. Similar to previous Ashra albums like New Age of Earth and Blackouts, it does so with a short list of instruments -- just the nominal drum machine and a pulsing guitar line in the background plus some light synthesizer work. What sets it apart from music that came before is a steadfast refusal to follow the popular notions of development in melody and harmony. Instead, E2-E4 continues working through similar territory for close to an hour with an application to trance-state electronics missing from most of the music that preceded it. Though the various components repeat themselves incessantly, it's how they interact and build that determines the sound -- and that's the essence of most electronic dance music, that complex interplay between several repetitive elements.\n\nINFO:\nThis is the full track complete with artwork.\nBitrate is 201.\nSamplerate 44.100Khz","torrent":{"xt":"urn:btih:5681b61ac0e9db06a3ca63643bd0d8bafe6bf41d","amp;dn":"Manuel+G%C3%83%C2%B6ttsching%3A+E2-E4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5681b61ac0e9db06a3ca63643bd0d8bafe6bf41d","infoHashBuffer":{"type":"Buffer","data":[86,129,182,26,192,233,219,6,163,202,99,100,59,208,216,186,254,107,244,29]},"announce":[],"urlList":[]}}