{"title":"Ocean Waves Studio Ghibli Japanese audio Eng Subs Divx","uid":6307429,"size":1754560854,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56f5232139e1674d722a9af65251eb11352c29ed&amp;dn=Ocean+Waves+Studio+Ghibli+Japanese+audio+Eng+Subs+Divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"sushiplatter","files":2,"time":1302393622,"description":"Ocean Waves by Studio Ghibli and Tomomi Mochizuki\n\nJapanese audio with English subtitles. Divx avi at high quality.\n\nRarely seen outside of its native Japan and never before released within the U.K., OCEAN WAVES (also known as Umi Ga Kikoeru and I Can Hear The Sea) is one of Studio Ghibli's most obscure and sought after titles. Directed by Tomomi Mochizuki and based upon author and playwright Saeko Himuro's most popular, best selling novel, Ocean Waves is one of the most poignant and unsung masterpieces within Studio Ghibli's legendary creative output. Wonderfully detailed and incredibly subtle, there are very few films in the history of animation that have managed to capture so well the joys and drama of adolescence and teenage alienation.\n\nKochi is your average coastal town on the the sleepy, idyllic island of Shikoku and young Taku is definitely your average high school student. But soon his quiet life will be turned upside down with the arrival of Rikako: a beautiful, female student recently transferred from Tokyo. By the end of term Taku will have learnt a valuable lesson in love and friendship.\n\nIf you like it leave me a little comment and let others know what you think, thanks!","torrent":{"xt":"urn:btih:56f5232139e1674d722a9af65251eb11352c29ed","amp;dn":"Ocean+Waves+Studio+Ghibli+Japanese+audio+Eng+Subs+Divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56f5232139e1674d722a9af65251eb11352c29ed","infoHashBuffer":{"type":"Buffer","data":[86,245,35,33,57,225,103,77,114,42,154,246,82,81,235,17,53,44,41,237]},"announce":[],"urlList":[]}}