{"title":"[SoM]Piccolo Buddha[DvdRip-Divx-Ita-Mp3]","uid":4988899,"size":1256078418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57a30bdbb5b488f13bc8b6ae04d7e55a814db76a&amp;dn=%5BSoM%5DPiccolo+Buddha%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mitimex","files":1,"time":1246925720,"description":"\n\nJesse Konrad ÃƒÂ¨ un bambino che vive a Seattle con il padre, ingegnere, Dean e la madre, insegnante, Lisa. Un giorno la famiglia trova sulla porta di casa una delegazione di monaci buddisti del lontano regno del Bhutan. I monaci, guidati dal Lama Norbu con il suo assistente Champa, credono che Jesse sia la reincarnazione di uno dei loro piÃƒÂ¹ rispettati lama e vorrebbero portare Jesse in Bhutan a studiare le pratiche buddiste. Increduli, ma curiosi, i Konrad accolgono i monaci e permettono loro di passare del tempo con Jesse. Dean, intanto, viene travolto da una crisi professionale e personale e decide di accettare la proposta dei monaci e accompagnare Jesse in Bhutan, superando le obiezioni di Lisa. Guidato da Lama Norbu, Jesse scopre il Bhutan, un mondo completamente diverso dal suo, vivendo alcuni giorni in monasteri dove vengono ancora seguite regole di vita antiche e tradizionali. Tra il bambino e il vecchio lama si instaura un legame profondo. Il lama si trova cosÃƒÂ¬ a raccontare a Jesse la storia, avvolta nel mito, del principe Siddhartha, vissuto duemilacinquecento anni fa, e destinato a diventare, dopo una straordinaria vicenda umana, la personificazione storica del Buddha. ","torrent":{"xt":"urn:btih:57a30bdbb5b488f13bc8b6ae04d7e55a814db76a","amp;dn":"%5BSoM%5DPiccolo+Buddha%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57a30bdbb5b488f13bc8b6ae04d7e55a814db76a","infoHashBuffer":{"type":"Buffer","data":[87,163,11,219,181,180,136,241,59,200,182,174,4,215,229,90,129,77,183,106]},"announce":[],"urlList":[]}}