{"title":"PBS Empires - The Greeks - Crucible of Civilization","uid":8750997,"size":1620338779,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:57af3c17e2decac94f5b08fe67e2cc510fa983f3&amp;dn=PBS+Empires+-+The+Greeks+-+Crucible+of+Civilization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"rambam1776","files":-1,"time":1375030428,"description":"The Greeks - Crucible of Civilization\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.31 GiB\nDuration                                 : 2h 20mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Variable\nScan type                                : Progressive\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0239018/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0239018/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=The_Greeks_-_Crucible_of_Civilization&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=The_Greeks_-_Crucible_of_Civilization&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/2b53b81b02b123dddac437db8730aedb3c2b145c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/2b53b81b02b123dddac437db8730aedb3c2b145c.jpg&lt;/a&gt;\n\nThe Revolution\n\nThe first part tells the story of the troubled birth of the world's first democracy, ancient Athens, through the life of an Athenian nobleman, Cleisthenes. In the brutal world of the 5th century BC, the Athenians struggle against a series of tyrants and their greatest rival, Sparta, to create a new &quot;society of equals.&quot; This documentary makes history entertaining as well as educational. Beautifully photographed, using reenactments, paintings, maps, pottery, metalwork, and &quot;living statues&quot; to take the viewer on a vicarious journey through ancient Greece. Episode one, The Revolution, begins at the dawn of democracy in 508 B.C., with the revolution of the common people against aristocratic rule. The film then travels further back in time to chronicle the key events leading up to the revolution. As the camera roams ancient ruins, the Greek countryside, and old stone roads, the viewer learns that the inhabitants of Greece once lived in mud houses with no sewage and frequently fell prey to disease and warfare. Unable to write, they memorized their works of literature in order to pass them on to the next generation. Over time, their hardship and learning whetted their appetite for freedom. After rule by tyrants of the aristocratic class and a struggle for power, Cleisthenes (570-507 B.C.), himself an aristocrat, sided with the common people of Athens and brought democracy into being. From this beginning, western democracy developed and flourished. All the while during their early maturation into a Mediterranean power, Athens and other city-states had to live with the threat of war from expansionist Sparta as well as the vast Persian Empire. But democracy had taken root, and it proved in the long run to be a greater force than the mightiest of armies. The program closes on the eve of the new society's first great test: invasion by the mighty empire of Persia. \n\nGolden Age\n\nThe second part recounts the Greeks' heroic victory against the mighty Persian empire through the life of Themistocles, one of Athens' greatest generals.The episode opens in 490 B.C. when tiny Athens prepares to safeguard its growing economy and infant democracy against an invasion by Persian armies of Darius the Great. When the Persians arrive for battle, the Greek courier Phidippides runs 140 miles to Sparta in two days to solicit help from its army, according the historian Herodotus. But Sparta, Athens' rival, refuses to participate. The outnumbered Athenians, fighting to uphold their life of freedom, defeat the Persians and send them in humiliation back to Asia. But one Athenian, Themistocles, realizes Athens has not seen the last of the proud Persians. He persuades city leaders to build a fleet of war ships. These ships, called triremes, are &quot;floating missiles&quot; with projecting bows designed specifically to ram enemy vessels. While the Athenians execute their plans, the Persian ruler Darius dies and his son Xerxes succeeds to the throne. Under pressure to take revenge against the Greeks, he assembles an army of two million men. When the terrified Greeks ask the Delphic Oracle for advice, she simply tells them to flee. But Themistocles refuses to panic. Instead, he again petitions the Delphic Oracle, and this time she predicts that a &quot;wooden wall&quot; will protect the Greeks. First, he orders Athens abandoned, installs his fleet at the Aegean island of Salamis, and sends a &quot;traitor&quot; to the Persians to tell them that the Athenians are fleeing and are easy prey for the Persian fleet. When Persian ships move into the strait between Salamis and the Greek mainland, the triremes ram and sink 200 Persian vessels, and Athens wins the war. Greece, now master of the Mediterranean, undergoes one of the most startling intellectual and physical transformations in history. Pericles, the elected leader of Athens, oversees the building of the Parthenon and an extraordinary flourishing of the arts and sciences, laying the foundation for what is now called &quot;Western culture.&quot; \n\nEmpire of Mind\n\nThe final segment describes how Athens, at the height of her glory, engaged in a suicidal conflict with her greatest rival, Sparta. Through the eyes of Socrates, Athens' first philosopher, viewers see the tragic descent of Athenian democracy into mob rule.The episode opens in 399 B.C., after the great philosopher Socrates has been sentenced to death and Athens lies in ruins after a war with Sparta. This episode goes back to 431 B.C., to an Athens at the height of its cultural, political, and economic power. Having taken great leaps forward in every field of learning, and with a strong economy that dominates Mediterranean trade, Athens and its 150,000 residents are the envy of their neighbors, in particular, bellicose Sparta. Jealous of Athenian success, the Spartans yearn to spill Athenian blood and dominate the region. Of course, Pericles knows what is coming, and he orders the citizens to abandon open areas and take refuge inside the walls of Athens. The mighty Athenian fleet will provide supplies for the citizens through the port of Piraeus and a walled corridor between that city and Athens. Over time, the navy will prevail, as it had against the Persians, and win yet another victory. Much is at stake -- democracy, freedom, the whole Athenian way of life. As expected, the Spartans invade and burn the open areas around the city. But it is the unexpected that deals the most devastating blow to Athens. Incoming ships with supplies for the walled-in Greeks carry plague-bearing rats feeding on grain. The disease ravages the Athenians, inflicting agony on them and killing one out of every three. The Spartans are of little concern; what matters is surviving until tomorrow. Pericles' esteem plummets even as he himself contracts the plague and eventually dies. Finally in 404 B.C., Athens surrenders. The Athenians, shattered and stripped of their empire, take revenge on their most vocal critic and condemn Socrates to death before a people's court. ","torrent":{"xt":"urn:btih:57af3c17e2decac94f5b08fe67e2cc510fa983f3","amp;dn":"PBS+Empires+-+The+Greeks+-+Crucible+of+Civilization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57af3c17e2decac94f5b08fe67e2cc510fa983f3","infoHashBuffer":{"type":"Buffer","data":[87,175,60,23,226,222,202,201,79,91,8,254,103,226,204,81,15,169,131,243]},"announce":[],"urlList":[]}}