{"title":"The Abbott and Costello Show - The complete Series","uid":11006079,"size":13534297254,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5871bf0b4ff0693305e5c8a743ec8fb1460a02c3&amp;dn=The+Abbott+and+Costello+Show+-+The+complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"pmedgar","files":60,"time":1410234863,"description":"The Abbott and Costello Show is an American television sitcom starring the popular comedy team of Bud Abbott and Lou Costello that premiered in syndication in the fall of 1952 and ran until May 1954.\n\nThe series is regarded among the most influential comedy programs in history. In 1998 Entertainment Weekly praised the series as one of the &quot;100 Greatest TV Shows of All Time&quot;. In 2007, Time magazine selected it for its &quot;The 100 Best TV Shows of All-TIME.&quot;\n\nThe show was a vehicle to bring the duo's tried and true burlesque routines to television in a format that the team could control. It contained none of the musical interludes or love stories that marked most of their feature films. Basically, if a situation or gag was funny, the team filmed it with little regard to plot, character or continuity. As a result, the show became a record of classic burlesque scenes performed by the duo.\n\nAbbott and Costello portrayed unemployed actors sharing an apartment in a rooming house in Hollywood. The supporting cast included Sidney Fields as their landlord; Hillary Brooke as a neighbor and sometime love interest; Gordon Jones as Mike the Cop, a dimwitted foil for the boys; Joe Besser as Stinky, a &quot;little boy&quot; dressed in a Little Lord Fauntleroy suit, played by the clearly adult Besser; and Joe Kirk (Costello's brother-in-law) as Mr. Bacciagalupe, an Italian immigrant caricature who held a variety of jobs depending upon the requirements of the script. Bobby Barber and Joan Shawlee also appeared frequently. Several episodes featured a pet female chimp named &quot;Bingo&quot;, who was dressed exactly the same as Costello. Bingo was fired from the show after biting Costello. Brooke, Besser, and Kirk also left the cast after the first season.\n\n Lou Costello owned the show with Bud Abbott working on salary. The show was not a network program when first introduced but was sold into syndication by MCA Inc. to about 40 local stations across the country. As a result, it was broadcast on different days and at different times in different cities. In New York, it first appeared on the CBS affiliate, WCBS, on December 5, 1952[1] but was not carried nationally on that network. (The 1953-54 season was telecast locally on WNBT, as NBC's New York flagship station was then known). However, first season episodes were repeated as part of CBS' Saturday morning schedule during the 1954-55 season.\n\nThis sitcom had a larger viewership in reruns from the late 1960s to the 1990s.\n\nStarring\tBud Abbott, Lou Costello, Sid Fields\n\nNo. of seasons\t 2\nNo. of episodes\t52\n\nThis collection also includes some speceial features that were included in the DVD box set which are:\n1. &quot;Hey Abbott&quot;\n2. 10000 kids and  cop\n3. Interviews\n4. Home Videos\n","torrent":{"xt":"urn:btih:5871bf0b4ff0693305e5c8a743ec8fb1460a02c3","amp;dn":"The+Abbott+and+Costello+Show+-+The+complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5871bf0b4ff0693305e5c8a743ec8fb1460a02c3","infoHashBuffer":{"type":"Buffer","data":[88,113,191,11,79,240,105,51,5,229,200,167,67,236,143,177,70,10,2,195]},"announce":[],"urlList":[]}}