{"title":"Crash Test Dummies - God Shuffled His Feet [Mp3 320 kbps]","uid":4817833,"size":87768998,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:58f5b02939d2a645c0284911a04180979044d89b&amp;dn=Crash+Test+Dummies+-+God+Shuffled+His+Feet+%5BMp3+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Appelloveglie","files":13,"time":1238625700,"description":"Crash Test Dummies - God Shuffled His Feet [Mp3 320 kbps]\n\n\n\n\nI Crash Test Dummies, anche noti come Dummies, sono un gruppo musicale canadese folk-rock originario di Winnipeg, formatosi nel 1990 e popolare negli anni '90.\nL'origine del gruppo, in molti sensi, ÃƒÂ¨ legata alla storia dei club Spectrum Cabaret e Blue Note Cafe, di cui Curtis Riddel era proprietario.\nAlla metÃƒÂ  degli anni '80, Riddel si unisce a Brad Roberts per formare il gruppo da bar Bad Brad Roberts and the St. James Rhythm Pigs. Il gruppo cambia il proprio nome in Crash Test Dummies, ascoltando il suggerimento di un amico che frequenta medicina. Ellen Reid e Benjamin Darvill si uniscono permanentemente al gruppo mentre George West, l'originale bassista, ne esce e viene sostituito da Dan Roberts, fratello di Brad. Riddel viene sostituito da Vince Labbert, il quale, viene rimpiazzato a sua volta da Mitch Dorge proprio durante l'uscita dell'album The Ghosts that Haunt Me.\nIl gruppo inizia ad ottenere il successo commerciale con il rilascio di The Ghosts that Haunt Me nel 1991. L'album ha ottenuto quadruple vendite di platino (400 000), in gran parte dovute alla popolaritÃƒÂ  del singolo Superman's song che ha fatto guadagnare ai Dummies nel 1991 il Juno Award del gruppo dell'anno.\nTuttavia, i Dummies non hanno piÃƒÂ¹ ricevuto riconoscimento internazionale fino al rilascio nel 1993 del loro secondo album, God Shuffled His Feet. Particolarmente strumentale nell'aumento delle esposizioni di Ctd nel mercato degli Stati Uniti era l'apparenza di un nuovo formato di radio: adult album-oriented alternative rock. Queste stazioni trasmettono la canzone Mmm Mmm Mmm Mmm in alta rotazione. Il risultato era stato nella metÃƒÂ  del 1994, l'album aveva passato le vendite di platino negli Stati Uniti (1 milione) e ha fatto guadagnare al gruppo 3 nominations al premio Grammy ed altre 3 al Juno Award. Fin qui God Shuffled His Feet ha venduto oltre 5 milioni e mezzo di copie in tutto il mondo.\nNel 1994 i Dummies rilasciano The Ballad of Peter Pumpkinhead, una cover dell'omonima canzone del gruppo britannico XTC, anche colonna sonora della commedia di Jim Carrey e Jeff Daniels Dumb and Dumber. La canzone, accreditata ai Dummies e da Ellen Reid, raggiunse la posizione 30 nella classifica dei singoli britannica ed ha posizionato il gruppo in prima posizione in Canada.[1]\nNel 1996, il terzo album dei Dummies, A Worm's Life, fu rilasciato con un critico e moderato successo commerciale.\n\n\n\nTRACKLIST\n\n&quot;God Shuffled His Feet&quot; - 5:10\n&quot;Afternoons &amp; Coffeespoons&quot; - 3:56\n&quot;Mmm Mmm Mmm Mmm&quot; - 3:55\n&quot;In the Days of the Caveman&quot; - 3:41\n&quot;Swimming in Your Ocean&quot; - 3:49\n&quot;Here I Stand Before Me&quot; - 3:07\n&quot;I Think I'll Disappear Now&quot; - 4:52\n&quot;How Does a Duck Know?&quot; - 3:42\n&quot;When I Go Out with Artists&quot; - 3:44\n&quot;The Psychic&quot; - 3:48\n&quot;Two Knights and Maidens&quot; - 3:25\n&quot;Untitled&quot; - 1:43 ","torrent":{"xt":"urn:btih:58f5b02939d2a645c0284911a04180979044d89b","amp;dn":"Crash+Test+Dummies+-+God+Shuffled+His+Feet+%5BMp3+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58f5b02939d2a645c0284911a04180979044d89b","infoHashBuffer":{"type":"Buffer","data":[88,245,176,41,57,210,166,69,192,40,73,17,160,65,128,151,144,68,216,155]},"announce":[],"urlList":[]}}