{"title":"Downton Abbey Christmas Special 2011 DvdRip NL Subs DutchRelease","uid":11033798,"size":1345156062,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:597705e83c7633ff027c9102fbd8a6507db2fbee&amp;dn=Downton+Abbey+Christmas+Special+2011+DvdRip+NL+Subs+DutchRelease&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Recon06","files":5,"time":1410757568,"description":"Downton Abbey Christmas Special 2011 DvdRip NL Subs DutchReleaseTeam\n\n[IMG]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/DowntonAbbeyS2dvdcase_zpsc1344635.png[/IMG]\n\nDe Kerstspecial speelt zich af net na de oorlog. De familie Crawley wil Kerstmis vieren, maar allerlei factoren dreigen dit in de war te sturen. \nJohn Bates, in seizoen twee gearresteerd op verdenking van moord, moet voor de rechtbank verschijnen. Robert Crawley en zijn personeel moeten getuigen. \nIedereen probeert een goed woordje te doen, maar uiteindelijk blijken er allerlei tegenstrijdigheden te zijn. \nBates wordt ter dood veroordeeld, maar uiteindelijk kan de straf nog omgezet worden in levenslang.\nMary begint steeds meer te twijfelen of het wel een goed idee is om met Sir Richard Carlisle te trouwen. \nSir Richard begint haar meer en meer onder druk te zetten, en Mary is verliefd op Matthew.\nMary biecht het verhaal over Mr Pamuk - de Turkse diplomaat - aan Matthew op en vraagt of hij haar wil vergeven. \nHierop antwoordt Matthew dat hij haar niet kan vergeven, omdat hij vindt dat het niet nodig is. \nAan het einde van de special gebeurt echter eindelijk wat er al lang in de lucht hing; Matthew vraagt aan Mary of ze met hem wil trouwen. \nZe gaat in op zijn aanbod en verbreekt haar relatie met Sir Richard Carlisle.\n\nActeurs: Maggie Smith, Jessica Brown Findlay, Laura Carmichael, Jim Carter, Brendan Coyle, Laura Carmichael and more...\nGenre: Drama | Family | History\nTaal orig. Versie : Engels\nLanguage: English\nOndertiteling: Nederlands\nSubtitles: Dutch (Hardcoded)\n\nDutchReleaseteam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.nl","torrent":{"xt":"urn:btih:597705e83c7633ff027c9102fbd8a6507db2fbee","amp;dn":"Downton+Abbey+Christmas+Special+2011+DvdRip+NL+Subs+DutchRelease","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"597705e83c7633ff027c9102fbd8a6507db2fbee","infoHashBuffer":{"type":"Buffer","data":[89,119,5,232,60,118,51,255,2,124,145,2,251,216,166,80,125,178,251,238]},"announce":[],"urlList":[]}}