{"title":"Joseph E. Stiglitz (2001) Globalization and Its Discontents","uid":9264553,"size":1327820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59f51532a6269180d7c3978b4242719631f94d7b&amp;dn=Joseph+E.+Stiglitz+%282001%29+Globalization+and+Its+Discontents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"navino2","files":4,"time":1385677796,"description":"Joseph E. Stiglitz (2001) Globalization and Its Discontents\n\nISBN-10: 0393324397\nISBN-13: 978-0393324396\n\n\nThis powerful, unsettling book gives us a rare glimpse behind the closed doors of global financial institutions by the winner of the 2001 Nobel Prize in Economics.\nWhen it was first published, this national bestseller quickly became a touchstone in the globalization debate. Renowned economist and Nobel Prize winner Joseph E. Stiglitz had a ringside seat for most of the major economic events of the last decade, including stints as chairman of the Council of Economic Advisers and chief economist at the World Bank. Particularly concerned with the plight of the developing nations, he became increasingly disillusioned as he saw the International Monetary Fund and other major institutions put the interests of Wall Street and the financial community ahead of the poorer nations. Those seeking to understand why globalization has engendered the hostility of protesters in Seattle and Genoa will find the reasons here. While this book includes no simple formula on how to make globalization work, Stiglitz provides a reform agenda that will provoke debate for years to come. Rarely do we get such an insider's analysis of the major institutions of globalization as in this penetrating book. With a new foreword for this paperback edition. Those seeking to understand why globalization has engendered the hostility of protesters in Seattle and Genoa will find the reasons here. While this book includes no simple formula on how to make globalization work, Stiglitz provides a reform agenda that will provoke debate for years to come. Rarely do we get such an insider's analysis of the major institutions of globalization as in this penetrating book. With a new foreword for this paperback edition.\n\nFormats: EPUB, MOBI, and AZW3","torrent":{"xt":"urn:btih:59f51532a6269180d7c3978b4242719631f94d7b","amp;dn":"Joseph+E.+Stiglitz+%282001%29+Globalization+and+Its+Discontents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f51532a6269180d7c3978b4242719631f94d7b","infoHashBuffer":{"type":"Buffer","data":[89,245,21,50,166,38,145,128,215,195,151,139,66,66,113,150,49,249,77,123]},"announce":[],"urlList":[]}}