{"title":"The Things They Carried (Audiobook) 2013 - sum1_here","uid":9119205,"size":466182836,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5a5f28458a98f20d850b0af56719a3d2c8e38298&amp;dn=The+Things+They+Carried+%28Audiobook%29+2013+-+sum1_here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"sum1_here","files":-1,"time":1383092367,"description":"REQUEST\n\n:General:\nComplete name: The Things They Carried (Audiobook) 2013 M4B AAC - sum1_here\nFormat: M4A\nSize: 448 MB\nDuration: 15h 34mn\nLanguage: English\nEncoder: sum1_here\nSource: Thanks\n\n\n\n:Audio:\nFormat: Advanced Audio Codec\nNominal Bitrate: 87.9 Kbps\nChannel(s): 2 channels\nSampling rate: 22.05 KHz\n\n\n\n\n:Info:\nThe Things They Carried (Audiobook) By Tim OBrien, read by Bryan Cranston\n\nUnabridged edition 2013 | 15 hours and 347 minutes \nThis modern classic and New York Times best seller was a finalist for both the 1990 Pulitzer Prize and National Book Critics Circle Award and has become a staple of American classrooms. Hailed by The New York Times as &quot;a marvel of storytelling&quot;, The Things They Carrieds portrayal of the boots-on-the-ground experience of soldiers in the Vietnam War is a landmark in war writing. Now, three-time Emmy Award winner Bryan Cranston, star of the hit TV series Breaking Bad, delivers an electrifying performance that walks the books hallucinatory line between reality and fiction and highlights the emotional power of the spoken word.\n\nThe soldiers in this collection of stories carried M-16 rifles, M-60 machine guns, and M-79 grenade launchers. They carried plastic explosives, hand grenades, flak jackets, and landmines. But they also carried letters from home, illustrated Bibles, and pictures of their loved ones. Some of them carried extra food or comic books or drugs. Every man carried what he needed to survive, and those who did carried their shattering stories away from the jungle and back to a nation that would never understand.\nThis audiobook also includes an exclusive recording &quot;The Vietnam in Me,&quot; a recount of the authors trip back to Vietnam in 1994, revisiting his experience there as a soldier 25 years before, read by Tim OBrien himself. \nThe Things They Carried was produced by Audible Studios in partnership with Playtone, the celebrated film and television production company founded by Tom Hanks and Gary Goetzman, and producer of the award\n","torrent":{"xt":"urn:btih:5a5f28458a98f20d850b0af56719a3d2c8e38298","amp;dn":"The+Things+They+Carried+%28Audiobook%29+2013+-+sum1_here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a5f28458a98f20d850b0af56719a3d2c8e38298","infoHashBuffer":{"type":"Buffer","data":[90,95,40,69,138,152,242,13,133,11,10,245,103,25,163,210,200,227,130,152]},"announce":[],"urlList":[]}}