{"title":"[FSX] Davor Puljevic - Croatian Airports (LDZA, LDDU, LDSP)","uid":7180799,"size":36767072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a99f22f7cd9bf1cc0f09bdd3dd7a324576b60d0&amp;dn=%5BFSX%5D+Davor+Puljevic+-+Croatian+Airports+%28LDZA%2C+LDDU%2C+LDSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"_SnakEye","files":1,"time":1334259116,"description":" This is photoreal scenery of three main croatian airports (LDZA, LDDU and LDSP). It is rebuilt scenery of my FS2004 version complitelly adjusted for FSX. Airport are excellent incorporated in surrounding scenery.Here is also very detailed coastline of adriatic sea from Trst in Italy till the Albanian border.\n\nScenery is based on hundreds digital and satellite pictures and includes: -photoreal objects with day and night textures of all three airports -semitransparent day and night terminal windows with arranged terminal interior -correct airport mesh with two levels and correct surrounding mesh -parking cars and original apron vehicles -dinamyc vehicles on the apron -very detailed and photoreal airports surrounding landscape which include towns: Velika Gorica, Trogir, Kastela, Split, Dubrovnik and Cavtat -very detailed coastline of the adriatic sea from Trst in Italy till Albanian border with more than 450 islands - correct landscape of maritime area (about 20 km inland) with towns, villages, main roads with dinamyc traffic in both sides, railways, bridges,boats,marinas,factories,shipyards and many other objects -aeronautical charts of these airports\n\nIn the Option-setting-display and scenery option set mesh resolution slider to 10 m. This is important for correct mesh of the LDDU and LDSP airports. For sharp textures my suggestion is to set global texture resolution slider to high position, and autogen slider to dense or better very dense.","torrent":{"xt":"urn:btih:5a99f22f7cd9bf1cc0f09bdd3dd7a324576b60d0","amp;dn":"%5BFSX%5D+Davor+Puljevic+-+Croatian+Airports+%28LDZA%2C+LDDU%2C+LDSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a99f22f7cd9bf1cc0f09bdd3dd7a324576b60d0","infoHashBuffer":{"type":"Buffer","data":[90,153,242,47,124,217,191,28,192,240,155,221,61,215,163,36,87,107,96,208]},"announce":[],"urlList":[]}}