{"title":"The Presocratics &amp; Sophists - Philosophical Works (11 books)","uid":10147816,"size":152135534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b4729b2a27e0df9edb90930743f6ebede68a07f&amp;dn=The+Presocratics+%26amp%3B+Sophists+-+Philosophical+Works+%2811+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"workerbee","files":-1,"time":1400028174,"description":"\nPresocratic philosophy is Greek philosophy before Socrates (and includes schools contemporary with Socrates that were not influenced by him).  The Presocratics rejected traditional mythological explanations of the phenomena they saw around them in favor of more rational explanations, which is why Aristotle called them physikoi (physicists after physis or &quot;nature&quot;) for seeking natural explanations for phenomena, as opposed to the earlier theologoi (theologians).  It is sometimes difficult to determine the actual line of argument some Presocratics used in supporting their particular views.  While most of them produced significant texts, none of the texts has survived in complete form.  All that is available are quotations by later philosophers (often biased) and historians, and the occasional textual fragment.\n\nThe Sophists were a class of mostly itinerant intellectuals who taught courses in various subjects, speculated about the nature of language and culture and employed rhetoric to achieve their purposes, generally to persuade or convince others.  Most are known today primarily through the writings of their opponents (specifically Plato and Aristotle), which makes it difficult to assemble an unbiased view of their practices and beliefs.  In some cases, such as Gorgias, there are original rhetorical works that are fortunately extant, allowing the author to be judged on his own terms.  In most cases, however, knowledge about what individual sophists wrote or said comes from fragmentary quotations that lack context.\n\n\nThis collection is comprised of 5 comprehensive anthologies of Presocratic and Sophist philosophy, in addition to individual volumes containing fragments and testimonia by Democritus, Heraclitus, Leucippus, Parmenides, and Philolaus.  With one exception noted below, the following books are in PDF format:\n\n\n== Anthologies ==\n\n* EARLY GREEK PHILOSOPHY (Penguin Classics, 1987).  Edited by Jonathan Barnes.\n\n* THE FIRST PHILOSOPHERS: The Presocratics and Sophists (Oxford World's Classics, 2000).  Translated with Commentary by Robin Waterfield.\n\n* THE OLDER SOPHISTS: A Complete Translation by Several Hands of the Fragments in &quot;Die Fragmente der Vorsokratiker&quot; edited by Diels-Kranz with a New Edition of &quot;Antiphon&quot; and of &quot;Euthydemus&quot; (Hackett, 2001).  Edited by Rosamond Kent Sprague.\n\n* THE PRESOCRATIC PHILOSOPHERS: A Critical History with a Selection of Texts (Cambridge University Press, 1957).   By G. S. Kirk and J. E. Raven.\n\n* A PRESOCRATICS READER: Selected Fragments and Testimonia (Hackett, 2011).  Second edition.  Edited with an Introduction by Patricia Curd; translations by Richard D. McKirahan and Patricia Curd.\n\n\n== Heraclitus ==\n\n* THE ART AND THOUGHT OF HERACLITUS: An Edition of the Fragments (Cambridge University Press, 1979).  Translated with Commentary by Charles H. Kahn.\n\n* FRAGMENTS: The Collected Wisdom of Heraclitus (Penguin, 2001).  Translated by Brooks Haxton, with a Foreword by James Hillman. -- ePUB + MOBI\n\n\n== Leucippus and Democritus ==\n\n* THE ATOMISTS: Leucippus and Democritus: Fragments (University of Toronto Press, 1999).  Translated with Commentary by C. C. W. Taylor.\n\n\n== Parmenides ==\n\n* THE FRAGMENTS OF PARMENIDES (Parmenides, 2009).  Revised and expanded edition by A. H. Coxon; edited with new translations by Richard McKirahan.\n\n* PARMENIDES OF ELEA: A Verse Translation with Interpretive Essays and Commentary (Praeger, 2003).  Translated with Commentary by Martin J. Henn.\n\n\n== Philolaus ==\n\n* PHILOLAUS OF CROTON: Pythagorean and Presocratic: A Commentary on the Fragments and Testimonia with Interpretive Essays (Cambridge University Press, 1993).  Translated with Commentary by Carl A. Huffman.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                  &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:5b4729b2a27e0df9edb90930743f6ebede68a07f","amp;dn":"The+Presocratics+%26amp%3B+Sophists+-+Philosophical+Works+%2811+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b4729b2a27e0df9edb90930743f6ebede68a07f","infoHashBuffer":{"type":"Buffer","data":[91,71,41,178,162,126,13,249,237,185,9,48,116,63,110,190,222,104,160,127]},"announce":[],"urlList":[]}}