{"title":"Warhammer 40k - Cult Mechanicus Codex [2015]","uid":12130070,"size":114690193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b4955dc03379b837f8a0af53de574ac83782c16&amp;dn=Warhammer+40k+-+Cult+Mechanicus+Codex+%5B2015%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"djupload","files":7,"time":1437013423,"description":"Behold - the Cult Mechanicus approaches. A grim procession of augmented horrors and soulless automata, they bring not salvation, no message of peace; they are not interested in conversion to their creed. Their purpose is death, recorded and measured for later assimilation. Marching implacably from world to world, scorching the skies with the colossal energies they harness, the Tech-Priests of the Cult Mechanicus hum their machine-code prayers in bursts of eerie static as they drain the very bioelectricity itself from all who stand in their way. A sinister display of absolute, unshakeable faith wielding the most advanced technology in the Imperium - dare you oppose the will of the Omnissiah?\nThis eighty-page, full-colour hardback book contains:\nDetails, backstory and history of the Cult Mechanicus - their formation, motivations and purpose, with timelines giving you all you need to know on their place in the universe;\nColour schemes and heraldry for Cult Mechanicus a number of different forge worlds, with uniform information for a selection of legendary Kastelan Robot Maniples of the Legio Cybernetica;\nRules for a large range of Adeptus Mechanicus miniatures - Tech-Priest Dominus, Kataphron Battle Servitors(Breachers and Destroyers), Kastelan Robots and Electro-Priests (Fulgurite and Corpuscarii), plus several Cult Mechanicus formations;\nThe Canticles of the Omnissiah - a special rule that allows the Cult Mechanicus to channel their faith into acts of destruction","torrent":{"xt":"urn:btih:5b4955dc03379b837f8a0af53de574ac83782c16","amp;dn":"Warhammer+40k+-+Cult+Mechanicus+Codex+%5B2015%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b4955dc03379b837f8a0af53de574ac83782c16","infoHashBuffer":{"type":"Buffer","data":[91,73,85,220,3,55,155,131,127,138,10,245,61,229,116,172,131,120,44,22]},"announce":[],"urlList":[]}}