{"title":"The Circle (NEW 2014 Viv Thomas) [WebDL]","uid":11186162,"size":1355508485,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5bb2d1ab03fa9bf557a83196ce678fa06801b93a&amp;dn=The+Circle+%28NEW+2014+Viv+Thomas%29+%5BWebDL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":6,"uploader":"chkm8te","files":1,"time":1412919721,"description":"The Circle (NEW 2014 Viv Thomas) [WebDL]\n\nEileen Sue, Alexis Crystal, Naomi Nevena, Silvie Luca.\n\nDirector Andrej Lupin`s latest cinematic creation for Viv Thomas, The Circle, begins with a heated blast of raw, high-voltage, lesbian lovemaking. As the film starts raven-haired Eileen Sue and her lover, Alexis Crystal, are already enjoying a lusty afternoon in bed. Their sex - ranging from passionate kissing to ravenous pussy and ass-licking, and everything in between - is feverish, intense, and the extended tryst unfolds at a full-throttle pace that results in explosive orgasms that leave the couple breathless, drained, and thoroughly satisfied. Afterwards, Alexis asks Eileen Sue about her sexual history, and the remaining scenes in The Circle explore seduction, romance, betrayal, heartbreak, and the search for sexual satisfaction and true love. Eileen Sue`s first time story flashes back to her experience with the sexually ravenous and far more experienced Naomi Nevena. Eileen is ready and eager to experience sex with another woman, and Naomi relishes her chance to be the first female to taste her sweet flesh - this seduction begins on a tender, loving note, but it becomes a completely uninhibited session of searing Sapphism that leaves no holes unexplored. Following her introduction to the joys of lesbian sex, Eileen Sue enters a long-term romance with brown-eyed beauty Silvie Luca. Here the physical expression of romantic connection is profoundly powerful, and the cinematography, featured throughout the film, adds additional intensity to something as simple as a kiss, or as sizzling as prolonged clit-licking, labia-sucking, and ass-tonguing. The Circle climaxes - in more ways than one! - when Eileen Sue inadvertently catches Silvie Luca in bed with another woman. Unaware that she`s been discovered, Luca savors a prolonged and passionate bout of multi-orgasmic, no-holes-barred girl-girl decadence, bringing The Circle to a scorching, satisfying, and surprising conclusion.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5qrww8ibi9af0mrrmcq8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5qrww8ibi9af0mrrmcq8.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mnm35ht8xptsood7pu73.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mnm35ht8xptsood7pu73.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5bb2d1ab03fa9bf557a83196ce678fa06801b93a","amp;dn":"The+Circle+%28NEW+2014+Viv+Thomas%29+%5BWebDL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb2d1ab03fa9bf557a83196ce678fa06801b93a","infoHashBuffer":{"type":"Buffer","data":[91,178,209,171,3,250,155,245,87,168,49,150,206,103,143,160,104,1,185,58]},"announce":[],"urlList":[]}}