{"title":"FTVGirls - Sammy {HyperSexual Nerd} NEW July 18, 2014","uid":10618887,"size":896510494,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5bc4a8589315d1d2c56a265e2b8fc8ccf517d622&amp;dn=FTVGirls+-+Sammy+%7BHyperSexual+Nerd%7D+NEW+July+18%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"christian2353","files":13,"time":1406151838,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/LapmIAAfG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LapmIAAfG&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/LaPMJaaFg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LaPMJaaFg&lt;/a&gt;\n\n\nSize: 116294989 bytes (110.91 MiB), duration: 00:12:27, avg.bitrate: 1245 kb/s\nAudio: aac, 22050 Hz, mono (und)\nVideo: h264, yuv420p, 854x480, 25.00 fps\n\n\nShe's a geeky teen with an extreme sex drive and a fully matured figure -- and she loves make full use of it! We see her at a farmer's market, as she buys some fruits &amp; veggies, then proceeds to flash her full, firm breasts and spread under the table! Out at a park, she gets down to her underwear, runs around on a jogging trail, and fingers herself naked! Back home, she masturbates with her magic wand toy while watching porn, to a strong orgasm. A second camera angle under her reveals the strong vaginal contractions. Putting on a sexy red dress &amp; heels, she gives us upskirt play at a resort, then uses a large zucchini like a sex toy! It pushes her vaginal limits... Later that night, we see her flash at a restaurant, and get all sexually aggressive... Next morning we see her in a cute summer dress and wedges, doing backbends at a resort, and playing with herself -- fingering herself again. She ends up fucking a carrot, pushing it deep inside her until it literally locks in, then eating it and using it several times! At home, she gives her body a nice hard breast and butt massage, then uses her magic wand toy again for another strong orgasm &amp; visible vaginal contractions. On the bed in lingerie &amp; heels, she teases us, then gives us extreme closeups of her private parts. Using a large glass toy, she penetrates herself, then gets pounded missionary-style. She teases her butt with some anal fingering, then goes back outside. Wearing a seethrough white dress with nothing else underneath, she visits a park, uses a glass toy anally, and does more acrobatics while guys fishing nearby watch Sammy panty-free. She's a fun, enthusiastic teen and a total nerd at heart :) ","torrent":{"xt":"urn:btih:5bc4a8589315d1d2c56a265e2b8fc8ccf517d622","amp;dn":"FTVGirls+-+Sammy+%7BHyperSexual+Nerd%7D+NEW+July+18%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bc4a8589315d1d2c56a265e2b8fc8ccf517d622","infoHashBuffer":{"type":"Buffer","data":[91,196,168,88,147,21,209,210,197,106,38,94,43,143,200,204,245,23,214,34]},"announce":[],"urlList":[]}}