{"title":"The Beginner's Guide to Growing Marijuana 2014 Lloyd Johnson (M)","uid":9498475,"size":6835258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bd2d27ff235b063de5575ab7be2d0ec9a0a5d3e&amp;dn=The+Beginner%27s+Guide+to+Growing+Marijuana+2014+Lloyd+Johnson+%28M%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"7","files":-1,"time":1390162680,"description":"The Beginner's Guide to Growing Marijuana: Everything You Need to Start Growing Weed at Home (2014) Lloyd Johnson (multi)\n\nFormat: mobi/epub/azw3\nLength: 226 pages\nGenre: Non-Fiction/Horticulture\nDate: 1 January 2014\n\nFilled with plenty of techniques for small-space and container gardening, The Beginner's Guide to Growing Marijuana will help you master the art of growing cannabis--no matter how small your space or budget!\n\nCannabis can be a tricky plant to cultivate, but The Beginner's Guide to Growing Marijuana makes it easy by guiding you through each stage of development to ensure that you always build a thriving garden.\n\nInside, you'll find everything you need to know about growing and harvesting marijuana, from choosing the right herb strain to establishing the perfect soil conditions, light, and temperature for your plants. Featuring illustrations that depict the cannabis's anatomy, you'll also discover the differences among various types of plants, how to tell a male marijuana plant from a female, and what it looks like when it's ready to be harvested.\n\nComplete with quick &quot;Money Smart&quot; tips and &quot;Keep It Simple&quot; sections, this one-stop resource shows you how to get the most out of your money and time when you're nurturing your first crop.\n\nAuthor:\n\nLloyd Johnson is a respected herbalist, specializing in natural home remedies, who strongly supports the growing movement to legalize marijuana throughout the United States. He began growing the herb as a medicinal treatment and now helps many find relief through cannabis use. He lives in California with his wife, their two cats, and his thriving herb garden.\n","torrent":{"xt":"urn:btih:5bd2d27ff235b063de5575ab7be2d0ec9a0a5d3e","amp;dn":"The+Beginner%27s+Guide+to+Growing+Marijuana+2014+Lloyd+Johnson+%28M%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bd2d27ff235b063de5575ab7be2d0ec9a0a5d3e","infoHashBuffer":{"type":"Buffer","data":[91,210,210,127,242,53,176,99,222,85,117,171,123,226,208,236,154,10,93,62]},"announce":[],"urlList":[]}}