{"title":"Idiot's Guides Raspberri Pi - Thorin Klosowsky","uid":12000052,"size":10586643,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c598257b04f7d602e0370f3d198f79095d29a03&amp;dn=Idiot%27s+Guides+Raspberri+Pi+-+Thorin+Klosowsky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433758849,"description":"The Raspberry Pi is an inexpensive, simple computer that's about the size of a credit card. At first glance, it looks like a simple circuit board with a few inputs and outputs, but the Raspberry Pi is actually a computer with multiple inputs and outputs that make it the foundation for an almost limitless number of projects - from creating a wireless internet streaming radio, to creating a wi-fi hot spot, to creating elaborate, programmed LED light shows - it's all been done. The real power of the RPi is that it's simple, cheap, and users can build all kinds of useful and fun projects using a few simple tools, some basic programming, and a ton of imagination. Idiot's Guides: Raspberry Pi is the perfect beginner book for learning how the Raspberry Pi works, how to program it, how to connect it to existing devices to enhance or even hack their existing functionality, and how to put together some basic first projects from scratch. Readers will learn how to download and use the right software for the job, how to program using Scratch (a basic language for programming Linux), and how to come up with their own crazy project ideas for creating virtually anything that requires nothing more than processing power from a simple computer","torrent":{"xt":"urn:btih:5c598257b04f7d602e0370f3d198f79095d29a03","amp;dn":"Idiot%27s+Guides+Raspberri+Pi+-+Thorin+Klosowsky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c598257b04f7d602e0370f3d198f79095d29a03","infoHashBuffer":{"type":"Buffer","data":[92,89,130,87,176,79,125,96,46,3,112,243,209,152,247,144,149,210,154,3]},"announce":[],"urlList":[]}}