{"title":"Desperados 2 Cooper's Revenge GOG","uid":8052167,"size":2346423993,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5cf7217e778372d281ff284d1fa71408f13f9a4d&amp;dn=Desperados+2+Cooper%27s+Revenge+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"lilke10","files":6,"time":1358879780,"description":"Genre: Strategy / Real-time / Tactical\nRelease date: April 28, 2006\nCompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nDeveloper / Publisher: Spellbound Entertainment AG / Atari\nGame modes: single-player\nESRB Rating: Teen with Violence, Use of Alcohol, Suggestive Themes, Language. PEGI Rating: 12+ with Violence, Bad Language.\n\n===\n\n1883. A barren, remote area of the Old West in which greed and corruption have cost many settlers their lives. Follow John Cooper and his friends on the trail of an Indian legend and discover the long-buried secrets of his own past. Put your tactical and action skills to the test in this captivating Wild West adventure. Experience and complete challenging missions by using various characters. Blow things up with Sam, send the beautiful Kate O'Hara to seduce the opposition, and heal your friends with Doc McCoy. Duels, brawls, and shootouts, in the classic Wild West scenery of old Spanish forts, ghost towns, dusty canyons, and Indian villages, create a breathtaking experience.\n\nDesperados 2 is the sequel to the successful Wild West title Desperados: Wanted Dead or Alive. The gameplay is based on its predecessor but with brand new tactical possibilities in a beautiful 3D environment. You can switch from isometric to third-person view whenever you want, and see the Wild West from a whole new perspective.\n\nFeatures:\n- Choose one of six heroes, each with a unique personality and set of skills, to deal with the opposition.\n- Exciting setting with a wide variety of scenarios including canyon ambushes, fort assaults, wagon convoys, and more.\n- Real-time strategy action with a gripping story and thrilling Western atmosphere.\n\n===\n\nIncludes:\n* manual\n* wallpapers\n* avatars\n\nInstall, Play! ","torrent":{"xt":"urn:btih:5cf7217e778372d281ff284d1fa71408f13f9a4d","amp;dn":"Desperados+2+Cooper%27s+Revenge+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf7217e778372d281ff284d1fa71408f13f9a4d","infoHashBuffer":{"type":"Buffer","data":[92,247,33,126,119,131,114,210,129,255,40,77,31,167,20,8,241,63,154,77]},"announce":[],"urlList":[]}}