{"title":"Sins.of.a.Solar.Empire.Rebellion.Update.v1.03-RELOADED","uid":7399182,"size":54513075,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5d1b2713b40347443df28c41b3d38c06e9e2a134&amp;dn=Sins.of.a.Solar.Empire.Rebellion.Update.v1.03-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"scene4all","files":-1,"time":1341015785,"description":"nERv\n\nSins of a Solar Empire: Rebellion Update v1.03 (c) Ironclad Games\n\n06/2012 :..... RELEASE.DATE .. PROTECTION .......: Steam + Stardock\n- :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nCheck included .txt for a list of what's new!\n\nWhile many were hopeful that diplomacy would finally end the war,\ndiffering opinions on what should be done, along with the depleted\npower of the controlling factions, has led to a splintering of the\ngroups involved.\n\nThe loyalist members of the Trader Emergency Coalition adopt a policy of\nisolation, focusing on enhanced defenses to ride out the rest of the war.\nThose who rebel against the coalition take on a purely militant view,\ncoming to the opinion that the only way to bring peace is by ultimately\ncrushing all who oppose them - especially xenos.\n\nFor the first time in their history, the war creates a schism in\nthe Advent Unity. The loyalists seek to continue their policy of revenge\nagainst the Traders, and to assimilate all others to the Unity's influence.\nHowever, others amongst the Advent suspect that a corrupting influence\nfrom within has diverted the Unity from its proper destiny.\n\nThe divide created in the Vasari Empire is less pronounced,\nbut just as severe to their people. With the Vasari now practically\nfrantic to move on to new space, the loyalist faction abandons cooperation\nand decides to take the resources they need by any means necessary.\nHaving accepted the need to work together, the rebel faction feels that\ntheir best chance for survival is to work with the other races and bring\nthem along to flee the approaching enemy.\n\nTake the battle for galactic supremacy to its ultimate level in\nSins of a Solar Empire: Rebellion - a standalone RT4X game that combines\nthe tactics of real-time strategy with the depth of\nthe 4X genre (eXplore, eXpand, eXploit, eXterminate).\n\n1. Copy this update into your game installation dir.\n2. Play the game. We recommend not going online with it, as usual.\n3. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:5d1b2713b40347443df28c41b3d38c06e9e2a134","amp;dn":"Sins.of.a.Solar.Empire.Rebellion.Update.v1.03-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d1b2713b40347443df28c41b3d38c06e9e2a134","infoHashBuffer":{"type":"Buffer","data":[93,27,39,19,180,3,71,68,61,242,140,65,179,211,140,6,233,226,161,52]},"announce":[],"urlList":[]}}