{"title":"Two Worlds 2 Keygen Fix-RELOADED","uid":5955798,"size":6137620,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5d34195d37427ba8b607735d9fe66734366d1021&amp;dn=Two+Worlds+2+Keygen+Fix-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"scene4all","files":-1,"time":1289711893,"description":"---------------------------------------------------------------------------------\n                                                                                \n           SSSSSSSSSSSSSSS       444444444                 AAA                  \n         SS:::::::::::::::S     4::::::::4                A:::A                 \n        S:::::SSSSSS::::::S    4:::::::::4               A:::::A                \n        S:::::S     SSSSSSS   4::::44::::4              A:::::::A               \n        S:::::S              4::::4 4::::4             A:::::::::A              \n        S:::::S             4::::4  4::::4            A:::::A:::::A             \n         S::::SSSS         4::::4   4::::4           A:::::A A:::::A            \n          SS::::::SSSSS   4::::444444::::444        A:::::A   A:::::A           \n            SSS::::::::SS 4::::::::::::::::4       A:::::A     A:::::A          \n               SSSSSS::::S4444444444:::::444      A:::::AAAAAAAAA:::::A         \n                    S:::::S         4::::4       A:::::::::::::::::::::A        \n                    S:::::S         4::::4      A:::::AAAAAAAAAAAAA:::::A       \n        SSSSSSS     S:::::S         4::::4     A:::::A             A:::::A      \n        S::::::SSSSSS:::::S       44::::::44  A:::::A               A:::::A     \n        S:::::::::::::::SS        4::::::::4 A:::::A                 A:::::A    \n         SSSSSSSSSSSSSSS          4444444444AAAAAAA                   AAAAAAA   \n                                                                                \n                                                                                \n---------------------------------------------------------------------------------\n\n                        Two Worlds 2 Keygen Fix-RELOADED                          \n\n---------------------------------------------------------------------------------\n\n\nTwo Worlds: The Temptation *Keygen fix* (c) Zuxxez\n\n11/2010 :..... RELEASE.DATE .. PROTECTION .......: Activation\n- :.......... DISC(S) .. GAME.TYPE ........: CRPG\n\nKeygen fix notes:\n\nThis is a fixed keygen for the users who experienced problems generating a\nvalid key using our initial release.\n\nA few years after the fateful events in Part 1 of the &quot;Two Worlds&quot; saga, the\npower of Gandohar, the Dark Imperator, is at its peak. The joy and relief\nexperienced by the populace of Antaloor when he conquered the proud Orcs was\nsoon brutally stifled by his reign of unbelievable terror. The depths of his\nevil character were revealed much too fast... and much too cruelly. Only one\nwarrior with the combined power of two worlds can destroy this spell of evil\n- and the people yearn for his coming. But... the hero is a prisoner in the\ncity's deepest dungeon, so he'll have to start out on the path to his\nadventures from this dark and gloomy location. He'll enjoy victories and\ntaste bitter defeats, he'll be betrayed and befriended and he'll be met by\nmind-boggling mysteries and sudden surprises on his travels. However, new\npowers are entering the scene - and they will plunge the player deep into\nAntaloor's past. One quest will take the hero back to his roots, present him\nwith surprising twists and turns in the game - and transport him into a truly\nnew dimension in the RPG genre. Gameplay&quot;Two Worlds II&quot; offers a perfect\nsymbiosis of the most important RP features - sheer atmosphere and dazzling\ntechnology. A complex quest system with an exciting main story that leads you\nthrough the world of Antaloor, plus lots of secondary scenarios with their\ncorresponding quest stories ensure that the followers of the main story AND\nthe adventurous souls who love the danger of exploring unknown regions will\nALL get their money's worth... and more! Completely revised AI and Balancing\nstandards, experienced authors, the active combat system and the fabulously\nintuitive management of magic are all a guarantee of even more game enjoyment\nfor both RPG professionals and those who are new to the genre. Then we have\nthe GRACE engine, especially developed for &quot;Two Worlds II&quot;. In combination\nwith the extremely flexible MoCap system, it enables unheard-of freedom of\nmovement when the hero is walking, running, involved in combat and\ninteracting with his environment. &quot;Two Worlds II&quot; is graphically superb,\nthanks to technological highlights like an unlimited number of dynamic light\nsources, 24 bit HDR post-processing and Real Eye Adaption.FeaturesAn active\ncombat system with variable attack moves, parrying and special\ntricksState-of-the-art technology, thanks to a powerful GRACE engine and\nspecial toolsCRAFT system (Complete Reshaping And Forging Technology) for\ncustomizing weapons and armouryLots of mini-games for enhancing\ngameplayIndividual magic system thanks to DEMONS technologyIntuitive user\ninterface for the Magic and Skill systemsMany Boss opponents, with unique\nrewards Set up your own workshop with the CWE system (Correlated Workflow\nEfficiency)Mercenaries and magically-created beings accompany the\nplayerComplex object management with movable and usable items Flexible MoCap\nsystem guarantees realistic everyday movements and combat Extensive\nMultiplayer part including building/setup sim.\n\nInstall Notes:\n\n1. Unrar.\n2. Block the main executable in your firewall software, start the game, and\nuse our updated keygen to activate using phone.\n3. Play the game.\n4. Support the software developers. If you like this game, BUY IT!\n\n---------------------------------------------------------------------------------\n\nJoin us at: &lt;a href=&quot; http://www.scene4all.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.scene4all.net/&lt;/a&gt;\t       \n\nEnjoy!!!","torrent":{"xt":"urn:btih:5d34195d37427ba8b607735d9fe66734366d1021","amp;dn":"Two+Worlds+2+Keygen+Fix-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d34195d37427ba8b607735d9fe66734366d1021","infoHashBuffer":{"type":"Buffer","data":[93,52,25,93,55,66,123,168,182,7,115,93,159,230,103,52,54,109,16,33]},"announce":[],"urlList":[]}}