{"title":"Dishonored_GOTY_PAL_XBOX360-SPARE","uid":9040510,"size":16577551034,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5d537b3fc911dbd5336b6e3f2cb0e8a797702e76&amp;dn=Dishonored_GOTY_PAL_XBOX360-SPARE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"Mr.Stifmeister","files":5,"time":1381610115,"description":"\nBW\n\nGROWL WHEN\n\nYOU DID\n\na SPARE\n\n- S P A R E   P R E S E N T S\n\nDishonoredGOTYPALXBOX360-SPARE &lt;a href=&quot;\nhttp://www.ign.com/games/dishonored/xbox-360-20005547&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ign.com/games/dishonored/xbox-360-20005547&lt;/a&gt;\n\nSYSTEM XBOX360\n\nFORMAT ISO\n\nREGiON/COUNTRY PAL , Australia and Rest Of Europe\n\nRELEASEDATE 12/10/2013\n\nGAMEGENRE Fist Persion Action\n\nLANGUAGE ENGLISH\n\nSiZE xx x 100MB\n\nRIPPED Nothing\n\nPublisher Bethesda Softworks\nGAMEiNFO\n\nYou are the once-trusted bodyguard of the beloved Empress\nFramed for her murder, you become an infamous assassin, known only by\nthe disturbing mask that has become your calling card. In a time of\nuncertainty, when the city is being besieged by plague and ruled by an\noppressive government armed with neo-industrial technologies,\ndark forces conspire to bestow upon you, abilities beyond those of any\ncommon man but at what cost? The truth behind your betrayal is as murky\nas the waters surrounding the city, and the life you once had is gone forever\n\nImprovise and Innovate\nApproach each assassination with precise first-person control and creatively\ncombine your abilities and gadgets to eliminate targets with your own ruthless strategy\nImprovise and innovate to define your play style\n\nAction with Meaning\nMove like a ghost and resist corruption, or show no mercy and leave a path of\ndestruction in your wake. Decide your approach for each mission, and the outcomes\nwill change as a result\n\nA City Unlike Any Other\nEnter an original world envisioned by Half-Life 2 art director Viktor Antonov\nIn a place where industry and mysticism collide, the world is yours to discover\n\nSupernatural Abilities\nTeleport for stealth approaches, possess any living creature, or stop time itself\nto orchestrate unearthly executions. Combining your suite of supernatural abilities\nand weapons opens up even more ways to overcome obstacles and eliminate targets\n\nExperience the definitive Dishonored collection with the Game of the Year Edition\nThis complete compilation includes Dishonored, winner of over 100 Game of Year awards,\nas well as all of its additional content - Dunwall City Trials, The Knife of Dunwall,\nThe Brigmore Witches and Void Walker's Arsenal.Developed by Arkane Studios,\nEdge Online's 2012 Studio of the Year, Dishonored is an immersive first-person action\ngame that casts you as a supernatural assassin driven by revenge. With Dishonored's\nflexible combat system, creatively eliminate your targets as you combine the\nsupernatural abilities, weapons and unusual gadgets at your disposal\nPursue your enemies under the cover of darkness or ruthlessly attack them head on\nwith weapons drawn. The outcome of each mission plays out based on the choices you make\n\nThe Knife of Dunwall: In The Knife of Dunwall, take on the role of Daud,\nthe legendary assassin who killed the Empress\nAfter assassinating the Empress, and forever changing the fate of Dunwall,\nyou embark on a search for redemption\n\nThe Brigmore Witches: Continue your journey as the legendary assassin,\nDaud, in The Brigmore Witches. This conclusion to Daud's story will put\nyou at odds with warring gang factions and the dangerous Brigmore witch coven\n\nDunwall City Trials: In Dunwall City Trials, experience Dishonored's flexible\ncombat system, stealth gameplay, and distinct settings in a whole new way as\nyou make your way through 10 distinct maps that feature a variety of challenges\n\nVoid Walker's Arsenal: With the Void Walker's Arsenal add-on pack, gain access\nto four content bundles previously available only through pre-ordering Dishonored\nThese bundles offer unique character bonuses, additional bone charm slots and more\n\nGROUPNEWS\nCurrently we are looking for\n\n- Suppliers of new unreleased Games and Moviez\n- You work for a GAMES or MOVIES or UTILS,\nDistributor, Magazine, Warehouse, Publisher,\npress/marketing company, duplicator, courier\ndelivery firm, tv/radio show, language\ntranslator company or store\n-You can get NEW unreleased GAMES or MOVIES or\nUTILS, from one of the above Game/Util/Video\nshop (such as, Baggages, Electronics Boutique\nFuncoLand, Media Play, Software Etc. GameStop\nBaggages, ebgames  etc\n\n-You live in the Usa, Canada, Uk, Europe, Japan,\nNew Zealand or Australia, have a fast upload\nline (500kb/s minimum) and free week days\nmorning or afternoon\n\nCONTACT\n\n-MAiL US  bowlingdomehushmail.com\n\nGREETiNGSANDLIGHTSHININGSTO\n","torrent":{"xt":"urn:btih:5d537b3fc911dbd5336b6e3f2cb0e8a797702e76","amp;dn":"Dishonored_GOTY_PAL_XBOX360-SPARE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d537b3fc911dbd5336b6e3f2cb0e8a797702e76","infoHashBuffer":{"type":"Buffer","data":[93,83,123,63,201,17,219,213,51,107,110,63,44,176,232,167,151,112,46,118]},"announce":[],"urlList":[]}}