{"title":"Art History, Vol 2.pdf","uid":9409190,"size":232004803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d747c1d0fb4503ca9fc8ba936ca2de98134d046&amp;dn=Art+History%2C+Vol+2.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1388239394,"description":"Art History, Volume 2 (4th Edition) By Marilyn Stokstad, Michael W. Cothren\n2010 | 696 Pages | ISBN: 0205744214 | PDF | 221 MB\n\nART HISTORY provides students with the most student-friendly, contextual, and inclusive art history survey text on the market. These hallmarks make ART HISTORY the choice for instructors who seek to actively engage their students in the study of art. \n\nThis new edition of ART HISTORY is the result of a happy and productive collaboration between two scholar-teachers (Marilyn Stokstad and Michael Cothren) who share a common vision that survey courses on the history of art should be filled with as much enjoyment as erudition, and that they should foster an enthusiastic, as well as an educated, public for the visual arts. \n\nLike its predecessors, this new edition seeks to balance formal and iconographic analysis with contextual art history in order to craft interpretations that will engage a diverse student population. Throughout the text, the visual arts are treated as part of a larger world, in which geography, politics, religion, economics, philosophy, social life, and the other fine arts are related components of a vibrant and cultural landscape.","torrent":{"xt":"urn:btih:5d747c1d0fb4503ca9fc8ba936ca2de98134d046","amp;dn":"Art+History%2C+Vol+2.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d747c1d0fb4503ca9fc8ba936ca2de98134d046","infoHashBuffer":{"type":"Buffer","data":[93,116,124,29,15,180,80,60,169,252,139,169,54,202,45,233,129,52,208,70]},"announce":[],"urlList":[]}}