{"title":"The Very Best Of Charles Mingus (2001) [FLAC] - insinuendo","uid":5861230,"size":385347416,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5deb08854d63f97628fb836bf965997f31b71ceb&amp;dn=The+Very+Best+Of+Charles+Mingus+%282001%29+%5BFLAC%5D+-+insinuendo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"insinuendo","files":11,"time":1285978238,"description":"hexagon.cc\n  &lt;a href=&quot; http://lossless-audiophiles-anonymous.hexagon.cc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://lossless-audiophiles-anonymous.hexagon.cc/&lt;/a&gt;\n\n\n\nThe Very Best Of Charles Mingus (2001) [FLAC] - insinuendo\n\nLabel: Rhino\nYear: 2001\nGenre: Jazz\n\n\nThe task of choosing the best work of Charles Mingus would be a daunting one. There's literally so much good material in a number of different settings, that the &quot;best&quot; of Charles Mingus could never be contained on one CD. Then again, it is extremely difficult for a newcomer to approach Mingus' multiple recordings and know where to begin. Rhino has solved this problem by offering a one-stop disc with a number of classic Mingus recordings. The vibrant &quot;Wednesday Night Prayer Meeting&quot; is filled with hand clapping, horn blasting, and shouting, and it seems impossible that this loose and wild music will hold together for the duration. Mingus somehow manages to ground himself in tradition on pieces like &quot;Tonight at Noon&quot; while simultaneously creating music that borders on free jazz. It's fascinating that an untamed piece like &quot;Pithecanthropus Erectus&quot; can hold an Ellington-esque piano solo at its very center. Another excellent inclusion is &quot;Haitian Flight Song,&quot; beginning with Mingus' untamed bass work before mushrooming into a riotous celebration of squealing horns and heavy percussion. There are certain types of jazz that the listener will allow to politely fade into the background; there are also types of jazz that rudely demand to be heard. Mingus falls into the second category. Of course, one could complain about certain items -- like &quot;Goodbye Pork Pie Hat&quot; -- that didn't show up on this best-of. But so what? There's more than enough excellent material here to hook the listener to the flamboyant and rich stylings of Charles Mingus. Once this has been accomplished, the listener will gladly seek out and collect other gems. ~ Ronnie D. Lankford, Jr.\n\nDigitally remastered by Dan Hersch (DigiPrep).\n\nRecorded at Audio-Video Studios, New York, New York on January 30, 1956 and at Atlantic Studios, New York, New York between March 12, 1957 and November 6, 1961. Includes liner notes by Neil Tesser.\n\nCompilation producer: Patrick Milligan.\n\nEngineers include: Tom Dowd, Hall Lustig, Phil Iehle.\n\nPersonnel: Charles Mingus (vocals); Rahsaan Roland Kirk (flute, stritch, manzello, tenor saxophone, siren); Jackie McLean (alto saxophone); Booker Ervin (tenor saxophone); Pepper Adams (baritone saxophone); Jimmy Knepper, Willie Dennis (trombone); Horace Parlan, Mal Waldron, Wade Legge (piano); Dannie Richmond, Willie Jones (drums).\n\nAudio Remasterer: Dan Hersch.\n\nLiner Note Author: Neil Tesser.\n\nRecording information: Atlantic Studios, New York, NY (01/30/1956-11/06/1961); Audio-Video Studios, New York, NY (01/30/1956-11/06/1961).\n\nPersonnel includes: Charles Mingus (vocals, bass); Jackie McLean, Shafi Hadi, John Handy (alto saxophone); Roland Kirk (tenor saxophone, manzello, stritch, flute, siren); J.R. Monterose, Booker Ervin (tenor saxophone); Pepper Adams (baritone saxophone); Jimmy Knepper, Willie Dennis (trombone); Mal Waldron, Wade Legge, Horace Parlan (piano); Doug Watkins (bass); Willie Jones, Dannie Richmond (drums).\n\nProducer: Nesuhi Ertegun.\n\nQ (5/01, p.132) - 4 stars out of 5 - &quot;...For anyone wanting a crash course in Mingusology this'll do nicely....keystones of the man's enduring reputation...&quot;\n\n1.\tPithecanthropus Erectus\n2.\tProfile of Jackie\n3.\tTonight at Noon\n4.\tHaitian Fight Song\n5.\tReincarnation of a Lovebird\n6.\tMoanin'\n7.\tCryin' Blues\n8.\tWednesday Night Prayer Meeting\n9.\tEcclusiastics\n10.\tPassions of a Man\n11.\tWham Bam Thank You Ma'am","torrent":{"xt":"urn:btih:5deb08854d63f97628fb836bf965997f31b71ceb","amp;dn":"The+Very+Best+Of+Charles+Mingus+%282001%29+%5BFLAC%5D+-+insinuendo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5deb08854d63f97628fb836bf965997f31b71ceb","infoHashBuffer":{"type":"Buffer","data":[93,235,8,133,77,99,249,118,40,251,131,107,249,101,153,127,49,183,28,235]},"announce":[],"urlList":[]}}