{"title":"Three Men in a Boat - Jerome Klapka Jerome (Penguin Classics)","uid":9963526,"size":1868029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e7312f9594aeac9cfb9fe119dd3953287224f06&amp;dn=Three+Men+in+a+Boat+-+Jerome+Klapka+Jerome+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1397545512,"description":"A comic masterpiece that has never been out of print since it was first published in 1889, Jerome K. Jerome's &quot;Three Men in a Boat&quot; includes an introduction and notes by Jeremy Lewis in &quot;Penguin Classics&quot;. Martyrs to hypochondria and general seediness, J. and his friends George and Harris decide that a jaunt up the Thames would suit them to a 'T'. But when they set off, they can hardly predict the troubles that lie ahead with tow-ropes, unreliable weather forecasts and tins of pineapple chunks - not to mention the devastation left in the wake of J.'s small fox-terrier Montmorency. &quot;Three Men in a Boat&quot; was an instant success when it appeared in 1889, and, with its benign escapism, authorial discursions and wonderful evocation of the late-Victorian 'clerking classes', it hilariously captured the spirit of its age. In his introduction, Jeremy Lewis examines Jerome K. Jerome's life and times, and the changing world of Victorian England he depicts - from the rise of a new mass-culture of tabloids and bestselling novels to crazes for daytripping and bicycling. Jerome K. Jerome (1859-1927) was born in Walstall, Staffordshire, and educated at Marylebone Grammar School. He left school at fourteen to become a railway clerk, the first in a long line of jobs that included actor, teacher and journalist. His first book, &quot;On Stage and Off&quot;, a collection of humorous pieces about the theatre, was published in 1885, and was followed the year after with the more commercially-successful &quot;The Idle Thoughts of an Idle Fellow&quot;; but it was with &quot;Three Men in a Boat&quot; (1889) that Jerome achieved lasting fame. He later went on to become one of the founders of the humorous magazine, &quot;The Idler&quot;, and continued to write articles and plays.","torrent":{"xt":"urn:btih:5e7312f9594aeac9cfb9fe119dd3953287224f06","amp;dn":"Three+Men+in+a+Boat+-+Jerome+Klapka+Jerome+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7312f9594aeac9cfb9fe119dd3953287224f06","infoHashBuffer":{"type":"Buffer","data":[94,115,18,249,89,74,234,201,207,185,254,17,157,211,149,50,135,34,79,6]},"announce":[],"urlList":[]}}