{"title":"Webcam Surveyor 2.41 Build 938 + cRACk-SND","uid":9961402,"size":7622815,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ebcc4142aba90b3895ab0baded210a293a27bf3&amp;dn=Webcam+Surveyor+2.41+Build+938+%2B+cRACk-SND&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"flau_bert","files":-1,"time":1397521875,"description":"================\n [INFO:]\n================\n\nWebcam Surveyor 2.41 Build 938 + cRACk-SND | 7.26 MB\n\n\nWebcam Surveyor is a simple and functional application designed for video capture and surveillance. With this software you can quickly and easily broadcast live media streams over network, record videos, take snapshots and monitor all motion activity.\n\nThe motion detector allows turning your computer into a complete video surveillance system and logging all events in your absence. If motion is detected, the application will execute predefined actions: record video, send an email alert, upload images to FTP site, run other application, play alert sound, etc. With advanced motion capture feature you can save time and disk space by recording only the frames with the motion.\n\nStealth mode allows to completely hiding the Webcam Surveyor in your computer and controls it by hotkeys. The application is invisible at startup and can start with Windows. It allows finding out what happens with your PC in your absence and can be useful for recording video on computers and terminals installed in public places.\n\nThe built-in file manager helps you organize the resulting images and videos.  In the thumbnail view you get a fast access to the stored videos and images. \n\nWebcam Surveyor key features:\n\n    Broadcasting - webcam live video streaming over Internet/local network\n    Video Capture - easily record a webcam video.\n    Continuous 24/7 video recording - view a resulting video during recording.\n    Capture Image Sequences - create a time-lapse video or capture sequence of images.\n    Motion Detection - monitor your office and home and record all motion activity.\n    Motion Capture - record video only when motion is detected.\n    Stealth Mode - hide Webcam Surveyor on your computer and manage it by hot keys.\n    Ease of Use and Compatibility.\n\nNew in version 2.4.1\n\n    Updated OpenSSL libraries;\n    Fixed email connection issue;\n    Impruved video recoding;\n    Minor bugs fixed;\n\n \n\nPlatform : Windows XP/Vista/Windows 7/Windows 8/Windows 8.1\nLanguage : Multilanguage\n \n \n\n================\n[INSTALL NOTES]\n================\n\n\n1. Install the application\n2. Replace the executable with our cracked one\n3. Double Click Reg Key.\n4. Done\n5. Enjoy!\n\nNOTE: Keygens, patches, Activators, Cracks, Loaders etc. are always scanned with\n      Kaspersky Internet Security 2014 Latest Version to Avoid Virus \n      issues.","torrent":{"xt":"urn:btih:5ebcc4142aba90b3895ab0baded210a293a27bf3","amp;dn":"Webcam+Surveyor+2.41+Build+938+%2B+cRACk-SND","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ebcc4142aba90b3895ab0baded210a293a27bf3","infoHashBuffer":{"type":"Buffer","data":[94,188,196,20,42,186,144,179,137,90,176,186,222,210,16,162,147,162,123,243]},"announce":[],"urlList":[]}}