{"title":"Gastroenterology, Clinical Cases Uncovered [PDF] [StormRG]","uid":10161657,"size":38734300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ecdcd36c441d6ecc40d7d9924de521b344b69f4&amp;dn=Gastroenterology%2C+Clinical+Cases+Uncovered+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"0xmovva","files":-1,"time":1400304326,"description":"Author: Satish Keshav, Emma Culver\nPaperback: 192 pages\nPublisher: Wiley-Blackwell; 1 edition (May 2, 2011)\nLanguage: English\nISBN-10: 1405169753\nISBN-13: 978-1405169752\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_____________________________________________________________________________________\n\n\nGastroenterology is a critically important specialty in medicine, encompassing the GI tract and two vital organs - the pancreas and the liver. Gastroenterology: Clinical Cases Uncovered includes reference to the new JCHMT curriculum for acute and internal medicine concerning gastroenterology and hepatology and presents real-life patient cases and outcomes as seen on the wards and in exams leading students through a practical approach to recognize, understand, investigate and manage gastroenterological and hepatological disorders and conditions.\nFollowing a question-answer approach, with self-assessment MCQs, EMQs and SAQs, and a 'refresher' section on basic science, Gastroenterology: Clinical Cases Uncovered features investigations and the treatment options available for patients with upper and lower GI disorders, liver disease, biliary and pancreatic disease, and problems of nutrition.\n\nGastroenterology: Clinical Cases Uncovered is ideal for medical students, junior doctors on the Foundation Programme, GP trainees, specialist nurses and nurse practitioners and gastroenterology trainees on the specialty training programme.","torrent":{"xt":"urn:btih:5ecdcd36c441d6ecc40d7d9924de521b344b69f4","amp;dn":"Gastroenterology%2C+Clinical+Cases+Uncovered+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ecdcd36c441d6ecc40d7d9924de521b344b69f4","infoHashBuffer":{"type":"Buffer","data":[94,205,205,54,196,65,214,236,196,13,125,153,36,222,82,27,52,75,105,244]},"announce":[],"urlList":[]}}