{"title":"[dvx-mp3-ita-ENG] Roma CittÃƒÂ  Aperta Open City- Roberto Rosselli","uid":4673428,"size":837918720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f59f795f452a642c43eb5bb1b19cfc2a995ea87&amp;dn=%5Bdvx-mp3-ita-ENG%5D+Roma+Citt%C3%83%C2%A0+Aperta+Open+City-+Roberto+Rosselli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"koller92","files":1,"time":1232814118,"description":"ENG\n\n\n\nWith his tale of a priest (Aldo Fabrizi) trying to survive in wartime Italy, Roberto Rossellini created the proto-typical piece of neo-realist cinema, an example followed by colleagues including Federico Fellini, who co-wrote this masterpiece.\n\nNever mind the appallingly approximate subtitles (you don't have to be Italian to see how bad they are), marvel instead at the stark imagery that makes use of Rome's war-damaged streetscapes as Rossellini portrays the moral quicksand of Nazi collaboration and gives us one of cinema's first portraits of state-sanctioned torture. Sixty years on, it packs a punch.\n\nITA\nNella Roma del 1943-44, occupata dai nazifascisti, la lotta, le sofferenze, i sacrifici della gente sono raccontati attraverso le vicende di una popolana, di un sacerdote e di un ingegnere comunista: la prima ÃƒÂ¨ abbattuta da una raffica di mitra; il terzo muore sotto le torture; il secondo viene fucilato all'alba alla periferia di Roma, salutato dai ragazzini della sua parrocchia. Girato tra difficoltÃƒÂ  economiche e organizzative di ogni genere, il film impose in tutto il mondo una visione e rappresentazione delle cose vera e nuova, cui la critica avrebbe dato poco piÃƒÂ¹ tardi il nome di neorealismo. Specchio di una realtÃƒÂ  come colta nel suo farsi, appare oggi come un'opera ibrida in cui il nuovo convive col vecchio, i grandi lampi di veritÃƒÂ  con momenti di maniera romanzesca, in bilico tra lirismo epico e retorica populista. La stessa lotta antifascista ÃƒÂ¨ raccontata ponendo l'accento sul piano morale piÃƒÂ¹ che su quello politico, il che non gli impedÃƒÂ¬ di essere il film giusto al momento giusto e di indicare attraverso le figure del comunista e del prete di borgata il tema politico centrale dell'Italia nel dopoguerra. Nastri d'argento per il miglior film e A. Magnani. Grande successo internazionale, molti premi all'estero e una nomination all'Oscar della sceneggiatura firmata da R. Rossellini, Sergio Amidei e Federico Fellini. Titolo inglese: Open City.\n\nkoller92","torrent":{"xt":"urn:btih:5f59f795f452a642c43eb5bb1b19cfc2a995ea87","amp;dn":"%5Bdvx-mp3-ita-ENG%5D+Roma+Citt%C3%83%C2%A0+Aperta+Open+City-+Roberto+Rosselli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f59f795f452a642c43eb5bb1b19cfc2a995ea87","infoHashBuffer":{"type":"Buffer","data":[95,89,247,149,244,82,166,66,196,62,181,187,27,25,207,194,169,149,234,135]},"announce":[],"urlList":[]}}