{"title":"Magical Mystery Tour (Beatles) - The 40th Anniversary Edit","uid":3946845,"size":3155771392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5f5c3a1653e34ddbe5ac907339cc6490fadda522&amp;dn=Magical+Mystery+Tour+%28Beatles%29+-+The+40th+Anniversary+Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"jandl","files":8,"time":1198537387,"description":"A dasjr-created edit (I am not dasjr). \n\nIf you haven&amp;#039;t seen MMT in a while, you&amp;#039;ll be surprised at how almost coherent this edit is! The picture and sound are like having your own copy of the Apple Videocassette release.  Just in time for the anniversary on December 26th!\n\nFrom dasjr:\n\n&quot;Disclaimer: Not for sale. \noriginal film name: Magical Mystery Tour \nfilm studio name: Apple \nDate Original Film Was Released: December 26, 1967 (Boxing Day) \nDate Edit Was Released: December 2007 \nOriginal Runtime: 50 min \nNew Runtime: 54 min \nAmount of time Cut/Added: 4 min \nCuts removed/added/altered: \n\n-&quot;Hello Goodbye&quot; video added before title sequence. This provides the film with a few more minutes of Beatle music, and gives reason to the song&amp;#039;s partial appearance in the end credits. Has little to do with the rest of the film, but the same could be said for the rest of the musical sequences. \n-&quot;Flying&quot; sequence placed after the &quot;magic is beginning to work&quot; sequence \n-&quot;I am the courier&quot;/&quot;I Am the Walrus&quot; placed after wizards&amp;#039; first scene \n-Aunt Jessie&amp;#039;s dream placed after Miss Winters announces luncheon time \n-&quot;Sergeant Victor&quot; scene placed between Jessie&amp;#039;s dream &amp; &quot;Blue Jay Way&quot;. Looks like the group is walking directly from the sergeant to the tent. \n-Buster confesses love to Jessie *after* Bonzo Dog strip club scene. \n-Marathon scene placed after Buster passes out during above scene. This scene was placed way too early in the original version, and works better as a grand conclusion to the bus trip. \n-Buster &amp; Jesse&amp;#039;s beach romance placed after marathon scene. This is now no longer a dream sequence. Moving this and the previous Buster/Jessie scene later into the film now gives some proper progression to what little plot this film has. \n-above scene ends with Jesse and Ringo joking around. This provides some closure to the arguing that they were doing at the start of the film. \n-&quot;Your Mother Should Know&quot; and end credits follow the above scene \n\nDVD - Features: \n\n1. 54 minutes, NTSC \n2. static chapter menu \n\nConceptual improvements/advancements of edit over original: \n\nThe original MMT was the Beatles&amp;#039; first big critiical flop. Shot during a bus trip with circus performers, and without an actual script, the end result was a series of seemingly random scenes wedged between music videos for the (far more successful) album/double-EP of the same name. Inspired years ago by the alternate sequence order in the US LP&amp;#039;s booklet, I set to make a better flowing version of this old TV special. Without taking *anything* out (save for some transitional effects), I rearranged the segments into a more reasonable order, to justify the film&amp;#039;s thin attempt at a plot (Ringo taking his cranky aunt on a trip). Oddly enough, the songs are all in the same order (save for the incidentals)! I once read in a bio that the film was re-edited numerous times in 1967 before its final release, mainly because of its improvised nature. Hopefully, this 2007 version finally provides some structure to the randomness, becoming the preferred version by Beatles fans new and old. \n\nTechnical notes: \n\nThe source for the film itself was the restored MPI version that only appeared on VHS and laserdisc in the late &amp;#039;80&amp;#039;s. I only had the VHS to work with, but it still looks and sounds better than the current DVD release. (EMI says they&amp;#039;re working on a new restoration of MMT for next year, so maybe I&amp;#039;ll use that for a &quot;Version 2&quot; edit.) &quot;Hello Goodbye&quot; is sourced from the underground &quot;Chronology&quot; 2-DVD set (I could have sourced most of it from &quot;Anthology&quot;, but the quality would have been too good in comparison with MMT). All songs are the stereo versions featured in the above sources. I stuck with straight cuts for the video, but with crossfades to the audio, to better allow the rearrangement of certain scenes. There were a few frames of MMT that I reluctantly had to take out of one (minor) shot, to cover a jitter in the capture, but it&amp;#039;s nothing to get hung about. \n\nTime needed for the edition: years of mulling it over, 1 day of editing \npersons involved: me (currently looking for an alternate name) \n\nThis release has no artwork. I finally watched it yesterday and deemed it fit for viewing by others. Enjoy! &quot;\n\n\n\n","torrent":{"xt":"urn:btih:5f5c3a1653e34ddbe5ac907339cc6490fadda522","amp;dn":"Magical+Mystery+Tour+%28Beatles%29+-+The+40th+Anniversary+Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f5c3a1653e34ddbe5ac907339cc6490fadda522","infoHashBuffer":{"type":"Buffer","data":[95,92,58,22,83,227,77,219,229,172,144,115,57,204,100,144,250,221,165,34]},"announce":[],"urlList":[]}}