{"title":"Mortal.Kombat.Komplete.Edition.v1.06.Update.2.Multi6-RG Origins","uid":11814274,"size":9366016544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f768bd425803f6eed4e6b2338b338fabe3b8d9a&amp;dn=Mortal.Kombat.Komplete.Edition.v1.06.Update.2.Multi6-RG+Origins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Tenguken","files":17,"time":1429020017,"description":"Mortal Kombat: Komplete Edition (c) Warner Bros Interactive\n\nRelease Date : 25/04/2015\nProtection : Steam\nCrack: CPY\nDiscs : 1\nVersion: 1.06 Update 2\nGenre : Fighting\nLanguages : EN/FR/DE/IT/ES/PT-BR\n\nExperience the legendary adrenaline pumping action as Warner Bros.\nInteractive Entertainment today announces Mortal Kombat Komplete Edition\nfor PC.\nPlayers enter the realm to face the Kombatants in Mortal Kombat Komplete\nEdition for PC, delivering all of the downloadable content (DLC),\nincluding intrepid warriors Skarlet, Kenshi and Rain, as well as the\nnotorious dream stalker Freddy Krueger. Additionally, the game offers 15\nKlassic Mortal Kombat Skins and three Klassic Fatalities (Scorpion,\nSub-Zero and Reptile).\nOriginally developed by NetherRealm Studios, led by Mortal Kombat\nco-creator and creative director Ed Boon and adapted for PC by High\nVoltage Software.\nMortal Kombat Komplete Edition for PC features dynamic gameplay including\nTag Team, Challenge Tower and a full feature length story mode. Players\nchoose from an extensive lineup of the game's iconic warriors and\nchallenge their friends in traditional 1 vs. 1 matches, or gamers can\nspectate battles and interact directly with Kombatants online during the\nKing of the Hill mode. The game supports the Mortal Kombat Tournament\nEdition Fight Stick and delivers full controller capability. Players will\nalso be able to access achievements and leaderboard stats.\n\nFeatures:\n\n* Graphic details, never before possible are presented with\nthe most sophisticated graphics engine in MK history.\n* By returning to its classic 2D fighting plane, mature presentation,\nand up to 4 player tag-team kombat; Mortal Kombat introduces\nan all new fighting mechanic that's both accessible and\nprovides the depth that fighting game players look for.\n* Mortal Kombat offers the deepest story mode of any fighting game;\nPlayers are taken back to the original Mortal Kombat tournament\nwhere they try to alter the events of the past in an attempt\nto save the future.\n* Characters, environments and fatalities have never been presented\nwith as much gory detail as in this next generation Mortal\nKombat; From internal organs to the most &quot;realistic&quot;\nblood effects, Kombat has never looked this good\n* Includes all DLC content\n\n-Install\n-Copy crack\n-Play","torrent":{"xt":"urn:btih:5f768bd425803f6eed4e6b2338b338fabe3b8d9a","amp;dn":"Mortal.Kombat.Komplete.Edition.v1.06.Update.2.Multi6-RG+Origins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f768bd425803f6eed4e6b2338b338fabe3b8d9a","infoHashBuffer":{"type":"Buffer","data":[95,118,139,212,37,128,63,110,237,78,107,35,56,179,56,250,190,59,141,154]},"announce":[],"urlList":[]}}