{"title":"SAS 9.2 original release (latest SID - Sept 2011) - reupload","uid":6276181,"size":14891,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f8a0ae94a8ecc5ef1224ccb72b23fc1040797eb&amp;dn=SAS+9.2+original+release+%28latest+SID+-+Sept+2011%29+-+reupload&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SloveniaX","files":3,"time":1301263528,"description":"SID file = license information for SAS\n\n\nNOTE: Follow these instructions carefully, otherwise your installation will fail!!!!\n\n1. Find the torrent with the ISO file you need to install SAS (http://www.kickasstorrents.com/sas-system-9-2-t2593878.html). Disregard other users' comments, some people are just plain stupid. Do not install SAS yet!\n2. Set your system date to any time between Jun 30, 2008 and Jun 30, 2009.\n3. Install SAS (mount ISO &amp; run setup.exe) and use the ORIGINAL(!!!) SID file provided with the ISO (very important!) - also found in this torrent.\n4. Set your system date back to the current date.\n5. Click SAS License Renewal &amp; Utilities -&gt; Renew SAS. Use the SID file provided in this torrent.\n6. SAS should be licensed till Sept 2011 and you won't need to set the date back to 2009 in order to use it. Verify this by running &quot;proc setinit; run;&quot; in SAS (click the small running person to run).\n\nCaveat: It might be that the Sept 2011 SID file (=license) does not cover every SAS component in the ISO file (which might not run after you update the license info). Everything worked for me, but there's a chance it won't for you. If so, you could also use the July 2011 license info (provided in the torrent).\n\n\nIf you can't follow these instructions, you'll probably never be able to use SAS, so make yourself a favor and stop here.\n\nI found all this on a Chinese forum (http://www.verycd.com/topics/2723698/comments/page8) - if you want to know more or are looking for a new SID file after this one expires, go use Google Translate and see if there's a new SID file posted there. Also, you might want to read that forum to help you with troubleshooting (&quot;Run as Administrator&quot; issue, etc.). Don't whine here if you don't know how to install SAS, use the brain cells you have and read a bit about it!!!\n\n\nPS-Don't bother with the SID file that expires in 2019 and is floating around the net - it does not work!","torrent":{"xt":"urn:btih:5f8a0ae94a8ecc5ef1224ccb72b23fc1040797eb","amp;dn":"SAS+9.2+original+release+%28latest+SID+-+Sept+2011%29+-+reupload","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f8a0ae94a8ecc5ef1224ccb72b23fc1040797eb","infoHashBuffer":{"type":"Buffer","data":[95,138,10,233,74,142,204,94,241,34,76,203,114,178,63,193,4,7,151,235]},"announce":[],"urlList":[]}}