{"title":"Native Construct  -  Quiet World  2015  a4k ","uid":11823058,"size":116197653,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:603556f00e60145072f9ba65d6eaf10214c9d19b&amp;dn=Native+Construct++-++Quiet+World++2015++a4k+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"analogkid6103","files":8,"time":1429352763,"description":"              Native Construct  -  Quiet World  2015  mp3 320k\n\n\n\nNative Construct is the product of collaboration between several students that began in 2011 at the storied Berklee College of Music in Boston, Massachusetts. Fueled by a desire to breathe new life into the modern metal genre, Native Construct artfully blends a wide spectrum of compositional influences, ranging from classical all the way to prog metal and musical theatre. The result is a wonderfully unique sonic texture, made up of extended-range guitars, theatrical vocals, and a full complement of symphonic instrumentation. Guitarist and composer Myles Yang's passion for innovation, coupled with his extensive academic study of arranging and compositional techniques, makes Native Construct a truly distinctive up-and-coming metal act.\n\nIn 2014, the band's music caught the ear of Brian Slagel at Metal Blade Records, and led to a recording contract and a worldwide release of the band's debut album, Quiet World. The album promises to be a rich, vibrant, and aurally engaging musical experience. While following a musically programmatic approach to its storytelling, the album demonstrates a fascinating unification of numerous musical styles and provides an emotional journey through the vast and imaginative world Native Construct have envisioned.\n\n\n\n&quot;It's at this point that the first track of the album, &quot;Mute,&quot; begins. And it turns out that many of the subjects of his new world are not as content living this way as he is. In the second track we see a new character, the Archon, rise up and unite his people in the clouds with the once distant people in the sea. He leads an opposition to &quot;Sinister Silence,&quot; as the people come to call him. The rest of the album unfolds with events within the &quot;Quiet World&quot; and manifestations of the enduring struggle between the Archon and Sinister Silence. The lone exception is track number four, &quot;Your Familiar Face,&quot; which steps out of this world for a moment to give a closer look at the events prior to the first track and the tragedy of Sinister Silence.&quot;\n\nWhat is impressive about Native Construct is not necessarily an involved concept on a debut record, it's that they wrote, produced, and recorded the album while balancing school work and on a college student budget. It's the epitome of &quot;self produced.&quot; And what Native Construct wants fans to know is that &quot;the composition process for this album was intensely meticulous from top to bottom. Each note, each lyric, each twist and each turn were arrived at with the utmost care. As such, we were able to weave rich, often subtle layers of meaning into the music and text. We're very excited for you all to experience the result of our efforts!&quot;\n\n\n\n\n\n Description\n\n01. Mute\n\n02. The Spark of the Archon\n\n03. Passage\n\n04. Your Familiar Face\n\n05. Come Hell or High Water\n\n06. Chromatic Lights\n\n07. Chromatic Aberration\n\n\n\n\n\nRobert Edens: Vocals\nMyles Yang: Guitar\nMax Harchik: Bass\n\n\nAs normal go to the shows and buy the merch,thats the best way to support the artist, all of that money goes to the band. Not to the DMCA","torrent":{"xt":"urn:btih:603556f00e60145072f9ba65d6eaf10214c9d19b","amp;dn":"Native+Construct++-++Quiet+World++2015++a4k+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"603556f00e60145072f9ba65d6eaf10214c9d19b","infoHashBuffer":{"type":"Buffer","data":[96,53,86,240,14,96,20,80,114,249,186,101,214,234,241,2,20,201,209,155]},"announce":[],"urlList":[]}}