{"title":"Edward Hopper - an intimate biography (Art Ebook Illustrated).pd","uid":10401954,"size":153728855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:609009225fc8129732da592b95950d0d531f74fe&amp;dn=Edward+Hopper+-+an+intimate+biography+%28Art+Ebook+Illustrated%29.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1403380804,"description":"Pdf / English / 1995 / 678 pages / 146 MB\n\nIn the art of Edward Hopper (1882-1967), tense, unhappy men and women, in whom we recognize something of our neighbors and ourselves, play out mysterious dramas in silent, stripped-down spaces - stages raked by an unrelenting and revealing light. These paintings, and Hopper's equally evocative landscapes and houses, make us wonder: what kind of man had this haunting vision, and what kind of life engendered this art? No one is better qualified to answer these questions than the art historian Gail Levin, author of the major studies of Hopper's work (including the catalogue raisonne) and curator of many exhibitions that explored his development and cultural context. Delving deeply into his art and into a rich archive of unpublished letters and diaries, she now constructs &quot;An Intimate Biography,&quot; which reveals the true nature and personality of the man himself - and of the woman who shared his life and helped to shape his art.\n\nJo Hopper's diaries permit an intimate look at the interactions of an indissolubly bonded couple, revealing for the first time the personal tensions that lie behind some of Hopper's most haunting works. Gail Levin, sifting the gritty reality of Jo's story with her own analytic skills and historical and literary knowledge, uses the diaries to great effect in linking specific paintings to the time, place, and mood in which they were created.","torrent":{"xt":"urn:btih:609009225fc8129732da592b95950d0d531f74fe","amp;dn":"Edward+Hopper+-+an+intimate+biography+%28Art+Ebook+Illustrated%29.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"609009225fc8129732da592b95950d0d531f74fe","infoHashBuffer":{"type":"Buffer","data":[96,144,9,34,95,200,18,151,50,218,89,43,149,149,13,13,83,31,116,254]},"announce":[],"urlList":[]}}