{"title":"Bill Laswell - Dreams Of Freedom - Ambient Translations Of Bob M","uid":5110639,"size":128663198,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60a4ef209e1edc05819c82937f4be7e87ddfc622&amp;dn=Bill+Laswell+-+Dreams+Of+Freedom+-+Ambient+Translations+Of+Bob+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"...cronus","files":13,"time":1254706967,"description":"DREAMS OF FREEDOM is a continuous, in-the-mix recording featuring Bill Laswell's dub versions of Bob Marley compositions.\n\nBill Laswell's 1997 ambient treatments of these Bob Marley classics shouldn't be seen in the same light as, say, a Lee Perry dub collection. Laswell approaches these mixes from quite another angle, seeking not to accentuate the music's quirks and singularities, but rather to smooth them out, providing a serene, ambient soundscape on which to apply his tonal palette.\n\nThe result is a pleasing collection of Marley greatest hits, twisted, remade, and remodeled. This seamless summation of the reggae master's oeuvre, commencing with &quot;Rebel Music&quot; and rapidly segueing into &quot;No Woman No Cry.&quot; The first hint of consistent rhythm comes with the ominous &quot;The Heathen,&quot; where the accent is on the drums and backing vocals, not to mention the omnipresent steady, pumping bass. &quot;Waiting in Vain&quot; is a light, almost conventional dub in comparison, all light guitars and piano trills, but we're soon back down the dub tunnel with &quot;Exodus,&quot; heavy on cavernous echo while nodding in the direction of the choppy horn riff. The cumulative effect of DREAMS OF FREEDOM, as each track morphs into the next, is a slowly escalating dub ceremonial, herbal incense optional.\n\nPersonnel includes: Bob Marley (vocals); Karl Berger (conductor); Aiyb Dieng (percussion); Tetsu Inoue (sound effects).Rolling Stone (9/18/97, p.108) - 3 Stars (out of 5) - &quot;...offers a fresh perspective on this familiar material while retaining the pulse and the spirit of Marley's music...&quot;\n\n\n1. Rebel Music (3 O'Clock Road Block) \n2. No Woman, No Cry     \n3. Heathen, The  \n4. Them Belly Full (But We Hungry)  \n5. Waiting in Vain   \n6. So Much Trouble in the World  \n7. Exodus    \n8. Burnin' and Lootin'  \n9. Is This Love  \n10. One Love (People Get Ready) \n11. Midnight Ravers \n","torrent":{"xt":"urn:btih:60a4ef209e1edc05819c82937f4be7e87ddfc622","amp;dn":"Bill+Laswell+-+Dreams+Of+Freedom+-+Ambient+Translations+Of+Bob+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a4ef209e1edc05819c82937f4be7e87ddfc622","infoHashBuffer":{"type":"Buffer","data":[96,164,239,32,158,30,220,5,129,156,130,147,127,75,231,232,125,223,198,34]},"announce":[],"urlList":[]}}