{"title":"Jordi Savall &amp; Hesperion XXI - Diaspora Sefardi (1999) [2CD]","uid":12579784,"size":612215479,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60b9f23694acdb21500b351821ab93feab36384d&amp;dn=Jordi+Savall+%26amp%3B+Hesperion+XXI+-+Diaspora+Sefardi+%281999%29+%5B2CD%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pucholoco","files":56,"time":1444939592,"description":"Jordi Savall &amp; Hesperion XXI - Diaspora Sefardi (1999) [2CD] \r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 552 Mb \r\n                      Full Artwork @ 300 dpi (jpg) -&gt; 60 Mb\r\n\r\n\r\nHespèrion XXI was nominated for a Grammy Award in 2001 for their double album Diáspora Sefardí, a collection of vocal works and instrumental pieces dating from the 15th century when the Jews were expelled from parts of Spain. The Sephardic Diaspora refers to this Jewish exodus in 1492 when King Ferdinand and Queen Isabella commanded that all Jews who refused to convert to Christianity be expelled from Castile and Aragon in modern-day Spain. An estimated 100,000 Jews fled to North Africa, lands of the Ottoman empire (particularly Turkey and Greece), and other European countries such as France, Italy, and Portugal. These exiles brought with them unique culture, language, and traditions. The resultant marriage of influences from the Sephardic Jews’ old and new homes is reflected in Hespèrion XXI’s two-disc set, Diáspora Sefardí. The selections on the album depict not only surviving traditions of medieval Hispanic music but also the influence of sophisticated musical forms which developed in the Ottoman empire during the 16th century.\r\n\r\nJordi Savall's outstanding group of instrumentalists, Hespèrion XXI continue to chart rare medieval territory with this double album of vocal and instrumental music dedicated to the Sephardi age. The first disc contains some wonderful demonstrations of the impressive vocal range of the highly talented Montserrat Figueras who sings the various pieces with unique character. I was particularly entranced by 'Por que llorax blanca nina' from Sarajevo and the Salonican 'Levantose el Conde Nino' both works of mystical provenance and complex harmonies. Figueras is consistently stupefying in the works dedicated to Marruecos, Sofia and Rhodes, all imbued with a rhythmic drive and particular élan. The second disc is even more intriguing as the instrumental pieces are much more inventive and create a particularly intriguing atmosphere. Savall is unquestionably one of the finest minds in this particular territory and this is shown in the outstanding interpretations of 'Las estrellas de los cielos' (Alexandria) and 'Longe de mi tu estaras' (Sofia) where the music is consistently shifting harmonies and tonalities. Each piece has its own characteristics and charms of its own, and they really come alive in Hesperion XXI's lively interpretations.\r\n\r\nThe recorded sound is exceptionally clear with each instrument spotlighted in a perfectly natural manner. AliaVox's presentation is also superb with a triple gatefold sleeve containing an appropriately detailed booklet that expounds on the history of the Sephardic Jews and their impact on the musical scene. I have nothing but praise for this outstanding issue - another superb addition to AliaVox's catalogue.\r\n\r\n\r\n-------------------------------------------------------------------------\r\nTracklist:\r\n-------------------------------------------------------------------------\r\n\r\nCD1 - Por que llorax blanca nina (romances vocales)\r\n01 - El Moro de Antequera (Rhodes)\r\n02 - Levantose el Conde Nino (Salonica)\r\n03 - El Rey de Francia (Esmirna)\r\n04 - Por alli paso un cavallero (Turquia)\r\n05 - Por que llorax blanca nina (Sarajevo)\r\n06 - La guirnalda de rosas (Rhodes)\r\n07 - Nani, Nani (Marruecos)\r\n08 - El Rey que tanto madruga (Sofia)\r\n\r\nCD2 - Las estrellas de los cielos (musica instrumental)\r\n01 - Las estrellas de los cielos - Yo m'enamori d'un aire (Alejandria)\r\n02 - En la santa Helena (Sofia)\r\n03 - A la una yo naci (Sarajevo)\r\n04 - Improvisacion [oud &amp; percusion]\r\n05 - Paxarico tu te llamas (Sarajevo)\r\n06 - Yo era nina de casa alta (Esmirna)\r\n07 - Longe de mi tu estaras (Sofia)\r\n08 - Hermoza muchachica (Jerusalen)\r\n09 - Axerico de quinze anos (Salonica)\r\n10 - Improvisacion sobre 'Axerico' [sarod &amp; percusion]\r\n\r\n*1999 Alia Vox | AV 9809 A+B\r\n\r\n\r\nPersonnel:\r\nMontserrat Figueras (vocals)\r\nHesperion XXI, director Jordi Savall\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:60b9f23694acdb21500b351821ab93feab36384d","amp;dn":"Jordi+Savall+%26amp%3B+Hesperion+XXI+-+Diaspora+Sefardi+%281999%29+%5B2CD%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b9f23694acdb21500b351821ab93feab36384d","infoHashBuffer":{"type":"Buffer","data":[96,185,242,54,148,172,219,33,80,11,53,24,33,171,147,254,171,54,56,77]},"announce":[],"urlList":[]}}