{"title":"Souad Massi","uid":4230899,"size":278525439,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60ef52edb429fed0bbf0b92e495f75c76df561b8&amp;dn=Souad+Massi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"pas.sie.f.","files":37,"time":1213044582,"description":"NOW DON'T LEECH! Seed at LEAST 1.5. When yr client STOPPED seeding because of reached SEED-LIMIT, change the limit and let it run for a FEW MINUTES, just to check the torrent-status. DON'T LEAVE PEOPLE STUCK!!\n\n\n\nIM GONNA DELETE THE FILES FROM MY LAPTOP, NEED THE SPACE, so...\nPLEEEEEEEAAAAAAAAZZ, SEEEEEEED SEEEEED SEEEEEEEEEED!!!!!! :-)\n\n\nSOUAD MASSI\n\n2001 Raoui (@ 192)\n2003 Deb (@ 192)\n2005 Mesk Elil (@ 320)\n\nMy first torrent ever :-D\nOne day I talked to someone in an IRC chat and he recommended Saoud Massi. He said there are torrents around, so i looked around and found them, but it was not easy to get. i listened a lot to them, and now I took all three albums to upload it as 1 \ntorrent, so u dont have to collect them like I did. And I hope that downloading this goes a lot easier and quicker for u then for me.\nAnd I hope that u will get at least one of her albums for real like I did, i bought Mesk Elil, and I think i will get the others too. This torrent is made to get Souad Massi WORLD DOMINATION!!!\n\nSouad Massi\nFrom Wikipedia, the free encyclopedia\n\nSouad Massi\nBorn \t        August 23, 1972 (1972-08-23) (age 35)\nOrigin   \tAlgiers, Algeria\nOccupation(s) \tSinger, songwriter, guitarist\nYears active \t1989-present\nLabel(s) \tIsland (1999-present)\nWebsite \twww.souadmassi.com.fr\n\nSouad Massi (Kabyle : SuÃƒÆ’Ã‚Â¢ad Masi) (born August 23, 1972), is an Algerian of Kabyle descent, singer, songwriter and guitarist. She began her career performing in the Algerian political rock band Atakor, before leaving the country following a series of death threats. In 1999, Massi performed at the Femmes d'Algerie concert in Paris, which led to a recording contract with Island Records.\n\nMassi's music, which prominently features the acoustic guitar, displays Western musical style influences such as rock, country or the Portuguese fado but sometimes incorporates oriental musical influences and oriental instruments like the oud. Massi sings in Algerian Arabic, French, and occasionally English and Kabyle (Berber language), often employing multiple languages in the same song.\nContents\n\n    * 1 Childhood and early bands\n    * 2 Solo career\n    * 3 Discography\n          o 3.1 Studio albums\n    * 4 Notes\n    * 5 External links\n\n\n\nMassi was born in Algiers, Algeria to a poor Muslim family of seven children.\nEncouraged by her older brother, she began studying music at a young age, singing and playing guitar. Growing up Massi immersed herself in American country and roots music, musical styles that would later heavily influence her songwriting. At the age of seventeen she joined a flamenco band, but quickly grew bored with the group and left.\n\nIn the early 1990s, Massi joined the Algerian political rock band Atakor, who were influenced by Western rock bands such as Led Zeppelin and U2. She recorded and performed with the group for seven years, releasing a successful album and two popular music videos. The band, however, with its political lyrics and growing popularity became a target. Massi disguised herself by cutting her hair and dressing in male clothing, but she nevertheless became the target of a series of death threats. In 1999, she left the band and moved to Paris, France.\n\n\nSolo career\n\nIn 1999, Massi was invited to perform at the Femmes d'Algerie (&quot;Women from Algeria&quot;) festival in Paris, which led to a recording contract with Island Records. In June of 2001, she released her solo debut album Raoui (&quot;Storyteller&quot;), which All Music Guide compared to 1960s American folk music. Sung mostly in French and Arabic, the album became a critical and commercial success in France. The following year she was nominated for &quot;Best Newcomer&quot; at the Radio 3 World Music Awards.\n\nIn 2003, she released her second album Deb (&quot;Heart-broken&quot;). The album's lyrics were more personal rather than political and it became one of the most successful North African albums worldwide. Three years later, Massi released her third album Mesk Elil (&quot;Honeysuckle&quot;). The album expanded on the themes of love and loss that had been explored on Deb and featured duets with Daby Toure and Rabah Khalfa.\n\n\nDiscography\n\nStudio albums\n\n    * 2001: Raoui\n    * 2003: Deb\n    * 2005: Mesk Elil\n    * 2007: Live acoustique\n\nExternal links\n\n    * http://www.souadmassi.com.fr  official website.\n    * http://www.wrasserecords.com  Souad's record label.\n    *    *","torrent":{"xt":"urn:btih:60ef52edb429fed0bbf0b92e495f75c76df561b8","amp;dn":"Souad+Massi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60ef52edb429fed0bbf0b92e495f75c76df561b8","infoHashBuffer":{"type":"Buffer","data":[96,239,82,237,180,41,254,208,187,240,185,46,73,95,117,199,109,245,97,184]},"announce":[],"urlList":[]}}