{"title":"Septimus Heap Series by Angie Sage RELOADED","uid":8277648,"size":17052904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:613056f33230a78a4fc98ece100b0ece5570e7d7&amp;dn=Septimus+Heap+Series+by+Angie+Sage+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"NewSky000","files":8,"time":1363754226,"description":"Title: Septimus Heap Series\n\nAuthor: Angie Sage\n\nBook(s): 7 (Original 6 + 1 Guidebook)\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Sci-Fi, Fantasy, Adventure\n\nSummary:\n\nThe seventh son of the seventh son, aptly named Septimus Heap, is stolen the night he is born by a midwife who pronounces him dead. That same night, the baby's father, Silas Heap, comes across a bundle in the snow containing a new born girl with violet eyes. The Heaps take this helpless newborn into their home, name her Jenna, and raise her as their own. But who is this mysterious baby girl, and what really happened to their beloved son Septimus?\nThe first book in this enthralling new series by Angie Sage leads readers on a fantastic journey filled with quirky characters and magykal charms, potions, and spells. Magyk is an original story of lost and rediscovered identities, rich with humor and heart. - Goodreads Summary of Magyk (Septimus Heap #1)\n\nNote: Mainly for a young adult audience and youth audience. Recommendable for those who enjoyed the Harry Potter Series by J.K. Rowling, as well as enjoy intense YA fantasy novels. Book 7, Fyre, is coming out April so I'll reload this torrent once I get my hands on it. Ha, a reload of a reload.\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nRELOADED: This torrent is a reload of the original for the purpose that it had belonged to the first generation of torrents MastermindTTA had uploaded. It lacked quality, and this torrent is improved with fresh covers, included good metadata and a [helpful] readme file.\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:613056f33230a78a4fc98ece100b0ece5570e7d7","amp;dn":"Septimus+Heap+Series+by+Angie+Sage+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613056f33230a78a4fc98ece100b0ece5570e7d7","infoHashBuffer":{"type":"Buffer","data":[97,48,86,243,50,48,167,138,79,201,142,206,16,11,14,206,85,112,231,215]},"announce":[],"urlList":[]}}