{"title":"Joshua Redman - 2013 - Walking Shadows FLAC","uid":8578314,"size":370469992,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6186733f6098051e0107bf90177bc12d40841086&amp;dn=Joshua+Redman+-+2013+-+Walking+Shadows+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"eika256","files":-1,"time":1371339831,"description":"Joshua Redman - 2013 - Walking Shadows\n\nJoshua Redman's 2013 album, Walking Shadows, is a lush orchestral album featuring the saxophonist backed by a large symphonic ensemble. From Charlie Parker's string recordings in the '50s, to Miles Davis' large-ensemble recordings with Gil Evans in the '60s, to Wynton Marsalis' 1984 album Hot House Flowers, there is a long tradition of jazz musicians framing themselves in the warm, classical tones of a string orchestra. Here, Redman positions himself within this continuum with an album that frames his articulate, harmonically sophisticated saxophone style with immaculately produced arrangements from Dan Coleman, Patrick Zimmerli, and pianist Brad Mehldau. Mehldau also appears here as a member of Redman's quartet alongside bassist Larry Grenadier and drummer Brian Blade. These are some of the most nuanced, lyrical, and romantic recordings Redman has ever produced. Tracks like his opening take on Jerome Kern and Oscar Hammerstein's &quot;The Folks Who Live on the Hill&quot; and Leo Robin and Ralph Rainger's &quot;Easy Living&quot; have a sweeping, cinematic quality that one could easily imagine as the soundtrack to classic film noir. Redman also includes a few of his compositions, including the ruminative &quot;Final Hour&quot; and the torchy &quot;Let Me Down Easy,&quot; which perfectly balance his vocal-like saxophone melodies and roiling John Coltrane-influenced improvisations. While most of the album centers around the orchestral arrangements, some tracks -- like Redman's cover of John Mayer's &quot;Stop This Train&quot; and the Beatles' &quot;Let It Be&quot; -- are ruminative small-group tracks that should appeal to listeners who enjoyed his quartet side project James Farm. Ultimately, Walking Shadows is a mature, sophisticated album that can stand head to head with the best orchestral jazz albums of any decade. (AllMusic)\n\nTrack list:\n01. The Folks Who Live on the Hill 4:00\n02. Lush Life 6:44\n03. Stop This Train 4:44\n04. Adagio 3:16\n05. Easy Living 5:34\n06. Doll Is Mine 5:55\n07. Infant Eyes 5:05\n08. Let It Be 5:16\n09. Final Hour 2:46\n10. Last Glimpse of Gotham 3:26\n11. Stardust 5:51\n12. Let Me Down Easy 4:56\n\nPersonnel:\nJoshua Redman - tenor &amp; soprano saxophones\nBrad Mehldau - piano, vibraphone, tubular bells\nLarry Grenadier - bass\nBrian Blade - drums\n\nOrchestra conducted by Dan Coleman (tr. 1, 2, 5, 7, 10, 12)\nLaura Frautschi - concertmistress\nAvril Brown, Christina Courtin, Karen Karlsrud, Ann Leathers, Katherine Livolsi-Landau, Joanna Maurer, Courtney Orlando, Yuri Vodovos - Violin\nVincent Lionti, Daniel Panner, Dov Scheindlin - viola\nStephanie Cummins, Eugene Moye, Ellen Westermann - cello\nTimothy Cobb - bass\nPamela Sklar - Flute (tr. 5, 10)\nRobert Carlisle - French horn (tr. 5, 7, 10)\n\nProduced by Brad Mehldau\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:6186733f6098051e0107bf90177bc12d40841086","amp;dn":"Joshua+Redman+-+2013+-+Walking+Shadows+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6186733f6098051e0107bf90177bc12d40841086","infoHashBuffer":{"type":"Buffer","data":[97,134,115,63,96,152,5,30,1,7,191,144,23,123,193,45,64,132,16,134]},"announce":[],"urlList":[]}}