{"title":"Bettie Page Reveals All (2012)","uid":10320180,"size":1468581330,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61a4d5ec9ec76ee32139a8e68e16ad5169f888e7&amp;dn=Bettie+Page+Reveals+All+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"loninappleton","files":2,"time":1402297816,"description":"Bettie Page Reveals All (2012)\n\nruntime 91 minutes\n\nIMDb tt1776086\n\n The world's greatest pinup model and cult icon, Bettie Page, recounts the true story of how her free expression overcame government witch-hunts to help launch America's sexual revolution.\n\nDirector:  Mark Mori\nWriter:    Doug Miller \n\nWiki\n\n  &quot;Bettie Page Reveals All is a 2012 documentary film about the life history and cultural influence of Bettie Page. Directed by Mark Mori, much of its narration is from audiotape interviews with Page herself. Individuals offering commentary on Page and her significance include Dita Von Teese, Hugh Hefner, Rebecca Romijn, Tempest Storm, Bunny Yeager, Paula Klaw, Mamie Van Doren and Naomi Campbell.&quot;\n\n  The dvd release from which the torrent has come was a recent arrival at my public library.  I had not known of it before but it is publicized as well in Film Comment magazine on or about April of 2014. \n\n   The torrent is given here since I have not seen it listed on my home torrent site or several others.  It does show up on certain indexes.  If indeed there is duplication, seed the to one with the highest numbers.\n\n   There is of course &quot;The Notorious Bettie Page&quot; film from HBO with Gretchen Mol and it is a favorite of mine.  This is a documentary which opens at Bettie's funeral in 2008.  However it is her voice you hear throughout the film.  \n   Anyone providing additional info for the wiki on the film is needed.\n\nNotes written June 10, 2014","torrent":{"xt":"urn:btih:61a4d5ec9ec76ee32139a8e68e16ad5169f888e7","amp;dn":"Bettie+Page+Reveals+All+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a4d5ec9ec76ee32139a8e68e16ad5169f888e7","infoHashBuffer":{"type":"Buffer","data":[97,164,213,236,158,199,110,227,33,57,168,230,142,22,173,81,105,248,136,231]},"announce":[],"urlList":[]}}