{"title":"Shakespeare's Globe Theatre On Screen Doctor Faustus by Christop","uid":8685898,"size":1466276058,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61b9b317d64635ed86283c5fe5499360827dd6c9&amp;dn=Shakespeare%27s+Globe+Theatre+On+Screen+Doctor+Faustus+by+Christop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"loninappleton","files":4,"time":1373760485,"description":"Shakespeare's Globe On Screen Doctor Faustus by Christopher Marlowe (2013)\n\nruntime 147 mins on 2 files\n\nNTSC source Region One\t\nEncoded LCPM 2 ch audio\nusing AGK 2.55\n\n\nSummary\n\nDoctor Faustus, restless for knowledge, forsakes scholarship for magic and makes a pact with the Devil: if the veil spirit Mephistopheles will serve him for 24 years, Faustus will yield his soul to the Devil after death. It isn't long before Faustus has doubts about the bargain, but Mephistopheles has plenty of entertainment at hand to distract Faustus from the terrifying reality of his position and the prospect of its agonizing conclusion.\n\nPaul Hilton\nArthur Darvill\nCharlotte Broom\nMichael Camp\nRichard Clews \nNigel Cooke\n\nRecorded from Live Performance at Shakespeare's Globe Theatre\n\nChristopher Marlows Dr. Faustus noted from the wiki:\n\n&quot;The Tragical History of the Life and Death of Doctor Faustus, commonly referred to simply as Doctor Faustus, is a play by Christopher Marlowe, based on the Faust story, in which a man sells his soul to the devil for power and knowledge. Doctor Faustus was first published in 1604, eleven years after Marlowe's death and at least twelve years after the first performance of the play.\n\n&quot;No Elizabethan play outside the Shakespeare canon has raised more controversy than Doctor Faustus. There is no agreement concerning the nature of the text and the date of composition... and the centrality of the Faust legend in the history of the Western world precludes any definitive agreement on the interpretation of the play...&quot;\n\n\nMy notes\n\n  Viewers of the other Shakespeare productions from the reconstructed Globe Theatre in London will see a marked difference in style in Marlowe's Doctor Faustus.  It is a morality play and harkens back to an earlier period of theatre.  But it is not spare in any way and is visually exciting and with comic interludes familiar to those who have seen other Shakespearean plays.\n\n  These uploads are presented in the hope that more people will see and request that their libraries acquire Globe On Screen for a wider audience.  At the Globe site you will learn that video performances of the plays are shown at movie theatres in select cities.  \n\nNotes written  July 12th 2013","torrent":{"xt":"urn:btih:61b9b317d64635ed86283c5fe5499360827dd6c9","amp;dn":"Shakespeare%27s+Globe+Theatre+On+Screen+Doctor+Faustus+by+Christop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61b9b317d64635ed86283c5fe5499360827dd6c9","infoHashBuffer":{"type":"Buffer","data":[97,185,179,23,214,70,53,237,134,40,60,95,229,73,147,96,130,125,214,201]},"announce":[],"urlList":[]}}