{"title":"Charles Wheelan - Naked Economics: Undressing the Dismal Science","uid":9012817,"size":361564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6234cf61c572e182acfdc09f10f0aad17634c8a8&amp;dn=Charles+Wheelan+-+Naked+Economics%3A+Undressing+the+Dismal+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"epub_888","files":-1,"time":1381139153,"description":"Naked Economics: Undressing the Dismal Science [epub]\n\nEver wonder what it means when the Fed raises interest rates? Or why there are occasional fears of inflation? To the rescue comes this simplified and chatty nontextbook textbook. Using words rather than math, it makes economics accessible, comprehensible and appealing. Wheelan, the Economist's Midwest correspondent, breezily explains the big picture, including finance, capital markets, government institutions and more. His informal style belies the sophisticated and scholarly underpinnings of his subject. Wheelan champions the often-maligned science: &quot;Economics should not be accessible only to the experts. The ideas are too important and too interesting.&quot; Well before book's end, highly persuasive yet simply illustrated concepts sway the reader. Complex ideas are demystified and made clear, using familiar examples, such as the price of sweatshirts at the Gap. A chapter on financial markets compares a grapefruit and ice cream fad diet with get-rich-quick schemes. (He wryly offers the mantra &quot;Save. Invest. Repeat.&quot;) Similarly, an explanation of interest rates compares them to &quot;rental rates,&quot; an easy-to-grasp concept. And to convey what the major international institutions do, Wheelan writes: &quot;If the World Bank is the world's welfare agency, then its sister organization, the International Monetary Fund (IMF) is the fire department responsible for dousing international financial crises.&quot; Wheelan's simplicity does not mask the detailed encapsulation of complicated issues, such as relative wealth, globalization and the importance of human capital. He smartly shows that while economic consequences can be global, they are also a part of everyday life.","torrent":{"xt":"urn:btih:6234cf61c572e182acfdc09f10f0aad17634c8a8","amp;dn":"Charles+Wheelan+-+Naked+Economics%3A+Undressing+the+Dismal+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6234cf61c572e182acfdc09f10f0aad17634c8a8","infoHashBuffer":{"type":"Buffer","data":[98,52,207,97,197,114,225,130,172,253,192,159,16,240,170,209,118,52,200,168]},"announce":[],"urlList":[]}}