{"title":"Anni Albers (Art Textile Design).pdf","uid":10757698,"size":23621561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6240d88a0f7fa42b5292a4300b9c9bb9216546af&amp;dn=Anni+Albers+%28Art+Textile+Design%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1407946727,"description":"pdf / English / 1999 / 183 pag / 22.5 MB\n\nBy Nicholas Fox Weber and Pandora Tabatabai Asbaghi\n\nWith contributions by Kelly Feeney, Jean-Paul Leclercq, and Virginia Gardner Troy\n\nAnni Albers (1899-1994) is considered the foremost textile designer of our century.  Albers, one of the central figures of the Weaving Workshop at the Bauhaus, had an enormous effect worldwide on the design of yard materials and on the creation of singular weavings and wall hangings. This catalogue, accompanying a centennial retrospective of her work, brings to light a wide selection of her weavings, drapery\nmaterials, and wall coverings as well as the preparatory studies and graphic works that accompanied them. In addition to full-color reproductions of Albers's most important works, it also includes documentation of scores of her highly influential textile designs. Scholars Virginia Gardner Troy and Jean-Paul Leclerq explore the significance of her work in the context of the history of Western and pre-Columbian textile design; Kelly Feeney discusses her important commission of ark panels for\nTemple Emanu-El in Dallas; and Albers scholar Nicholas Fox Weber provides an insightful memoir of the artist's exploration late in life of the graphic arts. A comprehensive illustrated chronology details Anni Albers's fascinating life and career in Germany and in America, both as an independent artist and as the wife of the famed painter and instructor Josef Albers.","torrent":{"xt":"urn:btih:6240d88a0f7fa42b5292a4300b9c9bb9216546af","amp;dn":"Anni+Albers+%28Art+Textile+Design%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6240d88a0f7fa42b5292a4300b9c9bb9216546af","infoHashBuffer":{"type":"Buffer","data":[98,64,216,138,15,127,164,43,82,146,164,48,11,156,155,185,33,101,70,175]},"announce":[],"urlList":[]}}