{"title":"Maya Visual Effects The Innovator's Guide [PDF]","uid":9179769,"size":201076632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6250ffc7a1e47abf1cd8c3bcd3d1fec9c18d4967&amp;dn=Maya+Visual+Effects+The+Innovator%27s+Guide+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"F1restorm","files":-1,"time":1384214617,"description":"Maya Visual Effects- The Innovator's Guide Second Edition\nAuthor: Eric Keller\nPublished: May, 2013\nPublisher: Autodesk Official Press/ Sybex\nISBN: 9781118441602\nFormat: Retail PDF\nReader Required: Adobe Digital Editions, Adobe Reader\nSkill Level: For Intermediate- Advanced Maya designers \nTested on the above readers with no problems.\nPlease allow a couple seconds for the seedboxes to engage, then it should be fairly quick.\nEnjoy and create something fantabulous :D\n_____________________________________________________________________________\n\n\nProfessional Maya artists have to think on their feet. It's nothing for them to receive just vague sketches or incomplete ideas of what the studio wants and have to come up with something brilliant. If you're an intermediate to advanced Maya user, Maya Visual Effects: The Innovator's Guide, Second Edition is what you need to meet the challenge. Professional Maya artist Eric Keller offers inspired solutions and hands-on projects, as well as numerous practical shortcuts and deadlines, so you learn to produce innovative CG assets from scratch, using Maya, on a deadline.\n\nShows intermediate to advanced Maya users new solutions, workarounds, and shortcuts for creating Maya visual effects on deadline\nGives readers plenty of hands-on projects, so they come up with solutions that they can add to their Maya toolsets\nOffers workable ideas that can be applied, no matter which version of Maya software is being used\nPresents projects in an engaging style, with pages of full-color imagery to illustrate concepts\nCreate amazing effects with the creative insights and fresh advice in this new edition of Maya Visual Effects: The Innovator's Guide.","torrent":{"xt":"urn:btih:6250ffc7a1e47abf1cd8c3bcd3d1fec9c18d4967","amp;dn":"Maya+Visual+Effects+The+Innovator%27s+Guide+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6250ffc7a1e47abf1cd8c3bcd3d1fec9c18d4967","infoHashBuffer":{"type":"Buffer","data":[98,80,255,199,161,228,122,191,28,216,195,188,211,209,254,201,193,141,73,103]},"announce":[],"urlList":[]}}