{"title":"War Requiem (1989 - Benjamin Britten and Derek Jarman)","uid":5074134,"size":1256982409,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:625ec89a59521367ddc7677479d51a11796c8ffa&amp;dn=War+Requiem+%281989+-+Benjamin+Britten+and+Derek+Jarman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"sheila6","files":4,"time":1251668255,"description":"Movies : Drama : DVD Rip : English\n\n\n \n\nFilm Information: &quot;War Requiem&quot;\nDirector: Derek Jarman\nWriter: Wilfred Owen (poems)\nComplete Credits: Full Cast, Crew &amp; Credits\nGenre: Drama | War | Music\nAwards: n/a\nRuntime: 92 min\nSpoken Language: English\nSubtitles: n/a.\n\n\n&quot;Jarman to a T: Brilliant, atmospheric, imagistic, eccentric, and sometimes homo-erotic . . &quot;\n\n\n\nSynopsis:\n\nA stunning visual and serious music treat (Variety), Derek Jarman's (Sebastiane, Jubilee) 1989 War Requiem reunites British cinema's enfant terrible with his muse Tilda Swinton (2008 Oscar Winner for Michael Clayton) for a spectacular and moving interpretation of composer Benjamin Britten's groundbreaking 1961 orchestral masterpiece. \n\nJust as Britten combined the sacred Latin Requiem Mass with the searing unromantic war poetry of British infantry lieutenant Wilfred Owen, who was tragically killed in the final week of WWI, Jarman interprets Britten's six movements in eye-popping and heartbreaking dialogue-free tableaus illustrating war's infinite futility, sacrifice, and waste. \n\nWar Requiem boldly combines archival footage of war's devastation with Jarman's keen and gifted eye for both the theatrical and the political as Owen, played by Nathaniel Parker, doggedly struggles to survive on the field of battle in defense of a cause rendered unjust by the human toll it takes in the trenches and on the home front. \n\nFeaturing Sean Bean (The Lord of the Rings: The Fellowship of the Ring, National Treasure) as Owen's star-crossed German counterpart, and Sir Laurence Olivier in his final screen appearance, War Requiem is a violent, horrifying, ultimately inspiring film that remains Derek Jarman's definitive, eloquent, complex, and profoundly negative statement on war.\n\n\n\n\nEnjoy and Seed!!\n\n\n\n\n","torrent":{"xt":"urn:btih:625ec89a59521367ddc7677479d51a11796c8ffa","amp;dn":"War+Requiem+%281989+-+Benjamin+Britten+and+Derek+Jarman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"625ec89a59521367ddc7677479d51a11796c8ffa","infoHashBuffer":{"type":"Buffer","data":[98,94,200,154,89,82,19,103,221,199,103,116,121,213,26,17,121,108,143,250]},"announce":[],"urlList":[]}}