{"title":"EXPLOITED COLLEGE GIRLS - Alice - Redhead Teen Painful Anal 720p","uid":11856374,"size":2783605524,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:62c15bd943490ca5d24830833f18206dec271a71&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Alice+-+Redhead+Teen+Painful+Anal+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"beta2008x","files":1,"time":1430166339,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=20hug_lce.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=20hug_lce.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=dd3bt_alice_ecg_720p_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=dd3bt_alice_ecg_720p_s.jpg&lt;/a&gt;\n\nWith her huge angelic smile and fuzzy bush Alice looks like the most innocent of girls next door, but when you see the way she opens her mouth like a baby bird to catch Jay's sperm after getting face fucked, ass fucked and regular fucked you'll see that she's more nymphomaniac than nice girl.\n\nIt would be foolish for a site like Ex Co Gi to offer parenting advice but after listening to Alice's behind the scenes interview with Jay we'd suggest people take heed of where they send their teenage daughters on vacation. Almost everything that comes out of Alice's mouth is a father's worst nightmare. And, to be fair everything that goes in her mouth (Jay's cock, a huge load of jizz) is ALSO a father's worst nightmare.\n\nIt's clear that Alice and Jay have a ton of chemistry, this shoot comes off more like a third date than an amateur porn shot in a hotel room but this is good news for you, dear loyal viewer, because Alice is so relaxed and natural and turned on that she completely allows Jay to have his way with her. As soon as the action starts and Jay applies his fingers to Alice's clit, she's already wet and breathless. He gets her 99% to orgasm with his fingers and then has her return the favor with a blowjob. From then on, whether he's pounding her into pleasurable submission as he manhandles her or smoothly turning some hard pounding in doggy into spur of the moment anal, this girl is putty in his hands.\n\nAfter fucking Alice on her back, in reverse cowgirl and then in doggy (with anal!) Jay's ready to unleash and he has her drop to her knees and open wide to catch one of his trademark jizzsplosions. Between Alice's mouth-eye coordination and Jay's great aim he manages to deposit most of his load on her tongue and...her arm. Hey, nobody's perfect","torrent":{"xt":"urn:btih:62c15bd943490ca5d24830833f18206dec271a71","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Alice+-+Redhead+Teen+Painful+Anal+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c15bd943490ca5d24830833f18206dec271a71","infoHashBuffer":{"type":"Buffer","data":[98,193,91,217,67,73,12,165,210,72,48,131,63,24,32,109,236,39,26,113]},"announce":[],"urlList":[]}}