{"title":"Upstairs, Downstairs (1971 - 1975) with limited ENG subtitles","uid":5625315,"size":25875113150,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62de5fa78494ce0b31b1c215372fb6bebc503a89&amp;dn=Upstairs%2C+Downstairs+%281971+-+1975%29+with+limited+ENG+subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"jgordon20904","files":89,"time":1276460071,"description":"This one big upload contains all 68 episodes of Upstairs, Downstairs.\nPerhaps I should have split it up into five season uploads.\n\nI emphasize subtitles. I am 85 years old and hear well; my wife is hard-of-hearing.\nI have written subtitles for many movies and cleaned up and straightened out others. At the moment I am finishing up writing subtitles for Tess of the D'Urbervilles 1998. My wife and I like this version better than the recent BBC one.\nI shall be uploading it in a couple of weeks. \n\nRefer to the Comments text file for information about this miniseries. There are two other text files listing the order of publication and the the order of popularity. The reason for this is that if I do manage to write subtitles for several more episodes I will first concentrate on the more popular ones. So far I have written one and one-half episodes worth of subtitles: On Trial and I Dies From Love. \n\nImpatient uploaders should leave their computers runnning 24/7 and then put a &quot;do not download&quot; on the priority of those episodes they dislike and put a &quot;high&quot; on those they do like.\n\nI'm sort of rushing-to-publication all that I've got anticipating the end of Pirate Bay and who-knows what else.\n\nI think the coming retirement of the Baby Boom generation will be wishing for subtitles to be available for all the old classics that did not come out with them.\n\n","torrent":{"xt":"urn:btih:62de5fa78494ce0b31b1c215372fb6bebc503a89","amp;dn":"Upstairs%2C+Downstairs+%281971+-+1975%29+with+limited+ENG+subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62de5fa78494ce0b31b1c215372fb6bebc503a89","infoHashBuffer":{"type":"Buffer","data":[98,222,95,167,132,148,206,11,49,177,194,21,55,47,182,190,188,80,58,137]},"announce":[],"urlList":[]}}