{"title":"FSX-Malta-Aerosoft-LMML","uid":6228313,"size":26432137,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6346da2cf5a906bc5283afea5a5d60a2e3d7f4b3&amp;dn=FSX-Malta-Aerosoft-LMML&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"VaticanCity","files":-1,"time":1299601026,"description":"Not Perfect but not bad for a Aerosoft overHaul.\nPlease enjoy.\n\nBy VaticanCity\nA must have for Mediteranean Flights\nA strong Hold Island during the War and a Country within it's self.\n\nFSX Ready by\nVaticanCity\nwill be Installed in your FSX Main folder under addon scenery\nMake sure to add it to your scenery files\n\nMade for fs9 worked on by me for FSX not perfect but close enough enjoy and seed a while thanks.\n\nIslands of Malta\n\n\n\nAnother stunning scenery of the well-known scenery designers of SimWings. A complete and accurate reproduction of the Islands of Malta with all its famous buildings and landmarks.\nThe beautiful archipelago in the mediterranean sea!\n\nThis scenery is a perfect destination for all lovers of the Mediterranean culture. Islands of Malta comprises of all the islands of the Maltese Republic. A detailed city scenery of Valetta including an original detailed replica of the International Airport Malta, the heliport on Gozo, the citadel of Victoria and Mdina with the roman village and many more typical landmarks show this add-on as a perfect representation of the islands.A new mesh terrain, corrected coastlines and animated objects such as opening hangar doors at the airport make this package an exciting simulation scenery.\n\nFeatures.\n\nAll islands of the Republic of Malta\nOriginal detailed airport scenery (Malta)\nOriginal detailed heliport on Gozo\nNumerous static and animated objects at the airport\nCorrected coastlines\nNew Mesh Terrain\nCity scenery of Valetta, the citadel of Victoria and Mdina, Roman villa, etc.\n\nIf you enjoy please seed a while.","torrent":{"xt":"urn:btih:6346da2cf5a906bc5283afea5a5d60a2e3d7f4b3","amp;dn":"FSX-Malta-Aerosoft-LMML","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6346da2cf5a906bc5283afea5a5d60a2e3d7f4b3","infoHashBuffer":{"type":"Buffer","data":[99,70,218,44,245,169,6,188,82,131,175,234,90,93,96,162,227,215,244,179]},"announce":[],"urlList":[]}}