{"title":"Peter F. Hamilton - Great North Road (2012)","uid":15471772,"size":561164803,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6425da6ba1e48a4888f3435dbeafc58f90e7a623&amp;dn=Peter+F.+Hamilton+-+Great+North+Road+%282012%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Laverna","files":2,"time":1470145537,"description":"A century from now, thanks to a technology allowing instantaneous travel across light-years, humanity has solved its energy shortages, cleaned up the environment, and created far-flung colony worlds. The keys to this empire belong to the powerful North family - composed of successive generations of clones. Yet these clones are not identical. For one thing, genetic errors have crept in with each generation. For another, the original three clone &quot;brothers&quot; have gone their separate ways, and the branches of the family are now friendly rivals more than allies. \r\n\r\nOr maybe not so friendly. At least that's what the murder of a North clone in the English city of Newcastle suggests to Detective Sidney Hurst. Sid is a solid investigator who'd like nothing better than to hand off this hot potato of a case. The way he figures it, whether he solves the crime or not, he'll make enough enemies to ruin his career. Yet Sid's case is about to take an unexpected turn: Because the circumstances of the murder bear an uncanny resemblance to a killing that took place years ago on the planet St. Libra, where a North clone and his entire household were slaughtered in cold blood.\r\n\r\nThe convicted slayer, Angela Tramelo, has always claimed her innocence. And now it seems she may have been right. Because only the St. Libra killer could have committed the Newcastle crime. Problem is, Angela also claims that the murderer was an alien monster. \r\n\r\nNow Sid must navigate through a Byzantine minefield of competing interests within the police department and the world's political and economic elite...all the while hunting down a brutal killer poised to strike again. And on St. Libra, Angela, newly released from prison, joins a mission to hunt down the elusive alien, only to learn that the line between hunter and hunted is a thin one.\r\n\r\nNarrated by: Toby Longworth\r\nFormat: M4B\r\nBitrate: 32 Kbps\r\nLength: 36 hrs and 37 mins \r\nUnabridged Audiobook\r\nRelease Date:01-01-13\r\nPublisher: Tantor Audio","torrent":{"xt":"urn:btih:6425da6ba1e48a4888f3435dbeafc58f90e7a623","amp;dn":"Peter+F.+Hamilton+-+Great+North+Road+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6425da6ba1e48a4888f3435dbeafc58f90e7a623","infoHashBuffer":{"type":"Buffer","data":[100,37,218,107,161,228,138,72,136,243,67,93,190,175,197,143,144,231,166,35]},"announce":[],"urlList":[]}}