{"title":"Clips4sale - Penny Pax, PepperXO (Lingerie Shopping with Mother","uid":15930327,"size":276011423,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6434fa8afc89d43efe894702df50335dcf2afb33&amp;dn=Clips4sale+-+Penny+Pax%2C+PepperXO+%28Lingerie+Shopping+with+Mother+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"SudoSu","files":1,"time":1475353766,"description":"http://youpornbook.com\r\n\r\n――――――――――――――――\r\n Screen source:\r\n―――――――――――――――― \nhttp://imgreborn.com/?v=428286 \nhttp://imgreborn.com/?v=830636 \nhttp://imgreborn.com/?v=898480\r\n\r\nPepper is 36 years old, she looks incredibly young for her age, but she has a son, and she's been divorced and living alone now for almost five years. Penny is Pepper's best friend, they've known each other since they were in school, and ever since the girls graduated college, their lifestyles changed. Pepper traded in her college clothes for professional attire, flats, classy wrap dresses that fit well below the knee, absolutely no cleavage, no makeup, her hair tightly wrapped in a bun. Penny has not changed all that much, she's traded in her sequin party dresses for form fitting pencil skirts, 4 inch stilettos, designer blouses that accentuate her full breasts just as nicely as the spandex she used to wear in their college heyday.\r\n\r\nPenny has convinced Pepper to change up her life by changing her wardrobe first. Pepper tells her, &quot;you can still look professional and hot, but we've got to give you a total make-over.&quot; Penny has dressed Pepper in similar clothing now, sexy pencil skirt, silk blouses, designer makeup, manicured nails with a little sparkle in them, but still appropriate for her job as a Court Stenographer. Pepper feels like a brand new woman, and she's growing more confident as the days pass, she humbly accepts the compliments from her peers, and even her boss, everyone loves the new Pepper.\r\n\r\n&quot;It's time for you to get out there on the dating scene,&quot; Penny tells Pepper. Pepper takes her advice without hesitation. She &quot;feels sexy&quot; now, she feels youthful, she's even fantasized about dating a man, feeling his body close against her's when the time is right, he unbuttons her blouse to see a lace bra, black, NO white, white is sexy, but not in that 'trying to get laid' type of way.\r\n\r\nOn a rainy Friday afternoon Pepper confesses her embarrassment about her lingerie. &quot;I'm still wearing the same bra that I wore twenty years ago! My panties remind me of my mother's. Please, please, help me.&quot; Penny's eyes light up. Lingerie shopping is her pastime. &quot;Let's go,&quot; Penny enthusiastically sets her wine glass on the table and grabs her purse. Pepper put on her signature worried face, &quot;not today, my son, it's my week with him.&quot; Penny looks over her shoulder, the boy is pretending not to hear, he has his headphones on and his laptop on his lap. Penny smiles at him. &quot;let's take him with.&quot;\r\n\r\nLatest DVD porn at:  https://thepiratebay.org/search/WebGift/0/3/0\r\n\r\nFind more exclusive content at:  https://thepiratebay.org/user/SudoSu/","torrent":{"xt":"urn:btih:6434fa8afc89d43efe894702df50335dcf2afb33","amp;dn":"Clips4sale+-+Penny+Pax%2C+PepperXO+%28Lingerie+Shopping+with+Mother+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6434fa8afc89d43efe894702df50335dcf2afb33","infoHashBuffer":{"type":"Buffer","data":[100,52,250,138,252,137,212,62,254,137,71,2,223,80,51,93,207,42,251,51]},"announce":[],"urlList":[]}}