{"title":"Afterlife With Archie 01-03 (2013- |Digital+HQ|MM-ID+GG-DCP)","uid":9718421,"size":129093493,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6467495bdf9f02eccad51b35072b4bfdd46af766&amp;dn=Afterlife+With+Archie+01-03+%282013-+%7CDigital%2BHQ%7CMM-ID%2BGG-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1394183810,"description":"This is definitely not your father's Archie! Roberto Aguirre-Sacasa and Francesco Francavilla combine their immense talents into one legitimately horrifying zombie book that pulls no punches and plays the genre completely straight. When Jughead's dog, the beloved Hot Dog, is accidentally killed by Reggie driving home in a rage, Jughead takes the dog over to Sabrina to see if she can bring him back from the dead. Despite warnings from her aunts not to meddle in the resurrection arts, Sabrina foolishly does anyway, and thus unleashes a Zombie Apocalypse as Hot Dog returns rabid and ready to infect anyone in his path - starting with his beloved former master! Now Archie, Betty, Veronica and the remaining survivors must find a way to escape with their lives, and save whoever they can before it is too late. With brilliant characterizations that stay true and authentic to the legacy of these characters, as well as stunning dark and haunting art and colorization, this is one of the best books on the market and you don't want to miss it (yes, for real!). It might even be a better zombie horror story than The Walking Dead. Yeah I said it. So what are you waiting for, now is the perfect time to catch up! \n\nI have uploaded the first three issues here in significantly higher resolution versions than what is available. The first and third issues are Digital by Minutemen-InnerDemons, while the second is a c2c webrip by GreenGiant-DCP. Thanks to the great scanners for their work, please seed and enjoy! :-)\n\nBRAAAAAAAAAAAAAIIIIIIIIIIIIIIIIIINSSSSSSSSSSSSSSS...","torrent":{"xt":"urn:btih:6467495bdf9f02eccad51b35072b4bfdd46af766","amp;dn":"Afterlife+With+Archie+01-03+%282013-+%7CDigital%2BHQ%7CMM-ID%2BGG-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6467495bdf9f02eccad51b35072b4bfdd46af766","infoHashBuffer":{"type":"Buffer","data":[100,103,73,91,223,159,2,236,202,213,27,53,7,43,75,253,212,106,247,102]},"announce":[],"urlList":[]}}