{"title":"T.G.British.Bake.Off-S06-Complete.w.Extra.Slice-720p","uid":12543538,"size":16670138639,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6478483609639890b22d7338fd6948cd818898fc&amp;dn=T.G.British.Bake.Off-S06-Complete.w.Extra.Slice-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":7,"uploader":"uggauga","files":42,"time":1444433417,"description":"The complete Season 6 of 'The Great British Bake Off'\r\n&amp;\r\nthe complete accompanying Season 2 of 'An Extra Slice'\r\n\r\nI will not upload the last episode of 'An Extra Slice' separately,\r\njust deselect the episodes you don't want from this torrent in your torrent client.\r\n\r\nWith subtitles - enjoy !\r\n\r\n*****************************************************\r\n\r\nThe Great British Bake Off - Season 6\r\n \nhttp://www.bbc.co.uk/programmes/b013pqnm\r\n\r\nOnce again, 12 new bakers don their aprons and head for the iconic tent in the heart of the British countryside. Judges Mary Berry and Paul Hollywood have created 30 new challenges that will test their baking prowess, creativity and skill in a bid to find the country's best amateur baker. From Victorian classics to high-end patisserie, from chocolate sculptures to everyday staples, the bakers will need cool heads and even colder hands to make it to the final. With them every step of the way are Mel Giedroyc and Sue Perkins, ready to lend a hand or a shoulder to cry on.\r\n\r\n*****************************************************\r\n\r\nThe Great British Bake Off: An Extra Slice - Season 2\r\n \nhttp://www.bbc.co.uk/programmes/b0656q6k\r\n\r\nJo Brand is joined by three different celebrity Bake Off fans to shine a spotlight on the good, the bad and the soggy bottomed from the most recent episode.\r\n\r\n*****************************************************\r\n\r\nAnd the description for the final episode of 'An Extra Slice':\r\n\r\n\r\nEpisode 10\r\nThe Great British Bake Off: An Extra Slice, Series 2\r\n\r\nIt is the final week in the Bake Off tent and just three bakers remain. Who will be crowned this year's winner?\r\n\r\nJo Brand hosts An Extra Slice and is joined in studio by Paul Hollywood and Mary Berry to get their take on the nerve-wracking final bakes and how and why they chose their eventual winner. Jo will interview the champion, the two runners-up and will be joined by all of this year's bakers. Plus there's lots of unseen footage from the BBC One show and a look at the best and worst viewer and audience bakes too.\r\n\r\nWith everything to play for, the final three face their last ever signature to create filled iced buns, a final nail-biting technical and a classic British cake in the show-stopper - whose bakes will be deemed worthy of a champion?\r\n\r\nThe Great British Bake Off: An Extra Slice - your final helping of the year","torrent":{"xt":"urn:btih:6478483609639890b22d7338fd6948cd818898fc","amp;dn":"T.G.British.Bake.Off-S06-Complete.w.Extra.Slice-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6478483609639890b22d7338fd6948cd818898fc","infoHashBuffer":{"type":"Buffer","data":[100,120,72,54,9,99,152,144,178,45,115,56,253,105,72,205,129,136,152,252]},"announce":[],"urlList":[]}}