{"title":"Investools Kiyosaki Tony Robbins Investing Money","uid":4394053,"size":29146447872,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6480343c56daa2c665e36a39be65318ffd4efed9&amp;dn=Investools+Kiyosaki+Tony+Robbins+Investing+Money&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"AXX0forever","files":8,"time":1221338065,"description":"Apparently the people that got these videos had to pay around 5,000.00 to go to some seminar where these were part of the package.  I&amp;#039;ve up-loaded them as ISO&amp;#039;s which you can actually play with VLC so you don&amp;#039;t really have to burn them to disc.\n\nIf your into this stuff check my other torrents at\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/AXX0forever/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/AXX0forever/&lt;/a&gt;\n\nFor those of you that have downloaded my financial audio books and the cashflow 202 game that Kiyosaki made so easy to copy. lol Thanks for keeping my torrents alive. I&amp;#039;m keeping busy so I may not have a too many new torrents for a while.  If I do run across some goodies I&amp;#039;ll be sure to deliver once again I&amp;#039;m open to requests.  These vids I saw amongst a stack of books during my orientation with my first truck driving job up north.  That was logging truck driving which was an easy move for me because I spent eight years logging in BC albeit busting my ass as a laborer not really doing anything with trucks at all.  Only two and a half months after getting my class 1 I&amp;#039;m starting my first job in the oil industry just like I planned.  As planned I&amp;#039;ve also been listening to the audio books I downloaded then organized and subsequently re-uploaded for you all.  Oh and I met the most amazing woman on eharmony makes more money working three days a week than I&amp;#039;ve ever made to date.  Of coarse her and I know that&amp;#039;s about to change in the next month as my income will double, but then all she&amp;#039;s got to do is work full time or start night shifts and she&amp;#039;d probably still make more.  Of coarse money doesn&amp;#039;t matter if your not having fun and well it&amp;#039;s only been a month so of coarse we&amp;#039;re having fun.  So far things are going as planned so when I achieve my next goal and get rich then buy my Ford GTX1 I&amp;#039;ll be sure to tell all. lol  Tony Robbins says, &quot;If you really believe it.  It will happen.&quot;  What can I say they all sound a little hokey but it does make some sense if you take the time to listen to the whole audio book.  Tony really does have some awesome shit to teach, but then they all do or their stuff wouldn&amp;#039;t sell.  Give them a try and feel free to share some of your success&amp;#039; or money making tips. ","torrent":{"xt":"urn:btih:6480343c56daa2c665e36a39be65318ffd4efed9","amp;dn":"Investools+Kiyosaki+Tony+Robbins+Investing+Money","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6480343c56daa2c665e36a39be65318ffd4efed9","infoHashBuffer":{"type":"Buffer","data":[100,128,52,60,86,218,162,198,101,227,106,57,190,101,49,143,253,78,254,217]},"announce":[],"urlList":[]}}