{"title":"The Red Circle - My Life in the Navy SEAL Sniper Corps (AudioBoo","uid":8513770,"size":371224720,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:64894629ee6e008d43df5b73b8b47cc399089253&amp;dn=The+Red+Circle+-+My+Life+in+the+Navy+SEAL+Sniper+Corps+%28AudioBoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"malestrom_HH","files":-1,"time":1369654917,"description":"The Red Circle: My Life in the Navy SEAL Sniper Corps and How I Trained America's Deadliest Marksmen (Audiobook) By John David Mann, Brandon Webb\nEnglish | 2012 | ISBN: 031260422X | MP3\n\nBefore he could forge a band of elite warriors ... he had to become one himself.\nBrandon Webb's experiences in the world's most elite sniper corps are the stuff of legend. From his grueling years of training in Naval Special Operations to his combat tours in the Persian Gulf and Afghanistan, The Red Circle provides a rare and riveting look at the inner workings of the U.S. military through the eyes of a covert operations specialist.\n\nYet it is Webb's distinguished second career as a lead instructor for the shadowy &quot;sniper cell&quot; and Course Manager of the Navy SEAL Sniper Program that trained some of America's finest and deadliest warriors - including Marcus Luttrell and Chris Kyle - that makes his story so compelling. Luttrell credits Webb's training with his own survival during the ill-fated 2005 Operation Redwing in Afghanistan.\n\nKyle went on to become the U.S. military's top marksman, with more than 150 confirmed kills.\n\nFrom a candid chronicle of his student days, going through the sniper course himself, to his hair-raising close calls with Taliban and al Qaeda forces in the northern Afghanistan wilderness, to his vivid account of designing new sniper standards and training some of the most accomplished snipers of the 21st century, Webb provides a rare look at the making of the Special Operations warriors who are at the forefront of today's military.\n\nExplosive, revealing, and intelligent, The Red Circle provides a uniquely personal glimpse into one of the most challenging and secretive military training courses in the world.","torrent":{"xt":"urn:btih:64894629ee6e008d43df5b73b8b47cc399089253","amp;dn":"The+Red+Circle+-+My+Life+in+the+Navy+SEAL+Sniper+Corps+%28AudioBoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64894629ee6e008d43df5b73b8b47cc399089253","infoHashBuffer":{"type":"Buffer","data":[100,137,70,41,238,110,0,141,67,223,91,115,184,180,124,195,153,8,146,83]},"announce":[],"urlList":[]}}