{"title":"Stone Medicine (2016) (Epub) Gooner","uid":15637155,"size":4062216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:656e257398e4f44d940dfd68df4a20c1ef42ba6b&amp;dn=Stone+Medicine+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1471994601,"description":"Stone Medicine - A Chinese Medical Guide to Healing with Gems and Minerals (2016) (Epub) Gooner\r\n\r\nPublisher: Healing Arts Press (24 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 1620555298\r\nISBN-13: 978-1620555293\r\n\r\nIn addition to herbalism and acupuncture, Chinese Medicine has a rich tradition of using stones as medicine, passed from generation to generation for thousands of years. In this comprehensive guide and extensive Materia Medica, Leslie J. Franks presents the Stone Medicine teachings of Dr. Jeffrey C. Yuen, an 88th generation Taoist priest from the ancient lineage of the Jade Purity School, which dates to the Han dynasty, 206 BCE. Detailing the therapeutic properties of 200 gems, stones, minerals, and crystals, Franks explains the physical, emotional, and spiritual conditions each stone can treat and how their color, form, hardness, and energetic qualities affect us according to Chinese Medicine. She examines the chemistry and sacred geometry of crystal structure, revealing how the minerals contained in the stones affect our physiology by supporting our Jing (Essence); by nourishing Qi (energy), blood, and fluids; and by clearing Wind, Cold, Damp, and Heat conditions that can lead to disease. Including a thorough primer on Traditional Chinese Medicine and backed by modern scientific research, this book explains how stones access our deepest layers, vibrating ever so slowly, to initiate deep lasting change","torrent":{"xt":"urn:btih:656e257398e4f44d940dfd68df4a20c1ef42ba6b","amp;dn":"Stone+Medicine+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656e257398e4f44d940dfd68df4a20c1ef42ba6b","infoHashBuffer":{"type":"Buffer","data":[101,110,37,115,152,228,244,77,148,13,253,104,223,74,32,193,239,66,186,107]},"announce":[],"urlList":[]}}