{"title":"No grazie, il caffÃƒÂ¨ mi rende nervoso 1982 - Troisi [H264 - Ita","uid":6497584,"size":1193976608,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:658d3421f62ff4076c6b9a6981e58c6b29e0d0e8&amp;dn=No+grazie%2C+il+caff%C3%83%C2%A8+mi+rende+nervoso+1982+-+Troisi+%5BH264+-+Ita+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"proximun","files":1,"time":1309128195,"description":"Nel capoluogo partenopeo, l'organizzazione del Primo Festival Nuova Napoli ÃƒÂ¨ turbata da alcuni inspiegabili episodi: prima cede l'impalcatura del Teatro Tenda, successivamente alla redazione de Il Mattino arriva una lettera di un maniaco che si firma FuniculÃƒÂ¬ FuniculÃƒÂ , nella quale ÃƒÂ¨ scritto che Il ciuccio ÃƒÂ¨ ferito, ma non ÃƒÂ¨ morto e che chiunque partecipi al festival sarÃƒÂ  ucciso. La brillante giornalista Lisa Sole vuole offrire al timido collega Michele Giuffrida la possibilitÃƒÂ  di ricavarne uno scoop, incarico che il direttore gli affida. Per cercare di scoprire qualcosa, Lisa e Michele si recano al teatro durante le prove per il concerto di James Senese; da una musicassetta viene audiodiffuso un messaggio del maniaco in cui ÃƒÂ¨ contenuta un'esplicita minaccia di morte verso il cantante, colpevole di aver accettato di intervenire alla kermesse. Lisa recupera la cassetta e riesce a recarsi nel deposito della Pasam Records, dove viene seguita da Michele; i due vengono scoperti dagli scagnozzi del contrabbandiere Mastino, ma riescono a fuggire. Anche l'attore Massimo Troisi, giunto da Roma per partecipare al festival, viene piantonato da due agenti del commissario Barra, il quale vorrebbe approfittare di una mossa falsa del maniaco per incastrarlo.\n\nNel frattempo perÃƒÂ² succede di tutto: Senese viene ucciso nella sua auto, Troisi minacciato addirittura nella sua stanza d'albergo, Michele viene sospettato di essere un emissario di un rivale di Mastino e da questi fatto rapire; stessa sorte toccherÃƒÂ  a Lisa, la quale viene poi rocambolescamente tratta in salvo da Michele. CiÃƒÂ² nonostante il festival continua; Troisi vorrebbe rinunciare a parteciparvi, ma viene convinto dal piano del commissario, con l'assenso dei vari giornalisti, Lisa compresa: la finta pubblicazione di un articolo in cui l'attore rinuncia al Festival, per poi farlo apparire a sorpresa e successivamente scortarlo fino a Roma. Troisi accetta con titubanza, e infatti la cosa non sfugge al maniaco, il quale finisce per strangolarlo e infilargli una pizza in bocca.\n\nDopo questo episodio Lisa ÃƒÂ¨ decisa ad arrivare in fondo, fino a quando non verrÃƒÂ  alla scoperta della cruda veritÃƒÂ  circa l'identitÃƒÂ  dell'assassino. Si tratta proprio di Michele, condizionato da un raptus, il cui movente sta nel totale rifiuto di una Napoli da allontanare dai classici stereotipi che l'hanno caratterizzata (sole, pizza, sfogliatella, mandolino, caffÃƒÂ¨, canzoni ecc.). Proprio mentre Lisa sta per essere uccisa, il commissario Barra riesce ad intervenire per arrestarlo.\n\nNel corso del film ÃƒÂ¨ possibile assistere tra una scena e l'altra, alle divertenti telefonate di un mitomane (Sergio Solli), nelle quali minaccia di morte un certo Nicola, ma ogni volta finisce sempre con il comporre un numero sbagliato.\n\n\n\nTitolo originale: No grazie, il caffÃƒÂ¨ mi rende nervoso\nLingua originale:    Italiano\nPaese: Italia\nAnno: 1982\nDurata: 1h 44min\nColore: colore\nAudio: stereo\nBitRate:   1 297 Kbps\nLarghezza: 1 016 pixel\nAltezza: 552 pixel\nAspectRatio: 16:9\nGenere: commedia\nRegia: Lodovico Gasparini\nSoggetto: Massimo Troisi\nSceneggiatura: Lello Arena, Michael Pergolani, Stefano Vespignani\nProduttore: Mauro Berardi, William M. Siegel\nFotografia: Pasquale Rachini\nMontaggio: Antonio Siciliano\nMusiche: James Senese\nScenografia : Andrea Crisanti\n\n\n\nVISIT ----http://www.tntvillage.scambioetico.org----","torrent":{"xt":"urn:btih:658d3421f62ff4076c6b9a6981e58c6b29e0d0e8","amp;dn":"No+grazie%2C+il+caff%C3%83%C2%A8+mi+rende+nervoso+1982+-+Troisi+%5BH264+-+Ita+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"658d3421f62ff4076c6b9a6981e58c6b29e0d0e8","infoHashBuffer":{"type":"Buffer","data":[101,141,52,33,246,47,244,7,108,107,154,105,129,229,140,107,41,224,208,232]},"announce":[],"urlList":[]}}