{"title":"Propagandhi - Discography (1993-2012) [FLAC]","uid":8349803,"size":1674255926,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65b4ec9462112f5d00985fc47dc4918c7c4385a7&amp;dn=Propagandhi+-+Discography+%281993-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"politux","files":-1,"time":1365301443,"description":"\n  Propagandhi - Discography (1993-2012) [FLAC]\n\n  Released: 1993-2012\n  Genre: Pop/Rock\n  Style: Punk\n  Source: CD (logs + cues)\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  1993 How to Clean Everything\n  1996 Less Talk, More Rock\n  2001 Today's Empires, Tomorrow's Ashes\n  2005 Potemkin City Limits\n  2009 Supporting Caste\n  2012 Failed States (Deluxe)\n\n  As one of Fat Wreck Chords' very first bands, Propagandhi have long been going against the grain of not just society, but even their own record label. Initiated by Chris Hannah and Jordy Samolesky, the band of radicals from Winnipeg, Canada, got together in 1989 and eventually played a show with NOFX. After talking with Fat Mike and realizing they shared the same D.I.Y. attitude, the band agreed to join his fledgling label. Ideally, the band would have loved to skirt the entire capitalist process of selling and marketing music, but made compromises in order to get its pro-gay, pro-feminist, pro-civil liberties, anti-fascism message out. Screeching over fast, catchy punk music, the group moved easily from humorous to profound to blunt with song titles like &quot;I Was a Pre-Teen McCarthyist,&quot; &quot;Hate, Myth, Muscle, Etiquette,&quot; and &quot;Stick the Fucking Flag Up Your Goddam Ass, You Sonofabitch.&quot;\n \n  That style took a dramatic turn in 1997 when singer, songwriter, and bassist John K. Samson left to write, start a publishing company, and eventually form the Weakerthans. The remaining members of Propagandhi started their own label, G7 Welcoming Committee, which released several Weakerthans' records and Propagandhi's 2001 effort, Today's Empire, Tomorrow's Ashes, in Canada. Their last for Fat Wreck Chords, Potemkin City Limits, appeared in 2005, featuring Glen Lambert as a replacement for Chris Hannah - although it soon became apparent that Hannah had not left the band, and had instead been using the &quot;Glen Lambert&quot; moniker as a pseudonym. The band became a four-piece in 2006 when guitarist David Guillas joined up, touring with the band before making his album debut on 2009's Supporting Caste. Propagandhi followed up three years later with Failed States, which was released on Epitaph in 2012.","torrent":{"xt":"urn:btih:65b4ec9462112f5d00985fc47dc4918c7c4385a7","amp;dn":"Propagandhi+-+Discography+%281993-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65b4ec9462112f5d00985fc47dc4918c7c4385a7","infoHashBuffer":{"type":"Buffer","data":[101,180,236,148,98,17,47,93,0,152,95,196,125,196,145,140,124,67,133,167]},"announce":[],"urlList":[]}}