{"title":"Steve Coll - Ghost Wars - Secret History of the CIA (Unab 80 kbp","uid":7026506,"size":974744829,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:65c0915e08008bcc3fdecc71e7e018e5b5f654e0&amp;dn=Steve+Coll+-+Ghost+Wars+-+Secret+History+of+the+CIA+%28Unab+80+kbp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rambam1776","files":-1,"time":1329032998,"description":"Ghost Wars: The Secret History of the CIA, Afghanistan, and bin Laden, from the Soviet Invasion to September 10, 2001\n\nWinner of the 2005 Pulitzer Prize for General Non-Fiction\n\n\nAudible.com\n227 mp3 files - 80kbps\nPenguin Audio\n26 hours, 46 minutes\n2005 - Unabridged\n\nWith the publication of Ghost Wars, Steve Coll became not only a Pulitzer Prize winner, but also the expert on the rise of the Taliban, the emergence of Bin Laden, and the secret efforts by CIA officers and their agents to capture or kill Bin Laden in Afghanistan after 1998.\n\nAmazon.com Review\n\nSteve Coll's Ghost Wars: The Secret History of the CIA, Afghanistan, and Bin Laden, from the Soviet Invasion to September 10, 2001 offers revealing details of the CIA's involvement in the evolution of the Taliban and Al Qaeda in the years before the September 11 attacks. From the beginning, Coll shows how the CIA's on-again, off-again engagement with Afghanistan after the end of the Soviet war left officials at Langley with inadequate resources and intelligence to appreciate the emerging power of the Taliban. He also demonstrates how Afghanistan became a deadly playing field for international politics where Soviet, Pakistani, and U.S. agents armed and trained a succession of warring factions. At the same time, the book, though opinionated, is not solely a critique of the agency. Coll balances accounts of CIA failures with the success stories, like the capture of Mir Amal Kasi. Coll, managing editor for the Washington Post, covered Afghanistan from 1989 to 1992. \n\nHe demonstrates unprecedented access to records of White House meetings and to formerly classified material, and his command of Saudi, Pakistani, and Afghani politics is impressive. He also provides a seeming insider's perspective on personalities like George Tenet, William Casey, and anti-terrorism czar, Richard Clarke (&quot;who seemed to wield enormous power precisely because hardly anyone knew who he was or what exactly he did for a living&quot;). Coll manages to weave his research into a narrative that sometimes has the feel of a Tom Clancy novel yet never crosses into excess. While comprehensive, Coll's book may be hard going for those looking for a direct account of the events leading to the 9-11 attacks. The CIA's 1998 engagement with bin Laden as a target for capture begins a full two-thirds of the way into Ghost Wars, only after a lengthy march through developments during the Carter, Reagan, and early Clinton Presidencies. But this is not a critique of Coll's efforts; just a warning that some stamina is required to keep up. Ghost Wars is a complex study of intelligence operations and an invaluable resource for those seeking a nuanced understanding of how a small band of extremists rose to inflict incalculable damage on American soil. --Patrick O'Kelley\n\n\nReview\n\n&quot;Certainly the finest historical narrative so far on the origins of al Qaeda in the post-Soviet rubble of Afghanistan . . . Ghost Wars provides fresh details and helps explain the motivations behind many crucial decisions.&quot;\n-The New York Times Book Review\n\n","torrent":{"xt":"urn:btih:65c0915e08008bcc3fdecc71e7e018e5b5f654e0","amp;dn":"Steve+Coll+-+Ghost+Wars+-+Secret+History+of+the+CIA+%28Unab+80+kbp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65c0915e08008bcc3fdecc71e7e018e5b5f654e0","infoHashBuffer":{"type":"Buffer","data":[101,192,145,94,8,0,139,204,63,222,204,113,231,224,24,229,181,246,84,224]},"announce":[],"urlList":[]}}