{"title":"Flikken Maastricht Seizoen 1, 2, 3, 4 (Dvdrip)","uid":6113076,"size":17620097758,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:667f5dd805ed15fe997de81bc8af05f6b70431b4&amp;dn=Flikken+Maastricht+Seizoen+1%2C+2%2C+3%2C+4+%28Dvdrip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"grudork","files":43,"time":1295435756,"description":"Flikken Maastricht Seizoen 1, 2, 3 en 4\n---------------------------------------\n\nSeizoen 1\n---------\nDe ambitieuze en aantrekkelijke politierechercheur Eva (Angela Schijf) moet in eerste instantie niets hebben van Floris Wolfs (Victor Reinier), de ervaren collega uit Amsterdam die haar nieuwe partner wordt. Terwijl de strijd tegen de misdaad in en rond het prachtige Maastricht steeds heftiger vormen aanneemt, groeien zij echter onweerstaanbaar naar elkaar toe. Flikken Maastricht is de zeer succesvolle Nederlandse versie van de Vlaamse serie 'Flikken'. Met belangrijke rollen voor onder anderen Oda Spelbos, Sergio Romero IJssel, en Will van Kralingen en diverse verrassende gastrollen.\t\n\nAfleveringen\n\n1. Een valse noot\n2. Een zaak met een luchtje\n3. Groeten uit Lagos\n4. Kogelvis\n5. Alcohol maakt meer kapot\n6. Kristalhelder\n7. Een oude man\n8. Broederliefde\n9. Klappen\n10. De gijzeling\n11. Auto-maat\n12. Britt (De Roof 1)\n13. Grensgeval (De Roof 2)\n\n\nSeizoen 2\n---------\nEva van Dongen (Angela Schijf) en Floris Wolfs (Victor Reinier) zijn terug! Het tweede seizoen van de zinderende Nederlandse politieserie Flikken Maastricht begint waar de eerste reeks eindigde. Wie loste het, wellicht fatale, schot op rechercheur Wolfs? En wordt Eva gestraft voor het negeren van een duidelijk bevel waarmee ze haar collega in levensgevaar bracht? De antwoorden en tal van spannende nieuwe ontwikkelingen liggen verscholen in 10 gloednieuwe afleveringen vol actie, misdaad en rondvliegende kogels door de straten van sfeervol Maastricht.\n\nAfleveringen:\n1. Afgemaakt\n2. Angst\n3. Echte liefde\n4. Pillen\n5. Kidnap\n6. Verliefd\n7. Vermist\n8. Runners\n9. De bestorming\n10. Door het lint\n\n\nSeizoen 3\n---------\nOok in het derde seizoen volgen we de spannende ontwikkelingen en de persoonlijke strubbelingen van het Flikken Maastricht-team. Eva moet kiezen tussen de twee belangrijkste mannen in haar leven. Accepteert Wolfs haar keuze wel? Is Frank wel helemaal verlost van de criminelen die het op zijn zaak voorzien hadden? Marion wordt wijkagent en moet meteen diverse keren in moeilijke situaties optreden. Als ze dan ook nog met doodsbedreigingen te maken krijgt, valt het politiewerk haar zwaar. En ook Romeo heeft grote relationele problemen. Gastrollen worden gespeeld door onder andere Micky Hoogendrijk, DaniÃƒÂ«l Boissevain, Chiem van Houweninge, Romijn Conen en Tanja Jess.\n\n\nAfleveringen\n\n1. Eeuwige Trouw\n2. Spelletjes\n3. Valse Liefde\n4. Eerwraak\n5. Ambitie\n6. Kameraden\n7. Stiekem\n8. Dubbelspel\n9. Geld (1)\n10. Geld (2)\n\n\nSeizoen 4\n---------\nIn het vierde seizoen worden de verhoudingen binnen het Flikken Maastricht-team flink op de proef gesteld. Rechercheur Wolfs (Victor Reinier) dreigt na het neerschieten van Luca, niet alleen zijn baan en partner te verliezen als hij op non-actief wordt gesteld, maar ziet ook nog eens zijn dochter Fleur aan de drugs ten onder gaan. Uiteindelijk belandt hij zelfs in de gevangenis, op beschuldiging van moord en verkrachting. Eva wil geloven in zijn onschuld, maar de bewijzen tegen hem stapelen zich op. Wat weten ze nu eigenlijk van Wolfs? Heeft Wolfs misschien toch iets te verbergen?\n\nBekende namen maken in het vierde seizoen hun opwachting. Vioolvirtuoos AndrÃƒÂ© Rieu krijgt te maken met een dreigende aanslag tijdens zijn Vrijthofconcerten. Daarnaast spelen onder anderen Yolanthe Cabau van Kasbergen en Gijs Scholten van Aschat een gastrol. Piet RÃƒÂ¶mer en Victor Reinier worden, na jaren samengewerkt te hebben bij \\'Baantjer\\', herenigd op de set van Flikken Maastricht, echter dit keer niet bepaald als collega\\'s. En Thomas Acda komt als Amsterdammer Daan de Vos het Flikken Maastricht-team versterken.\n\nAfleveringen\n\n1. Optreden\n2. Jagers\n3. Heksen\n4. Vuil spel\n5. Huis en haard\n6. Verkracht\n7. Ripdeal\n8. Ome Will\n9. Alarm\n10. Hangen","torrent":{"xt":"urn:btih:667f5dd805ed15fe997de81bc8af05f6b70431b4","amp;dn":"Flikken+Maastricht+Seizoen+1%2C+2%2C+3%2C+4+%28Dvdrip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"667f5dd805ed15fe997de81bc8af05f6b70431b4","infoHashBuffer":{"type":"Buffer","data":[102,127,93,216,5,237,21,254,153,125,232,27,200,175,5,246,183,4,49,180]},"announce":[],"urlList":[]}}