{"title":"Letter From An Unknown Woman (1948)  Joan Fontaine","uid":4429273,"size":735051776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66a66f05b8b2545c1d71add94dff0d262ed4984e&amp;dn=Letter+From+An+Unknown+Woman+%281948%29++Joan+Fontaine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"johnefp","files":1,"time":1223203088,"description":"Plot Synopsis  \tby Paul Brenner\n\nPerhaps the finest American film from the famed European director Max OphÃƒÂ¼ls, the film stars Joan Fontaine as a young woman who falls in love with a concert pianist. Set in Vienna in 1900, the story is told in a complex flashback structure as the pianist, Stefan Brand (Louis Jourdan), comes upon a letter written to him by Lisa Berndl (Fontaine), a girl who has been in love with him for years. Stefan is in the process of fleeing Vienna on the eve of fighting a duel. As he prepares himself for the nocturnal journey, the letter arrives. It begins, &quot;By the time you read this letter, I may be dead.&quot; As Stefan sits back in his study to read this letter, it turns out to be a confession of unrequited love from Lisa. The story flashes backs to when Lisa was 14 years old and Stefan was her neighbor. After following Stefan with a girlish obsession, the romance gets much more serious, and they have a brief encounter. Stefan promises to come back to her after a concert tour, but he never does. Meanwhile, Lisa marries another man when she discovers that she is pregnant with Stefan's child. When she runs into Stefan years later, he doesn't remember her and tries to seduce her. After Stefan reads the letter, he wants to rush to her side, but now poor Lisa is dying from typhus. \n","torrent":{"xt":"urn:btih:66a66f05b8b2545c1d71add94dff0d262ed4984e","amp;dn":"Letter+From+An+Unknown+Woman+%281948%29++Joan+Fontaine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a66f05b8b2545c1d71add94dff0d262ed4984e","infoHashBuffer":{"type":"Buffer","data":[102,166,111,5,184,178,84,92,29,113,173,217,77,255,13,38,46,212,152,78]},"announce":[],"urlList":[]}}