{"title":"Miyamoto Musashi - A Book of Five Rings (English &amp; Spanish)","uid":9849817,"size":61390168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6715ed71f838932ab5057d6e681ada4d47f787ff&amp;dn=Miyamoto+Musashi+-+A+Book+of+Five+Rings+%28English+%26amp%3B+Spanish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Dotexone","files":-1,"time":1396133822,"description":"-------------------------------------------------------------------------\nMiyamoto Musashi - The Book of Five Rings (El Libro de los Cinco Anillos)\n-------------------------------------------------------------------------\n\nTITLE: The Book of Five Rings\nAUTHOR: Miyamoto Musashi\nYEAR: 1645\nLANGUAGE: English &amp; Spanish\nFORMAT: PDF &amp; ePub\n\nSYNOPSIS: The Book of Five Rings is a text on kenjutsu and the martial arts in general, written by the swordsman Miyamoto Musashi circa 1645. There have been various translations made over the years, and it enjoys an audience considerably broader than only that of martial artists: for instance, some business leaders find its discussion of conflict and taking the advantage to be relevant to their work. The modern-day Hyoho Niten Ichi-ryu employs it as a manual of technique and philosophy. Musashi establishes a &quot;no-nonsense&quot; theme throughout the text. For instance, he repeatedly remarks that technical flourishes are excessive, and contrasts worrying about such things with the principle that all technique is simply a method of cutting down one's opponent. He also continually makes the point that the understandings expressed in the book are important for combat on any scale, whether a one-on-one duel or a massive battle. Descriptions of principles are often followed by admonitions to &quot;investigate this thoroughly&quot; through practice rather than trying to learn them by merely reading. Miyamoto Musashi in his prime, wielding two bokken. Musashi describes and advocates a two-sword style: that is, wielding both katana and wakizashi, contrary to the more traditional method of wielding the katana two-handed. However, he only explicitly describes wielding two swords in a section on fighting against many adversaries. The stories of his many duels rarely reference Musashi himself wielding two swords, although, since they are mostly oral traditions, their details may be rather inaccurate. Some suggest that Musashi's meaning was not so much wielding two swords &quot;simultaneously&quot;, but rather acquiring the proficiency to (singly) wield either sword in either hand as the need arose. However, Musashi states within the volume that one should train with a long sword in each hand, thereby training the body and improving one's ability to use two blades simultaneously, though the aim of this was only for training purposes and wasn't meant to be a viable fighting style.","torrent":{"xt":"urn:btih:6715ed71f838932ab5057d6e681ada4d47f787ff","amp;dn":"Miyamoto+Musashi+-+A+Book+of+Five+Rings+%28English+%26amp%3B+Spanish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6715ed71f838932ab5057d6e681ada4d47f787ff","infoHashBuffer":{"type":"Buffer","data":[103,21,237,113,248,56,147,42,181,5,125,110,104,26,218,77,71,247,135,255]},"announce":[],"urlList":[]}}