{"title":"two can play that game","uid":5025040,"size":735010816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67a7f1eab4d7617114052b5ce0a7589aaa177307&amp;dn=two+can+play+that+game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bs313","files":1,"time":1248647183,"description":"When it comes to matters of the heart, keeping her man happy and committed is all in a day's work for ShantÃƒÂ© Smith. ShantÃƒÂ© is so adept at navigating the waters of romance that her best girlfriends Diedre, Karen and Tracye depend on her for advice whenever &quot;man trouble&quot; clouds the horizon. But when ShantÃƒÂ©'s boyfriend Keith is caught red-handed stepping out with a co-worker, ShantÃƒÂ© institutes her &quot;Ten Day Plan&quot; to get her man in line. Whether its sexy lingerie or good home cooking, ShantÃƒÂ© has an arsenal of weapons designed to bring a man to his knees...and back to her. She's not above playing the damsel in distress or using the ever-reliable local grapevine to get Keith's attention. It's all good, because getting her man back - by any means necessary - is all that matters. Unfortunately the happy ending that ShantÃƒÂ© expects goes sideways when Keith begins following the advice of his buddy Tony, who brings a player's perspective to the games girls play. In this comedic battle of the sexes, Shante's about to discover that not only are there no rules - she's not the only one playing. With her relationship at stake and her friends checking her every move, ShantÃƒÂ© has to think fast and stay a step ahead of Keith if she has any hope of bringing her man back...with her pride intact","torrent":{"xt":"urn:btih:67a7f1eab4d7617114052b5ce0a7589aaa177307","amp;dn":"two+can+play+that+game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a7f1eab4d7617114052b5ce0a7589aaa177307","infoHashBuffer":{"type":"Buffer","data":[103,167,241,234,180,215,97,113,20,5,43,92,224,167,88,154,170,23,115,7]},"announce":[],"urlList":[]}}