{"title":"FIFA 2001 PC (FULL)","uid":5091948,"size":514135514,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6851b3bf60c9b4ec2958b3bd57126692acc38922&amp;dn=FIFA+2001+PC+%28FULL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"sasi89","files":2,"time":1253218850,"description":"FIFA 2001 PC VERSION (FULL)\n\n\nThe 2001 edition of the EA Sports FIFA franchise features the moves of six top players who were motion captured in Holland. Other features include improved facial animation, more joints in player skeletons, and supporting-player audio when the ball is out of play. EA Sports promises defenders that mark better, goalies that play smarter, new animations, smoother transitions, blending between animations, precise contact points in player-ball collisions, natural movement in turns, speed variations, and players showing different urgency around the pitch. The controls will stay similar to those of FIFA 2000 except for some skill moves. Linesmen, coaches, and bench players are animated, as are the crowd members, some of whom have props. Because FÃƒÂ©dÃƒÂ©ration Internationale de Football Association (FIFA) licenses the game, it includes authentic kits and team logos, plus full player names. There are over 60 national teams, and during season play, second-division club teams can be promoted. You can organize multiplayer games between two computers via a modem, several computers over a network, or over the Internet with the EA Sports matchmaking service.\n\n\nFIRST OF ALL THERE IS NEED TO KNOW:\n\n- This is an 1:1 (exact, bit to bit) copy of the original game.\n- There is no need crack to play the game.\n\n\nINSTRUCTIONS:\n\n1. Download the torrent\n\n2. Mount the CD image file(s) (*.bin/*.cue) in Daemon Tools or in another program like Alcohol 120%, that supports the Safedisc emultion method. Or write the CD image file(s) to CD-R / CD-RW in RAW DAO 96 mode with any CD burner software that supports RAW DAO/96 mode.\n\n3. Install the game (there is no need serial code, etc.)\n\n4. Play the game\n\n5. Enjoy and have fun!\n\n\n\nsasi89","torrent":{"xt":"urn:btih:6851b3bf60c9b4ec2958b3bd57126692acc38922","amp;dn":"FIFA+2001+PC+%28FULL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6851b3bf60c9b4ec2958b3bd57126692acc38922","infoHashBuffer":{"type":"Buffer","data":[104,81,179,191,96,201,180,236,41,88,179,189,87,18,102,146,172,195,137,34]},"announce":[],"urlList":[]}}