{"title":"[RawCastings] Casting 23 - Austin Andrews, Avery Jones 1080p","uid":15955061,"size":1000929970,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:68b52ee362fc75217f6354982ac0f3575922c05f&amp;dn=%5BRawCastings%5D+Casting+23+-+Austin+Andrews%2C+Avery+Jones+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"SudoSu","files":1,"time":1475610158,"description":"-------------------------\r\n ... : Screenshots : ... \r\n-------------------------\r\n \nhttp://imagep2p.com/?g=942246 \nhttp://imagep2p.com/?v=247362\r\n\r\n-------------------------\r\n ... : Description : ... \r\n-------------------------\r\n\r\n[RawCastings] Casting 23 - Avery Jones (Austin Andrews, Avery Jones) [2016 , 1080p]\r\n\r\nName the actor: Austin Andrews, Avery Jones\r\nSubsites and site: RawCastings\r\n\r\nProduction year: 2016\r\nGenre: Interview, Anal / Oral Sex, Kissing, Bareback, Big Dick, Piercings, Rough Sex, Rimming, Domination, Tattoos, Deep Throat, Cumshot, Creampie, Muscle, Twink, Spitting\r\nDuration: 00:29:51\r\n\r\nDescription: Now that is a rough fuck. You just have to love auditions where you put these so called power bottoms to the test and our massive man Austin Andrews is just the guy for the job. Our barely legal Avery Jones is the ideal twink with a mind to show haters how sexy he is by getting paid to do what he loves; taking thick dick. Avery Jones was made to do this, who else would dream of doing porn at 13? We know that our man Austin Andrews takes rough fucking seriously and heard Avery's claim of being a power bottom during the pre-interview; Avery's 'new to the screw' ass is up for one hell of a challenge. Even starting off Austin is merciless, his hand either across Avery's face or bubbly bottom, testing Avery's gag reflex immediately, and making sure that mouth stays wet by spitting in it. From the onset it looks like Avery was not lying, his obviously tight hole swallows Austin's girthy dick without issue and our boy Austin does what he does best- making a bottom his total bitch. Without wincing or complaint Avery is twisted like a pretzel while this muscle god puts him through the ringer; showing Avery what he is in for with this career dream of his. You can tell it really hit home when after pounding his twinkie ass into oblivion, Austin says &quot;Ready for a rough fucking ?!&quot; Austin shoves that kid to the floor and jack hammers it till Avery is in headlights. When Austin nuts, he scoops it back into Avery's hole and just keeps pounding until he gets the bright idea to have Avery cum onto his cock. Austin uses that boy nut as lube till Avery collapses. Austin gives Avery props, saying he needs some work but can handle it. Avery said it was the roughest and best he ever had. Looks like we got ourselves a new power bottom in the making guys!\r\n\r\nType of video HD: 1080p\r\nVideo Format: MP4\r\nVideo: AVC, 1920x1080 (16: 9), 29.970 fps, 4352 Kbps\r\nAudio: AAC LC, 48.0 KHz, 2 ch, 107 Kbps\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/\r\n\r  http://youpornbook.com","torrent":{"xt":"urn:btih:68b52ee362fc75217f6354982ac0f3575922c05f","amp;dn":"%5BRawCastings%5D+Casting+23+-+Austin+Andrews%2C+Avery+Jones+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b52ee362fc75217f6354982ac0f3575922c05f","infoHashBuffer":{"type":"Buffer","data":[104,181,46,227,98,252,117,33,127,99,84,152,42,192,243,87,89,34,192,95]},"announce":[],"urlList":[]}}