{"title":"Lou Reed - 3 Albums 1972-3 HDTracks 24bit 96khz","uid":11773968,"size":2693333686,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:68de8783bd636c03fc2c85be22b544d7a30623e3&amp;dn=Lou+Reed+-+3+Albums+1972-3+HDTracks+24bit+96khz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"sidmal","files":38,"time":1427193970,"description":"\nLou Reed - Lou Reed (1972/2015)\n FLAC (tracks) 24-bit/96 kHz | Time - 38:57 minutes | 837 MB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Lou Reed's eponymous debut solo album was released in 1972 and produced by Richard Robinson. It was released in 1972 by RCA Records two years after he left The Velvet Underground. The album comprises eight new recordings of then-unreleased Velvet Underground songs, plus two new songs, &quot;Going Down&quot; and &quot;Berlin&quot; (the latter was re-recorded by Reed as the title track for his 1973 album Berlin). With increasing interest in the Velvet Underground, Reed's debut album was highly anticipated, but the result was a commercial and critical disappointment, peaking at only number 189 on the Billboard 200.\n\n\n Nearly 30 years after it came out, Lou Reed's solo debut suggests that neither Reed nor his new record company were quite sure about what to do with him in 1972. It would be years before the cult of the Velvet Underground became big enough to mean anything commercially, leaving Lou pretty much back where he started from in the public eye after five years of hard work, and he seemed to be searching for a different musical direction on this set without quite deciding what it would be; while the best tunes are admirably lean, no-frills rock &amp; roll, there are also several featuring tricked-up arrangements that don't suit the material terribly well (at no other time in history would anyone believe that Steve Howe and Rick Wakeman would be a good choice as backing musicians for the guy who wrote &quot;Sister Ray&quot;). Lou also didn't appear to have done much songwriting since he left the Velvets in 1970; with the exception of the hilariously catty &quot;Wild Child&quot; and &quot;Berlin,&quot; a song Reed would revisit a few years later, nearly every significant song on Lou Reed dated back to his tenure with the Velvet Underground, though it would be years before that band's recordings of &quot;I Can't Stand It,&quot; &quot;Lisa Says,&quot; or &quot;Ocean&quot; would surface. On its own terms, Lou Reed isn't a bad album, but it isn't a terribly interesting one either, and since superior performances of most of these songs are available elsewhere, it stands today more as a historical curiosity than anything else.  \n\n\nTracklist:\n\n 01 - I Can't Stand It\n 02 - Going Down\n 03 - Walk and Talk It\n 04 - Lisa Says\n 05 - Berlin\n 06 - I Love You\n 07 - Wild Child\n 08 - Love Makes You Feel\n 09 - Ride Into The Sun\n 10 - Ocean\n\n\n\nLou Reed - Transformer (1972/2015)\n FLAC (tracks) 24-bit/96 kHz | Time - 37:05 minutes | 809 MB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Released in 1972, Transformer is Lou Reed's second studio album. It was produced by David Bowie and Mick Ronson and was ranked number 194 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\n David Bowie has never been shy about acknowledging his influences, and since the boho decadence and sexual ambiguity of the Velvet Underground's music had a major impact on Bowie's work, it was only fitting that as Ziggy Stardust mania was reaching its peak, Bowie would offer Lou Reed some much needed help with his career, which was stuck in neutral after his first solo album came and went. Musically, Reed's work didn't have too much in common with the sonic bombast of the glam scene, but at least it was a place where his eccentricities could find a comfortable home, and on Transformer Bowie and his right-hand man, Mick Ronson, crafted a new sound for Reed that was better fitting (and more commercially astute) than the ambivalent tone of his first solo album. Ronson adds some guitar raunch to &quot;Vicious&quot; and &quot;Hangin' Round&quot; that's a lot flashier than what Reed cranked out with the Velvets, but still honors Lou's strengths in guitar-driven hard rock, while the imaginative arrangements Ronson cooked up for &quot;Perfect Day,&quot; &quot;Walk on the Wild Side,&quot; and &quot;Goodnight Ladies&quot; blend pop polish with musical thinking just as distinctive as Reed's lyrical conceits. And while Reed occasionally overplays his hand in writing stuff he figured the glam kids wanted (&quot;Make Up&quot; and &quot;I'm So Free&quot; being the most obvious examples), &quot;Perfect Day,&quot; &quot;Walk on the Wild Side,&quot; and &quot;New York Telephone Conversation&quot; proved he could still write about the demimonde with both perception and respect. The sound and style of Transformer would in many ways define Reed's career in the 1970s, and while it led him into a style that proved to be a dead end, you can't deny that Bowie and Ronson gave their hero a new lease on life -- and a solid album in the bargain.  \n\n\nTracklist:\n\n 01 - Vicious\n 02 - Andy's Chest\n 03 - Perfect Day\n 04 - Hangin' 'Round\n 05 - Walk on the Wild Side\n 06 - Make Up\n 07 - Satellite of Love\n 08 - Wagon Wheel\n 09 - New York Telephone Conversation\n 10 - I'm So Free\n 11 - Goodnight Ladies\n\n\n\nLou Reed - Berlin (1973/2015)\n FLAC (tracks) 24-bit/96 kHz | Time - 49:31 minutes | 1,04 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Berlin was released in 1973 and is Lou Reed's third solo album. It was ranked #344 on Rolling Stone's list of the 500 greatest albums of all time in 2003. The album is formatted as a tragic rock opera and features heavy orchestral arrangements. The Rolling Stone Record Guide described the album as &quot;grandiose, decadent&quot;, and finally &quot;one of the most depressing records ever made, and oddly beautiful in its own awful way&quot;.\n\n\n Transformer and &quot;Walk on the Wild Side&quot; were both major hits in 1972, to the surprise of both Lou Reed and the music industry, and with Reed suddenly a hot commodity, he used his newly won clout to make the most ambitious album of his career, Berlin. Berlin was the musical equivalent of a drug-addled kid set loose in a candy store; the album's songs, which form a loose story line about a doomed romance between two chemically fueled bohemians, were fleshed out with a huge, boomy production (Bob Ezrin at his most grandiose) and arrangements overloaded with guitars, keyboards, horns, strings, and any other kitchen sink that was handy (the session band included Jack Bruce, Steve Winwood, Aynsley Dunbar, and Tony Levin). And while Reed had often been accused of focusing on the dark side of life, he and Ezrin approached Berlin as their opportunity to make The Most Depressing Album of All Time, and they hardly missed a trick. This all seemed a bit much for an artist who made such superb use of the two-guitars/bass/drums lineup with the Velvet Underground, especially since Reed doesn't even play electric guitar on the album; the sheer size of Berlin ultimately overpowers both Reed and his material. But if Berlin is largely a failure of ambition, that sets it apart from the vast majority of Reed's lesser works; Lou's vocals are both precise and impassioned, and though a few of the songs are little more than sketches, the best -- &quot;How Do You Think It Feels,&quot; &quot;Oh, Jim,&quot; &quot;The Kids,&quot; and &quot;Sad Song&quot; -- are powerful, bitter stuff. It's hard not to be impressed by Berlin, given the sheer scope of the project, but while it earns an A for effort, the actual execution merits more of a B-.  \n\n\nTracklist:\n\n 01 - Berlin\n 02 - Lady Day\n 03 - Men of Good Fortune\n 04 - Caroline Says I\n 05 - How Do You Think It Feels\n 06 - Oh Jim\n 07 - Caroline Says II\n 08 - The Kids\n 09 - The Bed\n 10 - Sad Song","torrent":{"xt":"urn:btih:68de8783bd636c03fc2c85be22b544d7a30623e3","amp;dn":"Lou+Reed+-+3+Albums+1972-3+HDTracks+24bit+96khz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68de8783bd636c03fc2c85be22b544d7a30623e3","infoHashBuffer":{"type":"Buffer","data":[104,222,135,131,189,99,108,3,252,44,133,190,34,181,68,215,163,6,35,227]},"announce":[],"urlList":[]}}