{"title":"CB8511 - Chartbuster Country Hits 1967-1977 - (200 Hits) - Karao","uid":11558198,"size":656825155,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:694ea1186587febb8bcaf9b5973cfc75b0a3104e&amp;dn=CB8511+-+Chartbuster+Country+Hits+1967-1977+-+%28200+Hits%29+-+Karao&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KaraokeRG","files":-1,"time":1416851158,"description":"\nKaraokeRG is a new Release Group dedicated to new,clean karaoke uploads.            \nAll our uploaders have been Trusted &amp; Verified for some years.\nBeware of Fake uploaders,check our username first.\nDo not ask to be an uploader,YOU will be asked.\nPlease comment if you enjoy our uploads &amp; please seed back.\n\nWE HAVE MANY MEMBERS, SO RESEEDING WILL NOT BE POSSIBLE\n\n\n\nCB8511 - Chartbuster Country Hits 1967-1977\n\nRelease Unknown\nPublisher:Chartbuster Karaoke \nUploaded By:KaraokeRG\nFile Size:626 Mb\nFormat:MP3/CD+G\nBit Rate:128.kbps\nContains:210 Files\nPassword Protection:None\n\n\n\n\nTrack List\n\n\nCB8511-01-01 - Haggard, Merle - Branded Man\nCB8511-01-02 - Lynn, Loretta - Don't Come Home A Drinkin'\nCB8511-01-03 - Greene, Jack - All The Time\nCB8511-01-04 - Jones, George - Walk Through This World With Me\nCB8511-01-05 - Wynette, Tammy - I Don't Wanna Play House\nCB8511-01-06 - Owens, Buck - Sam's Place\nCB8511-01-07 - Robbins, Marty - Tonight Carmen\nCB8511-01-08 - Wynette, Tammy - Your Good Girl's Gonna Go Bad\nCB8511-01-09 - James, Sonny - I'll Never Find Another You\nCB8511-01-10 - Rich, Charlie - My Elusive Dreams\nCB8511-01-11 - Gentry, Bobbie - Ode To Billy Joe\nCB8511-01-12 - Houston, David - You Mean The World To Me\nCB8511-01-13 - Wynette, Tammy - Apartment #9\nCB8511-01-14 - Brown, Jim Ed - Pop A Top\nCB8511-01-15 - Smith, Connie - Cincinnati Ohio\n\n\n\nCB8511-02-01 - Haggard, Merle - Sing Me Back Home\nCB8511-02-02 - Wynette, Tammy - Take Me To Your World\nCB8511-02-03 - Lynn, Loretta - Fist City\nCB8511-02-04 - Houston, David - Have A Little Faith\nCB8511-02-05 - Campbell, Glen - I Wanna Live\nCB8511-02-06 - Goldsboro, Bobby - Honey\nCB8511-02-07 - Wynette, Tammy - D-I-V-O-R-C-E\nCB8511-02-08 - Cash, Johnny - Folsom Prison Blues\nCB8511-02-09 - James, Sonny - Heaven Says Hello\nCB8511-02-10 - Haggard, Merle - Mama Tried\nCB8511-02-11 - Riley, Jeanie C. - Harper Valley P.T.A.\nCB8511-02-12 - Robbins, Marty - I Walk Alone\nCB8511-02-13 - James, Sonny - World Of Our Own, A\nCB8511-02-14 - Wynette, Tammy - Stand By Your Man\nCB8511-02-15 - Campbell, Glen - Galveston\n\n\n\nCB8511-03-01 - Cash, Johnny - Boy Named Sue, A\nCB8511-03-02 - Pride, Charley - All I Have To Offer You Is Me\nCB8511-03-03 - Haggard, Merle - Hungry Eyes\nCB8511-03-04 - Haggard, Merle - Okie From Muskogee\nCB8511-03-05 - James, Sonny - Running Bear\nCB8511-03-06 - Wynette, Tammy - Singing My Song\nCB8511-03-07 - Greene, Jack - Statue Of A Fool\nCB8511-03-08 - Greene, Jack - Until My Dreams Come True\nCB8511-03-09 - Wynette, Tammy - Ways To Love A Man, The\nCB8511-03-10 - Campbell, Glen - Wichita Lineman\nCB8511-03-11 - Lynn, Loretta - Woman Of The World (Leave My World Alone)\nCB8511-03-12 - Haggard, Merle - Working Man Blues\nCB8511-03-13 - Campbell, Glen - Try A Little Kindness\nCB8511-03-14 - Clark, Roy - Yesterday When I Was Young\nCB8511-03-15 - Hall, Tom T. - Week In A Country Jail, A\n\n\n\nCB8511-04-01 - Haggard, Merle - Fightin' Side Of Me, The\nCB8511-04-02 - Blanchard, Jack &amp; Misty Morgan - Tennessee Bird Walk\nCB8511-04-03 - Pride, Charley - Is Anybody Goin' To San Antone\nCB8511-04-04 - Lynn, Loretta - Coal Miner's Daughter\nCB8511-04-05 - Robbins, Marty - My Woman, My Woman, My Wife\nCB8511-04-06 - James, Sonny - My Love\nCB8511-04-07 - Twitty, Conway - Hello Darlin'\nCB8511-04-08 - Pride, Charley - Wonder Could I Live There Anymore\nCB8511-04-09 - Anderson, Lynn - Rose Garden\nCB8511-04-10 - James, Sonny - Don't Keep Me Hangin' On\nCB8511-04-11 - Price, Ray - For The Good Times\nCB8511-04-12 - Lewis, Jerry Lee - There Must Be More To Love Than This\nCB8511-04-13 - Cash, Johnny - Sunday Morning Coming Down\nCB8511-04-14 - Twitty, Conway - Fifteen Years Ago\nCB8511-04-15 - James, Sonny - Endlessly\n\n\n\nCB8511-05-01 - Cash, Johnny - Flesh &amp; Blood\nCB8511-05-02 - Smith, Sammi - Help Me Make It Through The Night\nCB8511-05-03 - Twitty, Conway &amp; Loretta Lynn - After The Fire Is Gone\nCB8511-05-04 - James, Sonny - Empty Arms\nCB8511-05-05 - Price, Ray - I Won't Mention It Again\nCB8511-05-06 - Anderson, Lynn - You're My Man\nCB8511-05-07 - Reed, Jerry - When You're Hot, You're Hot\nCB8511-05-08 - James, Sonny - Bright Lights, Big City\nCB8511-05-09 - Hart, Freddie - Easy Loving\nCB8511-05-10 - Hall, Tom T. - Year That Clayton Delaney Died, The\nCB8511-05-11 - Anderson, Lynn - How Can I Unlove You\nCB8511-05-12 - Twitty, Conway &amp; Loretta Lynn - Lead Me On\nCB8511-05-13 - Haggard, Merle - Daddy Frank\nCB8511-05-14 - Pride, Charley - Kiss An Angel Good Morning\nCB8511-05-15 - Parton, Dolly - Coat Of Many Colors\n\n\n\nCB8511-06-01 - Jennings, Waylon - Good Hearted Woman, A\nCB8511-06-02 - Lewis, Jerry Lee - Would You Take Another Chance On Me\nCB8511-06-03 - Lynn, Loretta - One's On The Way\nCB8511-06-04 - Young, Faron - It's Four In The Morning\nCB8511-06-05 - Haggard, Merle - Grandma Harp\nCB8511-06-06 - Fargo, Donna - Happiest Girl In The Whole U.S.A., The\nCB8511-06-07 - Owens, Buck - Made In Japan\nCB8511-06-08 - Tillis, Mel - I Ain't Never\nCB8511-06-09 - Fargo, Donna - Funny Face\nCB8511-06-10 - Haggard, Merle - It's Not Love But It's Not Bad\nCB8511-06-11 - Jones, George - Picture Of Me Without You, A\nCB8511-06-12 - Tucker, Tanya - Delta Dawn\nCB8511-06-13 - Davis, Mac - Baby Don't Get Hooked On Me\nCB8511-06-14 - Reeves, Jim - Missing You\nCB8511-06-15 - Anderson, Lynn - Listen To A Country Song\n\n\n\nCB8511-07-01 - Smith, Cal - Lord Knows I'm Drinkin', The\nCB8511-07-02 - West, Dottie - Country Sunshine\nCB8511-07-03 - Twitty, Conway - You've Never Been This Far Before\nCB8511-07-04 - Pruett, Jeanne - Satin Sheets\nCB8511-07-05 - Rich, Charlie - Behind Closed Doors\nCB8511-07-06 - Twitty, Conway &amp; Loretta Lynn - Louisiana Woman, Mississippi Man\nCB8511-07-07 - Shepard, Jean - Slippin' Away\nCB8511-07-08 - Rich, Charlie - Most Beautiful Girl, The\nCB8511-07-09 - Wynette, Tammy - Kids Say The Darndest Things\nCB8511-07-10 - Hall, Tom T. - Old Dogs, Children &amp; Watermelon Wine\nCB8511-07-11 - Jones, George &amp; Tammy Wynette - We're Gonna Hold On\nCB8511-07-12 - Lynn, Loretta - Love Is The Foundation\nCB8511-07-13 - Twitty, Conway - She Needs Someone To Hold Her When She Cries\nCB8511-07-14 - Fargo, Donna - Superman\nCB8511-07-15 - Clark, Roy - Come Live With Me\n\n\n\nCB8511-08-01 - Williams, Don - Amanda\nCB8511-08-02 - Haggard, Merle - Everybody's Had The Blues\nCB8511-08-03 - Anderson, Lynn - Keep Me In Mind\nCB8511-08-04 - Osmond, Marie - Paper Roses\nCB8511-08-05 - Price, Ray - You're The Best Thing That Ever Happened To Me\nCB8511-08-06 - Lynn, Loretta - Rated X\nCB8511-08-07 - Fairchild, Barbara - Teddy Bear Song\nCB8511-08-08 - Russell, Johnny - Rednecks, White Socks &amp; Blue Ribbon Beer\nCB8511-08-09 - Wynette, Tammy - Till I Get It Right\nCB8511-08-10 - Tucker, Tanya - What's Your Mama's Name\nCB8511-08-11 - Kristofferson, Kris - Why Me Lord\nCB8511-08-12 - Murray, Anne - Danny's Song\nCB8511-08-13 - Lewis, Jerry Lee - Drinking Wine Spo-Dee O'dee\nCB8511-08-14 - Tucker, Tanya - Jamestown Ferry, The\nCB8511-08-15 - Fargo, Donna - You Were Always There\n\n\n\nCB8511-09-01 - Smith, Cal - Country Bumpkin\nCB8511-09-02 - Jones, George - Grand Tour, The\nCB8511-09-03 - Parton, Dolly - Jolene\nCB8511-09-04 - Rich, Charlie - Very Special Love Song, A\nCB8511-09-05 - Gilley, Mickey - Room Full Of Roses, A\nCB8511-09-06 - Wynette, Tammy - Another Lonely Song\nCB8511-09-07 - Hall, Tom T. - Country Is\nCB8511-09-08 - Twitty, Conway &amp; Loretta Lynn - As Soon As I Hang Up The Phone\nCB8511-09-09 - Twitty, Conway - I See The Want To In Your Eyes\nCB8511-09-10 - Parton, Dolly - Love Is Like A Butterfly\nCB8511-09-11 - Hall, Tom T. - I Care\nCB8511-09-12 - Rich, Charlie - I Don't See Me In Your Eyes Anymore\nCB8511-09-13 - Hall, Tom T. - I Love\nCB8511-09-14 - Parton, Dolly - I Will Always Love You\nCB8511-09-15 - Haggard, Merle - Old Man From The Mountain\n\n\n\nCB8511-10-01 - Milsap, Ronnie - Pure Love\nCB8511-10-02 - Sheppard, T.G. - Devil In The Bottle\nCB8511-10-03 - Tucker, Tanya - Would You Lay With Me\nCB8511-10-04 - Craddock, Billy Crash - Rub It In\nCB8511-10-05 - Gilley, Mickey - I Overlooked An Orchid\nCB8511-10-06 - Murray, Anne - He Thinks I Still Care\nCB8511-10-07 - Milsap, Ronnie - Please Don't Tell Me How The Story Ends\nCB8511-10-08 - Rich, Charlie - She Called Me Baby\nCB8511-10-09 - Montgomery, Melba - No Charge\nCB8511-10-10 - Twitty, Conway - There's A Honky Tonk Angel\nCB8511-10-11 - Fargo, Donna - You Can't Be A Beacon\nCB8511-10-12 - Haggard, Merle - Things Aren't Funny Anymore\nCB8511-10-13 - Lynn, Loretta - Trouble In Paradise\nCB8511-10-14 - Anderson, Lynn - What A Man, My Man Is\nCB8511-10-15 - Rich, Charlie - There Won't Be Anymore\n\n\n\nCB8511-11-01 - Twitty, Conway - Linda On My Mind\nCB8511-11-02 - Nelson, Willie - Blue Eyes Cryin' In The Rain\nCB8511-11-03 - Gatlin Brothers, The - Broken Lady\nCB8511-11-04 - Spears, Billie Jo - Blanket On The Ground\nCB8511-11-05 - Williams, Don - I Wouldn't Want To Live If You Didn't Love Me\nCB8511-11-06 - Fender, Freddy - Before The Next Teardrop Falls\nCB8511-11-07 - Gilley, Mickey - City Lights\nCB8511-11-08 - Haggard, Merle - Always Wanting You\nCB8511-11-09 - Parton, Dolly - Bargain Store, The\nCB8511-11-10 - Twitty, Conway - Don't Cry Joni\nCB8511-11-11 - Fender, Freddy - Wasted Days &amp; Wasted Nights\nCB8511-11-12 - Parton, Dolly - Seeker, The\nCB8511-11-13 - Haggard, Merle - Kentucky Gambler\nCB8511-11-14 - Jones, George - Door, The\nCB8511-11-15 - Statler Brothers, The - I'll Go To My Grave Loving You\n\n\n\nCB8511-12-01 - Milsap, Ronnie - Daydreams About Night Things\nCB8511-12-02 - Campbell, Glen - Country Boy (You Got Your Feet In L.A.)\nCB8511-12-03 - Milsap, Ronnie - I'd Be A Legend In My Time\nCB8511-12-04 - Colter, Jessi - I'm Not Lisa\nCB8511-12-05 - Jennings, Waylon - I'm A Ramblin' Man\nCB8511-12-06 - Campbell, Glen - Rhinestone Cowboy\nCB8511-12-07 - Craddock, Billy Crash - Ruby, Baby\nCB8511-12-08 - Tucker, Tanya - San Antonio Stroll\nCB8511-12-09 - McCall, C.W. - Convoy\nCB8511-12-10 - Stampley, Joe - Roll On Big Mama\nCB8511-12-11 - Mandrell, Barbara - Standing Room Only\nCB8511-12-12 - Denver, John - Thank God I'm A Country Boy\nCB8511-12-13 - Williams, Don - Turn Out The Light &amp; Love Me Tonight\nCB8511-12-14 - Ronstadt, Linda - When Will I Be Loved\nCB8511-12-15 - Coe, David Allan - You Never Even Call Me By My Name\n\n\n\nCB8511-13-01 - Haggard, Merle - Cherokee Maiden\nCB8511-13-02 - Robbins, Marty - El Paso City\nCB8511-13-03 - Jones, George &amp; Tammy Wynette - Golden Ring\nCB8511-13-04 - Tillis, Mel - Good Woman Blues\nCB8511-13-05 - Gatlin Brothers, The - Statues Without Hearts\nCB8511-13-06 - Gayle, Crystal - I'll Get Over You\nCB8511-13-07 - Milsap, Ronnie - I'm A Stand By My Woman Man\nCB8511-13-08 - Cash, Johnny - One Piece At A Time\nCB8511-13-09 - Wynette, Tammy - Till I Can Make It On My Own\nCB8511-13-10 - Sovine, Red - Teddy Bear\nCB8511-13-11 - Wynette, Tammy - You And Me\nCB8511-13-12 - Rabbitt, Eddie - Do You Right Tonight\nCB8511-13-13 - Gilley, Mickey - Don't The Girl's All Get Prettier At Closing Time\nCB8511-13-14 - Rabbitt, Eddie - Drinking My Baby Off My Mind\nCB8511-13-15 - Bellamy Brothers, The - Let Your Love Flow\n\n\n\nCB8511-14-01 - Rogers, Kenny - Daytime Friends\nCB8511-14-02 - Gayle, Crystal - Don't It Make My Brown Eyes Blue\nCB8511-14-03 - Kendalls, The - Heaven's Just A Sin Away\nCB8511-14-04 - Parton, Dolly - Here You Come Again\nCB8511-14-05 - Gatlin Brothers, The - I Just Wish You Were Someone I Love\nCB8511-14-06 - Williams, Don - I'm Just A Country Boy\nCB8511-14-07 - Milsap, Ronnie - It Was Almost Like A Song\nCB8511-14-08 - Rogers, Kenny - Lucille\nCB8511-14-09 - Jennings, Waylon - Luckenbach, Texas\nCB8511-14-10 - Rich, Charlie - Rollin' With The Flow\nCB8511-14-11 - Pride, Charley - She's Just An Old Love Turned Memory\nCB8511-14-12 - Williams, Don - Some Broken Hearts Never Mend\nCB8511-14-13 - Campbell, Glen - Southern Nights\nCB8511-14-14 - Jennings, Waylon - Wurlitzer Prize (I Don't Want To Get Over You)\nCB8511-14-15 - Gayle, Crystal - You Never Miss A Real Good Thing","torrent":{"xt":"urn:btih:694ea1186587febb8bcaf9b5973cfc75b0a3104e","amp;dn":"CB8511+-+Chartbuster+Country+Hits+1967-1977+-+%28200+Hits%29+-+Karao","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"694ea1186587febb8bcaf9b5973cfc75b0a3104e","infoHashBuffer":{"type":"Buffer","data":[105,78,161,24,101,135,254,187,139,202,249,181,151,60,252,117,176,163,16,78]},"announce":[],"urlList":[]}}