{"title":"A Third Face: My Tale of Writing, Fighting and Filmmaking ","uid":9949702,"size":11928644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69a4ea176895d4dba61f77b36cfaa8b5db5487a9&amp;dn=A+Third+Face%3A+My+Tale+of+Writing%2C+Fighting+and+Filmmaking+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1397378278,"description":"Samuel Fuller was one of the most prolific and independent writer-director-producers in Hollywood. His 29 tough, gritty films made from 1949 to 1989 set out to capture the truth of war, racism and human frailties, and incorporate some of his own experiences. His film Park Row was inspired by his years in the New York newspaper business, where his beat included murders, suicides, state executions and race riots. He writes about hitchhiking across the country at the height of the Great Depression. His years in the army in World War II are captured in his hugely successful pictures The Big Red One , The Steel Helmet and Merrill's Marauders . \n\nFuller's other films include Pickup on South Street ; Underworld U.S.A. , a movie that shows how gangsters in the 1960s were seen as &quot;respected&quot; tax-paying executives; Shock Corridor , which exposed the conditions in mental institutions; and White Dog , written in collaboration with Curtis Hanson ( L.A. Confidential ), a film so controversial that Paramount's then studio heads Jeffrey Katzenberg and Michael Eisner refused to release it. In addition to his work in film, Samuel Fuller (1911-1997) wrote eleven novels. He lived in Los Angeles with his wife and their daughter. \n\nA Third Face was completed by Jerome Henry Rudes, Fuller's longtime friend, and his wife, Christa Lang Fuller. &quot;Fuller wasn't one for tactful understatement and his hot-blooded, incident-packed autobiography is accordingly blunt ... A Third Face is a grand, lively, rambunctious memoir.&quot; Janet Maslin, The New York Times ; &quot;Fuller's last work is a joy and an important addition to film and popular culture literature.&quot; Publishers Weekly ; &quot;If you don't like the films of Sam Fuller, then you just don't like cinema.&quot; Martin Scorsese, from the book's introduction","torrent":{"xt":"urn:btih:69a4ea176895d4dba61f77b36cfaa8b5db5487a9","amp;dn":"A+Third+Face%3A+My+Tale+of+Writing%2C+Fighting+and+Filmmaking+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a4ea176895d4dba61f77b36cfaa8b5db5487a9","infoHashBuffer":{"type":"Buffer","data":[105,164,234,23,104,149,212,219,166,31,119,179,108,250,168,181,219,84,135,169]},"announce":[],"urlList":[]}}