{"title":"[Z-Z] Baccano! 1 - 16 DVDRip (Dual Audio)","uid":4940044,"size":3994848918,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:69c300b4e5d29de935da75247c5dfc66b78c2f29&amp;dn=%5BZ-Z%5D+Baccano%21+1+-+16+DVDRip+%28Dual+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"WanNagashi","files":-1,"time":1244410107,"description":"The complete sixteen episode series of Baccano! \n\nVideo: 720x400 - 16/9, H.264, MKV, 29.970fps\nSubtitles: English Text for Songs &amp; Signs and Japanese Audio\nAudio: English AC3 5.1 Surround Sound (6 CH), Japanese AC3 Stereo (2 CH)\n\nVolume #1 (Eps #1-4)\n\nMafia goons are doing their best to whack each other on the mean streets of the Big Apple, and hot lead is punching holes in the walls of a cross-country train called the Flying Pussyfoot. But this caper ain't about a simple gangland feud or a train heist. It's about hoods that can't seem to die proper after catching a bullet or five between the eyes. For now, how's about we start on a ship called the Advenna Avis. Seems a group of guys who never wanna die are summoning a demon, and the proceedings are turning nasty. It's as good a start as any for a story where every Dick and Jane plays the lead.\n\nVolume #2 (Eps # 5-8)\n\nMafia goons are doing their best to whack each other on the mean streets of the Big Apple, and hot lead is punching holes in the walls of a cross-country train called the Flying Pussyfoot. But this caper ain't about a simple gangland feud or a train heist. It's about hoods that can't seem to die proper after catching a bullet or five between the eyes. For now, how's about we start on a ship called the Advenna Avis. Seems a group of guys who never wanna die are summoning a demon, and the proceedings are turning nasty. It's as good a start as any for a story where every Dick and Jane plays the lead.\n\nVolume #3 (Eps # 9-12)\n\nThe immortal gangsters are still trying to rub each other out, but hoods who won't die are tough to whack. Explosions rock the Flying Pussyfoot as the train nears the station, but this caper ain't about arrivals and departures. It's about the twists and turns along the way. It's about vicious monsters, deadly dames, and the sins of the past colliding with the present. For now, how's about we start in the alleys of the Big Apple. A notorious thug has gotten his filthy hands on a mysterious elixir and it just might mean his reign of terror could last forever. It's as good a start as any for a story where every Dick and Jane plays the lead.\n\n\nVolume #4 (Eps # 13-16)\n\nThe train is pulling in and the mobsters and monsters who populate this caper are ready to settle a score that's been a long time coming. But this ain't about revenge or pride. This is about the ins and outs of living forever. It's about making your way among thieves with honor and politicians with dirty hands. This is about sticking up for the guys that do you right and the gals that love you good. For now, how's about we start at the end of the story, where a ruthless alchemist is gonna get his after a couple of centuries of shady soul eating. It's as good a start as any for a story that never ends.","torrent":{"xt":"urn:btih:69c300b4e5d29de935da75247c5dfc66b78c2f29","amp;dn":"%5BZ-Z%5D+Baccano%21+1+-+16+DVDRip+%28Dual+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c300b4e5d29de935da75247c5dfc66b78c2f29","infoHashBuffer":{"type":"Buffer","data":[105,195,0,180,229,210,157,233,53,218,117,36,124,93,252,102,183,140,47,41]},"announce":[],"urlList":[]}}