{"title":"Discovery.Channel.World.War.II.In.HD.Colour.01of13.The.Gathering","uid":6369717,"size":855058432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:69e7e412ff85e89fa2f3f7687e304e3a35a11970&amp;dn=Discovery.Channel.World.War.II.In.HD.Colour.01of13.The.Gathering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"DocFreak08","files":-1,"time":1304635937,"description":"Nugus Martin Productions has accumulated probably the best collection of rare and unseen footage of World War II in the world. By using the very latest colorization techniques it is now possible to show the full story of World War II as it has never been fully seen before. With the very latest satellite delivered terrain mapping and state of the art graphics this story can now be told with the very latest access to information which was not previously available to other older series.\n\nConventional wisdom has recently changed as more and more secrets have been revealed particularly in the last five to ten years as documents, files and photographs have been released. Code breaking revelations, and newly released government papers on both sides of the Atlantic have added a very insightful new dimension to the understanding of this the worlds' greatest ever conflict. Narrated by English actor Robert Powell, WORLD WAR II IN HD COLOUR is a vivid, in-depth experience that provides viewers with new insights and information.\n\nAlso Known As: World War II in Colour and HD\n\nColourisation and Restoration : Westwing Studios Inc.\nExecutive Producer : Matthew Barrett\n\nNugus/Martin Productions (2009)\n\n\nEpisode 1 : The Gathering Storm\nThe series starts with that great paradox. How could the settlement at the end of World War One - the 'war to end all wars' - lead to an even greater conflict just a few years later ? The answer is a tale with terrible resonancy today. This film shows how the Great Depression sapped the will of the democracies of the West to face up to a new and disturbing political phenomenon - the rise of militaristic dictators, in Germany, Italy, Japan and Spain. The result was that the major powers ignored all the warning signs and allowed the likes of Mussolini and above all Hitler to begin the course that would lead the world into catastrophe. The programme ends as Hitler plots his attack upon Poland.\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2016 kbps\nVideo Resolution: 608x352\nVideo Aspect Ratio: 1.727:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 51:27.720\nNumber Of Parts: 13\nPart Size: 855,058,432 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:69e7e412ff85e89fa2f3f7687e304e3a35a11970","amp;dn":"Discovery.Channel.World.War.II.In.HD.Colour.01of13.The.Gathering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69e7e412ff85e89fa2f3f7687e304e3a35a11970","infoHashBuffer":{"type":"Buffer","data":[105,231,228,18,255,133,232,159,162,243,247,104,126,48,78,58,53,161,25,112]},"announce":[],"urlList":[]}}