{"title":"Weather Report - Black Market","uid":3342439,"size":54054300,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a066b76388b1aca14734b72787536596caee443&amp;dn=Weather+Report+-+Black+Market&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MDP","files":7,"time":1118344169,"description":"&quot;BLACK MARKET&quot; (1976) evinces a maturity of approach, the band consolidating artistic gains from previous years by constructing a unified group of suite-like musical landscapes that draw on elements of jazz, funk and &quot;world music&quot;.\n\nThe opener ( &quot;Black Market&quot; ), with its infectious melodic &quot;hook&quot;, radiates a positive, life-affirming warmth (nice solos and firm, funky rhythmic support) while the closing moments provide a sobering contrast: synthesized imitations of gun and artillery fire reflecting the tragedy of strife endemic (then and now) in many parts of the war-torn &quot;third world&quot;. \n\n&quot;Cannonball&quot; is a tribute to (then recently deceased) Julian Adderley, the famous alto saxophonist/bandleader who was Joe Zawinul's former employer. The tune, while pleasant enough, is somewhat lightweight: its streamlined style and overtly sentimental melody presage similar material to follow on their next ( and most famous ) album &quot;Heavy Weather&quot; ( note that Jaco Pastorius' recorded debut with WR took place on &quot;Cannonball&quot; ).\n\n&quot;Gibraltar&quot; opens to sounds of the portside city (waves &amp; foghorns) and softly evocative soprano sax before giving way to a prototypical Weather Report groove superbly laid down by bassist Alphonso Johnson. \n\nWayne Shorter's &quot;Elegant People&quot; is one of the perennial Weather Report favorites with its feeling of romantic intrigue and flamenco influenced (Phrygian) cadences (yet another infectious thematic &quot;hook&quot; and some impassioned tenor sax by Shorter).\n\nThe other Shorter tune on the album (&quot;Three Clowns&quot;) is a bizarre &quot;funhouse&quot; ballad, with the composer playing a synthesized wind instrument (&quot;Lyricon&quot;). \n\nThe final two pieces are both composed by bassists: \n\nJaco Pastorius' &quot;Barbary Coast&quot; is a brief, funky and somewhat meandering piece.\n\nAlphonso Johnson's &quot;Herandnu&quot; is an interesting tune; a rolling, calliope-sounding theme in alternating time signatures morphing into an up-tempo fusion feature for some keyboard improv by Zawinul (who paraphrases his own &quot;Black Market&quot; at one point). The theme briefly returns before the ghostly eeriness of a 45 second coda.\n\n&quot;BLACK MARKET&quot; was the summation of a musical path established in the 3 preceding albums, which while exhibiting many traits from the previous period also pointed towards the more streamlined direction they would take in their most popular phase (w/ Jaco Pastorius as a dynamic influence). While the group recorded a lot of good music and gained a much-deserved fame in the following years, the 4 albums Weather Report recorded from 1973 to 1976 stand as their most consistently creative efforts.\n","torrent":{"xt":"urn:btih:6a066b76388b1aca14734b72787536596caee443","amp;dn":"Weather+Report+-+Black+Market","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a066b76388b1aca14734b72787536596caee443","infoHashBuffer":{"type":"Buffer","data":[106,6,107,118,56,139,26,202,20,115,75,114,120,117,54,89,108,174,228,67]},"announce":[],"urlList":[]}}