{"title":"The Upperfloor--tUF-37600 Abella Danger, Mia Li and Marco Bander","uid":11894620,"size":932718024,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6a10021c0c51dc9d0449e68bc6d7f997b89bfe93&amp;dn=The+Upperfloor--tUF-37600+Abella+Danger%2C+Mia+Li+and+Marco+Bander&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"merzedes","files":1,"time":1431121887,"description":"Abella's Anal Initiation\n\nMay 8, 2015 - Performers: Marco Banderas ,  Mia Li  and  Abella Danger \n\n\nHi MP4 only.\n\n\nAbella Danger is a 19 year old colt that must be tamed before we can collar her, so we assigned one of our most refined senior slaves to the task: the elegant Mia Li. Abella has abouncy gorgeous fuckable ass that deserves to be house property, but can Mia get her in line? \n\nThe beginning of the party starts as many parties do: with introductions. As Mia Li presents her fresh young charge to the house, horny guests come forward to squeeze her nubile flesh and spank her bubble butt. She is then paraded around the party learning her manners and learning guests' names. Though polity does not come naturally to Abella, and Mia receives many clothes pins in punishment. Abella's mouth proves to be worthless for making introductions and a guests' hard cock is placed in it while Mia receives painful orgasms and a cruel zipper much to the party's pleasure. \n\nIf the House is to own Abella's ass, Mia will have to teach her how to properly fuck in a strict slave cowgirl. Mia is a fine example of slave flesh and bounces on dick, her thighs suffering with every stroke. Abella is abjectly used for oral duty, licking balls and pussy until a plug is placed in her ass and it is her turn to try fucking. Being innocent to slave training, she begins to steal orgasms will nilly and must be brought into line by Mia with a zapper and a harsh spanking hand. Close to tears, Abella finally learns how to hold her orgasms until given permission. \n\nLast scene finds our freshly minted initiate tied tightly to a table getting with a guests balls deep in her ass. Our colt finally begins to shine and she suffers exquisitely through a thorough pounding, cumming under duress and always asking permission and providing the slave motto upon release. Mia is rewarded for her outstanding leadership with countless orgasms as Abella has a collar placed around her neck. \n\nCongratulations Abella and Mia!\n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/37600-Abellas-Anal-Initiation.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/37600-Abellas-Anal-Initiation.html&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:6a10021c0c51dc9d0449e68bc6d7f997b89bfe93","amp;dn":"The+Upperfloor--tUF-37600+Abella+Danger%2C+Mia+Li+and+Marco+Bander","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a10021c0c51dc9d0449e68bc6d7f997b89bfe93","infoHashBuffer":{"type":"Buffer","data":[106,16,2,28,12,81,220,157,4,73,230,139,198,215,249,151,184,155,254,147]},"announce":[],"urlList":[]}}