{"title":"Halo.4.2DISC.XBOX360","uid":7723397,"size":17477693512,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:6a1d4f92c1207b59116c891b2505f5f5212300f0&amp;dn=Halo.4.2DISC.XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":null,"files":-1,"time":1350139636,"description":"Master Chief returns in Halo 4, part of a new trilogy in the colossal Halo universe.\n\nSet almost five years after the events of Halo 3, Halo 4 takes the series in a new direction and sets the stage for an epic new sci-fi saga, in which the Master Chief returns to confront his destiny and face an ancient evil that threatens the fate of the entire universe. Halo 4 also introduces a new multiplayer offering, called Halo Infinity Multiplayer, that builds off of the Halo franchise's rich multiplayer history. The hub of the Halo 4 multiplayer experience is the UNSC Infinity; the largest starship in the UNSC fleet that serves as the center of your Spartan career. Here you'll build your custom Spartan-IV supersoldier, and progress your multiplayer career across all Halo 4 competitive and cooperative game modes.\n\n\n\nThose who want to extract this iso, you will find gui based programs like xbox image browser and wx360 will not recognize the iso as an xbox image. Download exiso and drag the iso image to the exe file and it will extract it in same folder as the iso image. \n\n\nDisk 1 contains the campaign\nDisk 2 contains Multiplayer installation, Forge, Spartan Ops and Theater Mode\n\n\nWARNING: Going online now would be extremely dangerous as the game's official release is 6th november. Microsoft will be cracking the whip with this one... BE careful \n\n\nRegion : Free\nRelease Date : 6 November 2012\nGenre: First-Person Shooter\nPublisher: Microsoft Game Studios\nDeveloper: 343 Industries \n","torrent":{"xt":"urn:btih:6a1d4f92c1207b59116c891b2505f5f5212300f0","amp;dn":"Halo.4.2DISC.XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a1d4f92c1207b59116c891b2505f5f5212300f0","infoHashBuffer":{"type":"Buffer","data":[106,29,79,146,193,32,123,89,17,108,137,27,37,5,245,245,33,35,0,240]},"announce":[],"urlList":[]}}