{"title":"Le.Cronache.Di.Narnia.Il.Principe.Caspian.2008.iTALiAN.DVDRip.Xv","uid":4524770,"size":1467930624,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a4aa44c7598846da5b69e6d9764778e74e48255&amp;dn=Le.Cronache.Di.Narnia.Il.Principe.Caspian.2008.iTALiAN.DVDRip.Xv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"ivanone","files":2,"time":1227310563,"description":"Le.Cronache.Di.Narnia.Il.Principe.Caspian\n\n::: SCHEDA FILM :::\n\nTitolo: Le Cronache Di Narnia - Il Principe Caspian\nNazionalitÃƒÂ : USA/Gran Bretagna\nRegia: Andrew Adamson\nGenere: Avventura/Fantastico\nCast:  Liam Neeson, Ben Barnes, Warwick Davis, Georgie Henley, Skandar Keynes, William Moseley, Anna Popplewell, Ben Barnes, Sergio Castellitto, Alicia Borrachero, Peter Dinklage, Pierfrancesco Favino  \nData di uscita: 14/08/2008\nDurata: 145&amp;#039;\n\n::: TRAMA FILM :::\n\nL&amp;#039;armadio ÃƒÂ¨ sparito, la strega bianca ÃƒÂ¨ morta e Aslan ÃƒÂ¨ scomparso da oltre mille anni. Ora, Peter, Susan, Edmund e Lucy Pevensie vengono richiamati a Narnia per scoprire un mondo assolutamente diverso, mentre un nuovo nemico dÃƒÂ  battaglia e le dolci creature di questo territorio rischiano di estinguersi. Questa volta, i fratelli Pevensie vengono trasportati magicamente dall&amp;#039;Inghilterra coinvolta nella seconda guerra mondiale a Narnia attraverso una stazione della metropolitana vicino a Trafalgar Square, a Londra, imbarcandosi cosÃƒÂ¬ in una nuova pericolosa avventura e in una prova anche piÃƒÂ¹ impegnativa della loro fede e del loro coraggio. Soltanto un anno dopo gli incredibili eventi de &quot;Il leone, la strega e l&amp;#039;armadio&quot;, gli ex regnanti ritornano nel loro reame fatato, soltanto per scoprire che a Narnia sono trascorsi piÃƒÂ¹ di 1.300 anni. Nel corso della loro assenza, l&amp;#039;etÃƒÂ  dell&amp;#039;oro di Narnia ÃƒÂ¨ diventata una leggenda. Gli animali parlanti e le mitiche creature del territorio esistono soltanto come racconti popolari dei Telmarini, una razza di umani governata dallo spietato Lord Miraz, mentre il possente leone Aslan ÃƒÂ¨ scomparso da un migliaio di anni. I quattro ragazzi sono stati richiamati a Narnia da Caspian, il giovane erede del trono dei Telmarini, per combattere il malvagio zio Miraz. Con l&amp;#039;aiuto di un coraggioso nano, Trumpkin, un intrepido topo parlante di nome RicipÃƒÂ­, e l&amp;#039;inaffidabile nano nero Nikabrik, conducono i Narniani in un incredibile viaggio per restaurare la magia e la gloria del territorio.\n\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:6a4aa44c7598846da5b69e6d9764778e74e48255","amp;dn":"Le.Cronache.Di.Narnia.Il.Principe.Caspian.2008.iTALiAN.DVDRip.Xv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4aa44c7598846da5b69e6d9764778e74e48255","infoHashBuffer":{"type":"Buffer","data":[106,74,164,76,117,152,132,109,165,182,158,109,151,100,119,142,116,228,130,85]},"announce":[],"urlList":[]}}