{"title":"Star Wars - The Thrawn Trilogy (1997-1999|Digital|Fawkes-Empire)","uid":9668812,"size":470574547,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6a67466566a6bcf1b825dcbee8f7d25cb745969f&amp;dn=Star+Wars+-+The+Thrawn+Trilogy+%281997-1999%7CDigital%7CFawkes-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1393425782,"description":"Promotional info - &quot;Five years after the fall of the Empire, Luke Skywalker is the first in a new line of Jedi Knights. Han Solo and Princess Leia have married, together assuming many burdens of the New Republic's government. But across the galaxy lies a dying part of the Empire - all the more dangerous near death - and it has just discovered something that could bring it back to life! The last of the Emperor's warlords, Admiral Thrawn, is ready to destroy the New Republic - and the odds are stacked heavily against Luke, Leia, and Han!&quot;\n\nPerhaps the most famous and significant of Star Wars novels, Timothy Zahn's incredible Thrawn Trilogy showcased the events after the original films and became legendary stories themselves in the process. Zahn expanded upon the roles of each of the main trio, introduced the twin children of Leia (who would become immensely important in their own right) and of course created the remarkable villain - Grand Admiral Thrawn, for whom the trilogy is named. Thrawn was sharp as a tack, highly intelligent and cunning, and knew how to command loyalty without resorting to fear. In short, the most dangerous enemy the New Republic could ask for, who always seemed a step ahead of them. The books are worth reading on their own, but these comic adaptations by Dark Horse are pretty great too. Mike Baron wrote the scripts and a variety of artists handled the art but it all feels like it is of one piece. Some of the trickier concepts of Zahn's masterpiece are better represented in the visual medium, and in general it flows a lot faster in comic form due to some (mild) truncating. These brand new Digital TPB editions of this awesome tale are courtesy of Fawkes-Empire. Thanks so much to them for their work - please seed and enjoy! :-)","torrent":{"xt":"urn:btih:6a67466566a6bcf1b825dcbee8f7d25cb745969f","amp;dn":"Star+Wars+-+The+Thrawn+Trilogy+%281997-1999%7CDigital%7CFawkes-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a67466566a6bcf1b825dcbee8f7d25cb745969f","infoHashBuffer":{"type":"Buffer","data":[106,103,70,101,102,166,188,241,184,37,220,190,232,247,210,92,183,69,150,159]},"announce":[],"urlList":[]}}