{"title":"Interactive Storytelling for Video Games","uid":9753417,"size":4393896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a8f422ebb356672b0beca43d86c0fe7500c5a3e&amp;dn=Interactive+Storytelling+for+Video+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"PussycatDD","files":-1,"time":1394688523,"description":"Book: Interactive Storytelling for Video Games\nAuthors: Josiah Lebowitz, Chris Klug\n\n    What really makes a video game story interactive? What's the best way to create an interactive story? How much control should players be given? Do they really want that control in the first place? Do they even know what they want-or are their stated desires at odds with the unconscious preferences? All of these questions and more are examined in this definitive book on interactive storytelling for video games. You'll get detailed descriptions of all major types of interactive stories, case studies of popular games (including Bioshock, Fallout 3, Final Fantasy XIII, Heavy Rain, and Metal Gear Solid), and how players interact with them, and an in-depth analysis of the results of a national survey on player storytelling preferences in games. You'll get the expert advice you need to generate compelling and original game concepts and narratives.With Interactive Storytelling for Video Games, you'll: * Explore popular styles and genres of games (RPGs, Online Games, First Person Shooters, and more) * Learn to create effective, original concepts and story lines with key components in mind: structure, process, characters, player desire, and outcome * Learn about what players want, what they expect, and how to create truly compelling player-driven experiences * Get access to an associated website with additional data on storytelling preferences in games, valuable PowerPoint lectures for professors for each chapter of the book, and links to movies, websites, game writer discussion boards, and more\n    \nISBN13: 9780240817170\nISBN10: 0240817176\n\nPublished: Focal Press\n\nGenres: Computers Internet Games Strategy Guides Video, Computers Internet Programming Graphics Multimedia, Entertainment Puzzles Games Video Electronic\n\n","torrent":{"xt":"urn:btih:6a8f422ebb356672b0beca43d86c0fe7500c5a3e","amp;dn":"Interactive+Storytelling+for+Video+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a8f422ebb356672b0beca43d86c0fe7500c5a3e","infoHashBuffer":{"type":"Buffer","data":[106,143,66,46,187,53,102,114,176,190,202,67,216,108,15,231,80,12,90,62]},"announce":[],"urlList":[]}}