{"title":"Men on Fire [DvD5 - ita] [Tntvillage.Scambioetico]","uid":5282010,"size":3850604544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6aa7ae8d27bf8a94d163306b6b625294e2817615&amp;dn=Men+on+Fire+%5BDvD5+-+ita%5D+%5BTntvillage.Scambioetico%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"maxmalu6601","files":8,"time":1263582775,"description":"MAN ON FIRE\nIl Fuoco della Vendetta\n\n.::.Trama del Film.::.\n\nJohn Creasy ÃƒÂ¨ un ex-agente della CIA con un passato che fa male. Alcolizzato e depresso, non ha piÃƒÂ¹ uno scopo nella vita e nemmeno un lavoro. L'unica salvezza ÃƒÂ¨ uscire dal proprio mondo. Un caro amico gli trova un posto in Sudamerica come guardia del corpo di una bambina figlia di una ricca famiglia del luogo e, fra loro, nasce lentamente un'amicizia che rompe le barriere del freddo animo del protagonista, riportandolo a sentimenti dimenticati da tempo. Un giorno, purtroppo, Creasy non puÃƒÂ² evitare il rapimento della bambina da parte di un gruppo di terroristi, durante uno scontro a fuoco in cui viene gravemente ferito. Da questo momento in poi la rabbia di colui che era stato un assassino su commissione, si scaglia contro tutti, per andare a riprendersi ciÃƒÂ² che la vita gli aveva ancora regalato.\n\nRecensione\nC'ÃƒÂ¨ chi sostiene che i film &quot;dell'arrabbiato vendicativo&quot; - di solito monopolio dello Schwartzy di turno - siano un po' passati di moda o quanto meno abbiano poco da dire.\nVero, almeno finchÃƒÂ© non vengono sostenuti da una storia ben scritta e girati da qualcuno che sa usare la cinepresa e montare come fa Tony Scott (giÃƒÂ  il filmato che accompagna i titoli di testa prepara adeguatamente il palato dello spettatore).\nJohn Creasy (Denzel Washington / Il candidato di Manciuria) ÃƒÂ¨ un uomo alla deriva nel suo personale mare di alcool popolato dai rimorsi per una vita all'insegna della violenza e della distruzione. L'occasione per darsi una &quot;lustratina&quot; arriva con un incarico da guardia del corpo a CittÃƒÂ  del Messico per conto della famiglia Ramos. DovrÃƒÂ  proteggere la piccola Lupita (Dakota Fanning / Mi chiamo Sam) contro eventuali rischi di rapimento.\nIl legame che inizierÃƒÂ  ad unire Creasey a Pita sarÃƒÂ  una sorta di salvagente per l'ex-agente della CIA, che trova nella piccola la figlia che non ha mai avuto.\nQuesta sorta di paradiso ÃƒÂ¨, ovviamete, destinato ad una brusca fine con il rapimento della bambina. Le trattative con i rapitori non vanno a buon fine e mentre Crasey ÃƒÂ¨ ancora allettato per le ferite subite, Pita viene uccisa.\nPer Crasey non resta che una strada: la vendetta: &quot;Li ucciderÃƒÂ² tutti! UcciderÃƒÂ² chiunque abbia tratto un profitto da questo!&quot;.\nA Denzel non serve una muscolatura esplosiva o frasi altisonanti (anche se qualcuna non manca) per essere duro come il marmo. Per questo Kevin Kostner in versione &quot;black&quot;, l'essenzialitÃƒÂ  della recitazione e lo sguardo che sottintende la sua totale dedizione allo scopo, bastano ed avanzano.\nD'altro canto anche la piccola Dakota Fanning getta le basi per una futura carriera da star. Il talento non manca, speriamo che il passaggio da bambina prodigio ad attrice, avvenga senza troppi traumi.\nSul fratello &quot;minore&quot; di Ridley si ÃƒÂ¨ giÃƒÂ  detto fin troppo - cassettista, filo governativo, mestierante del video-clip, ecc. - ma forse ÃƒÂ¨ il momento di considerare che oggi ÃƒÂ¨ migliore di un fratello sempre uguale a se stesso.\nIl cinema ÃƒÂ¨ anche intrattenimento puro, quindi via libera all'azione.\n\n.::.Dati DvD.::.\n\nFormato DvD....: DvD5:\nLingue..............: Italiano\nLingue sub.......: Italiano\nCompressione...: poca roba\nProgramma usato: CloneDVD2\nMenu (si/no)....:  no\nExtra (si/no).....: no\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:6aa7ae8d27bf8a94d163306b6b625294e2817615","amp;dn":"Men+on+Fire+%5BDvD5+-+ita%5D+%5BTntvillage.Scambioetico%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aa7ae8d27bf8a94d163306b6b625294e2817615","infoHashBuffer":{"type":"Buffer","data":[106,167,174,141,39,191,138,148,209,99,48,107,107,98,82,148,226,129,118,21]},"announce":[],"urlList":[]}}