{"title":"Anita O'Day &amp; Cal Tjader - Tea for Two (1962) [Ja","uid":5091743,"size":78164539,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ab069f0431c806e19c70a3ccaba8d64cea49a24&amp;dn=Anita+O%5C%27Day+%26+Cal+Tjader+-+Tea+for+Two+%281962%29+%5BJa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"schon55","files":19,"time":1253206263,"description":"Anita O'Day &amp; Cal Tjader - Tea for Two\nRecorded in Hollywood, California in February 1962\nLabel:  Verve \nOrig Year:  1962 \nCD Release Date: Jun 22, 1999 \nQuality: 320 kbps\n\nAnita O'Day, a member of the pantheon of great jazz singers (whose ranks also include Billie Holiday, Ella Fitzgerald, and Sarah Vaughan), passed away Thanksgiving morning (November, 1986) at the age of 87.  Born in Chicago, O'Day gained national attention as the girl singer with drummer Gene Krupa's orchestra on the hit record &quot;Let Me Off Uptown. &quot; After two tenures with Krupa and one, inbetween, with Stan Kenton and his Orchestra, O'Day became a solo star and, along with Fitzgerald and Vaughan, a founding fore-mother ofmodern jazz vocals.  Known for her inventive scatting as well as her touching balladeering, O'Day recorded several dozen classic albums, mostly for the Verve label in the 1950s.  Ms.  O'Day was often as flamboyant visually as she was innovative vocally, evidence of which can be found in the films &quot;The Gene Krupa Story&quot; and &quot;Jazz On A Summer's Day.  A survivor of both heroin and alcohol addiction, she was also the author of one of the great jazz memoirs, &quot;Hard Times, High Times&quot; and the subject of a full-length documentary film, 'Anita O'Day - The Life of A Jazz Singer' which is currently in the final stages of completion.  Anita O'Day was never just another big-band canary.  Like Holiday, O'Day combined the soaring freedom of a jazz instrumentalist with the storytelling lyricism of a poet.  She often said she was a &quot;stylist,&quot; not a &quot;singer,&quot; which was correct, but only in a minimal sense.  From the moment she broke through to a national audience via the briskly swinging encounter with trumpeter Roy Eldridge in the Gene Krupa Band's recording of &quot;Let Me Off Uptown&quot; to her splendid Verve recordings of the '50s, and her comebacks in the '70s and again in the '90s, she was instantly recognizable, an utter original.  Yes, &quot;stylist,&quot; but much more.  Like Frank Sinatra, she balanced the rhythmic songs that were generally considered to be her forte with an approach to ballads that varied from seductive intimacy to sardonic irony.  ~ Will Friedwald\n\nBoth Anita O'Day and Cal Tjader are strong believers in improvising, together they swing through some excellent material including an afro-cuban swing version of Mr Sandman which actually sounds hip.  O'Day with her completley black phrasing is perfect with Tjader's afro-cubam rhythms, also includes swing, blues, standards, all with a touch of hot jazz.  Highlights include &quot;That's Your Red Wagon&quot; &quot;Peel Me A Grape&quot; and an absolutly hot version of &quot;Mr Sandman&quot;.  Highly recommended as are all of Miss O&quot;Day's Verves.  ~ Amazon. com\n\nYou can't do better than Anita O'Day for expression, and on this recording with Cal Tjader it's in full bloom.  Anita makes &quot;Thanks For The Memory&quot; the perfect vehicle for her wit and rolling voice.  Cal Tjader punctuates these songs perfectly; these two are a perfect pair.  All the songs are terrific, notable are &quot;Mr. Sandman&quot;, &quot;An Occasional Man&quot;,&quot;Red Wagon&quot;, and more.  As far as I'm concerned,it's an album for the ages.  ~ JH\n\n disovered this gem about a year and half ago and have all but worn out my copy and bought many others for friends.  Wow.  This is probably Anita's best work and her 'Peel Me A Grape' should be heard by anyone who thinks Diana Krall has any talent whatsoever as a singer.  Her 'An Occasional Man' alone is worth the price of the CD.  ~ AG\n\nPersonnel:\nAnita O'Day - vocals\nCal Tjader, Johnnie Rae - vibraphone, drums\nFreddy Schreiber - bass \nBob Corwin or Lonnie Hewitt  - piano\n\nAnita O'Day &amp; Cal Tjader - Tea for Two Tracks:\n01  Thanks For The Memory \n02  It Shouldn't Happen To A Dream \n03  Just In Time \n04  Under A Blanket Of Blue \n05  That's Your Red Wagon \n06  Peel Me A Grape \n07  An Occasional Man \n08  The Party's Over \n09  I Believe In You \n10  Mister Sandman \n11.  Spring Will Be A Little Late This Year \n12.  I'm Not Supposed To Be Blue Blues","torrent":{"xt":"urn:btih:6ab069f0431c806e19c70a3ccaba8d64cea49a24","amp;dn":"Anita+O%5C%27Day+%26+Cal+Tjader+-+Tea+for+Two+%281962%29+%5BJa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab069f0431c806e19c70a3ccaba8d64cea49a24","infoHashBuffer":{"type":"Buffer","data":[106,176,105,240,67,28,128,110,25,199,10,60,202,186,141,100,206,164,154,36]},"announce":[],"urlList":[]}}