{"title":"Sarah Vaughan - FLAC Collection part 1","uid":10401779,"size":14248672963,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ab7990e7b482ba19e8c2f466951b01c3f2a5893&amp;dn=Sarah+Vaughan+-+FLAC+Collection+part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":8,"uploader":"eika256","files":-1,"time":1403377190,"description":"Sarah Vaughan - FLAC Collection part 1\n\nPossessor of one of the most wondrous voices of the 20th century, Sarah Vaughan ranked with Ella Fitzgerald and Billie Holiday in the very top echelon of female jazz singers. She often gave the impression that with her wide range, perfectly controlled vibrato, and wide expressive abilities, she could do anything she wanted with her voice. Although not all of her many recordings are essential (give Vaughan a weak song and she might strangle it to death), Sarah Vaughan's legacy as a performer and a recording artist will be very difficult to match in the future.\nVaughan sang in church as a child and had extensive piano lessons from 1931-39; she developed into a capable keyboardist. After she won an amateur contest at the Apollo Theater, she was hired for the Earl Hines big band as a singer and second vocalist. Unfortunately, the musicians' recording strike kept her off record during this period (1943-44). When lifelong friend Billy Eckstine broke away to form his own orchestra, Vaughan joined him, making her recording debut. She loved being with Eckstine's orchestra, where she became influenced by a couple of his sidemen, Charlie Parker and Dizzy Gillespie, both of whom had also been with Hines during her stint. Vaughan was one of the first singers to fully incorporate bop phrasing in her singing, and to have the vocal chops to pull it off on the level of a Parker and Gillespie.\nOther than a few months with John Kirby from 1945-46, Sarah Vaughan spent the remainder of her career as a solo star. Although she looked a bit awkward in 1945 (her first husband George Treadwell would greatly assist her with her appearance), there was no denying her incredible voice. She made several early sessions for Continental: a December 31, 1944 date highlighted by her vocal version of &quot;A Night in Tunisia,&quot; which was called &quot;Interlude,&quot; and a May 25, 1945 session for that label that had Gillespie and Parker as sidemen. However, it was her 1946-48 selections for Musicraft (which included &quot;If You Could See Me Now,&quot; &quot;Tenderly&quot; and &quot;It's Magic&quot;) that found her rapidly gaining maturity and adding bop-oriented phrasing to poMuier songs. Signed to Columbia where she recorded during 1949-53, &quot;Sassy&quot; continued to build on her poMuierity. Although some of those sessions were quite commercial, eight classic selections cut with Jimmy Jones' band during May 18-19, 1950 (an octet including Miles Davis) showed that she could sing jazz with the best.\nDuring the 1950s, Vaughan recorded middle-of-the-road pop material with orchestras for Mercury, and jazz dates (including Sarah Vaughan, a memorable collaboration with Clifford Brown) for the label's subsidiary, EmArcy. Later record label associations included Roulette (1960-64), back with Mercury (1963-67), and after a surprising four years off records, Mainstream (1971-74). Through the years, Vaughan's voice deepened a bit, but never lost its power, flexibility or range. She was a masterful scat singer and was able to out-swing nearly everyone (except for Ella). Vaughan was with Norman Granz's Pablo label from 1977-82, and only during her last few years did her recording career falter a bit, with only two forgettable efforts after 1982. However, up until near the end, Vaughan remained a world traveler, singing and partying into all hours of the night with her miraculous voice staying in prime form. The majority of her recordings are currently available, including complete sets of the Mercury/Emarcy years, and Sarah Vaughan is as famous today as she was during her most active years. (AllMusic)\n\nAlbum list:\n1954-55 - Sarah Vaughan-In The Land Of Hi-Fi (2009)\n1955 - Sarah Vaughan In Hi-Fi (1997)\n1957 - At Mister Kelly's\n1957 - Sings George Gershwin\n1957 - Swingin' Easy\n1958 - No Count Sarah (MONO vinyl 24 96)\n1958 - Vaughan And Violins (2002)\n1959 - After Hours at the London House (2005)\n1959 - It`s You or No One (1993)\n1961 - After Hours\n1961 - Sarah Vaughan &amp; Count Basie (2007)\n1962 - Sarah + 2 (2006)\n1963 - Sarah Sings Soulfully\n1963 - Sassy Swings The Tivoli (vinyl 24 192)\n1964 - Sweet 'N' Sassy (Rem 2001)\n1965 - Sings The Mancini Songbook\n1965 - Viva! Vaughan\n1967 - It's a Man's World (2002)\n1971 - Monterey Jazz Festival (2007)\n1972 - Feelin good\n1973 - Live In Japan\n1973 - Sings With The Hollywood All Stars (vinyl 24 96)\n1977 - I Love Brazil! (1994)\n1978 - O Som Brasileiro De Sarah Vaughan\n1981 - Send In The Clowns\n1981 - Songs Of The Beatles\n1984 - The Pablo Years (vinyl 24 96)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:6ab7990e7b482ba19e8c2f466951b01c3f2a5893","amp;dn":"Sarah+Vaughan+-+FLAC+Collection+part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab7990e7b482ba19e8c2f466951b01c3f2a5893","infoHashBuffer":{"type":"Buffer","data":[106,183,153,14,123,72,43,161,158,140,47,70,105,81,176,28,63,42,88,147]},"announce":[],"urlList":[]}}