{"title":"Jonathan Clements - A Brief History of the Vikings [2005][A]","uid":10016752,"size":8443331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ac2e976bfcd5aa35c63c18a78be9d2a3cef7e42&amp;dn=Jonathan+Clements+-+A+Brief+History+of+the+Vikings+%5B2005%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":-1,"time":1398156340,"description":"Description\nProduct details\nBook Title: A Brief History of the Vikings\nBook Author: Jonathan Clements (Author)\nPaperback: 273 pages\nPublisher: Robinson Publishing (15 Sep 2005)\nLanguage: English\nISBN-10: 1845290763\nISBN-13: 978-1845290764\n============================\nBook Description\nPublication Date: 15 Sep 2005 | Series: A Brief History of\n'From the Fury of the Northmen deliver us, O Lord'. Between the eighth and eleventh centuries, the Vikings surged from their Scandinavian homeland to trade, raid and invade along the coasts of Europe. Their influence and expeditions extended from Newfoundland to Baghdad, their battles were as far-flung as Africa and the Arctic. But were they great seafarers or desperate outcasts, noble heathens or oafish pirates, the last pagans or the first of the modern Europeans? This concise study puts medieval chronicles, Norse sagas and Muslim accounts alongside more recent research into ritual magic, genetic profiling and climatology. It includes biographical sketches of some of the most famous Vikings, from Erik Bloodaxe to Saint Olaf, and King Canute to Leif the Lucky. It explains why the Danish king Harald Bluetooth lent his name to a twenty-first century wireless technology; which future saint laughed as she buried foreign ambassadors alive; why so many Icelandic settlers had Irish names; and, how the last Viking colony was destroyed by English raiders. Extending beyond the traditional 'Viking age' of most books, &quot;A Brief History of the Vikings&quot; places sudden Scandinavian population movement in a wider historical context. It presents a balanced appraisal of these infamous sea kings, explaining both their swift expansion and its supposed halt. Supposed because, ultimately, the Vikings didn't disappear: they turned into us.\n=============================\nAbout the Author\nJonathan Clements is the author of many books on East Asian history, including biographies of emperors and empresses, statesmen and warriors, foreign visitors and outcast rebels. His works have been translated into over a dozen languages, including French, Spanish, Korean and Dutch, and he achieved a rare distinction when his book on the First Emperor of China was itself published in Chinese.\n=============================\nMost Helpful Customer Reviews\n5.0 out of 5 stars A very good book which covers all the basics and important parts 9 Feb 2012\nBy valkyrie1008\nFormat:Paperback\nThis book is a suprisingly pleasant read and although it says Brief History on the front it doesn't feel like it. Each chapter gives enough details, dates, key characters, key locations etc that you are left satisfied not disappointed when it's time to move onto the next one. I am paritcularly impressed by the second to final chapter he's devoted to a key character not discussed in other history books I've read, Harald Hardrada. It allows you to follow him from his childhood through his years abroad gathering glory and treasure until he finally claims the throne of Norway and is lured to England with the death of Edward the Confessor. The other goods things are it of course looks at the Norse myths and gods and the influence on the Vikings, the Vikings impact on an international scale from the various countries they raided, fought in or discovered and settled. Whether this is a passing interest or a research project, you can not fail to learn a lot and have a developed understanding after reading this if you are interested in the vikings culture and history and people in any way at all.\n","torrent":{"xt":"urn:btih:6ac2e976bfcd5aa35c63c18a78be9d2a3cef7e42","amp;dn":"Jonathan+Clements+-+A+Brief+History+of+the+Vikings+%5B2005%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac2e976bfcd5aa35c63c18a78be9d2a3cef7e42","infoHashBuffer":{"type":"Buffer","data":[106,194,233,118,191,205,90,163,92,99,193,138,120,190,157,42,60,239,126,66]},"announce":[],"urlList":[]}}