{"title":"The Used - Discography (2002-2013) [FLAC]","uid":8583557,"size":2465520568,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b8f70849bafd0e24f227cf9f8990fc7a9e4603d&amp;dn=The+Used+-+Discography+%282002-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"politux","files":-1,"time":1371478634,"description":"\n  The Used - Discography (2002-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Screamo\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  2002 The Used\n  2003 Maybe Memories\n  2004 In Love and Death (Deluxe)\n  2007 Berth\n  2007 Lies for the Liars\n  2009 Artwork\n  2013 Vulnerable (Deluxe) \n\n  The members of the Used had to overcome poverty, homelessness, and substance abuse, not to mention the straitlaced attitudes of their hometown of Orem, Utah, to bring their screamo-tinged brand of post-hardcore to life. But they persevered and earned a contract with Reprise Records, releasing their self-titled debut album in June 2002. Having only played a handful of shows around Orem prior to their record's release, the band -- vocalist Bert McCracken, guitarist Quinn Allman, bassist Jeph Howard, and drummer Branden Steineckert -- began relentless nationwide touring that quickly saw their fan base multiply. Club dates soon turned into successful stints on larger-scale festival/package tours including the Warped Tour, Ozzfest, and Projekt Revolution alongside Linkin Park and Snoop Dogg. In the summer of 2003, the Used issued the introspective CD/DVD Maybe Memories, which contained unreleased songs, live material, behind-the-scenes footage, and more.\n\n  Their official sophomore offering showed up in September 2004 as In Love and Death, and the guys hopped on the first incarnation of the Taste of Chaos tour early the next year. Around that time, they also recorded a version of the Queen classic &quot;Under Pressure&quot; with My Chemical Romance to benefit victims of the devastating tsunami of December 2004. Boasting a fuller sound, In Love and Death peaked at number six on Billboard's Top 200 and the Used continued touring behind it worldwide. Outside of the band, McCracken has also lent his vocals to the punk rock drum troupe Street Drum Corps. As the Used readied their third album, Steineckert parted ways with the group over creative differences in early fall 2006 (he went on to join Rancid).\n\n  The live CD/DVD Berth appeared in February 2007 to tide over fans a bit longer until the proper full-length, Lies for the Liars, came out in May. Though he didn't perform on the record, drummer Dan Whitesides joined the band as an official member just in time for the supporting tour. The group's fourth full-length album, Artwork, was produced by Matt Squire (Panic at the Disco) and released on Reprise in 2009. 2012's Vulnerable, the band's fifth studio outing, and first for new label Hopeless, was preceded by the single &quot;I Come Alive.&quot; It was reissued the following year as Vulnerable (II) with a bonus disc stocked with B-sides, remixes, and acoustic tracks.","torrent":{"xt":"urn:btih:6b8f70849bafd0e24f227cf9f8990fc7a9e4603d","amp;dn":"The+Used+-+Discography+%282002-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b8f70849bafd0e24f227cf9f8990fc7a9e4603d","infoHashBuffer":{"type":"Buffer","data":[107,143,112,132,155,175,208,226,79,34,124,249,248,153,15,199,169,228,96,61]},"announce":[],"urlList":[]}}