{"title":"CRC Handbook of Fundamental Spectroscopic Correlation Charts","uid":15738690,"size":25321761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b90cf014711d7cf4a21d68e8992ecbd4d07b138&amp;dn=CRC+Handbook+of+Fundamental+Spectroscopic+Correlation+Charts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1472870443,"description":"CRC Handbook of Fundamental Spectroscopic Correlation Charts - Thomas J. Bruno, Paris D.N. Svoronos (CRC, 2006).pdf\r\n\r\nFrom forensics and security to pharmaceuticals and environmental applications, spectroscopic detection is one of the most cost-effective methods for identifying chemical compounds in a wide range of disciplines. For spectroscopic information, correlation charts are far more easily used than tables, especially for scientists and students whose own areas of specialization may lie elsewhere. The CRC Handbook of Fundamental Spectroscopic Correlation Charts provides a collection of spectroscopic information and unique correlation charts for use in the interpretation of spectroscopic measurements. \r\n\r\nThe handbook presents useful analysis and assignment of spectra and structural elucidation of organic and organometallic molecules. The correlation charts are compiled from an extensive search of spectroscopic literature and contain current, detailed information that includes new results for many compounds. The handbook includes graphical data charts for nuclear magnetic resonance spectroscopy of the most useful nuclei, as well as infrared and ultraviolet spectrophotometry. Because mass spectrometry data is not best represented graphically, the data are presented in tabular form, where mass spectrometry can be used for analyses and structural determinations in tandem with other techniques. In addition to presenting absorption bands and intensities for a variety of important functional groups and chemical families, the book also discusses instrument calibration, diagnostics, common solvents, fragmentation patterns, several practical conversion tables, and laboratory safety.\r\n\r\nNot intended to replace reference works that provide exhaustive spectral charts on specific compound classes, this book fills the need for fundamental charts that are needed on a general, day-to-day basis. The CRC Handbook of Fundamental Spectroscopic Correlation Charts is an ideal laboratory companion for students and professionals in academic, industrial, and government labs","torrent":{"xt":"urn:btih:6b90cf014711d7cf4a21d68e8992ecbd4d07b138","amp;dn":"CRC+Handbook+of+Fundamental+Spectroscopic+Correlation+Charts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b90cf014711d7cf4a21d68e8992ecbd4d07b138","infoHashBuffer":{"type":"Buffer","data":[107,144,207,1,71,17,215,207,74,33,214,142,137,146,236,189,77,7,177,56]},"announce":[],"urlList":[]}}