{"title":"Elizabeth Warren - A Fighting Chance (2014)","uid":10096730,"size":325311073,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6bddd1468b85601c00f2164a43faccfb61b12562&amp;dn=Elizabeth+Warren+-+A+Fighting+Chance+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SectorVector","files":-1,"time":1399314684,"description":"A Fighting Chance by Elizabeth Warren, read by the author.\n\n# Year: 2014\n# ISBN: 1427239169 | ASIN: B00JELM1C6\n# Durataion: 11 hours and 17 minutes\n# MP3 64 kbps\n\n\nAn unlikely political star tells the inspiring story of the two-decade journey that taught her how Washington really works -- and really doesn't.\n\n\nAs a child in small-town Oklahoma, Elizabeth Warren yearned to go to college and then become an elementary school teacher - an ambitious goal, given her family's modest means. Early marriage and motherhood seemed to put even that dream out of reach, but fifteen years later she was a distinguished law professor with a deep understanding of why people go bankrupt. Then came the phone call that changed her life: could she come to Washington DC to help advise Congress on rewriting the bankruptcy laws?\n\n\nThus began an impolite education into the bare-knuckled, often dysfunctional ways of Washington. She fought for better bankruptcy laws for ten years and lost. She tried to hold the federal government accountable during the financial crisis but became a target of the big banks. She came up with the idea for a new agency designed to protect consumers from predatory bankers and was denied the opportunity to run it. Finally, at age 62, she decided to run for elective office and won the most competitive -- and watched -- Senate race in the country.\n\n\nIn this passionate, funny, rabble-rousing audiobook, Warren shows why she has chosen to fight tooth and nail for the middle class -- and why she has become a hero to all those who believe that America's government can and must do better for working families.\n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/18779662-a-fighting-chance&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/18779662-a-fighting-chance&lt;/a&gt; - 4.55/5.0\n\n-_-\n\n(SB request by BranTarl)","torrent":{"xt":"urn:btih:6bddd1468b85601c00f2164a43faccfb61b12562","amp;dn":"Elizabeth+Warren+-+A+Fighting+Chance+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bddd1468b85601c00f2164a43faccfb61b12562","infoHashBuffer":{"type":"Buffer","data":[107,221,209,70,139,133,96,28,0,242,22,74,67,250,204,251,97,177,37,98]},"announce":[],"urlList":[]}}