{"title":"Charlotte Hinger-Lethal Lineage[Epub]","uid":16025626,"size":688173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c2737dc5c6017824a8710b21fbb04083a87a0c5&amp;dn=Charlotte+Hinger-Lethal+Lineage%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"twocows","files":5,"time":1476384145,"description":"Charlotte Hinger-Lethal Lineage\r\n\r\n\r\n\r\nA sinister Episcopal Bishop shows up to confirm Lottie and Josie Albright's niece at the new frame church built on the corners of four Western Kansas counties. The twins are already agitated over his scathing sermon when the Reverend Mary Farnsworth flees to the anteroom after dropping the chalice during communion. Josie, a psychologist, lingers after the service to comfort her, but Lottie immediately orders her sister to leave when they discover Reverend Mary's body. Alone with Talesbury, Lottie is frightened by the Bishop's cold, strange rituals for disposing of the spilled wine, but as Deputy Sheriff she's duty bound to attend to the death.Back at the county-wide picnic, an elderly lady informs Lottie that a man kneeling next to her scared Reverend Mary into a heart attack. Worried that this was not a natural death, Lottie calls in other law enforcement agencies. She soon learns that the beloved Reverend Mary was a woman without a past, and that the rogue Bishop has unexpected ties to Western Kansas. A sheriff from an adjacent county, unaware that Josie is an FBI consultant, assumes that seizing control of the investigation will be easy and instead arouses the twins' wrath","torrent":{"xt":"urn:btih:6c2737dc5c6017824a8710b21fbb04083a87a0c5","amp;dn":"Charlotte+Hinger-Lethal+Lineage%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c2737dc5c6017824a8710b21fbb04083a87a0c5","infoHashBuffer":{"type":"Buffer","data":[108,39,55,220,92,96,23,130,74,135,16,178,31,187,4,8,58,135,160,197]},"announce":[],"urlList":[]}}