{"title":"Weight Loss for Food Lovers (mAnaV)","uid":4774706,"size":1487266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c4a70df713bf992a387c11315cbddac89e69745&amp;dn=Weight+Loss+for+Food+Lovers+%28mAnaV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"msbisht","files":-1,"time":1237168618,"description":"Weight Loss for Food Lovers: Understanding the Psychology &amp; Sabotage of Weight Loss by Dr. George Blair-West \n\nThis is not another diet book. This is the book you read before you go on your next weight loss plan to arm yourself against the hardest part of weight loss, the psychological battle. If you are like most people who struggle with their weight you know exactly what you should eat and that you should exercise more. You don't need another book telling you what to eat or giving you gruelling exercise workouts. we eat what we know we should and why do we sabotage our healthy eating plans? In this fascinating, fun to read book, Dr Blair-West, medico and psychiatrist, explains why we sabotage and what to do about it. He explains why too much self-discipline is a problem, why we must keep our favourite high calorie foods in our diet and how we can do this and still lose weight. He also reviews the latest research that shows that exercise is not as important as previously thought when it comes to weight loss. In his chapter on children he gives parents tips on how to avoid the mistakes that can lead to obesity in children. Through Zen Buddhism he applies mindfulness to savouring and explains how we eat more because we taste less. He even addresses the big question of finding happiness in life and how people mistakenly pursue pleasures like eating and sex to find happiness. Do yourself a favor and read this book before you risk another demoralizing weight loss failure experience.\n\n\nPlz Seed...\n\nThnXX...\n\nmAnaV...\n\n\n","torrent":{"xt":"urn:btih:6c4a70df713bf992a387c11315cbddac89e69745","amp;dn":"Weight+Loss+for+Food+Lovers+%28mAnaV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c4a70df713bf992a387c11315cbddac89e69745","infoHashBuffer":{"type":"Buffer","data":[108,74,112,223,113,59,249,146,163,135,193,19,21,203,221,172,137,230,151,69]},"announce":[],"urlList":[]}}