{"title":"[FSX] LatinVFR - Cozumel Intl Airport","uid":7701372,"size":158924243,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c708e50a681d67af24e7cfd8d755338c9575a21&amp;dn=%5BFSX%5D+LatinVFR+-+Cozumel+Intl+Airport&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"_SnakEye","files":-1,"time":1349532302,"description":"Cozumel International Airport is situated in the island of Cozumel, Quintana Roo. It is located at the Caribbean Sea off the eastern coast of Mexico's Yucatan Peninsula, very near to Cancun. The island is about 48 km (30 mi) long and 16 km (9.9 mi) wide, and is Mexico's largest Caribbean island.\n This remarkable island has many interesting aspects including: Maya culture history, stunning coral reefs, incredible marine life and many appealing resorts to have wonderful and perfect vacations.  It is also a stop for Caribbean cruises by cruise lines Carnival, Celebrity, Crystal, Disney, Royal Caribbean, and others.\n \nCozumel International Airport handles national and international air traffic, receiving thousands of tourists all year. In 2011, the airport handled 441,692 passengers.\n As with the other nine airports in the Mexican southeast region, Cozumel International Airport is operated by the &quot;Grupo Aeroportuario del Sureste&quot; (ASUR) Airport Group.\n In 2003, the terminal was renovated and expanded. The airport is equipped with six boarding gates. It has two runways one for military use and another one for civilian use. \n","torrent":{"xt":"urn:btih:6c708e50a681d67af24e7cfd8d755338c9575a21","amp;dn":"%5BFSX%5D+LatinVFR+-+Cozumel+Intl+Airport","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c708e50a681d67af24e7cfd8d755338c9575a21","infoHashBuffer":{"type":"Buffer","data":[108,112,142,80,166,129,214,122,242,78,124,253,141,117,83,56,201,87,90,33]},"announce":[],"urlList":[]}}