{"title":"Warhammer: Shadow of the Horned Rat (1995) - WIN-ALL ","uid":8792072,"size":249171412,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d2df903be3664f5e23d816dad23240e3b506dc6&amp;dn=Warhammer%3A+Shadow+of+the+Horned+Rat+%281995%29+-+WIN-ALL+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1375975153,"description":"Warhammer: Shadow of the Horned Rat is a real-time tactics computer game published by Games Workshop (in conjunction with Mindscape) in 1995. It features medieval warfare and fantasy battles between military units at the squad and squadron level.\nDesign\n\nBased on Games Workshop's Warhammer Fantasy Battle table-top figurine battle rules and set within the Warhammer Fantasy world, the storyline focuses on a mercenary general's quest to stop a Skaven plot. Playing as the mercenary commander Morgan Bernhardt, the player must defeat a variety of foes in pitched battles using traditional fantasy battle methods such as shooting and close combat as well as magic. The finances of the mercenary army are handled by Paymaster Dietrich. The player is frequently given a choice of missions to accept, giving multiple paths through the game, some of which result in different mercenary units being available to the player.\n\nTroops killed in previous battles were not replaced (wounded troops were restored to the army in the next battle but one after sustaining their injury); this, in combination with the steeply increasing difficulty of battles meant that game missions soon became very hard. Unit losses were offset by the reinforcements that could be bought in most towns between missions. These reinforcements were bought with gold gained from combat, but the gold gained from combat was generally less than the replacement value of the lost troops. Only when the game was played with great skill did these reinforcements cover all the losses. Units gained experience and became better through use, but this in turn increased the cost of replacement. Another problem was that a fallen soldier could also be merely wounded, which would leave them out of the action for the next battle, after which they'd be healed for free. While this reduced the strain on the player's resources, it could result in the player having plenty of gold, but being unable to reinforce his or her army sufficiently to stand a chance in the next mission.\n\n\n1.Extract anywhere.\n2.Press &quot;START THE GAME&quot; batch file.\n3.Play.\n\nCompatible with WIN-ALL\t","torrent":{"xt":"urn:btih:6d2df903be3664f5e23d816dad23240e3b506dc6","amp;dn":"Warhammer%3A+Shadow+of+the+Horned+Rat+%281995%29+-+WIN-ALL+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2df903be3664f5e23d816dad23240e3b506dc6","infoHashBuffer":{"type":"Buffer","data":[109,45,249,3,190,54,100,245,226,61,129,109,173,35,36,14,59,80,109,198]},"announce":[],"urlList":[]}}