{"title":"Rocco Meats an American Angel in Paris (Evil Angel) XXX (DVDRip)","uid":11839195,"size":1470330880,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6d5bb435cdb67bfb3582a4b555bd7f4aa89eee41&amp;dn=Rocco+Meats+an+American+Angel+in+Paris+%28Evil+Angel%29+XXX+%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"xuluhulu","files":1,"time":1429817181,"description":"Savanna's a fan of Rocco's Animal Trainer series, and wrote to him asking if they could meet in Paris. When they do, it's lust at first sight! She's a charmer, a real natural, and a present to Rocco from her husband Daniel.\nHer pro porno-tour starts on-stage, stripping for a horny audience. In the hotel room Rocco introduces her to a Latina fox and lets her loose. As the girls play, Rocco hovers in true Animal Trainer fashion, fingering and pulling open orifices, guiding the new girl's tongue to previously unknown delights. The Maestro strikes, literally, her face, and by the time he's sealed her anal fate, it looks like the beginning of a beautiful, fucking friendship.\nStill professing his lust for Savanna, Rocco meets bespectacled French singer Lisa by the Seine, and takes her home for a change of pace. Sizzling in black PVC lingerie, she's a hog for his log, and Rocco's no less eager for her parts. Just stopping short of an act of cannibalism, he hungrily devours her cunt, arsehole and toes. Straddled on top, she screws him with her brown ring, and wanks him into her mouth. Not once does his todger touch her pussy.\nIt's Savanna's last day and Rocco lays a couple of pro studs on as a going away present. The lovely lady takes it all in her stride, attacking one fly front after the other, moulding the shape of things to cum with her hands and her mouth. By the time they mount, she's breathing hard, but starts breathing even harder when their meat bites deep in her asshole.\nFor the icing on the cake, Rocco provides three more dudes, body builders and boxers, who surround her and toss their joss onto her tongue. Rocco reckons that, in fifteen years in the biz, Savanna's one of the best.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=29936784546225018141.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=29936784546225018141.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=25034443748277192505.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=25034443748277192505.jpg&lt;/a&gt;\n\n\nCAST:\n\nSavanna Samson, Lisa Crowford, Amanda, Monica, Ovidie, Ksandra, Estelle, Carmen, Nacho Vidal, Max, Lou Luo, Ian Scott, Titof, Alam, Rocco Siffredi\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:6d5bb435cdb67bfb3582a4b555bd7f4aa89eee41","amp;dn":"Rocco+Meats+an+American+Angel+in+Paris+%28Evil+Angel%29+XXX+%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5bb435cdb67bfb3582a4b555bd7f4aa89eee41","infoHashBuffer":{"type":"Buffer","data":[109,91,180,53,205,182,123,251,53,130,164,181,85,189,127,74,168,158,238,65]},"announce":[],"urlList":[]}}