{"title":"Bee Gees - Discography (320kbps)","uid":6914054,"size":2397504879,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6da1bc00898404415e74a56320406eebbedfc6af&amp;dn=Bee+Gees+-+Discography+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"piratetorrent1989","files":260,"time":1324963580,"description":"The Bee Gees are a musical group which originally comprised three brothers: Barry, Robin and Maurice Gibb. The trio were successful for most of their 40-plus years of recording music, but they had two distinct periods of exceptional success: as a pop act in the late 1960s and early 1970s and as prominent performers of the disco music era in the late 1970s. The group sang three-part tight harmonies that were instantly recognisable; Robin's clear vibrato lead was a hallmark of their earlier hits, while Barry's R&amp;B falsetto became their signature sound during the late 1970s and 1980s. The brothers co-wrote all of their own hits, as well as writing and producing several major hits for other artists.\nBorn in the Isle of Man to English parents, the Gibb brothers lived their first few years in Chorlton, Manchester, England, then moved in the late 1950s to Redcliffe, Queensland, Australia, where they began their musical careers. After achieving their first chart success in Australia with &quot;Spicks and Specks&quot; (their 12th single), they returned to the United Kingdom in January 1967 where producer Robert Stigwood began promoting them to a worldwide audience. It has been estimated that the Bee Gees' career record sales total more than 220 million, making them one of the best-selling music artists of all time. They were inducted into the Rock and Roll Hall of Fame in 1997; the presenter of the award to &quot;Britain's first family of harmony&quot; was Brian Wilson, historical leader of the Beach Boys, a &quot;family act&quot; also featuring three harmonising brothers. The Bee Gees' Hall of Fame citation says &quot;Only Elvis Presley, The Beatles, Michael Jackson, Garth Brooks and Paul McCartney have outsold the Bee Gees&quot;.\nFollowing Maurice's sudden death in January 2003, Barry and Robin Gibb ended the group after 45 years of activity. In 2009, however, Robin announced that he and Barry had agreed that the Bee Gees would re-form and perform again.","torrent":{"xt":"urn:btih:6da1bc00898404415e74a56320406eebbedfc6af","amp;dn":"Bee+Gees+-+Discography+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da1bc00898404415e74a56320406eebbedfc6af","infoHashBuffer":{"type":"Buffer","data":[109,161,188,0,137,132,4,65,94,116,165,99,32,64,110,235,190,223,198,175]},"announce":[],"urlList":[]}}