{"title":"[2006] Inland Empire - David Lynch","uid":5506286,"size":2520742121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dafa0d4f338644aae6c1dbad96015a42c7445cc&amp;dn=%5B2006%5D+Inland+Empire+-+David+Lynch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"just_nobody","files":-1,"time":1271826961,"description":"Thanks to KamuiX @KG for this beautiful rip. English, French, and Portuguese subs on torrent. There are english hardcoded subs on polish dialogues.\n\nCinema of the surreal icon David Lynch follows up the success of his critically acclaimed 2001 feature Mulholland Drive with this dark mystery, shot on a handheld Sony PD150 digital video recorder. It is the tale of an actress whose personality becomes increasingly fragmented as she delves ever deeper into her work for a high-profile filmmaker. Kingsley (Jeremy Irons) is a director looking to adapt for the screen a Polish gypsy folktale that was previously stalled when the two leads were viciously murdered. Having offered the female lead to devoted actress Nikki (Laura Dern), Kingsley warns her male co-star, Devon (Justin Theroux), to maintain his professional distance, as Nikki's husband (Peter J. Lucas) is known to be notoriously possessive. As the passionate co-stars quickly cross the line and become lovers, Nikki's slowly slipping sense of reality causes her to eventually become lost in her character while the mysterious story of a Polish couple unfurls, and a trio of giant stage-bound rabbits (voices of Naomi Watts, Scott Coffey, and Laura Harring) lounge around on the sofa and tend to their domestic duties. Shot over the course of two and a half years and without a formalized script, Lynch's hallucinogenic look at a doomed film project features all of the abstract imagery and strange symbolism that have long made the director a favorite of film fans who embrace his disorienting approach to unconventional storytelling. (from allmovie.com)\n\nFile Name .........................................: Inland.Empire.2006.DVDRip.XviD-KamuiX.avi\nFile Size (in bytes) ............................: 2,520,526,848 bytes\nRuntime ............................................: 2:59:52\n\nVideo Codec ...................................: XviD 1.0.3\nFrame Size ......................................: 704x368 (AR: 1.913)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1670 kb/s\nBits per Pixel ...................................: 0.269 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 192 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\n\t\t\t\t\t &lt;a href=&quot;\nhttp://freakyflicks.proboards.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6dafa0d4f338644aae6c1dbad96015a42c7445cc","amp;dn":"%5B2006%5D+Inland+Empire+-+David+Lynch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dafa0d4f338644aae6c1dbad96015a42c7445cc","infoHashBuffer":{"type":"Buffer","data":[109,175,160,212,243,56,100,74,174,108,29,186,217,96,21,164,44,116,69,204]},"announce":[],"urlList":[]}}