{"title":"Chevelle - Greatest Hits (2009) - [kn0wnunkn0wn]","uid":4835269,"size":106786829,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e62fe9e0176979986e050ee9f5ed73cf43d114d&amp;dn=Chevelle+-+Greatest+Hits+%282009%29+-+%5Bkn0wnunkn0wn%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"kn0wnunkn0wn","files":-1,"time":1239294802,"description":"Chevelle's Greatest Hits\n\nTRACKLIST in Details\n\nAll Tracks Ripped By [kn0wnunkn0wn]\n\nBitrates Between 237 &amp; 320\n\n~BIO~\n\nInspired by the lurching riffs of Helmet and the soft/loud vocal styling of Tool, Chicago-based trio Chevelle's aggressive, heavy sound is all about mounting tension exploding into raw guitar bursts. Formed in 1995, Chevelle comprised brothers Sam (drums), Pete (vocals, guitar), and Joe Loeffler (bass), the last of whom joining up after he played better than the gang's original bassist. They started out playing parties and outdoor events, which quickly led to bookings at Chicago clubs when youngest member Joe was just 14. In 1999, Chevelle released their Steve Albini-produced debut album, Point 1, on Squint Entertainment. Three years later -- and following tours with bands like Filter, Sevendust, Powerman 5000, and Machine Head -- the band had inked a deal with Epic and issued Wonder What's Next, released in August 2002. The album went platinum by the next summer and their second single, &quot;Send the Pain Below,&quot; was a number one hit on modern rock and mainstream radio. Main stage dates with the annual Ozzfest tour followed that summer, and 2003 brought a concert album, Live from the Road. Chevelle returned in the fall of 2004 with their third full-length, This Type of Thinking (Could Do Us In), and with it came another hit song, &quot;Vitamin R (Leading Us Along).&quot; Joe parted ways with his brothers in July 2005, and though he was replaced on bass a month later by Dean Bernardini, Chevelle remained a family affair, since Bernardini was their brother-in-law. With the new member came a newfound energy and optimism that replaced the internal bickering of the past, and the guys carried that spirit into the recording of their next album, April 2007's Vena Sera. Please Enjoy And Seed, Thanks for Downloading :)\n","torrent":{"xt":"urn:btih:6e62fe9e0176979986e050ee9f5ed73cf43d114d","amp;dn":"Chevelle+-+Greatest+Hits+%282009%29+-+%5Bkn0wnunkn0wn%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e62fe9e0176979986e050ee9f5ed73cf43d114d","infoHashBuffer":{"type":"Buffer","data":[110,98,254,158,1,118,151,153,134,224,80,238,159,94,215,60,244,61,17,77]},"announce":[],"urlList":[]}}