{"title":"Criticism of the Western Civilization - Collection 43 (Pollution","uid":11033918,"size":262283954,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e78caccc5eaca5e0ceca05dad4bebc6e8278b61&amp;dn=Criticism+of+the+Western+Civilization+-+Collection+43+%28Pollution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"moman73","files":25,"time":1410759240,"description":"Criticism of the Western Civilization - Collection 43 (Pollution, Environment Disasters):\n\nWe have 25 titles in this upload. They discuss man-made disasters that had grave impact on the environment. Corporate greed and human errors are the major culprits in most of the crimes committed against mother Earth.\n\n-  Blackwell - Visit Sunny Chernobyl and Other Adventures in the World's Most Polluted Places (2012)\n\n-  Booth - The Environmental Consequences of Growth; Steady-State Economics as an Alternative to Ecological Decline (1998)\n\n-  Final Report on the Investigation of the Macondo Well Blowout, Deep Water Study Group, March1, 2011\n\n-  Fortun - Advocacy after Bhopal; Environmentalism, Disaster, New Global Orders (2001)\n\n-  Frickel - Chemical Consequences; Environmental Mutagens, Scientist Activism, and the Rise of Genetic Toxicology (2004)\n\n-  Holand - Offshore Blowouts; Causes and Control (1997)\n\n-  Iversen - Full Body Burden; Growing Up in the Nuclear Shadow of Rocky Flats (2012)\n\n-  Juhasz - Black Tide; the Devastating Impact of the Gulf Oil Spill (2011)\n\n-  Kletz - What Went Wrong; Case Histories of Process Plant Disasters and How They Could Have Been Avoided (2009)\n\n-  Kostianoy &amp; Lavrova (Eds.) - Oil Pollution in the Baltic Sea (2014)\n\n-  Macondo Well Deepwater Horizon Blowout; Lessons for Improving Offshore Drilling Safety (NAE &amp; NAS, 2012)\n\n-  Mahaffey - Atomic Accidents; a History of Nuclear Meltdown and Disasters from the Ozark Mountains to Fukushima (2014)\n\n-  Mara - The Chernobyl Disaster; Legacy and Impact on the Future of Nuclear Energy (2011)\n\n-  Mukherjee - Surviving Bhopal; Dancing Bodies, Written Texts, and Oral Testimonials of Women in an Industrial Disaster (2010)\n\n-  Nikiforuk - Tar Sands; Dirty Oil and the Future of a Continent (2010)\n\n-  Ochiai - Hiroshima to Fukushima; Biohazards of Radiation (2014)\n\n-  Oil in the Sea III; Inputs, Fates, and Effects (NRC, 2003)\n\n-  Petryna - Life Exposed; Biological Citizens after Chernobyl (2002)\n\n-  Potters - Marine Pollution (2013)\n\n-  Povinec et  al - Fukushima Accident; Radioactivity Impact on the Environment (2013)\n\n-  Price - The Orphaned Land; New Mexico's Environment Since the Manhattan Project (2011)\n\n-  Read - BP and the Macondo Spill; The Complete Story (2011)\n\n-  Stern - The Buffalo Creek Disaster (1976)\n\n-  Vallero - Unraveling Environmental Disasters (2013)\n\nNote that more titles about the this topic were uploaded within collection 5 of this series.\n\n\n","torrent":{"xt":"urn:btih:6e78caccc5eaca5e0ceca05dad4bebc6e8278b61","amp;dn":"Criticism+of+the+Western+Civilization+-+Collection+43+%28Pollution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e78caccc5eaca5e0ceca05dad4bebc6e8278b61","infoHashBuffer":{"type":"Buffer","data":[110,120,202,204,197,234,202,94,12,236,160,93,173,75,235,198,232,39,139,97]},"announce":[],"urlList":[]}}