{"title":"The Demographic Cliff - How To Survive And Prosper During The Gr","uid":9530954,"size":60239754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fdf89caf003d07996ed55ee76a37b89cd601124&amp;dn=The+Demographic+Cliff+-+How+To+Survive+And+Prosper+During+The+Gr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1390843865,"description":"The Demographic Cliff: How to Survive and Prosper During the Great Deflation of 2014-2019 by Harry S Dent Jr\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Non-Fiction/Economics/Finance\nDate: 7 January 2014\n\nBestselling author and financial guru Harry Dent shows why we're facing a &quot;great deflation&quot; after five years of desperate stimulus--and what to do about it now. \n\nThroughout his long career as an economic forecaster, Harry Dent has relied on a not-so-secret weapon: demographics. Studying the predictable things people do as they age is the ultimate tool for understanding trends. For instance, Dent explains why we now face a growing demographic cliff with the accelerating retirement of the Baby Boomers around the world.\n\nBut now, Dent argues, the fundamental demographics have turned against the United States and will hit more countries ahead. Inflation rises when a larger than usual block of younger people enter the workforce, and it wanes when large numbers of older people retire, downsize their homes, and cut their spending. The mass retirement of the Boomers won't just hold back inflation; it and massive debt deleveraging will actually cause deflation--weakening the economy the most from 2014 into 2019.\n\n* BUSINESSES should get lean and mean now. Identify segments that you can clearly dominate and sell off or shut down others. If you don't, the economy will do it for you, more painfully and less profitably.\n* INVESTORS should sell stocks by mid-January 2014 and look to buy them back in 2015 or later at a Dow as low as 5,800.\n* FAMILIES should wait to buy real estate in areas where home prices have gone back to where the bubble started in early 2000.\n* GOVERNMENTS need to stop the endless stimulus that creates more bubbles and kills the middle class, and should assist in restructuring the unprecedented debt bubble of 1983?2008.\n\nAuthor:\n\nHARRY S. DENT, JR. is the author of the New York Times bestseller The Great Depression Ahead (2009) among many other economic and financial books. He is the president of the H.S. Dent Foundation and founder of Dent Research, which publishes Survive and Prosper, Boom and Bust and The HS Dent Forecast. He has an MBA from Harvard, has consulted to Fortune 100 companies and many new ventures, and lectures widely. He lives in Tampa, Florida.","torrent":{"xt":"urn:btih:6fdf89caf003d07996ed55ee76a37b89cd601124","amp;dn":"The+Demographic+Cliff+-+How+To+Survive+And+Prosper+During+The+Gr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fdf89caf003d07996ed55ee76a37b89cd601124","infoHashBuffer":{"type":"Buffer","data":[111,223,137,202,240,3,208,121,150,237,85,238,118,163,123,137,205,96,17,36]},"announce":[],"urlList":[]}}