{"title":"Applied Statistics (gnv64)","uid":8882777,"size":14841153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fe4cdbc9c34fd7dbe9b3ac6dbc73ede154e6f27&amp;dn=Applied+Statistics+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":-1,"time":1378375717,"description":"Applied Statistics\nBy Mohammed A. Shayib\nBookboon | 2013 | ISBN-13: 978-87-403-0493-0 | True PDF | 300 pages | 14.1 mb\n\nApplied Statistics has come into existence as an outcome of an experiment and wide experience of more than 40 years. Applied Statistics is intended to introduce the concepts, definitions, and terminology of the subject in an elementary presentation with minimum mathematical background which does not surpass college algebra. Applied Statistics should prepare the reader to make a good decision based on data. The material, contained in Applied Statistics, can be covered in a 15-week, 3-hours-per-week semester, with little adjustment as time allows.\n\nCONTENTS\nPreface\n1.Descriptive Statistics\n2.Random Variables and Probability Distributions\n3.Estimation\n4.Testing of Statistical Hypotheses\n5.Simple Linear Regression and Correlation\n6.Other Tests and Analysis Of Variance\n7.Appendix A Tables\n8.References\n\nAbout the Author\nAfter he graduated from The Evangelical National Institute, High School, Sidon, Lebanon, June 1963, he was awarded a scholarship by UNRWA to continue my college degree. His scholarship was transferred to Egypt, and he enrolled in the College of Sciences, Ain Shams University, Cairo, Egypt. He had my four years of college, and chose Mathematics as my major. Despite the war in June 1967, during the final exams of my senior year, he graduated with Distinction, First Class honor, and got my B. Sc. Degree. He spent two years at AUB, Beirut, Lebanon. After those two years got my MS degree.\nIn1972 he left Beirut, Lebanon, to USA, via Cairo airport. I attended New Mexico State University, Las Cruces, NM, USA, for two years before changing his major of study and went to Texas Tech University, Lubbock, TX. &amp; got another MS degree before I left NMSU. In 1979, he was awarded my Ph D in Mathematics, with concentration in Statistics. One week later he was hired by Cottey College, Nevada, Missouri, USA, for one year. Worked for 10 years in the departments of Mathematics, and Statistics and Operations Research, Kuwait University. Joined Prairie View A&amp;M University, Department of Mathematics, Sept. 1, 2004, where HE IS now a tenured Associate Professor.","torrent":{"xt":"urn:btih:6fe4cdbc9c34fd7dbe9b3ac6dbc73ede154e6f27","amp;dn":"Applied+Statistics+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe4cdbc9c34fd7dbe9b3ac6dbc73ede154e6f27","infoHashBuffer":{"type":"Buffer","data":[111,228,205,188,156,52,253,125,190,155,58,198,219,199,62,222,21,78,111,39]},"announce":[],"urlList":[]}}