{"title":"MindNode 2.2.3 [MAC OS X]","uid":13799058,"size":26965958,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6fea925a6d6a6fa139da1633beaab7dc7309400c&amp;dn=MindNode+2.2.3+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"iAlexander","files":1,"time":1457439515,"description":"MADE IN UKRAINE\r\n\r\nMindNode 2.2.3 – Elegant mind mapping application.\r\n\r\nMindNode Pro is a powerful and intuitive mind mapping application. Its focus and flexibility make it the perfect tool for brainstorming and organizing your life – and iCloud sharing means you always have your mind maps with you. MindNode lets you lay out your notes and tasks visually so you can get a bird’s-eye view of your project. The clutter-free interface lets you concentrate on generating and connecting ideas, and an infinitely expanding canvas means that no matter how big or complicated your project gets, MindNode can keep up.\r\n\r\n- Create new nodes with one click\r\n- Create cross connections between otherwise unrelated nodes\r\n- Drag and drop to move or reconnect nodes\r\n- Add images and links to files or webpages\r\n- Create multiple mind maps on one canvas\r\n- Infinitely large canvas expands to keep up with your ideas\r\n- Lion fullscreen mode lets you brainstorm without distractions Organize\r\n- Hide and show nodes and branches with one click\r\n- Drag and drop nodes to rearrange your mind map\r\n- Automatically reorganize complicated mind maps\r\n- Highlight important nodes using different colors, fonts, and stroke widths\r\n- Search lets you find any node, even if it’s hidden-no matter how big the mind map gets Share\r\n- WiFi sharing: share files between your Mac and your iOS device over the local wireless network\r\n- Export your mind map as a PDF, FreeMind or OPML document, PNG or TIFF image, or RTF or text outline. More MindNode:\r\n- MindNode touch Create mind maps with a tap of your finger on your iPad, iPhone, and iPod touch. Available on the iOS App Store.\r\n- MindNode Lite Explore MindNode’s basic features before investing in MindNode Pro. Available on the Mac App Store.\r\n\r\nWhat’s new in version 2.2.3:\r\n\r\n- Allow to create a new cross connection with only the keyboard (Cmd-L)\r\n- Added link support to FreeMind importer\r\n- Fixes cross connection menu item validation\r\n- Correctly copy and paste text with more than one line\r\n- Fixes view state restoration\r\n- Don’t close the outline when the mind map reloads due to an iCloud update\r\n- Correctly scroll to node when editing the title\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:6fea925a6d6a6fa139da1633beaab7dc7309400c","amp;dn":"MindNode+2.2.3+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fea925a6d6a6fa139da1633beaab7dc7309400c","infoHashBuffer":{"type":"Buffer","data":[111,234,146,90,109,106,111,161,57,218,22,51,190,170,183,220,115,9,64,12]},"announce":[],"urlList":[]}}