{"title":"Harold Bloom - Anxiety of Influence: A Theory of Poetry (1997)","uid":8551769,"size":5561973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7033287ae9e42b51eead2b91d049b6e5eb4f704e&amp;dn=Harold+Bloom+-+Anxiety+of+Influence%3A+A+Theory+of+Poetry+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"workerbee","files":-1,"time":1370657344,"description":"Harold Bloom - The Anxiety of Influence: A Theory of Poetry, 2nd edition (Oxford University Press, 1997).\n\nISBN: 9780195112214 | 208 pages | PDF\n\n\nHarold Bloom's The Anxiety of Influence has cast its own long shadow of influence since it was first published in 1973.\n\nThrough an insightful study of Romantic poets, Bloom puts forth his central vision of the relations between tradition and the individual artist. Although Bloom was never the leader of any critical &quot;camp&quot;, his argument that all literary texts are a response to those that precede them had an enormous impact on the practice of deconstruction and poststructuralist literary theory in this country. Written in a moving personal style, anchored by concrete examples, and memorably quotable, Bloom's book maintains that the anxiety of influence cannot be evaded -- neither by poets nor by responsible readers and critics.\n\nThis second edition contains a new Introduction, which explains the genesis of Bloom's thinking and the subsequent influence of the book on literary criticism of the past twenty years.criticism of the past twenty years. Here, Bloom asserts that the anxiety of influence comes out of a complex act of strong misreading, a creative interpretation he calls &quot;poetic misprision.&quot; The influence-anxiety does not so much concern the forerunner but rather is an anxiety achieved in and by the story, novel, play, poem, or essay. In other words, without Keats's reading of Shakespeare, Milton, and Wordsworth, we could not have Keats's odes and sonnets and his two Hyperions.\n\nThe Anxiety of Influence remains a central work of criticism for all students of literature.\n\n\nReviews\n\n&quot;Bloom has helped to make the study of Romantic poetry as intellectually and spiritually challenging a branch of literary studies as one may find.&quot; -- New York Times Book Review\n\n&quot;This book will assuredly come to be valued as a major twentieth-century statement on the subject of tradition and individual talent.&quot; -- David J. Gordon, The Yale Review\n","torrent":{"xt":"urn:btih:7033287ae9e42b51eead2b91d049b6e5eb4f704e","amp;dn":"Harold+Bloom+-+Anxiety+of+Influence%3A+A+Theory+of+Poetry+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7033287ae9e42b51eead2b91d049b6e5eb4f704e","infoHashBuffer":{"type":"Buffer","data":[112,51,40,122,233,228,43,81,238,173,43,145,208,73,182,229,235,79,112,78]},"announce":[],"urlList":[]}}