{"title":"Socom 2 U.S. Navy Seals (NTSC) PS2","uid":6470258,"size":2669944691,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7037f26bdaaab104d8736d9690b4686581b4ace2&amp;dn=Socom+2+U.S.+Navy+Seals+%28NTSC%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big_dude","files":-1,"time":1308104700,"description":"Socom 2 U.S. Navy Seals for the Ps2                               Rel. 11/04/2003\n\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action, Strategy\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\n\nRelease Notes:  It seems the only way to play online with this game is to have\n                the original game with an unmodded PS2. The DNAS has been \n                patched though. Their may be ways around this but I had to disable \n                my modchip on my ps2 and use the retail game for online play FYI.\n\n\n\nGame Description:\n\nThe world's terrorists have targeted America and her allies. As an elite SEAL commander, your team's orders are simple - strike targets of importance within 12 intense international missions quietly and successfully - and protect freedom across the globe. Utilizing the best weaponry, technology and training available, accept no outcome but victory. \n\nIn SOCOM II, players don't combat threads and tactical prowess as an elite SEAL commander in the solo mode. You bark orders through the accompanying voice-recognizing headset (sold separately), you move in the shadows with pin-drop precision, and you don't evacuate until every last objective is scratched off the list. Twelve epic, international missions are your theater, spanning the globe from intense urban cities to the thick jungles of South America. \n\nBeyond the single player bouts, wherein you are the guiding force, SOCOM II was designed specifically with the online addict in mind. Supporting up to 16 gamers, there are five mission types to choose from, clan rankings, Medals of Merit, friends' lists (for easy location of your buddies), and the much-lauded ability to radio in air strikes. \n\n100% unmatched authenticity is the goal of this game. The association with Naval Special Warfare continues to provide the most realistic military strategy gameplay around.\n\n\nFeatures:\n\n* Confront deadly enemies with the most skilled Special Ops force ever assembled, \n  including collaboration with (Russian) Spetznaz and (British) SAS groups. \n\n* Battle the world's terrorists in 12 intense missions, including operations in \n  Brazil, Russia, Albania and Algeria. \n\n* Command and strategize with SEALs and other special operations forces with a  \n  SOCOM-compatible headset (sold separately). \n\n* Lead your SEAL team in single player mode, or exchange fire with and against up \n  to 16 total players via enhanced online gameplay - including five mission \n  types, clan rankings, Medals of Merit, friends' lists, and the ability to call \n  in air strikes. \n\n* Association with Naval Special Warfare Command ensures realistic SEAL gameplay.\n\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:7037f26bdaaab104d8736d9690b4686581b4ace2","amp;dn":"Socom+2+U.S.+Navy+Seals+%28NTSC%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7037f26bdaaab104d8736d9690b4686581b4ace2","infoHashBuffer":{"type":"Buffer","data":[112,55,242,107,218,170,177,4,216,115,109,150,144,180,104,101,129,180,172,226]},"announce":[],"urlList":[]}}