{"title":"The Movie Book - Big Ideas Simply Explained (2016) Gooner","uid":13744391,"size":543540822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70ac4dc64c20d5c55ae66e8e763316854024cd8e&amp;dn=The+Movie+Book+-+Big+Ideas+Simply+Explained+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":4,"time":1457109460,"description":"The Movie Book - Big Ideas Simply Explained (2016) (DK Publishing) (Pdf, Epub &amp; Mobi) Gooner\r\n\r\nQuality: Original Epub, Pdf &amp; Mobi - Conversion of Epub\r\nPublisher: DK (January 5, 2016)\r\nLanguage: English\r\nISBN-10: 1465437991\r\nISBN-13: 978-1465437990\r\n\r\nThe Movie Book, the latest in DK's award-winning Big Ideas Simply Explained series, profiles 100 of the best movies ever made throughout the world.\r\n\r\nFrom classic 1930s film noir and Hollywood romance to international art-house and 21st-century sci-fi, The Movie Book brings the world's most influential films to life with its illustrative design. Unforgettable quotes, film stills, and original posters and memorabilia transport you to the world of each film, while narrative timelines and infographics explore central themes, characters, actors, and directors.\r\n\r\nRelive classics of the silent era, such as Nosferatu, along with wartime greats like Casablanca, transformative New Wave films such as Lawrence of Arabia and Easy Rider, and modern masterpieces like Do the Right Thing, City of God, and Gravity. Each movie is placed in the broader context of the industry and its key players, making it an invaluable resource for any film fanatic.\r\n\r\nThe Movie Book zooms in on the best cinematic masterpieces of all time and is a must-have for anyone with a passion for films and the history of cinema.\r\n\r\nBig Ideas Simply Explained series uses creative design and innovative graphics, along with straightforward and engaging writing, to make complex subjects easier to understand. These award-winning books provide just the information needed for students, families, or anyone interested in concise, thought-provoking refreshers on a single subject","torrent":{"xt":"urn:btih:70ac4dc64c20d5c55ae66e8e763316854024cd8e","amp;dn":"The+Movie+Book+-+Big+Ideas+Simply+Explained+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ac4dc64c20d5c55ae66e8e763316854024cd8e","infoHashBuffer":{"type":"Buffer","data":[112,172,77,198,76,32,213,197,90,230,110,142,118,51,22,133,64,36,205,142]},"announce":[],"urlList":[]}}