{"title":"The Low Light Photography Field Guide- Michael Freeman [PDF] [St","uid":11102202,"size":9668681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:710635a43a082eab9d218e45e5a927e3e07c5e62&amp;dn=The+Low+Light+Photography+Field+Guide-+Michael+Freeman+%5BPDF%5D+%5BSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"krystine","files":-1,"time":1411682924,"description":"The Low Light Photography Field Guide: The essential guide to getting perfect images in challenging light\nAuthor: Michael Freeman\nPublished: 2011\nPublisher: Focal Press \nISBN: 9780240820804\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nIn bright light, it is easier to take a beautiful photograph with your DSLR.  When the sun starts to go down or you are shooting indoors, a whole new skill set is needed.  This new addition to the successful Field Guide Series will help you shoot what potentially could be the most lovely image without the help of natural light.  No more harsh flash photographs with dreary backgrounds and no more blurry night shots that were exposed too long. Opening with a section on the qualities of different kinds of low light, the book then deals with ways of overcoming gloomy situations, whether you are shooting hand-held or on a tripod.  Post-production fixes are also covered, allowing you to turn difficult shots into real works of art.","torrent":{"xt":"urn:btih:710635a43a082eab9d218e45e5a927e3e07c5e62","amp;dn":"The+Low+Light+Photography+Field+Guide-+Michael+Freeman+%5BPDF%5D+%5BSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710635a43a082eab9d218e45e5a927e3e07c5e62","infoHashBuffer":{"type":"Buffer","data":[113,6,53,164,58,8,46,171,157,33,142,69,229,169,39,227,224,124,94,98]},"announce":[],"urlList":[]}}