{"title":"Dzi.Croquettes.2009.Brazilian.DVDRip.AC3.HORiZON-ArtSubs","uid":6166720,"size":1486653516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71411240e25350601fff26d0657f60c78ce101f9&amp;dn=Dzi.Croquettes.2009.Brazilian.DVDRip.AC3.HORiZON-ArtSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"noriegaRJ","files":-1,"time":1297416706,"description":"Title / Titulo: Dzi Croquettes\nYear / Ano: 2009 \nCountry / Pais: Brazil / Brasil\nLanguage / Lingua: Portuguese and English and French (Portugues, Ingles e Frances)\nSource: DVDRIP\nSize / Tamanho: 1,38 GB \nGenre / Genero: Documentary | Biography | Drama | Music | Musical (Documentario / Biografia / Drama / Musical)\nRuntime / DuraÃƒÂ§ÃƒÂ£o: 110 min\nResolution / ResoluÃƒÂ§ÃƒÂ£o: 704 X 368\nBitrates: 448kbps\nFPS: 23.976\nVideo Codec: XVID\nAudio Codec: AC3 - 5.1\nDirected by / Dirigido por: Raphael Alvarez and Tatiana Issa\nStarring / Estrelando: Dzi Croquettes\nInterviewed / Entrevistados: Liza Minnelli, Ron Lewis, Norma Bengell, Maria Zilda Bethlem, Cesar Camargo Mariano, Pedro Cardoso, Miguel Falabella, Betty Faria, Jorge Fernando, Aderbal Freire Filho, Gilberto Gil, Elke Maravilha, Ney Matogrosso, Luis Carlos Miele, Nelson Motta, Marilia Pera, Jose Possi Neto, Claudia Raia\n\nIMDB Rate / Nota IMDB: 8/10\n\nIMDB Link:  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1532945/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1532945/&lt;/a&gt;\n\nPlot: The Dzi Croquettes - A Brazilian theater group that through talent, irony and humor confronted the Brazilian government and its violent dictatorship. They were banned and censored by the military regime and yet revolutionized the gay movement worldwide changing Theater and Dance language to an entire generation. Their history embraces Brazilian pop culture of the 1970's and 1980's, the violent years of dictatorship in Brazil, the sexual revolution, the beginning of the AIDS era and, above all, the enormous legacy that would remain unforgettable to every single person that had the opportunity to see their work. They were loved and admired by luminaries such as Mick Jagger, Jeanne Moreau, Omar Sharif, Maurice BÃƒÂ©jart, Josephine Baker and Liza Minnelli, who became a personal friend and played a major role in bringing them to Paris and subsequently to fame. The director's father (Americo Issa) worked with the group from 1970 to 1978. (IMDB)\n\n\nTHIS TORRENT HAS SUBTITLES IN ENGLISH, FRENCH AND BRAZILIAN PORTUGUESE.\n\n\nThanks to those helping me seed. Leechers remember, the community depends on you. If nobody shares, the freebies go away. Remember, the only reason you can download this free movie is because others are generous enough to keep sharing it with you. If nobody shares, everybody loses, so even if its for an extra hour or two after you get it, remember, others want to see it too, and they can't without you.\n\n\nSEE MY OTHERS UPLOADS:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/noriegaRJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/noriegaRJ&lt;/a&gt;\n\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxx +++++++++++++++++++++ xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\n\nSinopse: A trajetÃƒÂ³ria do irreverente grupo carioca Dzi Croquettes, que marcou o cenÃƒÂ¡rio artÃƒÂ­stico brasileiro nos anos 70. O conjunto contestava a ditadura por meio do deboche e da ironia e defendia a quebra de tabus sociais e sexuais. O grupo ÃƒÂ© lembrado por depoimentos de artistas e amigos como Liza Minnelli, Ron Lewis, Gilberto Gil, Nelson Motta, MarÃƒÂ­lia PÃƒÂªra, Ney Matogrosso, Betty Faria, JosÃƒÂ© Possi Neto, MiÃƒÂ©le, Jorge Fernando, CÃƒÂ©sar Camargo Mariano, ClÃƒÂ¡udia Raia, Miguel Falabella, Pedro Cardoso e Norma Bengell.\n\n\nESTE TORRENT TEM LEGENDAS EM INGLES, EM FRANCES E EM PORTUGUES (NORMAL E ESPECIAL).\n\n\nObrigado a todos que me ajudarem a semear. Lembrem-se que este filme so se mantera vivo se voce compartilha-lo com os demais, e que voce so o conseguiu baixar porque outros o estavam generosamente semeando. Um abraÃƒÂ§o.\n\n\nVEJA MEUS OUTROS UPLOADS TAMBEM:                            &lt;a href=&quot;\nhttp://thepiratebay.se/user/noriegaRJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/noriegaRJ&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:71411240e25350601fff26d0657f60c78ce101f9","amp;dn":"Dzi.Croquettes.2009.Brazilian.DVDRip.AC3.HORiZON-ArtSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71411240e25350601fff26d0657f60c78ce101f9","infoHashBuffer":{"type":"Buffer","data":[113,65,18,64,226,83,80,96,31,255,38,208,101,127,96,199,140,225,1,249]},"announce":[],"urlList":[]}}