{"title":"Forbidden Zone [Color] (2012) 720p BrRip x264 - CLOWNSEC (Phreak","uid":9022692,"size":2036922320,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:715f937e23f3ab3a8c17b5dc2c2b8c47227137f3&amp;dn=Forbidden+Zone+%5BColor%5D+%282012%29+720p+BrRip+x264+-+CLOWNSEC+%28Phreak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clownsec","files":-1,"time":1381305249,"description":"Forbidden Zone [Color] (2012) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nAmazon.com\nWords like &quot;delirious&quot; and &quot;bizarre&quot; simply don't suffice to describe Forbidden Zone, director Richard Elfman's 1980 musical fantasy that makes its DVD debut after two decades as a cult favorite. Conceived as an extension of the avant-garde theater troupe/music group the Mystic Knights of the Oingo Boingo (later just Oingo Boingo, which counted Elfman, his brother Danny, and co-scripter Matthew Bright--later the director of Freeway--among its members), Forbidden Zone tells the story of Frenchy (production designer Marie-Pascal Elfman, Richard's then-wife), who accidentally enters the phantasmagorical Sixth Dimension through a door in her basement. There, her waifish good looks catch the eye of King Fausto (Herve Villechaize), much to the consternation of Queen Doris (the indomitable Susan Tyrell). A frantic, funny, and occasionally profane blend of Fleischer Brothers cartoons, German Expressionism, Depression-era musicals, and '60s underground movies, Forbidden Zone is definitely not for all viewers, but cult aficionados will be delighted by the sheer energy and imagination of this long-unavailable classic. Supplemental features include commentary by Elfman and Bright, interviews with Danny Elfman, Pascal, and Tyrell; deleted scenes and outtakes; clips from an aborted early attempt, The Hercules Family. (with Danny tearing up &quot;Minnie the Moocher&quot;), and Richard's video for Oingo Boingo's &quot;Private Life.&quot; --Paul Gaita\n\nProduct Description\nPrepare to enter the Sixth Dimension, a deliriously insane world of frog butlers, topless princesses, machine-gun toting school teachers, chicken boys and the devil himself (Danny Elfman), all ruled by the lascivious midget King Fausto (Herve Villechaize - Tattoo on FANTASY ISLAND) and his deranged Queen (Susan Tyrrell). A feast of visual and aural delights, reaching new found heights of insanity, invention and questionable taste. Propelled by the incredible songs of the one and only Danny Elfman, FORBIDDEN ZONE is an experience like no other. The all time cult classic returns with an eye popping new high definition widescreen transfer and restored and remastered in 5.1 Dolby Digital Surround.\n\n\nBROUGHT TO YOU BY CLOWNSEC * HONK * \n\nHAVE A CLOWNY HALLOWEEN!!","torrent":{"xt":"urn:btih:715f937e23f3ab3a8c17b5dc2c2b8c47227137f3","amp;dn":"Forbidden+Zone+%5BColor%5D+%282012%29+720p+BrRip+x264+-+CLOWNSEC+%28Phreak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715f937e23f3ab3a8c17b5dc2c2b8c47227137f3","infoHashBuffer":{"type":"Buffer","data":[113,95,147,126,35,243,171,58,140,23,181,220,44,43,140,71,34,113,55,243]},"announce":[],"urlList":[]}}