{"title":"Insight Guides Pocket - Hong Kong (2016).epub Gooner","uid":15292381,"size":44266208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71809b2ac5ee6ae4b9f36a1dfe87a899a1abdef7&amp;dn=Insight+Guides+Pocket+-+Hong+Kong+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1468432617,"description":"Insight Guides Pocket - Hong Kong (2016).epub Gooner\r\n\r\nPublisher: Insight (18 April 2016)\r\nLanguage: English\r\nISBN-10: 1780053738\r\nISBN-13: 978-1780053738\r\n\r\nHong Kong is an intoxicating place - exciting, mysterious and glamorous, there's nowhere quite like this tiny corner of China. Be inspired to visit by the brand new Insight Pocket Guide Hong Kong, a concise, full-color guide to this exciting city that combines lively text with vivid photography to highlight the best that Hong Kong has to offer.\r\n\r\nInside Insight Pocket Guide Hong Kong:\r\n\r\n- Where To Go details all the key sights in the city, from evocative Man Mo Temple to the iconic harbor and the heights of the Peak, while handy maps on the cover flaps help you find your way around, and are cross-referenced to the text.\r\n\r\n- Top 10 Attractions gives a run-down of the best sights to take in on your trip, including the Star Ferry and the glittering skyscrapers of Central.\r\n\r\n- Perfect Day provides an itinerary for one day in the city.\r\n\r\n- What To Do is a snapshot of ways to spend your spare time, including arts, entertainment, horse-racing, night cruises and - of course - shopping. Essential information on Hong Kong's culture, including a brief history of the city.\r\n\r\n- Eating Out covers the city's best cuisine. Curated listings of the best hotels and restaurants.\r\n\r\n- A-Z of all the practical information you'll need.\r\n\r\nAbout Insight Guides: Insight Guides has over 40 years' experience of publishing high-quality, visual travel guides. We produce around 400 full-colour print guide books and maps as well as picture-packed eBooks to meet different travellers' needs. Insight Guides' unique combination of beautiful travel photography and focus on history and culture together create a unique visual reference and planning tool to inspire your next adventure.\r\n\r\n'Insight Guides has spawned many imitators but is still the best of its type.' - Wanderlust Magazine\r\n\r\nPart of an initial launch of compact size travel guides from the publishers of Insight Guides, known for quality cultural and historical coverage.\r\n\r\nInsight Pocket Guide Hong Kong is the ideal handy guide to this vibrant city, combining concise information on where to go and what to do with great photography and full-color maps","torrent":{"xt":"urn:btih:71809b2ac5ee6ae4b9f36a1dfe87a899a1abdef7","amp;dn":"Insight+Guides+Pocket+-+Hong+Kong+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71809b2ac5ee6ae4b9f36a1dfe87a899a1abdef7","infoHashBuffer":{"type":"Buffer","data":[113,128,155,42,197,238,106,228,185,243,106,29,254,135,168,153,161,171,222,247]},"announce":[],"urlList":[]}}