{"title":"Deadly Heat - Nikki Heat 05 - Richard Castle","uid":10168288,"size":325155382,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:719a74d67d2191960cd6237f38b7a6a3680eacb1&amp;dn=Deadly+Heat+-+Nikki+Heat+05+-+Richard+Castle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":-1,"time":1400372440,"description":"\n\nDeadly Heat is the fifth novel in Richard Castle's series about NYPD homicide detective Nikki Heat and journalist Jameson Rook. It was released on September 17, 2013. The novel is published by Hyperion Books in collaboration with ABC\n\nPicking up where Frozen Heat left off, top NYPD Homicide Detective Nikki Heat pursues the elusive former CIA station chief who ordered the execution of her mother over a decade ago. For the hunt, Nikki teams once again with her romantic partner, Pulitzer Prize winning investigative journalist Jameson Rook, and their quest for the old spy and the motive behind the past murder unearths an alarming terror plot-which is anything but ancient history. It is lethal. It is now. And it has already entered its countdown phase. Complicating Heat's mission to bring the rogue spy to justice and thwart the looming terror event, a serial killer begins menacing the Twentieth Precinct and her homicide squad is under pressure to stop him, and soon. The frightening murderer, known for his chilling stealth, not only has singled out Nikki as the exclusive recipient of his taunting messages, he then boldly names his next victim: Detective Heat.","torrent":{"xt":"urn:btih:719a74d67d2191960cd6237f38b7a6a3680eacb1","amp;dn":"Deadly+Heat+-+Nikki+Heat+05+-+Richard+Castle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719a74d67d2191960cd6237f38b7a6a3680eacb1","infoHashBuffer":{"type":"Buffer","data":[113,154,116,214,125,33,145,150,12,214,35,127,56,183,166,163,104,14,172,177]},"announce":[],"urlList":[]}}