{"title":"Advanced Financial Risk Management: Tools and Techniques for Int","uid":9284142,"size":14903952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71da75c61c46a2c5f08c85703ba3b0a527b0ba64&amp;dn=Advanced+Financial+Risk+Management%3A+Tools+and+Techniques+for+Int&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1385983196,"description":"Description\nPractical tools and advice for managing financial risk, updated for a post-crisis world\nAdvanced Financial Risk Management bridges the gap between the idealized assumptions used for risk valuation and the realities that must be reflected in management actions. It explains, in detailed yet easy-to-understand terms, the analytics of these issues from A to Z, and lays out a comprehensive strategy for risk management measurement, objectives, and hedging techniques that apply to all types of institutions. Written by experienced risk managers, the book covers everything from the basics of present value, forward rates, and interest rate compounding to the wide variety of alternative term structure models.\n\nRevised and updated with lessons from the 2007-2010 financial crisis, Advanced Financial Risk Management outlines a framework for fully integrated risk management. Credit risk, market risk, asset and liability management, and performance measurement have historically been thought of as separate disciplines, but recent developments in financial theory and computer science now allow these views of risk to be analyzed on a more integrated basis. The book presents a performance measurement approach that goes far beyond traditional capital allocation techniques to measure risk-adjusted shareholder value creation, and supplements this strategic view of integrated risk with step-by-step tools and techniques for constructing a risk management system that achieves these objectives.\n\nPractical tools for managing risk in the financial world\nUpdated to include the most recent events that have influenced risk management\nTopics covered include the basics of present value, forward rates, and interest rate compounding; American vs. European fixed income options; default probability models; prepayment models; mortality models; and alternatives to the Vasicek model\nComprehensive and in-depth, Advanced Financial Risk Management is an essential resource for anyone working in the financial field.\n\n\nTable of Contents\nIntroduction: Wall Street Lessons from Bubbles xxiii\nKey Fallacies in Risk Management xxiii\n\nSelected Events in the Credit Crisis xxviii\n\nPART ONE Risk Management: Definitions and Objectives\n\nCHAPTER 1 A Risk Management Synthesis: Market Risk, Credit Risk, Liquidity Risk, and Asset and Liability Management 3\n\nCHAPTER 2 Risk, Return, Performance Measurement, and Capital Regulation 15\n\nPART TWO Risk Management Techniques for Interest Rate Analytics\n\nCHAPTER 3 Interest Rate Risk Introduction and Overview 45\n\nCHAPTER 4 Fixed Income Mathematics: The Basic Tools 59\n\nCHAPTER 5 Yield Curve Smoothing 73\n\nCHAPTER 6 Introduction to Heath, Jarrow, and Morton Interest Rate Modeling 123\n\nCHAPTER 7 HJM Interest Rate Modeling with Rate and Maturity-Dependent Volatility 142\n\nCHAPTER 8 HJM Interest Rate Modeling with Two Risk Factors 161\n\nCHAPTER 9 HJM Interest Rate Modeling with Three Risk Factors 190\n\nCHAPTER 10 Valuation, Liquidity, and Net Income 230\n\nCHAPTER 11 Interest Rate Mismatching and Hedging 250\n\nCHAPTER 12 Legacy Approaches to Interest Rate Risk Management 257\n\nCHAPTER 13 Special Cases of Heath, Jarrow, and Morton Interest Rate Modeling 283\n\nCHAPTER 14 Estimating the Parameters of Interest Rate Models 316\n\nPART THREE Risk Management Techniques for Credit Risk Analytics\n\nCHAPTER 15 An Introduction to Credit Risk: Using Market Signals in Loan Pricing and Performance Measurement 335\n\nCHAPTER 16 Reduced Form Credit Models and Credit Model Testing 359\n\nCHAPTER 17 Credit Spread Fitting and Modeling 396\n\nCHAPTER 18 Legacy Approaches to Credit Risk 421\n\nCHAPTER 19 Valuing Credit Risky Bonds 453\n\nCHAPTER 20 Credit Derivatives and Collateralized Debt Obligations 473\n\nPART FOUR Risk Management Applications: Instrument by Instrument\n\nCHAPTER 21 European Options on Bonds 495\n\nCHAPTER 22 Forward and Futures Contracts 513\n\nCHAPTER 23 European Options on Forward and Futures Contracts 531\n\nCHAPTER 24 Caps and Floors 548\n\nCHAPTER 25 Interest Rate Swaps and Swaptions 567\n\nCHAPTER 26 Exotic Swap and Options Structures 580\n\nCHAPTER 27 American Fixed Income Options 596\n\nCHAPTER 28 Irrational Exercise of Fixed Income Options 622\n\nCHAPTER 29 Mortgage-Backed Securities and Asset-Backed Securities 639\n\nCHAPTER 30 Nonmaturity Deposits 656\n\nCHAPTER 31 Foreign Exchange Markets 675\n\nCHAPTER 32 Impact of Collateral on Valuation Models: The Example of\n\nCHAPTER 33 Pricing and Valuing Revolving Credit and Other Facilities 694\n\nCHAPTER 34 Modeling Common Stock and Convertible Bonds on a Default-Adjusted Basis 700\n\nCHAPTER 35 Valuing Insurance Policies and Pension Obligations 708\n\nPART FIVE Portfolio Strategy and Risk Management\n\nCHAPTER 36 Value-at-Risk and Risk Management Objectives Revisited at the Portfolio and Company Level 719\n\nCHAPTER 37 Liquidity Analysis and Management: Examples from the Credit Crisis 735\n\nCHAPTER 38 Performance Measurement: Plus Alpha vs. Transfer Pricing 765\n\nCHAPTER 39 Managing Institutional Default Risk and Safety and Soundness 783\n\nCHAPTER 40 Information Technology Considerations 793\n\nCHAPTER 41 Shareholder Value Creation and Destruction 800\n\nPostscript 808\n\nBibliography 809\n\nIndex 819\n\n\nAuthor Information\nDONALD R. VAN DEVENTER founded the Kamakura Corporation in April 1990 and is currently Chairman and CEO. In 2003, he was voted into the Risk Hall of Fame for having made a profound contribution to the field of risk management. He has been involved in financial advisory assignments involving both risk management and mergers and acquisitions. Prior to founding Kamakura Corporation, he was senior vice president of the investment banking department of Lehman Brothers. From 1982 to 1987, he was the treasurer for First Interstate Bancorp in Los Angeles. He holds a PhD in business economics, a joint degree of the Harvard University Department of Economics and the Harvard Graduate School of Business Administration.\n\nKenji Imai has headed Software Development for Kamakura for sixteen years. Mr. Imai is member of the Managing Committee of Kamakura. Prior to Kamakura, Mr. Imai worked in the derivatives structuring/trading and risk management groups at the Sanwa Bank and S.G. Warburg. He graduated from the University of Tokyo with a BS in civil engineering and from the Sloan School of the Massachusetts Institute of Technology with a MS in management, concentrating on finance.\n\nMark Mesler is Managing Director and heads Kamakura Risk Information Services, Kamakura's innovative Basel II and III compliant default probability service. Mr. Mesler is in charge of the daily production of the KRIS Merton model, Jarrow reduced form model, and hybrid model default probabilities. Mr. Mesler has twenty-seven years' experience in the financial services information and systems field and is a veteran of State Street Bank, KPMG, Oracle, and the Bank of America. Prior to joining Kamakura Corporation, Mr. Mesler was vice president at Askari Risk Management Solutions, at that time a subsidiary of State Street Bank in Boston.","torrent":{"xt":"urn:btih:71da75c61c46a2c5f08c85703ba3b0a527b0ba64","amp;dn":"Advanced+Financial+Risk+Management%3A+Tools+and+Techniques+for+Int","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71da75c61c46a2c5f08c85703ba3b0a527b0ba64","infoHashBuffer":{"type":"Buffer","data":[113,218,117,198,28,70,162,197,240,140,133,112,59,163,176,165,39,176,186,100]},"announce":[],"urlList":[]}}