{"title":"Walter Trout-15 cd","uid":5268319,"size":1448727489,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:720eee7a6946d195689f05bfacd3a04b601f00f5&amp;dn=Walter+Trout-15+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"flitigalisa","files":205,"time":1262965479,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nWalter Trout (born March 6, 1951, Ocean City, New Jersey, United States) is an American blues guitarist, singer and songwriter.\n\nTrout's career began on the Jersey coast scene of the late 1960s and early 1970s. He then decided to relocate to Los Angeles where he became a sideman for Percy Mayfield and Deacon Jones. He also worked in the bands of John Lee Hooker and Joe Tex. \nIn 1981 be became the guitarist for Canned Heat.[1] This led to an invitation to play in John Mayall's Bluesbreakers where he shared the stage with fellow guitarist Coco Montoya. He left the Bluesbreakers in 1989 and formed the 'Walter Trout Band' which developed a successful following in Europe.\nIn 1994 the official Walter Trout Fan Club for the Netherlands and Belgium was founded, followed in 1996 by the official International Fan Club who has members in 14 countries in Europe, America, Asia and Australia. In 2006 the official International Fan club celebrated its tenth anniversary by giving fan club members an exclusive live CD recorded in Las Vegas, Nevada, which was the last performance of the late bassist, Jimmy Trapp, who died in 2005.\nIn 1998 Trout released his self-titled US debut album and renamed his band 'Walter Trout and the Free Radicals' (later renamed 'Walter Trout and the Radicals' and currently simply 'Walter Trout'). Since that time Trout has been recording and touring in North America, Europe and India.\nIn 2002, he was featured on the Bo Diddley tribute album, Hey Bo Diddley - A Tribute!, performing the song &quot;Road Runner&quot; and many more guest appearances on other recordings.\nThe 2006 release Full Circle, meant that Trout realized his dream of creating an album with some of his most admired musicians, including John Mayall, Coco Montoya, and Joe Bonamassa, among others. \n\n","torrent":{"xt":"urn:btih:720eee7a6946d195689f05bfacd3a04b601f00f5","amp;dn":"Walter+Trout-15+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"720eee7a6946d195689f05bfacd3a04b601f00f5","infoHashBuffer":{"type":"Buffer","data":[114,14,238,122,105,70,209,149,104,159,5,191,172,211,160,75,96,31,0,245]},"announce":[],"urlList":[]}}