{"title":"The Mirror of Yoga Awakening the Intelligence of Body and Mind t","uid":11861612,"size":3917213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:725e10c6bc4bb000f7cd2e35e60ecee0ec914cc4&amp;dn=The+Mirror+of+Yoga+Awakening+the+Intelligence+of+Body+and+Mind+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"jerryregioS","files":3,"time":1430296986,"description":"The world of yoga is astonishingly rich in its array of schools and practices. Yet, as diverse as they seem, they share a common aim: the discovery of the essence of existence that can be found at the core of our being, and the liberation that comes from that discovery. With this worthy goal in mind, Richard Freeman presents an enlightening overview of the many teachings, practices, and scriptures that serve as the basis for all the schools of yoga-hatha, bhakti, jnana, karma, tantra, and others. He shows how the myriad forms are ultimately related, and can even be perceived to make up a vast, interpenetrating matrix, symbolizing the unity, profundity, and beauty of the ancient tradition.\n\nRichards wide-ranging discussion includes the Upanisads and Samkhya philosophies, the Yoga Sutra of Patanjali, the eight limbs of astanga yoga, the process and purpose of hatha yoga, and much more. He also explores the role of the guru, chanting, meditation, and the yogic imperative of offering service to others. All of this is applied to the actual practice, giving the reader the tools to digest and apply the wealth of information to daily life. The Mirror of Yoga will be a welcome resource to all yogis who wish to better practice the profound philosophy underlying their practice","torrent":{"xt":"urn:btih:725e10c6bc4bb000f7cd2e35e60ecee0ec914cc4","amp;dn":"The+Mirror+of+Yoga+Awakening+the+Intelligence+of+Body+and+Mind+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725e10c6bc4bb000f7cd2e35e60ecee0ec914cc4","infoHashBuffer":{"type":"Buffer","data":[114,94,16,198,188,75,176,0,247,205,46,53,230,14,206,224,236,145,76,196]},"announce":[],"urlList":[]}}