{"title":"Ayaan Hirsi Ali - Infidel (mobi, epub)","uid":6926485,"size":1334821,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:729a290588356d048bf874df7bab3599f51132ab&amp;dn=Ayaan+Hirsi+Ali+-+Infidel+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"mirex0_0","files":2,"time":1325523279,"description":"Infidel\n\nReaders with an eye on European politics will recognize Ali as the Somali-born member of the Dutch parliament who faced death threats after collaborating on a film about domestic violence against Muslim women with controversial director Theo van Gogh (who was himself assassinated). Even before then, her attacks on Islamic culture as &quot;brutal, bigoted, [and] fixated on controlling women&quot; had generated much controversy. In this suspenseful account of her life and her internal struggle with her Muslim faith, she discusses how these views were shaped by her experiences amid the political chaos of Somalia and other African nations, where she was subjected to genital mutilation and later forced into an unwanted marriage. While in transit to her husband in Canada, she decided to seek asylum in the Netherlands, where she marveled at the polite policemen and government bureaucrats. Ali is up-front about having lied about her background in order to obtain her citizenship, which led to further controversy in early 2006, when an immigration official sought to deport her and triggered the collapse of the Dutch coalition government. Apart from feelings of guilt over van Gogh's death, her voice is forceful and unbowed--like Irshad Manji, she delivers a powerful feminist critique of Islam informed by a genuine understanding of the religion.\n\nAuthor: Ayaan Hirsi Ali\nPublisher: Free Press\nPublication Date: February 6, 2007\n\nFormats:\n.epub (compatable with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatable with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:729a290588356d048bf874df7bab3599f51132ab","amp;dn":"Ayaan+Hirsi+Ali+-+Infidel+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729a290588356d048bf874df7bab3599f51132ab","infoHashBuffer":{"type":"Buffer","data":[114,154,41,5,136,53,109,4,139,248,116,223,123,171,53,153,245,17,50,171]},"announce":[],"urlList":[]}}