{"title":"Success as an Introvert For Dummies - Joan Pastor","uid":14513632,"size":1096314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72afd27e4828ff446bda87a68b9fb7a1748ad21c&amp;dn=Success+as+an+Introvert+For+Dummies+-+Joan+Pastor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462315287,"description":"Thrive as an introvert in an extrovert world\r\n\r\nBill Gates, Mark Zuckerberg, and author J.K. Rowling have more in common than being highly successful. They're also introverts. Success as an Introvert For Dummies identifies common misunderstandings about introverts and highlights the strengths often found in people associated with this worldview.\r\n\r\nSuccess as an Introvert For Dummies examines the traits common to introverts and the benefits they bring to both work and life. You'll learn: how to boost your confidence while learning strategies for successfully living in an extrovert world; how to understand introversion and where you fall on the introvert/extrovert continuum; tools to improve relationships with colleagues, partners, friends, and children; ways to talk less, communicate more, and showcase your abilities at work; how to deal effectively with parties, interruptions, and crowds; and much more.\r\n\r\n• Offers examples of how introverts can thrive in a world dominated by extroverts\r\n• Outlines the positive aspects of introverted personality types\r\n• Provides actionable ways to promote introverted qualities in work and life\r\n\r\nSuccess as an Introvert For Dummies is for anyone looking to understand the introvert's worldview and how they fit into a society dominated by extroverts","torrent":{"xt":"urn:btih:72afd27e4828ff446bda87a68b9fb7a1748ad21c","amp;dn":"Success+as+an+Introvert+For+Dummies+-+Joan+Pastor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72afd27e4828ff446bda87a68b9fb7a1748ad21c","infoHashBuffer":{"type":"Buffer","data":[114,175,210,126,72,40,255,68,107,218,135,166,139,159,183,161,116,138,210,28]},"announce":[],"urlList":[]}}