{"title":"Stefano Bollani - 2014 - Joy in Spite of Everything (24 88.2) FL","uid":11161231,"size":1458156930,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:730ecb4bd6a5e92855a10553c46f74ee7ee26726&amp;dn=Stefano+Bollani+-+2014+-+Joy+in+Spite+of+Everything+%2824+88.2%29+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"eika256","files":-1,"time":1412545536,"description":"Stefano Bollani - 2014 - Joy in Spite of Everything\n24 bits, 88.2 KHz\n\nOn Joy in Spite of Everything, Italian pianist Stefano Bollani reconvened his longstanding trio with drummer Morten Lund and bassist Jesper Bodilsen. They recorded three previous dates together, the most recent being 2009's excellent Stone in the Water on ECM. Bollani has continually displayed -- from his dates with mentor Enrico Rava, on solo offerings, and with other leaders, that his playing and composing signatures are not only versatile and Catholic in their approach to jazz, but informed equally by the building blocks and possibilities of song itself. To that end, he has added two more players to this date, guitarist Bill Frisell and saxophonist Mark Turner. The group performs on these tunes not only as a quintet, but in various quartets, trios, and duets. The tracks are long enough to stretch a bit and offer a wide, colorful palette of approaches. Opener &quot;Easy Healing&quot; has a calypso-cum-plena vibe that allows for lovely interplay from the rhythm section, but also between Frisell and Turner -- who is unusually lyrical rather than cerebral -- in his solo. It's followed by &quot;No Pope No Party.&quot; With knotty, stop-and-start post-bop as its entryway, it swings throughout even when it moves afield; the dialogue between saxophonist and pianist is canny, with Frisell's solo melding straight-ahead swing with Americana. &quot;Alobar e Kudra&quot; is a piano trio that offers Bollani's fluid voicings, light and dark, balanced by shimmering ostinati as the rhythm section digs in and extrapolates on them. &quot;Las Hortensias&quot; is a long, moody ballad for a quartet with lovely understated work by the pianist. Turner explores the fringes of the melody and engages in counterpoint after his restrained solo break. The set's lengthiest number is &quot;Vale.&quot; It commences skeletally as a nearly formless, languid, balladic improvisation. Bollani brings angles into view after his own solo, touching on post-bop, Nino Rota's delicate classicism, and the Italian jazz tradition, but it's Turner's solo that shines brightest. &quot;Teddy,&quot; a duet with Frisell, was inspired by pianist Teddy Wilson, though its sparse, impressionistic opening would hardly suggest that. Nonetheless, in its sprightly, swinging dialogue, one can hear its subject's influence -- though musically it reaches much further. &quot;Ismene&quot; is a beautiful ballad, and a fine vehicle for Frisell's instinctive manner of chordal voicings and poignant lyrical fills. The closing title track for Bollani's trio is fleet, wildly creative post-bop that shows off just how intuitive the group's development has become in the last decade. Joy in Spite of Everything's myriad colors and moods illustrate its title -- even in the most melancholy places. As an album it reveals how confident and sensitive Bollani is, in full command of his musical range and technical facility -- as composer, bandleader, pianist, and arranger -- as well as in the depth of his honesty in emotional expression. (AllMusic)\n\nTrack list:\n01 - Easy Healing\n02 - No Pope No Party\n03 - Alobar e Kudra\n04 - Las Hortensias\n05 - Vale\n06 - Teddy\n07 - Ismene\n08 - Tales from the Time Loop\n09 - Joy in Spite of Everything\n\nPersonnel:\nStefano Bollani: piano; \nMark Turner: tenor saxophone; \nBill Frisell: guitar; \nJesper Bodilsen: double-bass; \nMorten Lund: drums.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:730ecb4bd6a5e92855a10553c46f74ee7ee26726","amp;dn":"Stefano+Bollani+-+2014+-+Joy+in+Spite+of+Everything+%2824+88.2%29+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"730ecb4bd6a5e92855a10553c46f74ee7ee26726","infoHashBuffer":{"type":"Buffer","data":[115,14,203,75,214,165,233,40,85,161,5,83,196,111,116,238,126,226,103,38]},"announce":[],"urlList":[]}}