{"title":"Against Atheism: Why Dawkins, Hitchens, and Harris ","uid":10868276,"size":738332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:736b70653310a06e424bebccc634c60de1cb3d7f&amp;dn=Against+Atheism%3A+Why+Dawkins%2C+Hitchens%2C+and+Harris+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1408940702,"description":"Ian S. Markham, &quot;Against Atheism: Why Dawkins, Hitchens, and Harris Are Fundamentally Wrong&quot;\nISBN: 1405189649, 1405189630 | 2010 | EPUB | 176 pages | 721 KB\n\nIn this new book, Ian Markham analyzes the atheistic world view, opposing the arguments given by renowned authors of books on atheism, such as Richard Dawkins. Unlike other responses to the new atheism, Markham challenges these authors on their own ground by questioning their understanding of belief and of atheism itself. The result is a transforming introduction to Christianity that will appeal to anyone interested in this debate.\n\nA fascinating challenge to the recent spate of successful books written by high-profile atheist authors such as Richard Dawkins, Christopher Hitchens, and Sam Harris\nTackles these authors on their own ground, arguing that they do not understand the nature of atheism, let alone theology and ethics\nDraws on ideas from Nietzsche, cosmology, and art to construct a powerful response that allows for a faith that is grounded, yet one that recognizes the reality of uncertainty\nSuccinct, engaging, but robustly argued, this new book by a leading academic and writer contains a wealth of profound insights that show religious belief in a new light","torrent":{"xt":"urn:btih:736b70653310a06e424bebccc634c60de1cb3d7f","amp;dn":"Against+Atheism%3A+Why+Dawkins%2C+Hitchens%2C+and+Harris+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736b70653310a06e424bebccc634c60de1cb3d7f","infoHashBuffer":{"type":"Buffer","data":[115,107,112,101,51,16,160,110,66,75,235,204,198,52,198,13,225,203,61,127]},"announce":[],"urlList":[]}}