{"title":"Trans at Play: She Exclusive 2015 XXX Split Scenes WEB-DL","uid":12425928,"size":2078077651,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:73789eb9c8e87488478155c30e419b2af82e4176&amp;dn=Trans+at+Play%3A+She+Exclusive+2015+XXX+Split+Scenes+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":10,"uploader":"Ctrlme","files":1,"time":1442375177,"description":"-----------------------------------------------------------\nTrans at Play: She Exclusive 2015 XXX Split Scenes WEB-DL\n-----------------------------------------------------------\nScreenshots &lt;a href=&quot;\nhttp://imgsay.com/?v=820311&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsay.com/?v=820311&lt;/a&gt; &lt;a href=&quot;\nhttp://imgsay.com/?v=992378&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsay.com/?v=992378&lt;/a&gt;\n-----------------------------------------------------------\nHardcore Tranny On Girl &amp; TS On TS Action!\n\n100% All girl - all TS action! The new era of transsexual porn is here, and you''re going to go crazy when you see who they''re fucking around with!\n\nScene One: Venus Lux and Angelina Castro are teasing the camera and the viewers as they seduce them individually outdoors.\nater, we see them in front of a white couch. They are kissing. Venus is rubbing her partner's crotch. Some titty play occurs by the tranny. She also spanks the woman too. More spanking action takes place as soon as Venus removes the dress off of Angelina.A good amount of time is spent showing off Angelina's gigantic boobs while Venus runs her hands along them.After, Venus is on top of Angelina and she cums on her body.\n\nScene Two: Tranny Natassia Dreams is at outdoors in a red bikini. She is staring at the camera while caressing her body.Female performer Angelina Valentine is seen teasing the camera at a different part of the backyard.All of a sudden, they are indoors making out. Angelina goes down on Natassia and eats her out. Natassia works on her pussy well while also sucking the woman's strap-on. Afterwards, Angelina eats her asshole briefly before dogging.\n\nScene Three: Melody Star is teasing the camera in front of a spray-painted mural outdoors. Brunette Bianca Nascimento also does a teasing routine too. Later, they meet each other and their coming together leads to their indoor make out session.Afterwards, the blonde cutie applies solid bj action on her partner. Even though the doggie activity by the tranny on Melody looked good, it's the toy play by Melody on Bianca that initiates the hottest moments in this scene.In the end, Bianca cums on Melody's cute mouth.\n\nScene Four: Carla Novaes teases the camera from a distance by the indoor pool. Moments later, her friend Bruna Butterfly joins the blonde cutie. They press against themselves with a stripper's pole in between them. There is a good amount of oral action by both of them. They really got into it. This scene gets hotter as both of them fuck each other. Carla does it first. She fucks well as does Bruna when it was her turn. They also take a shower toguether.\n\nScene Five: Trans babe Dany De Castro and Pryscilla Brandoa make out on a pink bed. Both ladies do a nice job placing good attention on pleasuring their partner's titties.Later, the screwing activity starts off with a doggie and then, a cowgirl ride. It intensifies during the spooning moments. It is here where Pryscilla gives off the most emotion. In the end, the trans hottie cums on the woman's mouth and chest.  \n\ncast  \nAngelina Valentine, Bruna Butterfly, Angelina Castro, Venus Lux, Dany De Castro, Natassia Dreams, Carla Novaes, Bianka Nascimento, Melody Star \n\nStudio: Trans 500 Studios \n-----------------------------------------------------------\nIf you like this torrent, please post a comment!\n\nDon't forget to seed!","torrent":{"xt":"urn:btih:73789eb9c8e87488478155c30e419b2af82e4176","amp;dn":"Trans+at+Play%3A+She+Exclusive+2015+XXX+Split+Scenes+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73789eb9c8e87488478155c30e419b2af82e4176","infoHashBuffer":{"type":"Buffer","data":[115,120,158,185,200,232,116,136,71,129,85,195,14,65,155,42,248,46,65,118]},"announce":[],"urlList":[]}}