{"title":"Defenders Complete","uid":4280036,"size":1711701197,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:73897ac394899112422ba69464ef2d88f9cee39c&amp;dn=Defenders+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"Rishab","files":214,"time":1215372728,"description":"The Defenders is a name of a number of Marvel Comics superhero groups ÃƒÂ¢?? usually presented as a &quot;non-team&quot; of individualistic &quot;outsiders&quot; each known for following their own agendas ÃƒÂ¢?? that usually battles mystic and supernatural threats.\n\nIts original and most popular incarnation is led by Doctor Strange and also includes The Silver Surfer, Namor, and the Hulk, all popular superheroes in their own right. They first appeared as The Defenders in Marvel Feature #1 (December 1971). \n\nThe group had a rotating line-up from 1972 until 1986. The publication was retitled near the end of the run as The New Defenders but featured none of the originals. The concept was modified in the 1993-95 series Secret Defenders, in which Dr. Strange assembled different teams for each individual mission. In the 2000s, Marvel published a new miniseries featuring the classic line-up.\n\nThis is the most complete Defenders torrent featuring\n1. Defenders v1\n2. Defenders v2\n3. Secret Defenders \n4. Defenders-The Order\n5. The Last Defenders\n\nDefenders could have been a classic mainstream title for Marvel like Avengers, Fantastic Four. It featured some of the big guns of the Marvel. Hulk, Namor, Silver Surfur and Dr.Strange (all loners) packed in to one 'non team'. But Marvel killed the title when they introduced the 'New Defenders' featuring Angel,Valkyrie,Beast,Gargoyle. Now just imagine the original line up replaced by these characters. That is when the series really took a downturn. In later incarnations Marvel replaced the new team by the original members. This torrent contains Defenders title uptill the current Last Defenders title releases.\n\nI would like to thank all the scanners and original uploaders for making it possible for me to compile this torrent. Enjoy and Seed.","torrent":{"xt":"urn:btih:73897ac394899112422ba69464ef2d88f9cee39c","amp;dn":"Defenders+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73897ac394899112422ba69464ef2d88f9cee39c","infoHashBuffer":{"type":"Buffer","data":[115,137,122,195,148,137,145,18,66,43,166,148,100,239,45,136,249,206,227,156]},"announce":[],"urlList":[]}}