{"title":"Networking A Beginner's Guide, 6E [Epub &amp; Mobi]~StormRG~","uid":9878528,"size":10984781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73e4fb52ad4e26085e919f30bd4acc97b6914934&amp;dn=Networking+A+Beginner%27s+Guide%2C+6E+%5BEpub+%26amp%3B+Mobi%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"steelballz","files":-1,"time":1396507041,"description":"Description\nNetworking A Beginner's Guide Sixth Edition\nAuthor: Hallberg, Bruce\nPublished: Sept. 24 2013\nPublisher: McGraw-Hill Osborne Media; 6 edition\nISBN: 978-0071812245\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nNOTE: No PDF available, please use a reader, as above. If you want it to scroll like\na PDF just use Calibre and click scroll mode (top right) after opening the book\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy!\n\nimage\nCover from actual book file\n\n\n\n\nimage\nScientia est potentia\n\nRequest books here:\nKAT Book Request Thread\n\nProduct Description\nCurrent, essential IT networking skills--made easy!\n\nThoroughly revised to cover the latest technologies, this practical resource provides you with a solid foundation in networking fundamentals. Networking: A Beginner's Guide, Sixth Edition discusses wired and wireless network design, configuration, hardware, protocols, security, backup, recovery, and virtualization. You'll also get step-by-step instructions for installing, configuring, and managing Windows Server 2012, Exchange\nServer 2013, Oracle Linux, and Apache. This is the perfect book for anyone starting a networking career or in need of an easy-to-follow refresher.\n\n\nUnderstand network cabling, topologies, hardware, and the OSI seven-layer model\nConnect LANs and WANs\nConfigure network protocols, such as TCP/IP, IPX/SPX, SMTP, DHCP, HTTP, WINS, and more\nExplore directory services, such as Microsoft's Active Directory, X.400, and LDAP\nEnable and support remote network access\nSecure your network and handle backup and disaster recovery\nSelect, install, and manage reliable network servers, including Windows Server 2012, Exchange Server 2013, Oracle\nLinux, and Apache\nManage network workstation computers\nDesign a robust network from the ground up\nWork with virtualization technologies, such as Hyper-V, VMWare, and Oracle VM VirtualBox\n\nAbout the Author\n\nBruce Hallberg is a networking technology consultant to Fortune 1000 companies. He is the bestselling author of more than 20 information technology books on computer networking and technology topics, such as web servers, Linux, Apache, Windows, virtualization, and more.\n","torrent":{"xt":"urn:btih:73e4fb52ad4e26085e919f30bd4acc97b6914934","amp;dn":"Networking+A+Beginner%27s+Guide%2C+6E+%5BEpub+%26amp%3B+Mobi%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73e4fb52ad4e26085e919f30bd4acc97b6914934","infoHashBuffer":{"type":"Buffer","data":[115,228,251,82,173,78,38,8,94,145,159,48,189,74,204,151,182,145,73,52]},"announce":[],"urlList":[]}}