{"title":"Godfather: The Intimate Francis Ford Coppola - Gene D. Phillips","uid":10313779,"size":4434580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:744cc0f4af0a9245053deb1fea8f5028c4f7b46d&amp;dn=Godfather%3A+The+Intimate+Francis+Ford+Coppola+-+Gene+D.+Phillips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1402223981,"description":"WITH A FOREWORD BY WALTER MURCH Gene Phillips blends biography, studio history, and film criticism to complete the most comprehensive work on Coppola ever written. The force behind such popular and critically acclaimed films as Apocalypse Now and the Godfather trilogy, Coppola has imprinted his distinct style on each of his movies and on the landscape of American popular culture. In Godfather , Phillips argues that Coppola has repeatedly bucked the Hollywood &quot;factory system&quot; in an attempt to create distinct films that reflect his own artistic vision-often to the detriment of his career and finances. Phillips conducted interviews with the director and his colleagues and examined Coppola's production journals and screenplays. Phillips also reviewed rare copies of Coppola's student films, his early excursions into soft-core pornography, and his less celebrated productions such as One from the Heart and Tucker: The Man and His Dream . The result is the definitive assessment of one of Hollywood's most enduring and misunderstood mavericks.","torrent":{"xt":"urn:btih:744cc0f4af0a9245053deb1fea8f5028c4f7b46d","amp;dn":"Godfather%3A+The+Intimate+Francis+Ford+Coppola+-+Gene+D.+Phillips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744cc0f4af0a9245053deb1fea8f5028c4f7b46d","infoHashBuffer":{"type":"Buffer","data":[116,76,192,244,175,10,146,69,5,61,235,31,234,143,80,40,196,247,180,109]},"announce":[],"urlList":[]}}