{"title":"Learning Network Programming with Java (2015).pdf Gooner","uid":14936415,"size":2571720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:753ddb202dfa2bfe7742c2c3f50df4cecdf1de55&amp;dn=Learning+Network+Programming+with+Java+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1466000699,"description":"Learning Network Programming with Java (2015).pdf Gooner\r\n\r\nPublisher: Packt Publishing (22 Dec. 2015)\r\nLanguage: English\r\nISBN-10: 1785885472\r\nISBN-13: 978-1785885471\r\n\r\nKey Features:\r\n\r\n* Learn to deliver superior server-to-server communication through the networking channels\r\n\r\n* Gain expertise of the networking features of your own applications to support various network architectures such as client/server and peer-to-peer\r\n\r\n* Explore the issues that impact scalability, affect security, and allow applications to work in a heterogeneous environment\r\n\r\nBook Description:\r\n\r\nNetwork-aware applications are becoming more prevalent and play an ever-increasing role in the world today. Connecting and using an Internet-based service is a frequent requirement for many applications. Java provides numerous classes that have evolved over the years to meet evolving network needs. These range from low-level socket and IP-based approaches to those encapsulated in software services.\r\n\r\nThis book explores how Java supports networks, starting with the basics and then advancing to more complex topics. An overview of each relevant network technology is presented followed by detailed examples of how to use Java to support these technologies.\r\n\r\nWe start with the basics of networking and then explore how Java supports the development of client/server and peer-to-peer applications. The NIO packages are examined as well as multitasking and how network applications can address practical issues such as security.\r\n\r\nA discussion on networking concepts will put many network issues into perspective and let you focus on the appropriate technology for the problem at hand. The examples used will provide a good starting point to develop similar capabilities for many of your network needs.\r\n\r\nWhat you will learn:\r\n\r\n* Connect to other applications using sockets\r\n\r\n* Use channels and buffers to enhance communication between applications\r\n\r\n* Access network services and develop client/server applications\r\n\r\n* Explore the critical elements of peer-to-peer applications and current technologies available\r\n\r\n* Use UDP to perform multicasting\r\n\r\n* Address scalability through the use of core and advanced threading techniques\r\n\r\n* Incorporate techniques into an application to make it more secure\r\n\r\n* Configure and address interoperability issues to enable your applications to work in a heterogeneous environment\r\n\r\nAbout the Author:\r\n\r\nRichard M Reese has worked in both industry and academia. For 17 years, he worked in the telephone and aerospace industries, serving in several capacities, including research and development, software development, supervision, and training. He currently teaches at Tarleton State University, where he has the opportunity to apply his years of industry experience to enhance his teaching.\r\n\r\nRichard has written several Java books and a C Pointer book. He uses a concise and easy-to-follow approach to topics at hand. His Java books have addressed EJB 3.1, updates to Java 7 and 8, certification, functional programming, jMonkeyEngine, and natural language processing.\r\n\r\nTable of Contents:\r\n\r\n1. Getting Started with Network Programming\r\n2. Network Addressing\r\n3. NIO Support for Networking\r\n4. Client/Server Development\r\n5. Peer-to-Peer Networks\r\n6. UDP and Multicasting\r\n7. Network Scalability\r\n8. Network Security\r\n9. Network Interoperability","torrent":{"xt":"urn:btih:753ddb202dfa2bfe7742c2c3f50df4cecdf1de55","amp;dn":"Learning+Network+Programming+with+Java+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753ddb202dfa2bfe7742c2c3f50df4cecdf1de55","infoHashBuffer":{"type":"Buffer","data":[117,61,219,32,45,250,43,254,119,66,194,195,245,13,244,206,205,241,222,85]},"announce":[],"urlList":[]}}