{"title":"Rush Revere and the Brave Pilgrims (audiobook) Limbaugh Rush","uid":9249824,"size":130236602,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75837e82c8355a1354ae6511e575feeebdc2bfd2&amp;dn=Rush+Revere+and+the+Brave+Pilgrims+%28audiobook%29+Limbaugh+Rush&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Info4U","files":16,"time":1385444974,"description":"Rush Revere and the Brave Pilgrims: Time-Travel Adventures with Exceptional Americans (Audiobook) By Rush Limbaugh, read by the author\nUnabridged edition 2013 | 4 hours and 31 mins | ISBN: 1442369183 | MP3 64 kbps | 124 MB\n\nNationally syndicated radio talk show host Rush Limbaugh has long wanted to make history come to life for the children of his listeners. In this book, he travels back in time with fearless history teacher Rush Revere. With the help of his faithful talking horse, Liberty, Rush experiences American history as it happens, having adventure after adventure with exceptional Americans such as Paul Revere and George Washington. Rush is transported back to the deck of the Mayflower as it makes its momentous voyage across the oceans to land at Plymouth Rock.\n\n\nRush finds out quickly, though, that there's nothing so momentous about seasickness! Soon he is caught up in the early moments of our nation as the Pilgrims struggle to make a home for themselves in this new world. He continues to travel back and forth in time to better illuminate for his students the real-life aspects of this historic times. Ending with the first Thanksgiving, this book captures the bravery of the first settlers.","torrent":{"xt":"urn:btih:75837e82c8355a1354ae6511e575feeebdc2bfd2","amp;dn":"Rush+Revere+and+the+Brave+Pilgrims+%28audiobook%29+Limbaugh+Rush","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75837e82c8355a1354ae6511e575feeebdc2bfd2","infoHashBuffer":{"type":"Buffer","data":[117,131,126,130,200,53,90,19,84,174,101,17,229,117,254,238,189,194,191,210]},"announce":[],"urlList":[]}}