{"title":"La-Mulana GOG","uid":7808774,"size":254074622,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7586957860155672a63ba9b0162e48abad3ee50c&amp;dn=La-Mulana+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1352472926,"description":"genre: action / adventure / platformer \nrelease date: July 13, 2012 \ncompatible with: Windows XP, Windows Vista, Windows 7 \nlanguages: English, Japanese \ndeveloper / publisher: NIGORO / Active Gaming Media \ngame modes: single-player \n\nBonus content included for FREE with purchase: \nmanual \nwallpaper \nsoundtrack sample \n8 avatars \n\nWhat's cool about it: \n\nA free roaming platformer adventure with over 18 secret-filled unique areas to explore. \nJam-packed with a slew of weapons, sub-weapons, quest items, and riddles. \nTake on the Hell Temple Time Attack for the ultimate challenge! \n\nOverview: \n\nMy name is Lemeza Kosugi and when I am not busy teaching archeology, I seek out undiscovered ruins and their secrets. Not too long ago, a note arrived from my long-lost father, exclaiming  Eventually, I found it. I ve won! Seems like the old man finally did it: he found La-Mulana, the ancient temple that holds the ancient knowledge hidden from mankind for all these years. With my trusty laptop and my whip, I have set out to plumb the depths of this ancient temple to see what treasures I can find... \n\nLa-Mulana is an  Archaeological Ruin Exploration Action Game  in the vein of classic MSX platformers. As a daring archaeologist you venture inside the ancient ruins of the Mayan city La-Mulana, seeking out the Secret Treasure of Life. Apart from the plethora of traps lying in wait to stop intruders, there are also monsters on the prowl, protecting the ruins. Head for the innermost depths of the ruins while solving a variety of mysteries, fending off monsters, and disarming traps. Forging ahead will be no simple task   the further into the depths you reach, the more difficult the mysteries become. Will you fall prey to treacherous traps and gruesome guardians or unravel the secrets of La-Mulana? \n\nAge requirements: ESRB Rating: EVERYONE 10+ with Animated Blood, Mild Fantasy Violence, Suggestive Themes. PEGI Rating: 12+ with Bad Language, Violence. \n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 2 GHz Processor, 1GB RAM, 3D graphics card compatible with DirectX 9.0c, with at least 128MB of VRAM , 500MB HDD, sound card fully compatible with DirectX 9.0c, Mouse, Keyboard. Use the checker to see if if your PC can play La Mulana. \n\nInstallation \n\nInstall and play\n","torrent":{"xt":"urn:btih:7586957860155672a63ba9b0162e48abad3ee50c","amp;dn":"La-Mulana+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7586957860155672a63ba9b0162e48abad3ee50c","infoHashBuffer":{"type":"Buffer","data":[117,134,149,120,96,21,86,114,166,59,169,176,22,46,72,171,173,62,229,12]},"announce":[],"urlList":[]}}