{"title":"Walt Disney Short Films / Cartoons - 1929-1995","uid":8004800,"size":45955941538,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75c01e97f5680ec950f1197c66c58f367e738c33&amp;dn=Walt+Disney+Short+Films+%2F+Cartoons+-+1929-1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Emieliboy","files":-1,"time":1357863262,"description":"A collection of Walt Disney's short films, made mainly between the 30's and 60's. The Alice, Laugh-O-Gram and Oswald shorts aren't on this! (Available here:Only main character and Silly Symphony shorts. This is not all of them, 'just' 463, the most I could get in my possession. I tried ripping the rest off the Walt Disney Treasures DVD's, but there are multiple shorts in one video file and some shorts are spread acress two video files. Cutting them in multiple videos is really time consuming.\n\nI got most of these from other torrents. The files are .avi, .mpg, .m2ts, so they're compatible with PlayStation 3 or Xbox 360. Some of the shorts are both .avi and .m2ts. I ripped the .m2ts off the 'Snow White and the Seven Dwarfs' and 'A Bug's Life' Blu-rays, so they are high-definition and look pretty neat:)\n\nI would like to ask if you want to upload or sent me more shorts (.avi, .mpg, .mp4, .m2ts (just not .mkv) and in decent quality) that are not in this torrent, if you have any, so I can add them to this collection, but please only Donald Duck, Goofy, Mickey Mouse (or other main character) and Silly Symphony shorts. I would really appreciate it!\n\nLanguage is English (two shorts with Dutch subtitles)\n\nEnjoy and please seed:) Comment if something is wrong or you have another short, thanks in advance!","torrent":{"xt":"urn:btih:75c01e97f5680ec950f1197c66c58f367e738c33","amp;dn":"Walt+Disney+Short+Films+%2F+Cartoons+-+1929-1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75c01e97f5680ec950f1197c66c58f367e738c33","infoHashBuffer":{"type":"Buffer","data":[117,192,30,151,245,104,14,201,80,241,25,124,102,197,143,54,126,115,140,51]},"announce":[],"urlList":[]}}