{"title":"Emmet Otter's Jug Band Christmas [1977]","uid":4552526,"size":366939424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:762c028515b4eebf69a10fd7f193e94c6315ac00&amp;dn=Emmet+Otter%5C%27s+Jug+Band+Christmas+%5B1977%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"baldbear420","files":1,"time":1228356004,"description":"Emmet Otter&amp;#039;s Jug-Band Christmas was written by Russell Hoban and illustrated by his then-wife, Lillian Hoban in 1969. The book was published in 1971 by Parents&amp;#039; Press Magazine. The story tells of Emmet Otter and his Ma, a widow who scrapes by on the small amount of money she gets from doing laundry and that Emmet gets from doing odd jobs around their home of Frogtown Hollow. As Christmas approaches, they hear of a talent contest in the nearby town of Waterville, and separately decide to enter to buy nice presents for each other -- a nice guitar for Emmet, or a piano for Ma. However, in a twist on The Gift of the Magi, they must sacrifice each other&amp;#039;s livelihood for the talent contest -- Ma hocks Emmet&amp;#039;s tools for dress fabric, while Emmet turns Ma&amp;#039;s washtub into a washtub bass for a jug band.\n\nEmmet and Ma each do an excellent job (despite Emmet&amp;#039;s jug band having to frantically change songs after another contestant performs their song, Bar-b-que), only to be defeated at the last minute by a rock and roll band called The Nightmare, which comprises a hoodlum gang from the fairly distant town of River Bottom. However, as Ma and Emmet&amp;#039;s jug band sing a song together on the way home (more accurately, both of their talent show songs together after Ma realized they fit together), they are overheard by Doc Bullfrog, owner of a local restaurant, who hires them to sing for his customers, thus granting them the bigger prize.","torrent":{"xt":"urn:btih:762c028515b4eebf69a10fd7f193e94c6315ac00","amp;dn":"Emmet+Otter%5C%27s+Jug+Band+Christmas+%5B1977%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"762c028515b4eebf69a10fd7f193e94c6315ac00","infoHashBuffer":{"type":"Buffer","data":[118,44,2,133,21,180,238,191,105,161,15,215,241,147,233,76,99,21,172,0]},"announce":[],"urlList":[]}}