{"title":"6,100 Home Plans","uid":4462789,"size":680585216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76568257efdca8ff3bbbf561b18f5508344f5387&amp;dn=6%2C100+Home+Plans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"wennZone","files":1,"time":1224783366,"description":"6,100 Home Plans\n\nPlans to build your own house\n\n\nPlease be sure you read the article called &quot;Your Worst Mistake&quot;.\nThat article helps people who are shopping for a home. You read\nthat article by clicking on the HELP tab in the Home-Plan\nFinder(TM) 2.0 application.\n \nThe help also has useful information for people who sell, build\nor design homes. See the document called &quot;Getting Down To\nBusiness&quot; found in the Help.\n\nIf you have trouble installing or running the software, see the\n&quot;Problems and Solutions&quot; section in the &quot;abbisoft.hlp&quot; Help file.\nTo read the Help file, press F1 after starting the application.\n\nYou need to shut down all other programs before running the\ninstall. Other programs might be using files we need to update.\nIf you experience installation problems, try shutting down all\nother programs and then re-install this software.\n\n\nWhen you attempt to install from your CD-ROM drive, you may \nreceive this error message:\n\n  ISSET_SE Caused a General Protection Fault in Module...\n\nThis behavior can occur if any of the following conditions \nexists: \n\n  Norton AntiVirus version 4.04 is installed and Norton \n  AutoProtect is enabled. \n\n  You use LiveUpdate for Norton AntiVirus to download an \n  updated version of Norton AntiVirus. \n\n  Microsoft IntelliPoint software is installed on your \n  computer, and the Point32 program is currently running. \n\n  Microsoft IntelliMouse or Microsoft IntelliMouse Trackball \n  software is installed on your computer, and the Mswheel \n  program is currently running. \n\nRESOLUTION\nTo work around this behavior, use the appropriate method\nbelow, and then attempt to install this software again. \n\n  Norton AutoProtect Is Enabled\n  Disable Norton AutoProtect Mode. To do so, right-click \n  the Norton icon on the taskbar, and then click Disable. \n  Disabling the Load AutoProtect At Startup option on the \n  AutoProtect tab does not disable AutoProtect. \n\n  You Use LiveUpdate to Download Norton AntiVirus\n  Obtain the latest version of LiveUpdate for Norton AntiVirus \n  from Symantec&amp;#039;s Web site. For more information about how to \n  obtain LiveUpdate, contact Symantec Technical Support. \n\n  The Point32 Program Is Running\n  Quit the Point32 program by pressing CTRL+ALT+DELETE to \n  open the Close Program dialog box, clicking Point32, \n  clicking End Task, and then clicking End Task again. \n\n  The Mswheel Program Is Running\n  Quit the Mswheel program by pressing CTRL+ALT+DELETE to \n  open the Close Program dialog box, clicking Mswheel, \n  clicking End Task, and then clicking End Task again. \n\nMORE INFORMATION\n\nNorton AntiVirus, Point32, and Mswheel are manufactured by \nvendors independent of AbbiSoft Multimedia, Inc.; we make \nno warranty, implied or otherwise, regarding these products&amp;#039; \nperformance or reliability. \n\nMANUAL INSTALL\n\nIf you still have problems with the setup program, all of the\napplication files are located on the CD-ROM in the INSTALL\ndirectory.  You can copy all of these files to a directory on\nyour harddrive, then run &quot;abbisoft.exe&quot;. It is preferable\nto do the copy in DOS, because Window&amp;#039;s Explorer might hide\nsome of the files.\n\nADDITIONAL HELP\n\nFor additional help, go to the technical support internet\nsite at www.abbisoft.com/tech\n\n\nRegards,\n\n\nWennZone,,,,\n","torrent":{"xt":"urn:btih:76568257efdca8ff3bbbf561b18f5508344f5387","amp;dn":"6%2C100+Home+Plans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76568257efdca8ff3bbbf561b18f5508344f5387","infoHashBuffer":{"type":"Buffer","data":[118,86,130,87,239,220,168,255,59,187,245,97,177,143,85,8,52,79,83,135]},"announce":[],"urlList":[]}}