{"title":"Frederick Forsyth - The Avenger","uid":9731345,"size":435598848,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7739164be3b45646b2bb61c602ab5cabee1c7ad1&amp;dn=Frederick+Forsyth+-+The+Avenger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":-1,"time":1394387819,"description":"&quot;The master is back,&quot; the promo goes, &quot;with his best thriller since The Day of the Jackal.&quot; A bold statement: while no Jackal, this strong and memorable novel is his best in decades, and as good as The Odessa File and The Dogs of War. It is the story of vigilante Cal Dexter's pursuit of a Serbian warlord into the jungles of the fictional Republic of San Martin. Dexter, former Vietnam tunnel rat, now small-town attorney and clandestine kidnapper of refugees from justice, is after Zoran Zilic, a gangster who has escaped Serbia with a fortune but not before savagely killing an American aid worker who happens to be the grandson of a billionaire mining magnate. It's the magnate who sets in motion the operation against Zilic, first through a man known as &quot;The Tracker,&quot; who locates him, then via the Avenger, whose task is to bring Zilic to American justice. But Zilic is protected in his South American jungle compound not only by the best security money can buy but also by a top FBI man who plans to use the warlord to help take out a dangerous terrorist named Usama bin Laden; much of the narrative takes place within weeks of 9/11, and is laced with irony. Forsyth fans won't be surprised that the action, always exciting, is supported by numerous briefings on matters geopolitical, historical and scientific; with Jackal, Forsyth established the now traditional formula of thrillers that educate as well as entertain. The digressions are frequent early on but no page lacks interest and the novel's second half, which focuses on the Avenger's attempted snatch of Zilic, is pure gold. ","torrent":{"xt":"urn:btih:7739164be3b45646b2bb61c602ab5cabee1c7ad1","amp;dn":"Frederick+Forsyth+-+The+Avenger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7739164be3b45646b2bb61c602ab5cabee1c7ad1","infoHashBuffer":{"type":"Buffer","data":[119,57,22,75,227,180,86,70,178,187,97,198,2,171,92,171,238,28,122,209]},"announce":[],"urlList":[]}}