{"title":"Wolverine Origins 01-50 + Ann (2006-2010|Digital|AnPymGold-Emp)","uid":9955035,"size":2592931578,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:77bd357435c54fa659fdd258596d0e320106b2ce&amp;dn=Wolverine+Origins+01-50+%2B+Ann+%282006-2010%7CDigital%7CAnPymGold-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1397442120,"description":"For more information on this series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Wolverine:_Origins&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Wolverine:_Origins&lt;/a&gt;\n\nThis series was written by Daniel Way with art by Steve Dillon and others, and focuses on WOlverine's relationship with Daken among other plots as well as crossing into the Dark Reign storyline as well. Promotional info for the first collected edition - &quot;Picking up where House of M and Wolverine: Origins and Endings left off! Armed with the one thing that could kill him, as well as key clues to his very existence, Logan embarks on the first leg of a long and bloody quest for vengeance against those who once enslaved him. No longer feeling the need to play it quiet, Logan's first strike elicits a Condition Critical response from the U.S. government. With no other choice, they drop their bomb - and you won't believe who it is! When Logan hits D.C., someone's going to be waiting for him.&quot;\n\nSummary from Comic Vine - &quot;For years Wolverine did not have access to his past memories due to brainwashing and memory implants. Now that he has regained those memories, he is attempting to sort them out. Faced with past deeds he was forced to complete, Wolverine is trying to right those wrongs and to seek out those responsible.&quot;\n\nThis is all 50 issues of the series + the 2007 annual. All of the regular issues are the new digital editions by AnPymGold in conjunction with Empire; the Annual has no digital copy and is the traditional scan by Steam-DCP. Thanks to all the scanners for their hard work; please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:77bd357435c54fa659fdd258596d0e320106b2ce","amp;dn":"Wolverine+Origins+01-50+%2B+Ann+%282006-2010%7CDigital%7CAnPymGold-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77bd357435c54fa659fdd258596d0e320106b2ce","infoHashBuffer":{"type":"Buffer","data":[119,189,53,116,53,197,79,166,89,253,210,88,89,109,14,50,1,6,178,206]},"announce":[],"urlList":[]}}