{"title":"Is It Just Me by Miranda Hart (ePUB/Mobi)","uid":7861728,"size":4223788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7855a20e6caa95093df7b94976ff8ccdca9b7ff8&amp;dn=Is+It+Just+Me+by+Miranda+Hart+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"azizex666","files":-1,"time":1353948857,"description":"Well hello to you dear browser. Now I have your attention it would be rude if I didn't tell you a little about my literary feast. So, here is the thing: is it just me or does anyone else find that adulthood offers no refuge from the unexpected horrors, peculiar lack of physical coordination and sometimes unexplained nudity, that accompanied childhood and adolescence?\n\nDoes everybody struggle with the hazards that accompany, say, sitting elegantly on a bar stool; using chopsticks; pretending to understand the bank crisis; pedicures - surely it's plain wrong for a stranger to fondle your feet? Or is it just me?\n\nI am proud to say I have a wealth of awkward experiences - from school days to life as an office temp - and here I offer my 18-year-old self (and I hope you too dear reader) some much needed caution and guidance on how to navigate life's rocky path.\n\nBecause frankly where is the manual? The much needed manual to life. Well, fret not, for this is my attempt at one and let's call it, because it's fun, a Miran-ual. I thank you.\n\nMiranda Hart made her mark appearing in shows including Smack the Pony, Absolutely Fabulous and Not Going Out. But when her sitcom Miranda burst on to our screens in 2009, her popularity rocketed. Miranda has since been crowned the Queen of Comedy at the British Comedy Awards and the hit series Miranda has won two further comedy awards, two RTS Awards, and been nominated for four BAFTAs. Miranda is currently filming a drama for BBC based on the bestselling memoir Call the Midwife. The third series of Miranda will air in autumn 2012\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published -  October 11th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:7855a20e6caa95093df7b94976ff8ccdca9b7ff8","amp;dn":"Is+It+Just+Me+by+Miranda+Hart+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7855a20e6caa95093df7b94976ff8ccdca9b7ff8","infoHashBuffer":{"type":"Buffer","data":[120,85,162,14,108,170,149,9,61,247,185,73,118,255,140,205,202,155,127,248]},"announce":[],"urlList":[]}}