{"title":"Kris Kristofferson - Let the Music Play [2013] [Live album][EAC/","uid":10269182,"size":309376968,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:787a4ba20154a3f268b8d2f139054bbfa8cb6b58&amp;dn=Kris+Kristofferson+-+Let+the+Music+Play+%5B2013%5D+%5BLive+album%5D%5BEAC%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"dickspic","files":20,"time":1401554794,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: All Access / Chrome Dreams / #AACD 0111\nCountry:USA\nYear: 2013\nGenre: Country\nFormat: CD,Album\n\n\n\n1. Duvalier's Dream\n2. When I Loved Her\n3. Jesus Was A Capricorn\n4. Same Old Song\n5. Band Introduction\n6. Smile At Me Again\n7. Loving Her Was Easier\n8. Casey's Last Ride\n9. Billy Dee\n10. Sunday Mornin Comin Down\n11. Jesus Song\n12. A Woman Left Lonely\n13. Everybody Loves a Winner\n14. Help Me Make It through the Night\n15. My Crew\n\n\n\n\nKris Kristofferson is one of a select handful of artists who have become equally respected as a musician/composer and as an actor. Many others have tried, but very few have made such an indelible mark in both spheres. Indeed, as 2012 saw the release of the man's 17th studio album, Feeling Mortal, it equally witnessed the premiere of his latest movie one of almost 100 he has featured in to date - Joyful Noise, a musical that also stars Dolly Parton and Queen Latifah. Amongst the many movies that feature his name, A Star Is Born (co-starring with Barbra Streisand) is probably the best known, but his inclusion in films as renowned as Sam Peckinpah s superb Pat Garrett &amp; Billy The Kid, the maligned but magnificent masterpiece Heaven s Gate, John Sayles low budget but critically acclaimed Lone Star and the cult classic Cisco Pike is what singles Kristofferson out as an actor of true merit. Musically, he has written a string of Country songs that have become standards of the genre: Help Me Make It Through The Night, Me And Bobby McGee, Sunday Morning Coming Down and For The Good Times. His songs have been covered by superstars including Elvis Presley, Johnny Cash, Frank Sinatra and Janis Joplin. This beautifully recorded 1972 live broadcast from RCA s New York Studios, displays the best of Kristofferson's musical talents. His career in music began in 1965, after he decided to cut short a promising stint in the US Army and moved to Nashville to concentrate on song writing. Initially, he took a janitorial job at Columbia Studios - a very astute move as he met Johnny Cash there and was able to watch Bob Dylan s recording sessions for his classic 1966 album, Blonde On Blonde. Soon his own song writing blossomed and he wrote hits for a host of Country artists including Roger Miller, Faron Young, Jerry Lee Lewis and Ray Stevens. Kristofferson's own major debut as a performer was at the prestigious Newport Folk Festival in 1969, where he was introduced by Johnny Cash. By the time of this recording he had already released four albums, all recorded for the Monument label. Duvalier's Dream, Casey s Last Ride, Sunday Mornin Comin Down and Help Me Make It Through The Night are all drawn from his superb debut 1970 debut, Kristofferson. The Silver Tongued Devil And I (1971) is represented by When I Loved Her, Loving Her Was Easier and Billy Dee. Jesus Was a Capricorn is drawn from the eponymous 1972 album. Same Old Song and Smile At Me Again were unreleased when broadcast, but subsequently appeared on Spooky Lady in 1974. Rita Coolidge joins the ensemble onstage towards the end of the set. She was already a renowned Country singer in her own right with three albums under her belt. Her then current record, The Lady s Not For Sale (1972) contributes three songs: A Woman Left Lonely, Everybody Loves A Winner and My Crew. Rita also joins Kris for a duet on his classic Help Me Make It Through The Night, which might be seen as a touching reflection on their own relationship - they married in 1973 and went on to record three albums as a duo over the next five years.","torrent":{"xt":"urn:btih:787a4ba20154a3f268b8d2f139054bbfa8cb6b58","amp;dn":"Kris+Kristofferson+-+Let+the+Music+Play+%5B2013%5D+%5BLive+album%5D%5BEAC%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"787a4ba20154a3f268b8d2f139054bbfa8cb6b58","infoHashBuffer":{"type":"Buffer","data":[120,122,75,162,1,84,163,242,104,184,210,241,57,5,75,191,168,203,107,88]},"announce":[],"urlList":[]}}