{"title":"Spec.Ops.The.Line-R.G.Mechanics","uid":9001826,"size":4486297939,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:788058a498ac5d1a6a7783db5da2660ca2355e7b&amp;dn=Spec.Ops.The.Line-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"Taker009","files":21,"time":1380956245,"description":"Spec.Ops.The.Line-R.G.Mechanics\n\n\nYear: 2012\nPublication Type: Repack \nCrack: {enclosing} SKIDROW\nVersion: 1.0.6890.0\nLanguage:  RUS,  ENG\nSound language:  RUS,  ENG\n\nDescription: \n\nSpec Ops: The Line - an unusual cinematic third-person shooter that will make you enter \ninto a confrontation not only with real opponents, but even with their own principles. \nGet ready to be in a world where there is no place the concept of &quot;morality&quot; and at \nevery step we have to choose - who will live and who will die. Dubai was wiped off \nthe face of the Earth horrific cataclysm. The unprecedented dust storm turned the \nonce magnificent city in ruins. And now you in the role of Delta Force squad \ncaptain Martin Walker have to go to the hostile territory to find and return \nthe home of Colonel John Konrad. Take part in the raid and battle against \nopponents who are not afraid of death. Spec Ops: The Line combines an exciting \nstoryline campaign and addictive multiplayer with multiple competitive and \ncooperative modes. You will be able to enter the conflict on the side of one \nof the two factions and to prove their superiority against the background of tures\nthe beautiful and terrifying at the same time the ruined landscape of Dubai.\n\nGame Features\n\n*  The story of Martin Walker repeatedly cause you to make a choice \n   between right and necessary. \n\n*  The arena will be the ruins of a special operation to Dubai - the city \n   that once drowning in luxury and well-known as the most chic place on \n   earth. At each step there is grandeur mixed with destruction, and \n   preserved within the fine structures hidden death.\n*  An important factor in the battles of Spec Ops: The Line serves sand. \n   Accurate shot can often radically change the course of battle. Sands like \n   living in Dubai - this uncontrollable and unpredictable force can both \n   help you and destroy you.\n*  Even in the most heated skirmishes will always be companions managed \n   by artificial intelligence.\n*  An exciting storyline campaign complement a variety of network modes, \n   among which there are the classic choices, and unique modifications \n   associated with the development of the main plot. You can choose one \n   of the two parties to the conflict, personalize your character and \n   customize it to fit your own style of play.\n\nSystem requirements:\n\nOperating system: Windows XP  (SP3), Windows Vista  (SP2), Windows 7  (SP1) \nProcessor: Intel  Core  2 Duo 2.0 GHz or AMD  Athlon  X2 3200 + \nMemory: 2 GB \nVideo: Nvidia  GeForce 9800 GTX or ATI  Radeon HD 4850 with 512 MB \nSound device: compatible with DirectX  9.0c \nFree hard drive space: 9 GB\nStarting: Install and play.\n\nRepack Features  \n\nDo not cut / recoded \nGame Version - 1.0.6890.0 (update 2) \nDLC: Fubar Pack, Coop Chalenge Mode \nRepack by R.G.Mechanics\n\n","torrent":{"xt":"urn:btih:788058a498ac5d1a6a7783db5da2660ca2355e7b","amp;dn":"Spec.Ops.The.Line-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"788058a498ac5d1a6a7783db5da2660ca2355e7b","infoHashBuffer":{"type":"Buffer","data":[120,128,88,164,152,172,93,26,106,119,131,219,93,162,102,12,162,53,94,123]},"announce":[],"urlList":[]}}