{"title":"Shortbus AKA The Sex Film Project","uid":4207884,"size":730161152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78b736d16bbd73a4fde6baaa44783c0a42903bd2&amp;dn=Shortbus+AKA+The+Sex+Film+Project+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"circlensess","files":1,"time":1211904835,"description":"Also Known As: The Sex Film Project \n\nNumerous New York City-dwellers come to the exclusive club Shortbus to work out problems in their sexual relationships. Rob and Sophia are a happily married couple, except for the fact that she has never experienced sexual climax. This irony follows her to work, because she is a couples counselor who frequently has to deal with the sexual issues other couples have. Two of her patients are Jamie and James, a gay couple who have been monogamous for five years and counting. James wants to bring other men in to the relationship, and his own history with depression may hint at an ulterior motive. Ceth (Pronounced like Seth) may be the perfect addition to their family, but Caleb, a voyeur from across the street, may have his own ideas about that. Sophia visits Severin, a dominatrix with secrets of her own to reveal. \n\nCanadian Broadcasting Corporation was going to fire Sook-Yin Lee when they learned that she was going to be participating in a film with explicit sexual content. Several prominent individuals came to her rescue, including Gus Van Sant, Atom Egoyan, David Cronenberg and Julianne Moore, in successfully urging CBC to retain Lee as a member of their staff.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0367027/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0367027/&lt;/a&gt;\n\nCast \n\tSook-Yin Lee\t... \tSofia\n\tPaul Dawson\t... \tJames\n\tLindsay Beamish\t... \tSeverin\n\tPJ DeBoy\t... \tJamie\n\tRaphael Barker\t... \tRob\n\tPeter Stickles\t... \tCaleb, the Stalker\n\tJay Brannan\t... \tCeth\n\tAlan Mandell\t... \tTobias, the Mayor\n\tAdam Hardman\t... \tJesse, the John\n\tRay Rivas\t... \tShabbos Goy\n\tBitch\t... \tBitch / Shortbus House Band\n\tShanti Carson\t... \tLeah, the Beautiful Couple\n\tJustin Hagan\t... \tBrad\n\tJan Hilmer\t... \tNick, the Beautiful Couple\n\tStephen Kent Jusick\t... \tCreamy\n\n\nOpen your mind and your heart, Last night I went to see a screening of Shortbus; John Cameron Mitchell&amp;#039;s follow-up to Hedwig and the Angry Inch and it was the most joyful movie experience I&amp;#039;ve had in ages. There is something audacious and exciting going on here... something that maybe hasn&amp;#039;t been seen in American film since the 60&amp;#039;s. Shortbus is laugh-out-loud funny and sink-in-your-seat to hide your tears sad. There&amp;#039;s a message of &amp;#039;acceptance&amp;#039; and &amp;#039;we&amp;#039;re all in this together&amp;#039; to be received... you just have to want to hear it (and that, in itself, will present a problem to a fair number of moviegoers who are just unable to let it in.) The explicit sex isn&amp;#039;t just a gimmick... it really feels like it comes from an honest place with these characters. It&amp;#039;s playful when it needs to be, angry at other times, sometimes it&amp;#039;s tentative and unsure. Just like how it is in real life (as opposed to porn) which is why it works so well.","torrent":{"xt":"urn:btih:78b736d16bbd73a4fde6baaa44783c0a42903bd2","amp;dn":"Shortbus+AKA+The+Sex+Film+Project+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b736d16bbd73a4fde6baaa44783c0a42903bd2","infoHashBuffer":{"type":"Buffer","data":[120,183,54,209,107,189,115,164,253,230,186,170,68,120,60,10,66,144,59,210]},"announce":[],"urlList":[]}}