{"title":"Joseph Roth - The Radetzky March &amp; other novels (6 books)","uid":10281458,"size":5286157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78d20ccce7b7cf7cf2a58f20ca8ff29b0684d284&amp;dn=Joseph+Roth+-+The+Radetzky+March+%26amp%3B+other+novels+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"workerbee","files":-1,"time":1401667963,"description":"\nJOSEPH ROTH (1894-1939) was an Austrian-Jewish journalist and novelist, best known for his family saga THE RADETZKY MARCH (1932) about the decline and fall of the Austro-Hungarian Empire, and for his novel of Jewish life, JOB (1930).  His work is concise and emotionally forthright, with a style that harks back to the nineteenth century realists.\n\nHOTEL SAVOY (1924) is set in the Polish town of Lodz, where lonely war veterans, variety dancers and others dream of better places.  Still bearing scars from the gulag, a freed POW traverses Russia to arrive at the massive Hotel Savoy, where he meets a surreal cast of characters, each eagerly awaiting the return from America of a rich man named Bloomfield.\n\nIn THE SILENT PROPHET (1929), the protagonist returns to Russia from abroad after the February Revolution, becoming a leader of the Red Army, but realizes during the civil war that the revolution seems to be over before it has begun, that the cause has been betrayed, and that exile might offer the only choice.  A beautifully descriptive journey from loneliness into an illusory worldliness and back into loneliness, this is a haunting study in alienation.\n\nJOB (1930), based on the Book of Job and subtitled &quot;The Story of a Simple Man&quot;, tells the story of an orthodox Jew whose faith is weakened when he moves from Tsarist Russia to New York.  Harriet Porter of The Guardian reviewed the book in 2000: &quot;Roth captures essential truths about faith, hope and despair within his reworking of a Biblical story.  His writing is rich without being dense, and has a fable-like directness.&quot;\n\nTHE RADETZKY MARCH (1932), Roth's best-known work, chronicles the decline and fall of the Austro-Hungarian Empire via the story of the privileged von Trotta family.  German literary critic Marcel Reich-Ranicki included it in Der Kanon (&quot;The Canon&quot;) of the most important German-language literary novels.  Colombian writer Mario Vargas Llosa ranked The Radetzky March as the best political novel ever written.\n\nRoth's continues his account of the von Trotta family from 1913 to 1938 in THE EMPEROR'S TOMB (1938).  It is a haunting elegy to the vanished world of the Austro-Hungarian Empire, and a magically evocative paean to the passing of time and the loss of hope.  Prophetic and regretful, intuitive and exact, Roth tells of one man's foppish, sleepwalking, spoiled youth and then his struggle to come to terms with the uncongenial society of post-First World War Vienna, financial ruin, and the first intimations of Nazi barbarities.\n\nFinally, TARABAS (1934) is a powerful fable set in the early days of the Russian Revolution about a Russian peasant who learns in his youth from a gypsy that it is his destiny to be both a murderer and saint.  In Tarabas's fulfillment of his tragic destiny, the larger movements of history find their perfect expression in the fate of one man.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n* THE EMPEROR'S TOMB (New Directions, 2013).  Translated by Michael Hofmann.\n\n* HOTEL SAVOY (Overlook, 2003).  Translated by John Hoare.\n\n* JOB: The Story of a Simple Man (Archipelago Books, 2010).  Translated by Ross Benjamin.\n\n* THE RADETZKY MARCH (Penguin Classics, 1995).  Translated by Joachim Neugroschel and with an Introduction by Nadine Gordimer.\n\n* THE SILENT PROPHET (Peter Owen, 2001).  Translated by David Le Vay.\n\n* TARABAS: A Guest on Earth (Picador Classics, 1988).  Translated by Winifred Katzin. -- PDF\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                              &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:78d20ccce7b7cf7cf2a58f20ca8ff29b0684d284","amp;dn":"Joseph+Roth+-+The+Radetzky+March+%26amp%3B+other+novels+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78d20ccce7b7cf7cf2a58f20ca8ff29b0684d284","infoHashBuffer":{"type":"Buffer","data":[120,210,12,204,231,183,207,124,242,165,143,32,202,143,242,155,6,132,210,132]},"announce":[],"urlList":[]}}