{"title":"[Discografia]Planet_Hemp(by_SARS)","uid":4288765,"size":205430123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7922a9d37377e82bd045f07b0eda9d4354f5bb1a&amp;dn=%5BDiscografia%5DPlanet_Hemp%28by_SARS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"pessutti","files":-1,"time":1215826178,"description":"Selecionado Por SARS (Rogerin)\n                     Discografia Planet HEMP   \n\nA banda surgiu num encontro de casamento entre Marcelo D2 e Skunk, pelas ruas do Catete. D2 usava uma camisa do Dead Kennedys e Skunk, artesÃƒÂ£o e vendedor de camisetas de Rock, deu inÃƒÂ­cio a um diÃƒÂ¡logo que daÃƒÂ­ nasceu a amizade e vocaÃƒÂ§ÃƒÂ£o. Skunk falava de mÃƒÂºsica todo o tempo e nesse momento D2 resolveu que queria ser mÃƒÂºsico. A banda nÃƒÂ£o era para ser de Rap e sim de Rock, mas eles nÃƒÂ£o sabiam tocar nada e queriam cantar.\n\nO nome da banda foi tirado da revista americana High Times, especializada em cannabicultura, ou seja sobre o cultivo de maconha, e Hemp que, na lÃƒÂ­ngua inglesa, significa maconha, e para evitar problemas com a policia, colocaram o nome em inglÃƒÂªs, porÃƒÂ©m a manobra do grupo, nÃƒÂ£o durou muito, pois anos mais tarde do comeÃƒÂ§o da banda, o grupo foi preso por apologia as drogas. Mais tarde, se juntaram ÃƒÂ  Skunk e D2, Rafael, FormigÃƒÂ£o e Bacalhau.\n\nNo palco os vocais falados do rap foram misturados com as guitarras psicodÃƒÂ©licas e com letras que pediam a legalizaÃƒÂ§ÃƒÂ£o da maconha com muita fumaÃƒÂ§a e zoeira. Desde o comeÃƒÂ§o, o Planet Hemp se destacou por sua performance ao vivo.\n\nRegistraram uma ÃƒÂºnica fita-demo e seguiram o circuito alternativo em apresentaÃƒÂ§ÃƒÂµes no Rio de Janeiro, SÃƒÂ£o Paulo, Belo Horizonte, Curitiba e em festivais como o Juntatribo (Campinas) e Superdemo. A morte de Skunk, em 1994, quase decretou o fim do grupo. Mas B NegÃƒÂ£o, que era presente em todos os concertos, assumiu o outro vocal. A banda conseguiu um contrato com a Sony Music (Superdemo / Chaos) e gravaram UsuÃƒÂ¡rio (1995), Os CÃƒÂ£es Ladram mas a Caravana NÃƒÂ£o PÃƒÂ¡ra (1997) e A InvasÃƒÂ£o do Sagaz Homem FumaÃƒÂ§a (2000). Solto jÃƒÂ¡ era ÃƒÂ³timo, prensado ficou melhor ainda.\n\nLanÃƒÂ§ado em marÃƒÂ§o de 1995, o disco contava com hits como Legalize JÃƒÂ¡ que se transformou em hit, apesar do clip ter sofrido censuras. Mas o grupo nÃƒÂ£o chamou atenÃƒÂ§ÃƒÂ£o somente pelas letras que falam de maconha e legalizaÃƒÂ§ÃƒÂ£o. As 17 faixas nÃƒÂ£o se restringem ÃƒÂ  legalizaÃƒÂ§ÃƒÂ£o apenas. O disco aborda temas que giram em torno de violÃƒÂªncia, dos menores de rua, e das dificuldades financeiras enfrentados pelo cidadÃƒÂ£o comum brasileiro.\n\nA banda jÃƒÂ¡ teve passagem na polÃƒÂ­cia por apologia ÃƒÂ s drogas.\n\nPlanet Hemp jÃƒÂ¡ tocou com Black Alien &amp; Speed, Beastie Boys, Cypress Hill e lotou o Metropolitan em um concerto conjunto com os Raimundos, com pÃƒÂºblico de mais de 6 mil pessoas.\n\nA ÃƒÂºltima formaÃƒÂ§ÃƒÂ£o contou com Marcelo D2 (vocal), BNegÃƒÂ£o (vocal), FormigÃƒÂ£o (baixo), Rafael (guitarra), Pedrinho (bateria), ZÃƒÂ© Gonzales (DJ) e Apolo 9 (teclados). SÃƒÂ£o presenÃƒÂ§a nas rÃƒÂ¡dios de rock, e tiveram duas indicaÃƒÂ§ÃƒÂµes no VMB (1996).\n\nA banda se encerrou em 2001 por motivo de brigas entre os membros da banda, por causa dos trabalhos solo do Marcelo D2, o ÃƒÂºltimo disco foi o MTV Ao Vivo: Planet Hemp.\n\n\nbom Show\n\n\n  SSSS      A     RRRR     SSS\n S         A A    R   R   S\n S        A   A   R    R  S\n  S      A  A  A  RRRRR    S\n    S    A  AA A  R   R      S  \nSSSSS    A     A  R    R  SSS\n\n\n\n","torrent":{"xt":"urn:btih:7922a9d37377e82bd045f07b0eda9d4354f5bb1a","amp;dn":"%5BDiscografia%5DPlanet_Hemp%28by_SARS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7922a9d37377e82bd045f07b0eda9d4354f5bb1a","infoHashBuffer":{"type":"Buffer","data":[121,34,169,211,115,119,232,43,208,69,240,123,14,218,157,67,84,245,187,26]},"announce":[],"urlList":[]}}