{"title":"Malware Analyst's Cookbook And DVD","uid":6851543,"size":1030410833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79b71fbf5e77d82b3e92ac854533786cba316f75&amp;dn=Malware+Analyst%5C%27s+Cookbook+And+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"d1zzYLOL","files":2,"time":1322546367,"description":"The Torrent File Includes the PDF Book AND The DVD in .iso format. (I have not been able to find the DVD and Book together).  \n\nIn Linux, mount -o loop ./path/to/iso /mnt/point\nIn Windows, you will need to download Daemon tools...or better yet, Arch Linux ;)\n\nVia Amazon.com:\n\nBook Description\nISBN-10: 0470613033 | ISBN-13: 978-0470613030 | Publication Date: November 2, 2010 | Edition: 1\n\n\nA computer forensics &quot;how-to&quot; for fighting malicious code and analyzing incidents\n\nWith our ever-increasing reliance on computers comes an ever-growing risk of malware. Security professionals will find plenty of solutions in this book to the problems posed by viruses, Trojan horses, worms, spyware, rootkits, adware, and other invasive software. Written by well-known malware experts, this guide reveals solutions to numerous problems and includes a DVD of custom programs and tools that illustrate the concepts, enhancing your skills.\n\n    Security professionals face a constant battle against malicious software; this practical manual will improve your analytical capabilities and provide dozens of valuable and innovative solutions\n    Covers classifying malware, packing and unpacking, dynamic malware analysis, decoding and decrypting, rootkit detection, memory forensics, open source malware research, and much more\n    Includes generous amounts of source code in C, Python, and Perl to extend your favorite tools or build new ones, and custom programs on the DVD to demonstrate the solutions\n\nMalware Analyst's Cookbook is indispensible to IT security administrators, incident responders, forensic analysts, and malware researchers.\n","torrent":{"xt":"urn:btih:79b71fbf5e77d82b3e92ac854533786cba316f75","amp;dn":"Malware+Analyst%5C%27s+Cookbook+And+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79b71fbf5e77d82b3e92ac854533786cba316f75","infoHashBuffer":{"type":"Buffer","data":[121,183,31,191,94,119,216,43,62,146,172,133,69,51,120,108,186,49,111,117]},"announce":[],"urlList":[]}}