{"title":"Star.Wolves.3.Civil.War-SKIDROW","uid":5407235,"size":3357612566,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:79d015a3b22ce94166e575801a639b5e71b0c485&amp;dn=Star.Wolves.3.Civil.War-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"thenoobish","files":69,"time":1267639171,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nStar Wolves 3: Civil War / 1C Company\n\nRELEASE DATE : 03-03-2010               PROTECTION : SecuROM\nGAME TYPE    : Space Strategy/RPG       DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nLarge-scale battles have become a vestige of the past,\ndepleting resources of conflicting parties. Settled space,\nwhere welfare and order had reigned, has become a cemetery for\ndead ships which is flooded with pirates and adventurists.\nComplete impunity, black market flourishing where gun and tech\ntrade is on the move, arbitrariness and anarchy - the Galaxy\nhas become a real dangerous place. Events in the Universe and\nits habitants destiny are completely up to players choice\nand tactical decisions.\n\nStar Wolves 3: Civil War is a sequel to the popular\nreal-time strategy with RPG elements. Original large-scale\nscenario, closely tied with the first part of intergalactic\nepic helps the player influence the ongoing events and\nforeordain one of many endings. Free roam, free mission\nselection, free team forming  the world of Star Wolves waits\nfor its heroes.\n\nHuge world: 110 highly detailed star systems in different\nparts of the Galaxy\n\nNon-linear story: several endings and additional quests create\na complete game universe\n\nNew characters and skills: form up a team of your dream; teach\nyour companions new skills\n\nNew participant in the intergalactic conflict: the Space Fleet\nof a New Empire, equipped with its own spaceships\n\nA number of new base ships and fighters with unique\nspecifications and original weapon types and equipment\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:79d015a3b22ce94166e575801a639b5e71b0c485","amp;dn":"Star.Wolves.3.Civil.War-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d015a3b22ce94166e575801a639b5e71b0c485","infoHashBuffer":{"type":"Buffer","data":[121,208,21,163,178,44,233,65,102,229,117,128,26,99,155,94,113,176,196,133]},"announce":[],"urlList":[]}}