{"title":"Adventures Beyond the Body 4 CD Set with William Buhlman [FLAC]","uid":11880277,"size":1398325766,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79d41127d9edec43eb622bc3a4ab606c97084efe&amp;dn=Adventures+Beyond+the+Body+4+CD+Set+with+William+Buhlman+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"elessedilgirl","files":14,"time":1430664183,"description":"Are you ready to embark on the greatest adventure of your life? Join William Buhlman, a pioneer in out-of-body exploration, as he guides you on a journey to shimmering realms of being beyond your conscious awareness. ADVENTURES BEYOND THE BODY, a set of guided meditations, provides the listener with powerful tools for optimum out-of-body travel.\n\nBegin the journey with relaxing meditations that put you in touch with your pure, divine nature. Experience total freedom as you leave the limitations of your physical body behind and become aware of the radiance of your astral body. An incredible lightness of being can be yours through ADVENTURES BEYOND THE BODY.\n\nDisk 1: Sleep Programming for Out-of-Body Experiences relaxes you to sleep with positive statements and affirmations to prepare you for astral travel, and provide a safe and secure journey. (Start here and use concurrently with each successive technique).\n\nDisk 2: Spiritual Awakening puts you in touch with your pure, divine nature and assists you in achieving your spiritual goals with ease. Deeply relax and be at peace with Hypnosis for Out-of-Body Travel. This gentle meditation will allow you to see and feel total freedom as you leave the limitations of your physical body behind and become aware of your astral body. (Begin techniques with disk 2).\n\nDisk 3: Once we become in tune with our energy body and its ability to journey to worlds of light, we can practice and sharpen our travel skills. With the Target Technique, you will learn to visualize, notice colors and details, expanding your senses as much as possible. Spiritual Growth and Expansion continues the lessons as William Buhlman teaches you how to see, feel, and extend your astral body -- literally stretching your energy-self to feel lighter and lighter. (Alternate between techniques on disk 2 and 3).\n\nDisk 4: Finally, expand your ability to travel with The Vibrational Technique. This CD enables you to align yourself with heightened vibrational levels and the Chakra Technique, which moves through the seven chakras, opening them up for clarity and attuning them to higher energies. (Alternate between techniques on disk 2, 3 and 4).\n\nreference libFLAC 1.3.1 20141125\n\nSecure rips. Logs included","torrent":{"xt":"urn:btih:79d41127d9edec43eb622bc3a4ab606c97084efe","amp;dn":"Adventures+Beyond+the+Body+4+CD+Set+with+William+Buhlman+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d41127d9edec43eb622bc3a4ab606c97084efe","infoHashBuffer":{"type":"Buffer","data":[121,212,17,39,217,237,236,67,235,98,43,195,164,171,96,108,151,8,78,254]},"announce":[],"urlList":[]}}