{"title":"Complete Marvel Uncanny X-Men Comics DVD part 4","uid":4180013,"size":1657164586,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7abc560091aa82b35836afa0b72be27977c82bcb&amp;dn=Complete+Marvel+Uncanny+X-Men+Comics+DVD+part+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"citaltras","files":168,"time":1210352731,"description":"Complete Marvel Uncanny X-Men Comics DVD part 4 \t\n\n     \nTHE COMPLETE MARVEL UNCANNY\nCOMICS DVD\nPart 4:\nThe Uncanny X-Men 301-461\nThe Uncanny X-Men minus 1\n\nHere is the Complete Uncanny X-Men DVD nicely converted to the popular .cbz format. Now you can read these high quality commercial scans with your favorite comic book viewer software.\n\nThese are all complete scans, cover-to-cover, including letters pages, bullpen bulletins, and all advertisements. All files have been expertly converted from .pdf to .cbz format with single-page images! No more double-page images to navigate! And all are crisp, sharp scans! If you have used the commercial DVD, you are sure to appreciate this improved, user-friendly collection.\n\nThis torrent contains: The Uncanny X-Men 301-461 plus the Uncanny X-Men minus-one. Please download parts 1, 2, 3 and 4 to get the entire Uncanny X-Men Collection which consists of 487 issues!\nHow are these .cbz files better than .pdf?\n\nUnlike the commercial Marvel comic book collections, these files employ no use-restriction schemes. There are no passwords, no encryption, no water-marked images. You are free to view, copy, extract, print, and manipulate the images. Also, all images have been split into single pages for easier reading. A convenient graphical &quot;covers index&quot; is included to help you find the issues you want and an informative character bios file is also included. All are .cbz files.\n\nThese files will work well on any major computing platform, e.g. Windows, Linux/Unix, Mac OS-X, and many others. You can copy the comics files to your hard drive, laptop, or optical disk. Because these comics are in the popular .cbz format, they can now be read with your favorite comics viewing software. Unlike the .pdf file format, the .cbz file format is supported by a wide choice of snappy viewers offering a multitude of reading enhancement features. See the readme file, included in the collection, to learn where to down- load free .cbz/.cbr comic viewer software. ","torrent":{"xt":"urn:btih:7abc560091aa82b35836afa0b72be27977c82bcb","amp;dn":"Complete+Marvel+Uncanny+X-Men+Comics+DVD+part+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7abc560091aa82b35836afa0b72be27977c82bcb","infoHashBuffer":{"type":"Buffer","data":[122,188,86,0,145,170,130,179,88,54,175,160,183,43,226,121,119,200,43,203]},"announce":[],"urlList":[]}}