{"title":"Roger Pertwee - Handbook of Cannabis [2014][A]","uid":11213307,"size":13194860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ad2f736468cf9ca7969a280e997e3b185e6a8fa&amp;dn=Roger+Pertwee+-+Handbook+of+Cannabis+%5B2014%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1413297030,"description":"Description\nProduct Details\nBook Title: Handbook of Cannabis\t\nBook Author: Roger Pertwee (Editor)\nHardcover: 768 pages\nPublisher: Oxford University Press; 1 edition (October 21, 2014)\nLanguage: English\nISBN-10: 0199662681\nISBN-13: 978-0199662685\n\nBook Description\nTruly global in scope and with contributions from leading researchers around the world, The Handbook of Cannabis is the definitive resource on this fascinating drug. Combining scientific perspectives and clinical applications, it covers a vast array of topics, from why over the centuries cannabis has been used as a medicine, through the regulations facing those wishing to self-administer cannabis or provide cannabis-based medicines, to the chemical structure of its many constituents and the rapidly growing group of synthetic cannabinoids that are currently being used for 'legal highs'.\n\nWith each chapter written by a group of one or more internationally recognised subject experts, it provides academics and researchers with authoritative scientific material on the main pharmacological actions and their effects, as well as their pharmacokinetics, metabolism, and forensic detection. In addition it also examines the complex morphology, cultivation, harvesting, and processing of cannabis and the ways in which the plant's chemical composition can be controlled.\n\nAs well as offering a raft of scientific information there is extensive coverage of cannabinoid-based medicines. Helping readers to identify and evaluate their benefits, chapters explore pharmacological actions and the effects that seem to underlie approved therapeutic uses, how they are currently used to treat certain disorders, and the ever-growing number of wide-ranging potential clinical applications. There is also coverage of both the legal and illegal sources of cannabis, including 'coffee shops' and 'cannabis dispensaries'.\n\nThe complex issue of 'recreational cannabis' is also tackled. The sought-after and adverse psychological and non-psychological effects are described and discussions are included on how some adverse effects can be lessened by at least one constituent of cannabis, and that it might be possible to reduce the harm that cannabis does to some by changing current regulatory policies.\n\nThe Handbook of Cannabis is a one-stop reference; essential reading for all clinicians, pharmacologists, psychologists, and psychiatrists interested in this drug, as well as those working in the field of public health.\n\nReview\nThe &quot;Handbook of Cannabis&quot; is clearly a labour of love. Prof. Pertwee is an international leading light in the study of cannabis and cannabinoids. He has recruited an extended list of contributors and sub-editors, who have managed a Herculean task of summarising the wealth and breadth of knowledge on cannabis and cannabinoids. This handbook will be a fantastic reference book for both researchers and those outside the area to obtain an authoritative summary on that topic. This book is a masterpiece! The contributions Roger Pertwee has made (namely his research on experimental multiple sclerosis and cannabinoids) are incredibly noteworthy. The &quot;Handbook of Cannabis&quot; contains contributions from many important international researchers, and I am delighted to commend the handbook, which will no doubt be a landmark in the field.\n\nAbout the Author\nRoger Pertwee has three degrees from the University of Oxford: MA (in biochemistry), D.Phil. (in pharmacology) and D.Sc. (in physiological sciences). He is Professor of Neuropharmacology at the University of Aberdeen, Director of Pharmacology for GW Pharmaceuticals, co-chairman of the International Union of Basic and Clinical Pharmacology (IUPHAR) Subcommittee on Cannabinoid Receptors, a co-ordinator of the British Pharmacological Society's Special Interest Group on Cannabinoids, and visiting Professor at the University of Hertfordshire. He has also served as chairman of the International Association for Cannabinoid Medicines (IACM; 2005-2007) and twice as President of the International Cannabinoid Research Society (ICRS; 1997-1998; 2007-2008), and is currently ICRS International Secretary and also a member of the IACM board of directors","torrent":{"xt":"urn:btih:7ad2f736468cf9ca7969a280e997e3b185e6a8fa","amp;dn":"Roger+Pertwee+-+Handbook+of+Cannabis+%5B2014%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ad2f736468cf9ca7969a280e997e3b185e6a8fa","infoHashBuffer":{"type":"Buffer","data":[122,210,247,54,70,140,249,202,121,105,162,128,233,151,227,177,133,230,168,250]},"announce":[],"urlList":[]}}