{"title":"Bob_Dylan_and_the_Band-The_Basement_Tapes-2CD-(Remastered)-2009-","uid":4802005,"size":121287568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7ade5a490fb9cf9fea9215969500c1bebf944e2d&amp;dn=Bob_Dylan_and_the_Band-The_Basement_Tapes-2CD-%28Remastered%29-2009-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1238075017,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nBob Dylan (born Robert Allen Zimmerman on May 24, 1941) is an American singer-songwriter, author, poet, and painter, who has been a major figure in popular music for five decades. Much of Dylan's most celebrated work dates from the 1960s, when he became an informal chronicler and a reluctant figurehead of American unrest. A number of his songs, such as &quot;Blowin' in the Wind&quot; and &quot;The Times They Are a-Changin'&quot;, became anthems of both the civil rights movements and of those opposed to the Vietnam War.[3] His new studio album, Together Through Life, will be released on April 28, 2009. Dylan's last album, Modern Times, was released on August 29, 2006 and entered the U.S. album chart at number one; that year it was named Album of the Year by Rolling Stone magazine. \nDylan's early lyrics incorporated political, social, philosophical, and literary influences, defying existing pop music conventions and appealing widely to the counterculture. While expanding and personalizing musical styles, he has explored many traditions of American song, from folk, blues and country to gospel, rock and roll and rockabilly to English, Scottish and Irish folk music, and even jazz and swing. Dylan performs with the guitar, piano and harmonica. Backed by a changing line-up of musicians, he has toured steadily since the late 1980s on what has been dubbed the &quot;Never Ending Tour&quot;. Although his accomplishments as performer and recording artist have been central to his career, his songwriting is generally regarded as his greatest contribution. \nThroughout his career, Dylan has won many awards for his songwriting, performing, and recording. His records have earned Grammy, Golden Globe, and Academy Awards, and he has been inducted into the Rock and Roll Hall of Fame, Nashville Songwriters Hall of Fame and Songwriters Hall of Fame. In 2008, a &quot;Cultural Pathway&quot; was named in Dylan's honor in his birthplace, Duluth.[7][8] In 2008, he was awarded a Pulitzer Prize Special Citation for his &quot;profound impact on popular music and American culture, marked by lyrical compositions of extraordinary poetic power.&quot; \n\n","torrent":{"xt":"urn:btih:7ade5a490fb9cf9fea9215969500c1bebf944e2d","amp;dn":"Bob_Dylan_and_the_Band-The_Basement_Tapes-2CD-%28Remastered%29-2009-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ade5a490fb9cf9fea9215969500c1bebf944e2d","infoHashBuffer":{"type":"Buffer","data":[122,222,90,73,15,185,207,159,234,146,21,150,149,0,193,190,191,148,78,45]},"announce":[],"urlList":[]}}