{"title":"Gautam Shroff - The Intelligent Web. Search, smart algorithms, a","uid":10316843,"size":1991964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7af07b8996a419114cac4d70201e6d82afead844&amp;dn=Gautam+Shroff+-+The+Intelligent+Web.+Search%2C+smart+algorithms%2C+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":-1,"time":1402255657,"description":"Description\nProduct Details\nBook Title: The Intelligent Web: Search, smart algorithms, and big data\t\nBook Author: Gautam Shroff (Author)\nHardcover: 256 pages\nPublisher: Oxford University Press (January 28, 2014)\nLanguage: English\nISBN-10: 0199646716\nISBN-13: 978-0199646715\n\n===================================================================================\nBook Description\nPublication Date: January 28, 2014\nAs we use the Web for social networking, shopping, and news, we leave a personal trail. These days, linger over a Web page selling lamps, and they will turn up at the advertising margins as you move around the Internet, reminding you, tempting you to make that purchase. Search engines such as Google can now look deep into the data on the Web to pull out instances of the words you are looking for. And there are pages that collect and assess information to give you a snapshot of\nchanging political opinion. These are just basic examples of the growth of &quot;Web intelligence&quot;, as increasingly sophisticated algorithms operate on the vast and growing amount of data on the Web, sifting, selecting, comparing, aggregating, correcting; following simple but powerful rules to decide what\nmatters. While original optimism for Artificial Intelligence declined, this new kind of machine intelligence is emerging as the Web grows ever larger and more interconnected.\nGautam Shroff takes us on a journey through the computer science of search, natural language, text mining, machine learning, swarm computing, and semantic reasoning, from Watson to self-driving cars. This machine intelligence may even mimic at a basic level what happens in the brain.\n\n===================================================================================\nAbout the Author\nGautam Shroff is Vice President &amp; Chief Scientist, Tata Consultancy Services and head of the TCS Innovation Lab in Delhi, India. He occasionally teaches in an adjunct capacity at the IIT Delhi and IIIT Delhi, as well as online via Coursera. Prior to joining TCS in 1998, Shroff had been on the faculty of the California Institute of Technology, Pasadena, USA and thereafter of the Department of Computer Science and Engineering at Indian Institute of Technology, Delhi, India. He has also held visiting positions at NASA Ames Research Center in Mountain View, CA, and at Argonne National Labs in Chicago. Shroff has published over 30 research papers in the areas of computational mathematics, parallel computing, distributed systems, software architecture, software engineering, and information fusion. He has also written a book Enterprise Cloud Computing, published by Cambridge University Press in 2010. This is his first trade book.\n===================================================================================","torrent":{"xt":"urn:btih:7af07b8996a419114cac4d70201e6d82afead844","amp;dn":"Gautam+Shroff+-+The+Intelligent+Web.+Search%2C+smart+algorithms%2C+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af07b8996a419114cac4d70201e6d82afead844","infoHashBuffer":{"type":"Buffer","data":[122,240,123,137,150,164,25,17,76,172,77,112,32,30,109,130,175,234,216,68]},"announce":[],"urlList":[]}}