{"title":"50 Common Errors - A Practical Guide for English Learners.pdf","uid":8767525,"size":72739461,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b342e1fb496f90bc8079f556211ca1ca9d8159f&amp;dn=50+Common+Errors+-+A+Practical+Guide+for+English+Learners.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"rambam1776","files":-1,"time":1375368601,"description":"\n\n50 Common Errors: A Practical Guide for English Learners (Practical Guides for English Learners) by Bob Marsden\n\nEach page scanned to 150 dpi b/w photo and them combined into a PDF.\n\nBook Description\nPublication Date: September 2008 | ISBN-10: 0877796815\n\nAn essential handbook by noted author and ESL teacher Bob Marsden covering 50 common usage, style, and syntax errors encountered by English Language learners in day-to-day speech and writing. Provides easy-to-understand guidance on such topics as word order in indirect speech, irregular plurals, verb choice in tag questions, comparatives and superlatives, and choice of adjectives with count vs. noncount nouns. Includes special reference sections on English verb tenses and irregular verbs.\n\nOP NOTE - In my college writing classes, I often have adult learners who are ESL (English as Second Language), and have a terribly difficult time with unusual English structural issues such as articles (A, An, The), verb tenses, and typically just the inconsistent illogic of the whole bloody language. \n\nThis workbook - 150 pages of exercises plus the answer key - is a brute force fix to these issues. &quot;See this? We do it this way for this reason. Now, here are 30 exercises to practice. Now, see THIS? We do it this way...&quot; The explanatory notes include both full, complex instructions (Verbals, modals, appositives) as well as simple examples that any level reader can practice. Most modern textbooks don't emphasize good old boring grammar anymore, and that;s why most of them don't work. This book is NOT fun. It DOES work.","torrent":{"xt":"urn:btih:7b342e1fb496f90bc8079f556211ca1ca9d8159f","amp;dn":"50+Common+Errors+-+A+Practical+Guide+for+English+Learners.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b342e1fb496f90bc8079f556211ca1ca9d8159f","infoHashBuffer":{"type":"Buffer","data":[123,52,46,31,180,150,249,11,200,7,159,85,98,17,202,28,169,216,21,159]},"announce":[],"urlList":[]}}