{"title":"The Hundred-Year Marathon: China's Secret Strategy (2015)epub","uid":11740825,"size":441409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b39fe7c147851e64abe18b11cf1085968165013&amp;dn=The+Hundred-Year+Marathon%3A+China%27s+Secret+Strategy+%282015%29epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1425815229,"description":"The Hundred-Year Marathon: China's Secret Strategy to Replace America as the Global Superpower \n\nOne of the U.S. government's leading China experts reveals the hidden strategy fueling that country's rise - and how Americans have been seduced into helping China overtake us as the world's leading superpower.\n\nFor more than forty years, the United States has played an indispensable role helping the Chinese government build a booming economy, develop its scientific and military capabilities, and take its place on the world stage, in the belief that China's rise will bring us cooperation, diplomacy, and free trade. But what if the &quot;China Dream&quot; is to replace us, just as America replaced the British Empire, without firing a shot?\n\nBased on interviews with Chinese defectors and newly declassified, previously undisclosed national security documents, The Hundred-Year Marathon reveals China's secret strategy to supplant the United States as the world's dominant power, and to do so by 2049, the one-hundredth anniversary of the founding of the People's Republic. Michael Pillsbury, a fluent Mandarin speaker who has served in senior national security positions in the U.S. government since the days of Richard Nixon and Henry Kissinger, draws on his decades of contact with the &quot;hawks&quot; in China's military and intelligence agencies and translates their documents, speeches, and books to show how the teachings of traditional Chinese statecraft underpin their actions. He offers an inside look at how the Chinese really view America and its leaders - as barbarians who will be the architects of their own demise","torrent":{"xt":"urn:btih:7b39fe7c147851e64abe18b11cf1085968165013","amp;dn":"The+Hundred-Year+Marathon%3A+China%27s+Secret+Strategy+%282015%29epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b39fe7c147851e64abe18b11cf1085968165013","infoHashBuffer":{"type":"Buffer","data":[123,57,254,124,20,120,81,230,74,190,24,177,28,241,8,89,104,22,80,19]},"announce":[],"urlList":[]}}