{"title":"Weird Universe: Most Bizarre Ideas in Cosmology (2015) pdf","uid":11440037,"size":9252671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b6b88b60f8f3f87459056d4b2b9722fbdab70a9&amp;dn=Weird+Universe%3A+Most+Bizarre+Ideas+in+Cosmology+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1415752069,"description":"Weird Universe: Exploring the Most Bizarre Ideas in Cosmology\n\n\n As new discoveries complicate the scientific picture of the universe, the evolving theories about the nature of space and time and the origins and fate of the universe threaten to become overwhelming. Enter David Seargent. Continuing the author's series of books popularizing strange astronomy facts and knowledge, Weird Universe explains the bizarre, complicated terrain of modern cosmology for lay readers.\n\n From exploring some of the strange consequences of the theories of special and general relativity, to probing time dilation and the twin and mother-and-baby &quot;paradoxes&quot; and the theory that the universe can be mathematically considered as a hologram, all of the latest findings and conjectures are clearly described in non-technical language. The development of quantum physics and the more recent developments of string and M-theory are looked at, in addition to several hypotheses that have not won wide acceptance from the scientific community, such as modified gravity. Enter the wonderfully weird world of these theories and gain a new appreciation for the latest findings in cosmological research","torrent":{"xt":"urn:btih:7b6b88b60f8f3f87459056d4b2b9722fbdab70a9","amp;dn":"Weird+Universe%3A+Most+Bizarre+Ideas+in+Cosmology+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b6b88b60f8f3f87459056d4b2b9722fbdab70a9","infoHashBuffer":{"type":"Buffer","data":[123,107,136,182,15,143,63,135,69,144,86,212,178,185,114,47,189,171,112,169]},"announce":[],"urlList":[]}}