{"title":"Daily life in the Mongol empire (History Ebook).pdf","uid":9532161,"size":36953889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bfafd869fd1e24467bc8dd199c8b0d1c34ed328&amp;dn=Daily+life+in+the+Mongol+empire+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"STBGD","files":-1,"time":1390862728,"description":"George Lane, &quot;Daily Life in the Mongol Empire &quot; \n2006 | ISBN-10: 0313332266 | 340 pages | PDF | 35,2 MB\n\nThe Mongol Empire comes to life in this vivid account of the lives of ordinary people who lived under the rule of Ghengis Khan. The book allows the reader to enjoy traditional Mongol folktales and experience life in a yurt, the tent in which the nomadic Mongols lived. It explains why the Mongols had a reputation for being savage barbarians by describing their fur-lined clothes and their heavy, meat- and alcohol-based diet. It supplies first-hand accounts of fighting in Ghengis Khan's decimalized army, and explores the various tasks that were left up to the women, such as loading and unloading the wagons when traveling. High school students and undergraduates can compare and contrast religious beliefs and various laws of the Mongols with those of other cultures they are studying. From traditional medicinal treatments to the Great Yasa law system, readers young and old can enjoy this comprehensive, in-depth study of everyday living during the Mongol Empire. \n\nThe Mongol Empire comes to life in this vivid account of the lives of ordinary people who lived under the rule of Ghengis Khan. The book allows the reader to enjoy traditional Mongol folktales and experience life in a yurt, the tent in which the nomadic Mongols lived. It explains why the Mongols had a reputation for being savage barbarians by describing their fur-lined clothes and their heavy, meat- and alcohol-based diet. It supplies first-hand accounts about fighting in Ghengis Khan's army and explores the various tasks that were left up to the women, such as loading and unloading the wagons when traveling. High school students and undergraduates can compare and contrast religious beliefs and various laws of the Mongols with those of other cultures they are studying. From traditional medicinal treatments to the Great Yasa law system, readers young and old can enjoy this comprehensive, in-depth study of everyday living during the Mongol Empire. \n\nIn addition to general questions, Lane delves into specific situations of everyday living during the Mongol Empire. Questions such as How did the judicial system of the Mongol Empire work? and What spices were generally used in Mongol cooking? are answered in this extensive study. Subjects include: the structure of steppe society; clothes and hairstyles; the evolution of the nomadic life to one more permanent; the decimalization of the Mongol army; and the shaman's methods of healing sick patients. Other topics are: the Mongols' insatiable thirst for airag, an alcoholic beverage; Hu Szu-hui's royal cookbook; the liberal religious beliefs held by the Mongols; Ghengis Khan's strict law system; and the status of Mongol women. Passages from ancient texts and authors enhance this reference work, one that is essential to all school and public libraries.","torrent":{"xt":"urn:btih:7bfafd869fd1e24467bc8dd199c8b0d1c34ed328","amp;dn":"Daily+life+in+the+Mongol+empire+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bfafd869fd1e24467bc8dd199c8b0d1c34ed328","infoHashBuffer":{"type":"Buffer","data":[123,250,253,134,159,209,226,68,103,188,141,209,153,200,176,209,195,78,211,40]},"announce":[],"urlList":[]}}