{"title":"Solid State Chemistry and its Applications [PDF] [StormRG]","uid":9741066,"size":19629478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c0897a53eba2a3e91fc0d0f28d7f5259fd3a750&amp;dn=Solid+State+Chemistry+and+its+Applications+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394517425,"description":"Author: Anthony R. West\nPaperback: 582 pages\nPublisher: Wiley; 2nd Edition, Student Edition edition (March 10, 2014)\nLanguage: English\nISBN-10: 1119942942\nISBN-13: 978-1119942948\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nSolid State Chemistry and its Applications, 2nd Edition: Student Edition is an extensive update and sequel to the bestselling textbook Basic Solid State Chemistry, the classic text for undergraduate teaching in solid state chemistry worldwide.\n\nSolid state chemistry lies at the heart of many significant scientific advances from recent decades, including the discovery of high-temperature superconductors, new forms of carbon and countless other developments in the synthesis, characterisation and applications of inorganic materials. Looking forward, solid state chemistry will be crucial for the development of new functional materials in areas such as energy, catalysis and electronic materials.\n\nThis revised edition of Basic Solid State Chemistry has been completely rewritten and expanded to present an up-to-date account of the essential topics and recent developments in this exciting field of inorganic chemistry. Each section commences with a gentle introduction, covering basic principles, progressing seamlessly to a more advanced level in order to present a comprehensive overview of the subject. \n\nThis new Student Edition includes the following updates and new features:\n\n* Expanded coverage of bonding in solids, including a new section on covalent bonding and more extensive treatment of metallic bonding.\n\n*Synthetic methods are covered extensively and new topics include microwave synthesis, combinatorial synthesis, mechano-synthesis, atomic layer deposition and spray pyrolysis.\n\n* Revised coverage of electrical, magnetic and optical properties, with additional material on semiconductors, giant and colossal magnetoresistance, multiferroics, LEDs, fibre optics and solar cells, lasers, graphene and quasicrystals.\n\n* Extended chapters on crystal defects and characterisation techniques.\n\nExtensive coverage of crystal structures for important families of inorganic solids is complemented by access to CrystalMakerÂ® visualization software, allowing readers to view and rotate over 100 crystal structures in three dimensions.\nSolutions to exercises and supplementary lecture material are available online.\nSolid State Chemistry and its Applications, 2nd Edition: Student Edition is a must-have textbook for any undergraduate or new research worker studying solid state chemistry.","torrent":{"xt":"urn:btih:7c0897a53eba2a3e91fc0d0f28d7f5259fd3a750","amp;dn":"Solid+State+Chemistry+and+its+Applications+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c0897a53eba2a3e91fc0d0f28d7f5259fd3a750","infoHashBuffer":{"type":"Buffer","data":[124,8,151,165,62,186,42,62,145,252,13,15,40,215,245,37,159,211,167,80]},"announce":[],"urlList":[]}}