{"title":"Cream - Fresh Cream (1966)Mp3[CR-Bt]","uid":4668447,"size":67464734,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c61a46a7bef3bf0303a1715c43687bdea5b9063&amp;dn=Cream+-+Fresh+Cream+%281966%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"CR-Bt","files":11,"time":1232648910,"description":"1966. La date ÃƒÂ¨ importante, se non fondamentale per capire come il rock, nel giro di 4 anni, cambierÃƒÂ  totalmente diventando principe ed assoluto imperatore dell'universo musicale, relegando jazz e blues al ruolo di meri subalterni. Il rock incendia e prende fuoco, come cantava Jimi Hendrix in &quot;Fire&quot;, lui che di fuoco se ne intendeva come un piromane della scala musicale, un firestarter degli assoli che erano incandescenti come la sua strato sul palco di Woodstock nel 1967.\nNel 1966 non avevano fatto ancora la loro comparsa a livello mondiale alcuni dei maggiori esponenti del rock: Morrison e Manzarek stavano ancora sulla spiaggia di Venice Queen, Robert Plant cazzeggiava in UK, Lemmy imparava ad usare il basso nei suoi Hawkwind, Blackmore studiava nuovi assoli e John Michael Osbourne diventerÃƒÂ  presto famoso col nome di Ozzy. In quegli anni Dylan era il dominatore incontrastato, c'erano Cash e i Beatles, gli Stones e i Blues Magoos: tutta gente che aveva a che fare, chi piÃƒÂ¹ chi meno, con il blues. E &quot;Fresh Cream&quot; ÃƒÂ¨ formalmente un album di blues revival: ha la struttura, la durata delle canzoni, i pezzi e le cover di grandi bluesman. E poi ci suona Eric Clapton, che usciva da due esperienze illuminanti come quelle con Yardbyids e Bluesbreacker di John Mayall, che gli avevano fruttato il titolo di enfant prodige del blues rock, mentre a Londra i muri erano coperti dalle scritte Eric Clapton is God.\nCapirete bene che ci troviamo di fronte ad un gruppo eccezionale, uno dei migliori power trio che abbiano mai deciso di deliziarci con buona musica, se non fosse per il fatto che la loro influenza sui decenni a venire ÃƒÂ¨ immensa, e gruppi meno famosi inizieranno giÃƒÂ  ad emularli sin dal 1968. In tutto, dal basso di Jack Bruce, una delle voci piÃƒÂ¹ spettacolari degli anni '60, alle ritmiche di Ginger Baker, il primo vero drum-hero della storia, colui che fu capace di trasformare uno strumento da semplice accompagnatore a co-protagonista: basta ascoltare &quot;Toad&quot;, un autentico delirio di batteria.\nCi sono anche quattro cover, riarrangiate e rimescolate negli assoli e nella dinamica: &quot;Four Until Late&quot; del maestro dei crossroads Robert Johnson, &quot;Rollin' and Tumblin'&quot; di Muddy Waters, &quot;Spoonful&quot; di Willie Dixon, &quot;I'm So Glad&quot; di Skip James e la ballata tradizionale &quot;Cat's Squirrel&quot;. Si tratta dunque di un disco a metÃƒÂ  strada tra il tributo dei grandi del blues e canzoni nuove, catchy, tra il blues e l'acid rock, che nasce proprio in quegli anni con le esibizioni dal vivo dei Cream. L'aria che si respira ÃƒÂ¨ una continua esclation di felicitÃƒÂ , emozione, senso di libertÃƒÂ  e voglia di vivere (&quot;I Feel Free&quot;, &quot;N.S.U. &quot;, &quot;I'm So Glad&quot;, &quot;Wrapping Paper&quot;), nonostante vi siano anche dei brani di pure e semplice sofferenza blues, accompagnati da riff eccezionali, voci e armoniche spettacolari, una batteria posseduta come se fosse la magia negra del voodoo a prendere il controllo degli arti di Baker e costringerlo a suonare la musica del diavolo. Questo ÃƒÂ¨ uno dei capolavori del rock, per importanza e bellezza, non esistendo un punto in cui la qualitÃƒÂ  cali o sia minore rispetto agli altri. Undici brani, undici perle che si incastonano nell'arazzo arabesco intrecciato dal rapsodo Clapton e dal cantante Bruce.\n\n","torrent":{"xt":"urn:btih:7c61a46a7bef3bf0303a1715c43687bdea5b9063","amp;dn":"Cream+-+Fresh+Cream+%281966%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c61a46a7bef3bf0303a1715c43687bdea5b9063","infoHashBuffer":{"type":"Buffer","data":[124,97,164,106,123,239,59,240,48,58,23,21,196,54,135,189,234,91,144,99]},"announce":[],"urlList":[]}}