{"title":"FIFle Soccer 2017 v1.0.1 Android","uid":15772078,"size":61934135,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7c67682a29c5c8a66601f029aa54a11f19e3bfa9&amp;dn=FIFle+Soccer+2017+v1.0.1+Android+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":".BONE.","files":3,"time":1473210728,"description":"Playing beautiful has never been more exciting than in the new FIFA Mobile Soccer! Build and manage your team, play head to head, and keep coming back for daily updated content. Whether youâ™re a savvy veteran or just starting out on the soccer pitch, FIFA goes bigger and better than ever, completely redesigned and built exclusively for mobile with a download under 100 MB.\r\n\r\nMANAGE YOUR ULTIMATE TEAM\r\nBe the manager of your favorite team with a fresh approach to collecting and building. Create a bigger and deeper squad, make lineup adjustments on the fly, and quickly change tactics before every game. Make the right moves and watch your club get better each day.\r\nATTACK TO WIN\r\nBring innovative levels of competition to your game with Attack Mode. Enjoy endless thrilling matches that keep you clamoring for more as you handle offensive possessions. Keep the power of your team in your hands with bite-sized plays and updated controls.\r\n\r\nKEEP UP WITH LIVE EVENTS\r\nStay connected to the game you love 365 days a year with daily content based on up-to-date stories and matches. Instantly jump into quick, playable Live Events that change hourly, and take a shot at incredible prizes, Packs, and Player Items.\r\n\r\nJOIN A LEAGUE, CONQUER THE WORLD\r\nFor the first time, participate in Leagues, a true social experience that allows you to join forces and strive for glory with friends and gamers around the globe. Test your skills in inter-league championships or take a shot competing against worldwide Leagues to climb leaderboards and conquer top opponents. Combined with the ability to chat and send gifts, Leagues make you part of the global soccer community.\r\n\r\nPLAY WITH UNRIVALED AUTHENTICITY\r\nOver 30 leagues, 650 real teams, and 17,000 real players make FIFA Mobile an authentic mobile soccer experience you wonâ™t want to put down. Score big with your favorite stars—from top defenders to attackers to keepers—and immerse yourself in the worldâ™s sport!","torrent":{"xt":"urn:btih:7c67682a29c5c8a66601f029aa54a11f19e3bfa9","amp;dn":"FIFle+Soccer+2017+v1.0.1+Android+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c67682a29c5c8a66601f029aa54a11f19e3bfa9","infoHashBuffer":{"type":"Buffer","data":[124,103,104,42,41,197,200,166,102,1,240,41,170,84,161,31,25,227,191,169]},"announce":[],"urlList":[]}}