{"title":"Video2Brain &amp;ndash; Android App Development and Design Learn by","uid":8719615,"size":990330783,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7c7dbadbeff4d6cc54bbf9f961c9b45f9beca39b&amp;dn=Video2Brain+%26ndash%3B+Android+App+Development+and+Design+Learn+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"simer101","files":-1,"time":1374399152,"description":"Android App Development and Design: Learn by Video\nEnglish | 2011 | iso | flv | 3 hrs 50 min | 1.02 GB\neLearning\n\n\nThis innovative product uses interactive video to give developer/designers a solid understanding of how to design apps that can run on many different Android-based devices, under Android versions up to 2.3. Users will learn to set up an Android development environment, define device emulators, and connect to actual Android devices. The video also explains the fundamentals of Android layouts and user interfaces. It introduces the process of programming an app's interaction with Activities and Services and explains how to access existing Android system components. It also looks at how to ensure that an app runs on as many Android devices, screen sizes, and form factors as possible. It also explains how to package an app and publish it to the Android Marketplace.\n\nExperienced instructor Constantin Ehrenstein presents five hours of exceptional quality video tutorials, complete with lesson files, assessment quizzes, and review materials. The video is wrapped in a unique interface that allows the viewer to jump to any topic and also bookmark individual sections for later review. The unique Watch-and-Work mode shrinks the video into a small window to allow the student to work alongside the video. Project files used in the lessons are included on the disc so viewers can practice what they've learned, and interactive review questions help reinforce freshly gained knowledge.\n\nIf you want to get in on the rapidly expanding market for Android apps, you??â„¢ll need to understand the important concepts behind Android development, which may not be intuitive for those familiar with other platforms. In this course from expert programmer and developer Constantin Ehrenstein, you??â„¢ll begin by stepping through the process of setting up your Android development environment, defining device emulators, and connecting to actual Android devices. Next, you??â„¢ll learn about the fundamentals of Android layouts and UIs and how to program your app??â„¢s interaction with activities and services. With your basic Android app fleshed out, you??â„¢ll learn how to broaden your app??â„¢s target audience by making it run on as many devices, screen sizes, and form factors as possible. And finally, you??â„¢ll learn how to package your app and publish it to the Android Market. This Learn by Video workshop is published in partnership with Peachpit Press.\n\nTrainer: Constantin Ehrenstein\n\nSource is  LotharKing on kat","torrent":{"xt":"urn:btih:7c7dbadbeff4d6cc54bbf9f961c9b45f9beca39b","amp;dn":"Video2Brain+%26ndash%3B+Android+App+Development+and+Design+Learn+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c7dbadbeff4d6cc54bbf9f961c9b45f9beca39b","infoHashBuffer":{"type":"Buffer","data":[124,125,186,219,239,244,214,204,84,187,249,249,97,201,180,95,155,236,163,155]},"announce":[],"urlList":[]}}