{"title":"mIRC 7.34 + Patch [SWEG]","uid":10442844,"size":2153734,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7cc28b3099e4db989ac043fb3ec4b3a6e18348f2&amp;dn=mIRC+7.34+%2B+Patch+%5BSWEG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Swegin8r","files":1,"time":1403918597,"description":"Includes the mIRC v7.34 installation package, a patch and a text file containing instructions.\n\nInstall as usual. Use the provided patch then enter any name and serial combination to register the program. Done! Enjoy!\n\n\n-----------------------------------------------------------------------------------\n\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies.\n\n-----------------------------------------------------------------------------------\n\nWHY UPGRADE?\n\n-Added a Switchbar font option that allows you to change the style and size of font used by the switchbar buttons to improve visibility\n-Fixed SSL certificate password dialog box being displayed multiple times when multiple SSL connections are in progress\n-Added a number of math identifiers such as $atan2(), $hypot() and $intersect() that returns the point at which two lines/rays intersect\n-Changed the display size of the toolbar and switchbar buttons to make them more usable on tablet touch screens. The small and large button size now also apply to the toolbar\n-Added CAP support for the userhost-in-names and server-time server features\n-Extended SendMessage() support in a number of ways, including the ability to disable SendMessage() support in the Lock dialog\n-Changed Clear History feature to retain non-privacy related settings, such as interface settings for the treebar, switchbar, toolbar and script editor\n-Extended mouse wheel support to work in interface elements, such as list boxes in dialogs, under the cursor even if they are not active\n-Added a $servertarget identifier to return the original address specified in the /server command\n-Improved the way server passwords are stored in servers.ini and channels list lock passwords are stored in mirc.ini\n-Added a $input() 'f' switch that forces the return of $no/$cancel for edit/combo boxes\n-Other changes and bug fixes","torrent":{"xt":"urn:btih:7cc28b3099e4db989ac043fb3ec4b3a6e18348f2","amp;dn":"mIRC+7.34+%2B+Patch+%5BSWEG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cc28b3099e4db989ac043fb3ec4b3a6e18348f2","infoHashBuffer":{"type":"Buffer","data":[124,194,139,48,153,228,219,152,154,192,67,251,62,196,179,166,225,131,72,242]},"announce":[],"urlList":[]}}