{"title":"Taboo American Style 1 (1985) XXX Classic DVDRip","uid":11826231,"size":455875803,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7e5c82343a8fc1c2883fff6fb0d62515eeb1800e&amp;dn=Taboo+American+Style+1+%281985%29+XXX+Classic+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"B01010000","files":2,"time":1429506071,"description":"        ...::TORRENT NAME::...\nTaboo American Style 1 (1985) XXX Classic DVDRip\n\n         ...::POSTER::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=mqM6Y.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=mqM6Y.jpg&lt;/a&gt;\n\n       ...::SCREENSHOTS::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=BJ1Fk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=BJ1Fk.jpg&lt;/a&gt;\n\n        ...::DESCRIPTION::...\nAlso Known As:\nNena - Das geile Biest von nebenan - Teil 1 (German release by Ribu Video)\nTaboo American Style Part 1: The Ruthless Beginning\n\nActors\n\nFrank Serrone\nPaul Thomas\nR. Bolla\nTom Byron\nNonSex Performers\nHenri Pachard\n\nScene 1. Gloria Leonard, R. Bolla\nScene 2. Taija Rae, Tom Byron\nScene 3. Raven, Taija Rae\nScene 4. Raven, Frank Serrone\nScene 5. Gloria Leonard, R. Bolla\nScene 6. Raven, Paul Thomas\nScene 7. Raven, Paul Thomas\n\nDescription:\n\nLauded by critics as the finest film of the year, Taboo American Style is the four-part saga of a young woman's sexual awakening, and the power she attains with it. In The Ruthless Beginning, Nina gets her first taste of passion with her best friend's boyfriend. Her newfound desires turn her middle-class family upside-down.\n\nTaboo, American Style, Part I\n\nThe evening started off with Taboo, American Style, Part I. This was an ambitious effort from Pachard in 1985. A four part miniseries dealing the evil machinations of one Nine Sutherland, played by a very young Raven. Her dad, Harding (Paul Thomas) and Mom (Gloria Leonard) round out her family with a 16 year old (it seemed) Tom Byron playing her brother, aptly named, Tom.\nThe Sutherlands are a well-to-do family, we're told. Harding is a successful financial analyst, and Mom is very concerned about appearances... and about the gardener, Mr. Chernaske (R Bolla)\n\nThe film is heavy on plot and light on sex. It opens with R Bolla enjoying Gloria Leonard.. however, Gloria does not seem to be alive at all... couple this with some HORRID audio looping and dubbing, and you have the beginning of a lukewarm film.\n\nThe plot, which stretches over four (FOUR!) tapes begins innocently enough. Prudish Mom doesn't want young Tom to gout with gutter trash like Lisa Chernaske (Taija Rae). So instead, Nina invites Lisa over, and after while the parents are getting busy, leads her into Tom's room.\n\nThe Paul Thomas/Gloria Leonard coupling is lukewarm, and in the end frustrating as she rolls over and goes to sleep, leaving PT with a woody and a frown. However, sex scene of the movie goes to Taija and Tom who have a spirited romp marred only by some bad audio dubbing.\n\nAfter the Tom/Taija tryst, Nina gives a terribly stilted textbook masturbation lesson to Lisa. &quot;First, you rub the clitoris... the clitoris is the small penis like thing between your pussy lips...&quot; Zzzzzz.\n\nLisa tells Nina about her mother's indiscretions with the gardener, her father. Nina calls Dad home, who walks in on Mom and Mr. Chernaske.\n\n&quot;There will be no divorce&quot; Dad states to a shaken family. Nina quietly revels in her mothers downfall and Tom just looks sullen, probably happy that he's going to Brown in the fall.\n\nDad grows increasingly despondent until Nina walk in on him in the tub. He sits, bottle in hand, getting sauced... watching as his daughter starts kissing him with too much familiarity and eventually blows him. The scene is marred by a fake-o cum shot, but is redeemed by the &quot;My God, what have I done?&quot; acting of PT.\n\nI always liked PT as an actor and feel those strengths do complement him as a director. However, as a stud, PT was always a little lacking to me, and this too, translates into his movies. All plot, no heat.\n\nThat sentiment sums up the first part of Taboo, American Style.\n\nIt's been almost 10 years since I watched it, and I didn't hit FF once. The acting is kinda silly, though it was great seeing people actually sorta playing their ages. PT's mid 30s to Gloria Leonard's mid 30s contrasted rather nicely with Taija, Raven and Tom all of whom had to be about 18.\n\nWhen it was done, I looked at my wife who looked at me. &quot;I have ONE WORD&quot; she says. Not a great sign. &quot;Yeah&quot; I ask. &quot;F-E-H, Feh.&quot; she says.\n\nAs a sex movie it didn't do it for her and as a straight movie it came down on the side of campy... it's a tough call to make, because such an effort seemed to have been made, you hate to dis it, but I would recommend it for a rent but bring along insurance","torrent":{"xt":"urn:btih:7e5c82343a8fc1c2883fff6fb0d62515eeb1800e","amp;dn":"Taboo+American+Style+1+%281985%29+XXX+Classic+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e5c82343a8fc1c2883fff6fb0d62515eeb1800e","infoHashBuffer":{"type":"Buffer","data":[126,92,130,52,58,143,193,194,136,63,255,111,176,214,37,21,238,177,128,14]},"announce":[],"urlList":[]}}