{"title":"Zen and the Art of Motorcycle Maintenance - Full 13 CDs edition","uid":4465128,"size":432935972,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7ef956e07e85707aedc3514a2e422c333b2d0e56&amp;dn=Zen+and+the+Art+of+Motorcycle+Maintenance+-+Full+13+CDs+edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pirrent","files":134,"time":1224879318,"description":"13 CDs | Unabridged | MP3/64Kbps\n\nSummary:\nOne of the most important and influential books written in the past half-century, Robert M. Pirsig&amp;#039;s &quot;Zen and the Art of Motorcycle Maintenance&quot; is a powerful, moving, and penetrating examination of how we live . . . and a breathtaking meditation on how to live better. Here is the book that transformed a generation: an unforgettable narration of a summer motorcycle trip across America&amp;#039;s Northwest, undertaken by a father and his young son. A story of love and fear -- of growth, discovery, and acceptance -- that becomes a profound personal and philosophical odyssey into life&amp;#039;s fundamental questions, this uniquely exhilarating modern classic is both touching and transcendent, resonant with the myriad confusions of existence . . . and the small, essential triumphs that propel us forward.\n\nReviews\nNew York Times\nProfoundly important... full of insights into our most perplexing contemporary dilemmas... It is intellectual entertainment of the highest order.\n\nNew Yorker\nIt lodges in the mind as few recent novels have... The book is inspiredoriginal... As the mountains gentle toward the seaÃƒÂ¢  with father and child locked in a ghostly gripÃƒÂ¢  the narrative tactthe perfect economy of effect defy criticism... The analogies with Moby Dick are patent. Robert Pirsig invites the prodigious comparison... What more can one say?&quot;\n\nVillage Voice\nIt&amp;#039;s a miracle.. sparkles like an electric dream. Freshnessoriginality... that seduces you into loving motorcyclesas tender in their pistons as the petals in the Buddah&amp;#039;s dawn lotus.\t\t\t","torrent":{"xt":"urn:btih:7ef956e07e85707aedc3514a2e422c333b2d0e56","amp;dn":"Zen+and+the+Art+of+Motorcycle+Maintenance+-+Full+13+CDs+edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef956e07e85707aedc3514a2e422c333b2d0e56","infoHashBuffer":{"type":"Buffer","data":[126,249,86,224,126,133,112,122,237,195,81,74,46,66,44,51,59,45,14,86]},"announce":[],"urlList":[]}}