{"title":"The PayPal Wars - Eric M. Jackson","uid":9924201,"size":2974321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f1bc3f6157305185cfafd7ab286d45a1886b357&amp;dn=The+PayPal+Wars+-+Eric+M.+Jackson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"aksljdf","files":2,"time":1397038620,"description":"The PayPal Wars: Battles with eBay, the Media, the Mafia, and the Rest of Planet Earth\n\nWhen Peter Thiel and Max Levchin launched an online payment website in 1999, they hoped their service could improve the lives of millions around the globe. But when their start-up, PayPal, survived the dot.com crash only to find itself besieged by unimaginable challenges, that dream threatened to become a nightmare. PayPal's history - as told by former insider Eric Jackson - is an engrossing study of human struggle and perseverance against overwhelming odds. The entrepreneurs that Thiel and Levchin recruited to overhaul world currency markets first had to face some of the greatest trials ever thrown at a Silicon Valley company before they could make internet history. Business guru Tom Peters, author of In Search of Excellence, called the hardcover edition of The PayPal Wars a real page turner that featured what he called the best description of business strategy unfolding in a world changing at warp speed. The new paperback edition will feature updated material and even more insights on the state of internet commerce.","torrent":{"xt":"urn:btih:7f1bc3f6157305185cfafd7ab286d45a1886b357","amp;dn":"The+PayPal+Wars+-+Eric+M.+Jackson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f1bc3f6157305185cfafd7ab286d45a1886b357","infoHashBuffer":{"type":"Buffer","data":[127,27,195,246,21,115,5,24,92,250,253,122,178,134,212,90,24,134,179,87]},"announce":[],"urlList":[]}}