{"title":"Sony Vegas Pro 11","uid":8135886,"size":213003893,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f690ccf8bc61d5d1e24c9e8d698d7992fb3d8c4&amp;dn=Sony+Vegas+Pro+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"lifePool","files":-1,"time":1360706140,"description":"Overview:\nVegasâ„¢ Pro 12 is an integrated, forward-thinking production environment designed for a new generation of creative professionals. Combining a familiar track-based timeline with hundreds of thoughtful workflow innovations, Vegas Pro 12 is a refreshing, modern approach to post-production. Supporting more formats, more workflows, and more creative control than ever before, Vegas Pro 12 makes it easy to deliver your message and express your artistic vision.\n\nInnovative editing tools:\nEdit SD, HD, 2K and 4K material in 2D or stereoscopic 3D, with drag-and-drop functionality or traditional 3-point and 4-point editing modes. The Vegas Pro 12 interface provides an impressive array innovative tools and thoughtful touches, with a fully customizable workspace for accomplishing a wide range of production tasks. Nest Vegas Pro projects within the timeline, customize and save keyboard commands, and use application scripting to automate repetitive tasks. The new Expanded Edit Mode temporarily splits the track at the edit point and enables you to dynamically add or remove frames from either side of the edit point while the media is playing, creating a highly precise, interactive editing experience.\n\nPowerful effect and composting engine:\nCombine up to 32 high-quality, keyframeable effects per Effects Chain and apply them at the Event, Track, Media, or Project level. Vegas Pro 12 uses an advanced plug-in architecture based on the OpenFX standard, for hundreds of optional effects from leading visual effects plug-in VFX developers. Parent-Child tracks and sophisticated 2D and 3D compositing modes provide a powerful, flexible effects environment. Shape Masking tools and FX Masking capabilities are new for Vegas Pro 12, along with the Color Match plug-in, to quickly match the color characteristics from one clip to another. ","torrent":{"xt":"urn:btih:7f690ccf8bc61d5d1e24c9e8d698d7992fb3d8c4","amp;dn":"Sony+Vegas+Pro+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f690ccf8bc61d5d1e24c9e8d698d7992fb3d8c4","infoHashBuffer":{"type":"Buffer","data":[127,105,12,207,139,198,29,93,30,36,201,232,214,152,215,153,47,179,216,196]},"announce":[],"urlList":[]}}