{"title":"Music of Ancient Greece &amp; Egypt","uid":4109160,"size":559491905,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7f73add9dc7857cb361e56bf2d988636322e687f&amp;dn=Music+of+Ancient+Greece+%26+Egypt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Rivenshield","files":48,"time":1206968423,"description":"Here is a supplement to my \\&amp;#039;Music Of The Ancient World\\&amp;#039; torrent. It consists exclusively of reconstructed music from ancient Greece and Egypt.\n\nAncient Egypt: Music of the Age of the Pyramids (Rafael Perez Arroyo)\n\nMelpomen: Ancient Greek Music (Conrad Steinmann)\n\nMusic of Upper &amp; Lower Egypt (This is contemporary tribal music, sung in Arabic but not greatly changed in cadence and spirit for millennia. It probably sounds more like old Egyptian music sung by ordinary workaday Egyptians than all the reconstructions put together)\n\nMusic of the Ancient Greeks (by De Organographia, considered a definitive work)\n\nMusique de la Grece Antique (another interpretation of Greek music, this time by a French group)\n\nCoptic Liturgies, by Ensemble David (the Copts have one of the oldest surviving languages on earth, directly descended from the ancient Egyptian tongue. These Christian hymns are the closest link we have to the religious music of their ancestors)\n\nIn keeping with my new policy regarding CD\\&amp;#039;s still in print, I am only including every other track on these albums. All are of excellent quality, either 320 or Windows lossless. If you want to complete the album, I encourage you to buy the CD\\&amp;#039;s or download the individual tracks off Amazon.com. Support the artists so that they can keep bringing this wonderful music alive -- and keep seeding! Enjoy!","torrent":{"xt":"urn:btih:7f73add9dc7857cb361e56bf2d988636322e687f","amp;dn":"Music+of+Ancient+Greece+%26+Egypt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f73add9dc7857cb361e56bf2d988636322e687f","infoHashBuffer":{"type":"Buffer","data":[127,115,173,217,220,120,87,203,54,30,86,191,45,152,134,54,50,46,104,127]},"announce":[],"urlList":[]}}