{"title":"Oscar Wilde - The Collection  (BBC Radio)","uid":5081811,"size":597384778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8037639e6b8ef9b3b4cd683fae1b182a9b988429&amp;dn=Oscar+Wilde+-+The+Collection++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"eddie1969","files":-1,"time":1252370464,"description":"Audio Books : Literary : Other quality : English\n\n\n\nThe Picture of Dorian Gray - A Woman of No Importance - The Importance of Being Earnest - Lord Arthur Savile's Crime - The Trials of Oscar Wilde\n\nFour plays and one unabridged reading, written by or about Oscar Wilde.\n\nMy recordings from BBC7. The plays are 160kbps stereo mp3 and the reading is 64kbps mono.\n\n\n\n1, The Picture of Dorian Gray.\n`If it were I who was to be always young, and the picture that was to grow old... I would give my soul for that.' Oscar Wilde's famous novel of a spoilt hedonist who, Faust-like, makes a foolish wish, the granting of which destroys him. Dramatised by Nick McCarty. With Jamie Glover, Ian McDiarmid and Steven Pacey. Director: Gordon House. Two hour-long episodes.\n\n\n2, A Woman of No Importance.\nDiana Rigg, Martin Jarvis and Annette Crosby star in Oscar Wilde's tale of social scandal.\n\nA Woman of No Importance primarily focuses on the differences between men and women and, more importantly, the way in which Victorian society treated its ladies. Wilde shows feminist leanings as he attacks the injustice of a society that condemns a &quot;fallen&quot; woman while admiring the cause of her downfall. A Woman of No Importance is a great reminder of how good Oscar Wilde is. He writes beautifully in both comic and (sometimes melo)dramatic mode and his main characters are memorable. A 90 minute play.\n\n\n3, The Importance of Being Earnest.\nWhat is the secret allure of the name Ernest? Written over 100 years ago, Oscar Wilde's most famous play was described by its author as a trivial comedy for serious people'. It's a mixture of the usual comic ploys of mistaken identity, thwarted romance, and a happy ending, but what makes this play a classic is Wilde's epigrams, whizzing dialogue, and the monstrous character Lady Bracknell, played in this production by Dame Judi Dench. With Martin Clunes and Sir Michael Hordern. A Two hour play.\n\n\n4, Lord Arthur Savile's Crime.\nWhen a fortune teller predicts murder in the palm of Arthur Savile's hand, the young man decides he must fulfil his destiny. An unabridged reading of Wilde's short story, read in three half-hour episodes by Michael Maloney.\n\n\n5, The Trials of Oscar Wilde by Christopher Fitz-Simon.\nSimon Russell Beale stars as Oscar Wilde in a recreation of the doomed libel action taken by Wilde against the Marquis of Queensbury. Old Bailey, the main courthouse in London, had never presented a show quite like the trial that captivated England and much of the literary world in the spring of 1895. Celebrity, sex, witty dialogue, political intrigue, surprising twists, and important issues of art and morality in an era when being gay got you thrown in gaol, is it any surprise that the trials of Oscar Wilde continue to fascinate over one hundred years after the death of one of the world's greatest authors and playwrights? Two episodes, one is 90 minutes and the other is an hour.\n\n\nShare and enjoy!!","torrent":{"xt":"urn:btih:8037639e6b8ef9b3b4cd683fae1b182a9b988429","amp;dn":"Oscar+Wilde+-+The+Collection++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8037639e6b8ef9b3b4cd683fae1b182a9b988429","infoHashBuffer":{"type":"Buffer","data":[128,55,99,158,107,142,249,179,180,205,104,63,174,27,24,42,155,152,132,41]},"announce":[],"urlList":[]}}