{"title":"Fences Pro HP for any Windows 7 PC","uid":7000758,"size":50000726,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:805e31ab013aaf4c3f9b88ed161fbf492361f358&amp;dn=Fences+Pro+HP+for+any+Windows+7+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Tom_Da_Man","files":-1,"time":1328046831,"description":"With Fences Pro, you can specify a default Fence for all new icons to go to. By utilizing rules (as detailed below), you can also customize this setting based on the time of day, day of the week, or what program you are currently using.\n\nRules: Easy, automatic desktop organization\nWant a fence to help keep track of all your recent documents? Done. Another for your web links? All set. Another for your downloads? A click away, and maintained for you automatically. Fences Pro\\'s organization settings allow you to quickly and easily define rules that govern where new icons get placed. Additionally, you can also have rules that are applied at all times, keeping your desktop organized 24/7.\t \n\nSort your fences\nFences Pro includes the ability to sort icons within fences, by any of the usual categories such as name, type and date modified. Additional options unique to Fences, it can also sort your icons by the date added to the fence, or the number of times used, keeping your most accessed items in front.\t \n\nFading Fences\nNow that you\\'ve organized your desktop into tidy Fences, you may find yourself using the double-click quick-hide feature a lot. Perhaps you\\'re really using it because you do need your icons, but you don\\'t want them \\&quot;taking over\\&quot;. A new feature found in Fences Pro looks to make life even easier, allowing you to fade individual fences to be only partially visible, then bring them back by simply mousing over them. Check out the live demo on the front page - this feature scores high on our list for both cool, and everyday-helpful.\n\nThis is the full Pro version, designed for HP computers.\nIn order for it to work, we have to trick it into thinking, your computer is a HP.\n\nSo copy the content inside the crack folder into c:\\\\\nThen run the sp49993.exe to install. \n\nRead install notes on how to install!!\n\nHave fun, say thanks!!","torrent":{"xt":"urn:btih:805e31ab013aaf4c3f9b88ed161fbf492361f358","amp;dn":"Fences+Pro+HP+for+any+Windows+7+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"805e31ab013aaf4c3f9b88ed161fbf492361f358","infoHashBuffer":{"type":"Buffer","data":[128,94,49,171,1,58,175,76,63,155,136,237,22,31,191,73,35,97,243,88]},"announce":[],"urlList":[]}}