{"title":"Abraham-Hicks Vortex Guided Meditations.wav+Guide","uid":7616055,"size":784480251,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:80a8057fc1d22153820e146f06f2c93f60cb6e45&amp;dn=Abraham-Hicks+Vortex+Guided+Meditations.wav%2BGuide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"kind212","files":10,"time":1347204088,"description":"\nGetting Into The Vortex: Guided Meditations CD in .wav format\n\n\n   Living a better-feeling life really comes down to one thing only: coming into alignment with the Energy of our Source. Abraham reminds us that we are truly Source Energy focused into our physical bodies, and that a conscious Connection to that Broader Non-Physical part of us is necessary if we are to be the joyful Beings that we were born to be. Abraham calls that wonderful alignment Getting into the Vortex.\n \n   Abraham has helped us to understand that our dominant intent in every day is to get into the Vortex! And now, they have lovingly and specifically guided Jerry and Esther Hicks in the creation of an innovative and valuable tool that promises to get us into the Vortex right now . . . and that tool is enclosed in the Getting into the Vortex User Guide in the form of a 70-minute CD.\n\n   This unique recording contains four powerfully guided daily meditations that have been designed to get you into the Vortex of Creation in four basic areas of your life: General Well-Being, Financial Well-Being, Physical Well-Being, and Relationships.\n\n   Jerry and Esther are thrilled to offer this powerful, first-of-its kind, musically scored, breath-enhancing, user-friendly tool from Abraham that will get you into the Vortex.\n\nAbout the Author\n#1 New York Times best-selling authors Esther and Jerry Hicks produce the Leading Edge Abraham-Hicks teachings on the Art of Allowing our natural Well-Being to come forth. Law of Attraction workshops held in up to 60 cities per year inspire a regular flow of Abraham books, CDs, and DVDs.\n\n","torrent":{"xt":"urn:btih:80a8057fc1d22153820e146f06f2c93f60cb6e45","amp;dn":"Abraham-Hicks+Vortex+Guided+Meditations.wav%2BGuide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a8057fc1d22153820e146f06f2c93f60cb6e45","infoHashBuffer":{"type":"Buffer","data":[128,168,5,127,193,210,33,83,130,14,20,111,6,242,201,63,96,203,110,69]},"announce":[],"urlList":[]}}