{"title":"The Secret Life of Chaos BBC Science XviD AC3.avi","uid":5280267,"size":734373888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:80e59413ca2b46e74f4a7572366a4a7de9b3e096&amp;dn=The+Secret+Life+of+Chaos+BBC+Science+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Pharos2001","files":1,"time":1263521286,"description":"Chaos theory has a bad name, conjuring up images of unpredictable weather, economic crashes and science gone wrong. But there is a fascinating and hidden side to Chaos, one that scientists are only now beginning to understand.\n\nIt turns out that chaos theory answers a question that mankind has asked for millennia - how did we get here?\n\nIn this documentary, Professor Jim Al-Khalili sets out to uncover one of the great mysteries of science - how does a universe that starts off as dust end up with intelligent life? How does order emerge from disorder?\n\nIt's a mindbending, counterintuitive and for many people a deeply troubling idea. But Professor Al-Khalili reveals the science behind much of beauty and structure in the natural world and discovers that far from it being magic or an act of God, it is in fact an intrinsic part of the laws of physics. Amazingly, it turns out that the mathematics of chaos can explain how and why the universe creates exquisite order and pattern.\n\nAnd the best thing is that one doesn't need to be a scientist to understand it. The natural world is full of awe-inspiring examples of the way nature transforms simplicity into complexity. From trees to clouds to humans - after watching this film you'll never be able to look at the world in the same way again.\n\nAirtime: GMT 10:00pm\nAirdate: 14/01/2010\nDuration: 0:59:15\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass MPEG)\nACodec: AC3 2ch 192Kbps\n\nFlawless encoding\nPls. help seed to keep torrent alive.","torrent":{"xt":"urn:btih:80e59413ca2b46e74f4a7572366a4a7de9b3e096","amp;dn":"The+Secret+Life+of+Chaos+BBC+Science+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80e59413ca2b46e74f4a7572366a4a7de9b3e096","infoHashBuffer":{"type":"Buffer","data":[128,229,148,19,202,43,70,231,79,74,117,114,54,106,74,125,233,179,224,150]},"announce":[],"urlList":[]}}