{"title":"CCNA Cisco Certified Network Associate Review Guide Exam 640-802","uid":8734080,"size":3652022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:818e0f77352bbd019fca4af4c6ee330a2502bcae&amp;dn=CCNA+Cisco+Certified+Network+Associate+Review+Guide+Exam+640-802&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"livhre","files":-1,"time":1374651833,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\n\nThe leading quick-review guide to the number-one IT certification\nThe Cisco Certified Network Associate (CCNA) certification is the first step for network administrators seeking to advance their careers. Part of the Sybex study-practice-review approach to certification preparation, this concise review guide is organized by exam objective and is the perfect companion to CCNA: Cisco Certified Network Associate Study Guide, 7th Edition. Written by networking authority Todd Lammle, this brand new guide features eight chapters corresponding to the eight domains of the CCNA exam objectives.\nAlso included is an interactive CD with two bonus exams, handy flashcard questions, and a searchable PDF of a Glossary of Terms.\nNetwork professionals who hold the CCNA certification generally earn more than coworkers who have not earned the CCNA\nThis guide, by author and trainer Todd Lammle, provides a focused, concise review that works with other learning tools such as CCNA: Cisco Certified Network Associate Study Guide, 7th Edition\nCovers the eight domains of the exam objectives, including how a network works, configuration, IP addresses, network security threats, and troubleshooting\nIncludes a CD with two bonus exams, handy flashcard questions, and a searchable PDF of a Glossary of Terms\nCCNA candidates will find this focused review guide greatly improves their chances of success as they tackle the exam.\n\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.\n\nSupport Amas school of technology. The only school of its kind in an entire 3rd world country that doesn't force poor people to pay.","torrent":{"xt":"urn:btih:818e0f77352bbd019fca4af4c6ee330a2502bcae","amp;dn":"CCNA+Cisco+Certified+Network+Associate+Review+Guide+Exam+640-802","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818e0f77352bbd019fca4af4c6ee330a2502bcae","infoHashBuffer":{"type":"Buffer","data":[129,142,15,119,53,43,189,1,159,202,74,244,198,238,51,10,37,2,188,174]},"announce":[],"urlList":[]}}