{"title":"Henri Nouwen - Life of the Beloved: Spiritual Living (pdf)","uid":8517092,"size":1355362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:823261cbf761f6de7ed3fb549f25e8e0acdf8c42&amp;dn=Henri+Nouwen+-+Life+of+the+Beloved%3A+Spiritual+Living+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369777286,"description":"Henri J. M. Nouwen - Life of the Beloved: Spiritual Living in a Secular World (Crossroad, 1992). 156 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThis personal witness to a God who calls us the Beloved is the fruit of a long friendship between journalist-writer Fred Bratman and Heri Nouwen. Here is a ringing affirmation that everyone is loved by God and can enjoy the life of the beloved.\n\nReview\n\n&quot;A beautiful and sensitive book that reaches out to the believer.&quot; -- Church and Synagogue Library Association\n\n&quot;Anyone who is searching for the Spirit of God in the world today will benefit from reading it.&quot; -- Horizons\n\n&quot;For those unfamiliar with his work, this volume is a wonderful place to begin. Another significant achievement.&quot; -- Circuit Rider\n\n&quot;Gentle and searching. This Crossroad book is a spiritual primer for anyone seeking God.&quot; -- The Other Side\n\nFrom the Publisher\n\n&quot;Life of the Beloved&quot; has become Nouwen's most cherished book. He wrote it at the invitation of a friend, who asked him to write something about the depths of spirituality in language that people unfamiliar with theology and scripture could understand. His friends loved the book, and so have readers ever since.","torrent":{"xt":"urn:btih:823261cbf761f6de7ed3fb549f25e8e0acdf8c42","amp;dn":"Henri+Nouwen+-+Life+of+the+Beloved%3A+Spiritual+Living+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"823261cbf761f6de7ed3fb549f25e8e0acdf8c42","infoHashBuffer":{"type":"Buffer","data":[130,50,97,203,247,97,246,222,126,211,251,84,159,37,232,224,172,223,140,66]},"announce":[],"urlList":[]}}