{"title":"TOUR_OF_DUTY_Season 1.Xvid-AJAXEN","uid":9530914,"size":8690267354,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82814cd00d6dbd995a0acfc674638f7a64cfab3b&amp;dn=TOUR_OF_DUTY_Season+1.Xvid-AJAXEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"ajaxen94","files":-1,"time":1390842434,"description":"TOUR OF DUTY - Season 1 with all the original music Soundtrack\n\nAs the first television drama series about the Vietnam War, Tour of Duty focuses on a single platoon of young U.S. soldiers through their one-year tour of combat duty in Vietnam during the late 1960's. While their own country is rocked by a massive anti-war movement, these young men find themselves thrown into combat in Southeast Asia, where they face enemy troops they can not see and sometimes can not kill. They also face their own fears, as they struggle in a hostile environment just to keep themselves and their fellow soldiers alive. Terence Knox, Kevin Conroy, Stephen Caffrey, Joshua Maurer, Steve Akahoshi, Tony Becker, Eric Bruskotter, Stan Foster, Ramon Franco and Miguel A. Nunez, Jr. star as the infantrymen who represent diverse racial, cultural and philosophical backgrounds but must ultimately depend on one another to get through the war alive. Tour of Duty takes place in 1967, when the war in Vietnam has escalated to terrifying heights. \n\naspect ratio...576x364\nbit rate..........1000\nframe rate......25\naudio mp3 stereo...96\n\ni bought this dvd set for my husband as a birthday present we already owned the version without the original music soundtrack, when he first heard it he refused to watch anymore until we got a better copy with the music he loves, and as he is disabled and finds it hard to change dvds i decided to make it easier for him and converted all the seasons so we could transfer to a flash drive and he didn't have to change discs anymore, so he suggested that i should upload it as there are probably a lot of people who would like to have the original music soundtrack so here it is and please enjoy.","torrent":{"xt":"urn:btih:82814cd00d6dbd995a0acfc674638f7a64cfab3b","amp;dn":"TOUR_OF_DUTY_Season+1.Xvid-AJAXEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82814cd00d6dbd995a0acfc674638f7a64cfab3b","infoHashBuffer":{"type":"Buffer","data":[130,129,76,208,13,109,189,153,90,10,207,198,116,99,143,122,100,207,171,59]},"announce":[],"urlList":[]}}