{"title":"The Penumbra Collection GOG","uid":8763700,"size":1029021065,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:82eb691f1ebea936d9da0df9b9b1af8895c32b58&amp;dn=The+Penumbra+Collection+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1375292846,"description":"\ngenre: action / adventure / horror\nrelease date: March 30, 2007\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: English\ndeveloper / publisher: Frictional Games / Frictional Games\ngame modes: single-player\n\nBonus content included for FREE with purchase:\n2 manuals\n2 walkthroughs\n17 artworks\n\nWhat's cool about it:\n\nThe Penumbra Collection includes Penumbra Overture, Black Plague, and the expansion Requiem.\nA thrilling blend of puzzles with multiple solutions and horror that will have you screaming for more!\nFull freedom of movement along with the ability to manipulate everything using natural gestures creates an immersive world.\n\nOverview:\n\nLike all good nightmares, Philip's begins with something all too real - his mother's death. The days following the funeral are characterized by nothing, save for an incessant feeling of abandonment. Until, that is, he receives a letter from a dead man. Philip's father left before he was born, taking his reasons with him. Now, here he is, opening up the door from beyond the grave. That door leads to more questions, and those questions lead to Greenland. Philip follows the clues - they're all he has left. On leaving the final signs of human civilization behind him, in search of the location mentioned in his father's ambiguous notes, Philip wonders if he's left some part of his humanity behind as well. Soon, that will be the least of his fears.\n\nThe Penumbra Collection is a first person horror adventure focusing on story, immersion, and puzzle solving. You'll be on edge like never before as you explore bizarre and mysterious environments, the unknown waiting for you behind every corner. The world is detailed both in terms of graphical fidelity and narrative character - the Penumbra Collection is a horrific experience that will grip players from its opening thrills to it chilling denouement.\n\nAge requirements: ESRB Rating: MATURE with Blood and Gore, Language, Violence. PEGI Rating: 16+ with Violence.\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 9.0c with 256 MB of VRAM or more, 2GB HDD, Mouse, Keyboard.\n\nInstallation\n\nInstall and play","torrent":{"xt":"urn:btih:82eb691f1ebea936d9da0df9b9b1af8895c32b58","amp;dn":"The+Penumbra+Collection+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82eb691f1ebea936d9da0df9b9b1af8895c32b58","infoHashBuffer":{"type":"Buffer","data":[130,235,105,31,30,190,169,54,217,218,13,249,185,177,175,136,149,195,43,88]},"announce":[],"urlList":[]}}