{"title":"Wolfgang Amadeus Mozart - Le Nozze Di Figaro (Georg Solti)","uid":5142610,"size":404503334,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82f25acb02a3461c40250528817077e032ebee2f&amp;dn=Wolfgang+Amadeus+Mozart+-+Le+Nozze+Di+Figaro+%28Georg+Solti%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dougietrotter","files":-1,"time":1257028071,"description":"This is a recording that people either love or hold in contempt. I happen to be someone who favors this recording. How can a recording with a cast such as this possibly fail? Each of the major performers: Kiri Te Kanawa as the Countess, Frederica von Stade as Cherubino, Lucia Popp as Susanna, Thomas Allen the Count, and Samuel Ramey as Figaro are all known for their interpretations of these roles. Sir Georg Solti conducts the score with vigor and expertise.\n\nStrengths of the recording start with the rousing version of the overture, an orchestral piece that can often be performed too slowly, but has vigor in this recording. Von Stade's renditions of &quot;Non so Piu&quot; in Act I and the well known &quot;Voi Che Sapete&quot; of Act II are excellent. Ramey's rendition of &quot;Non Pui Andrai&quot; where he celebrates Cherubino's decision to join the military is able to convey the humor of the scene. The finale of Act II is well done and the cast captures the craziness of the scene rather well. The Act III aria &quot;Dove Sono&quot; is Te Kanawa at her best. The Act III duet of the Countess and Susanna &quot;Che Soave Zefiretto&quot; (familiar to fans of THE SHAWSHANK REDEMPTION as the song played over the prison p.a. system) sounds angelic. My only fault with the singing in this recording is that of the tenor role of Robert Tear as Don Basilio, but this may be due more to the fact that this is not all that great a role for a tenor.\n\nSo why do some people love this recording and others disdain it? Le NOZZE di FIGARO is one of the most popular operas as well as one of the most recorded works in the classical repertoire. I think we tend to fall in love with the first recording we hear and judge all others based on our first impressions. Figaro is one of the operas that &quot;we always remember our first love.&quot; Fans of other interpretations of Mozart may find earlier recordings superior, and since I enjoy them I will not argue the point, but this is certainly a great recording and brings this magnificent opera to life in a truly magical way.\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:82f25acb02a3461c40250528817077e032ebee2f","amp;dn":"Wolfgang+Amadeus+Mozart+-+Le+Nozze+Di+Figaro+%28Georg+Solti%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f25acb02a3461c40250528817077e032ebee2f","infoHashBuffer":{"type":"Buffer","data":[130,242,90,203,2,163,70,28,64,37,5,40,129,112,119,224,50,235,238,47]},"announce":[],"urlList":[]}}