{"title":"The.Lucky.Ones.DVDRip.2008.H264","uid":5214729,"size":368383995,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82f922fc84332e11c6f9b3d25414e93a8d3ac22e&amp;dn=The.Lucky.Ones.DVDRip.2008.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"twentyforty","files":1,"time":1260722029,"description":"*** Small-sized 2-pass re-encode of DVDrip for computers (PC, Mac), PS3 or Xbox . ***\n*** Video is 480x272 H264; audio is 44.1 kHz/stereo AAC LC and container is MP4. ***\n\nI can recommend CoreCodec for H264 (avc1, x264) video-playback, free DivX 7 for AAC sound-playback (and .mkv with AAC), Haali splitter (free, comes with CoreCodec) as the fastest and best combination for Windows Media Player. This is what I use.\nVLC player (free), mplayer (free) and KMplayer (free) are available as alternative for all platforms (operating systems) out there and have BUILT-IN codecs and MP4 capabilities. But, video quality is approx. 10-15% lower, blurrier at least on system I have.\nOne can try CCCP matroska codec pack, where ffdshow codec/filter packs and Haali splitter comes in one package and support MP4 playback - but extra caution is required during the install process.\nQuickTime of course, supports H264/AAC natively.\nMany of movies I encode have embedded subtitles. So far, only VLC player is able to use them correctly.\n\nDirected by Neil Burger. With Tim Robbins, Rachel McAdams, Michael Pena.\n\nThe story revolves around three soldiers - Colee, TK and Cheever who return from the Iraq War after suffering injuries and learn that life has moved on without them. They end up on an unexpected road trip across the U.S., with Colee on a mission to bring her boyfriend's guitar back to his family because he saved her life, TK seeking confidence to face his wife after a shrapnel injury that threatens his sexual function and middle-aged Cheever planning to hit the casinos in a desperate effort to pay for his son's college tuition.\n","torrent":{"xt":"urn:btih:82f922fc84332e11c6f9b3d25414e93a8d3ac22e","amp;dn":"The.Lucky.Ones.DVDRip.2008.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f922fc84332e11c6f9b3d25414e93a8d3ac22e","infoHashBuffer":{"type":"Buffer","data":[130,249,34,252,132,51,46,17,198,249,179,210,84,20,233,58,141,58,194,46]},"announce":[],"urlList":[]}}