{"title":"Pulitzer prize winners and finalists for general nonfiction, 199","uid":10685733,"size":213759423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83137c4468731ce0cd1edce5bd0071b6dbef42b2&amp;dn=Pulitzer+prize+winners+and+finalists+for+general+nonfiction%2C+199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"medoxic","files":155,"time":1407078051,"description":"Pulitzer prize winners and finalists for general nonfiction, 1995-2014\nepub/mobi with metadata and covers\n\n\nBooks in torrent:\n\n1995: The Beak of the Finch: A Story of Evolution in Our Time by Jonathan Weiner / How We Die: Reflections on Life's Final Chapter by Sherwin B. Nuland,       Midnight in the Garden of Good and Evil: A Savannah Story by John Berendt\n1996: / Darwin's Dangerous Idea: Evolution and The Meanings of Life by Daniel C. Dennett\n1997: Ashes to Ashes: America's Hundred-Year Cigarette War, the Public Health, and the Unabashed Triumph of Philip Morris by Richard Kluger /\n1998: Guns, Germs, and Steel: The Fates of Human Societies by Jared Diamond / How the Mind Works by Steven Pinker, Into Thin Air: A Personal Account of the Mt. Everest Disaster by Jon Krakauer\n1999: Annals of the Former World by John McPhee / The Nurture Assumption: Why Children Turn Out the Way They Do by Judith Rich Harris\n2000: Embracing Defeat: Japan in the Wake of World War II by John W. Dower / The Elegant Universe: Superstrings, Hidden Dimensions and the Quest for the Ultimate Theory by Brian Greene\n2001: Hirohito and the Making of Modern Japan by Herbert P. Bix / Newjack: Guarding Sing Sing by Ted Conover\n2002: Carry Me Home: Birmingham, Alabama, the Climactic Battle of the Civil Rights Revolution by Diane McWhorter / The Noonday Demon: An Atlas of Depression by Andrew Solomon\n2003: &quot;A Problem from Hell&quot;: America and the Age of Genocide by Samantha Power / The Anthropology of Turquoise: Meditations on Landscape, Art, and Spirit by Ellen Meloy, The Blank Slate: The Modern Denial of Human Nature by Steven Pinker\n2004: Gulag: A History by Anne Applebaum / \n2005: Ghost Wars: The Secret History of the CIA, Afghanistan, and Bin Laden, from the Soviet Invasion to September 10, 2001 by Steve Coll / The Devil's Highway: A True Story by Luis Alberto Urrea, Maximum City: Bombay Lost and Found by Suketu Mehta\n2006: Imperial Reckoning: The Untold Story of Britain's Gulag in Kenya by Caroline Elkins / Postwar: A History of Europe Since 1945 by Tony Judt\n2007: The Looming Tower: Al-Qaeda and the Road to 9/11 by Lawrence Wright / Crazy: A Father's Search Through America's Mental Health Madness by Pete Earley, Fiasco: The American Military Adventure in Iraq by Thomas E. Ricks\n2008: The Years of Extermination: Nazi Germany and the Jews, 1939-1945 by Saul Friedlander / The Cigarette Century by Allan M. Brandt, The Rest Is Noise: Listening to the Twentieth Century by Alex Ross\n2009: Slavery by Another Name: The Re-Enslavement of Black Americans from the Civil War to World War II by Douglas A. Blackmon / Gandhi and Churchill: The Epic Rivalry That Destroyed an Empire and Forged Our Age by Arthur L. Herman\n2010: The Dead Hand: The Untold Story of the Cold War Arms Race and Its Dangerous Legacy by David E. Hoffman / The Evolution of God by Robert Wright, How Markets Fail: The Logic of Economic Calamities by John Cassidy\n2011: Emperor of All Maladies: A Biography of Cancer by Siddhartha Mukherjee / The Shallows: What the Internet Is Doing to Our Brains by Nicholas G. Carr, Empire of the Summer Moon: Quanah Parker and the Rise and Fall of the Comanches, the Most Powerful Indian Tribe in American History by S.C. Gwynne\n2012: The Swerve: How the World Became Modern by Stephen Greenblatt / Unnatural Selection: Choosing Boys over Girls, and the Consequences of a World Full of Men by Mara Hvistendahl\n2013: Devil in the Grove: Thurgood Marshall, the Groveland Boys, and the Dawn of a New America by Gilbert King / Behind the Beautiful Forevers: Life, Death and Hope in a Mumbai Undercity by Katherine Boo, The Forest Unseen: A Year's Watch in Nature by David George Haskell\n2014: Toms River: A Story of Science and Salvation by Dan Fagin / The Blood Telegram: Nixon, Kissinger and a Forgotten Genocide by Gary J. Bass, The Insurgents: David Petraeus and the Plot to Change the American Way of War by Fred Kaplan\n\n\nMissing books (will be thankful for posting):\n\n1996: The Haunted Land: Facing Europe's Ghosts After Communism by Tina Rosenberg / Mr. Wilson's Cabinet of Wonder by Lawrence Weschler\n1997: / Fame and Folly by Cynthia Ozick, The Inheritance: How Three Families and America Moved from Roosevelt to Reagan and Beyond by Samuel G. Freedman\n1999: / Crime and Punishment in America by Elliott Currie\n2000: / Living on the Wind: Across the Hemisphere with Migratory Birds by Scott Weidensaul\n2001: / A Heartbreaking Work of Staggering Genius by Dave Eggers\n2002: / War in a Time of Peace: Bush, Clinton, and the Generals by David Halberstam\n2004: / The Mission: Waging War and Keeping Peace with America's Military by Dana Priest, Rembrandt's Jews by Steven Nadler\n2006: / The Assassins' Gate: America in Iraq by George Packer\n2009: / The Bitter Road to Freedom: A New History of the Liberation of Europe by William I. Hitchcock\n2012: / One Hundred Names For Love: A Stroke, a Marriage, and the Language of Healing by Diane Ackerman\n","torrent":{"xt":"urn:btih:83137c4468731ce0cd1edce5bd0071b6dbef42b2","amp;dn":"Pulitzer+prize+winners+and+finalists+for+general+nonfiction%2C+199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83137c4468731ce0cd1edce5bd0071b6dbef42b2","infoHashBuffer":{"type":"Buffer","data":[131,19,124,68,104,115,28,224,205,30,220,229,189,0,113,182,219,239,66,178]},"announce":[],"urlList":[]}}