{"title":"Mira Grant - Newsflesh Complete","uid":15349123,"size":1763627342,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:836c65e6a55d533725116e2a0eadd71491ba6dce&amp;dn=Mira+Grant+-+Newsflesh+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Cybotage","files":77,"time":1468914514,"description":"Collected here for the first time is every piece of short fiction from New York Times best seller Mira Grant's acclaimed Newsflesh series, with two new never-before-published novellas and all eight short works available for the first time in audio.\r\n\r\nWe had cured cancer. We had beaten the common cold. But in doing so, we created something new, something terrible that no one could stop. The infection spread, a man-made virus taking over bodies and minds, filling them with one unstoppable command...FEED.\r\n\r\nMira Grant creates a chilling portrait of an America paralyzed with fear. No one leaves their houses, and entire swaths of the country have been abandoned. And only the brave, the determined, or the very stupid venture out into the wild.\r\n\r\n \t\r\n  \t01 - Feed\r\n  \t02 - Deadline\r\n  \t03 - Blackout\r\n  \tRise - The Complete Newsflesh Collection\r\n\r\nRead by Christine Lakin, John Glouchevitch, Nicholas Guy Smith\r\nFormat: MP3\r\nUnabridged\r\n\r\n\r\n---\r\n\r\nThe Trilogy books are not mine, so thank you to the original uploaders, but it felt fitting to include them with Rise: The Complete Newsflesh Collection, the compilation of all the short fiction to come after the Trilogy. The stories are labeled &quot;Pre&quot; meaning the events happened before the Trilogy; &quot;Post&quot; meaning the story takes place after the Trilogy; one &quot;Pre-Post&quot; where the two POVs flip back and forth between events happening before the Trilogy and after; and the two &quot;New&quot; stories which are exclusive to the Collection. The stories, in my opinion, are best enjoyed after experiencing the Trilogy, with the possible exception of Countdown, but to each their own","torrent":{"xt":"urn:btih:836c65e6a55d533725116e2a0eadd71491ba6dce","amp;dn":"Mira+Grant+-+Newsflesh+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"836c65e6a55d533725116e2a0eadd71491ba6dce","infoHashBuffer":{"type":"Buffer","data":[131,108,101,230,165,93,83,55,37,17,110,42,14,173,215,20,145,186,109,206]},"announce":[],"urlList":[]}}