{"title":"A Cook's Tour - Anthony Bourdain [Epub &amp; Mobi] [StormRG]","uid":9861863,"size":1450459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:837c6a33da283c7ba15158a7932d1339a53e2b2b&amp;dn=A+Cook%27s+Tour+-+Anthony+Bourdain+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"krystine","files":-1,"time":1396309538,"description":"Description\nA Cook's Tour: In Search of the Perfect Meal\nAuthor: Anthony Bourdain\nPublished: 2010\nPublisher: Bloomsbury USA\nISBN: 9781582341408\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nDodging minefields in Cambodia, diving into the icy waters outside a Russian bath, Chef Bourdain travels the world over in search of the ultimate meal. The only thing Anthony Bourdain loves as much as cooking is traveling, and A Cook's Tour is the shotgun marriage of his two greatest passions. Inspired by the question, 'What would be the perfect meal?', Anthony sets out on a quest for his culinary holy grail. Our adventurous chef starts out in Japan, where he eats traditional Fugu, a poisonous blowfish which can be prepared only by specially licensed chefs. He then travels to Cambodia, up the mine-studded road to Pailin into autonomous Khmer Rouge territory and to Phnom Penh's Gun Club, where local fare is served up alongside a menu of available firearms. In Saigon, he's treated to a sustaining meal of live Cobra heart before moving on to savor a snack with the Viet Cong in the Mecong Delta. Further west, Kitchen Confidential fans will recognize the Gironde of Tony's youth, the first stop on his European itinerary. And from France, it's on to Portugal, where an entire village has been fattening a pig for months in anticipation of his arrival. And we're only halfway around the globe. . . A Cook's Tour recounts, in Bourdain's inimitable style, the adventures and misadventures of America's favorite chef.","torrent":{"xt":"urn:btih:837c6a33da283c7ba15158a7932d1339a53e2b2b","amp;dn":"A+Cook%27s+Tour+-+Anthony+Bourdain+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837c6a33da283c7ba15158a7932d1339a53e2b2b","infoHashBuffer":{"type":"Buffer","data":[131,124,106,51,218,40,60,123,161,81,88,167,147,45,19,57,165,62,43,43]},"announce":[],"urlList":[]}}