{"title":"Our darknet and its bright spots - Hacking - 26C3 [MP4-ENG]","uid":5452305,"size":611567864,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:84aeb23a4db7f93346684b2c370b0658580b265d&amp;dn=Our+darknet+and+its+bright+spots+-+Hacking+-+26C3+%5BMP4-ENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"exportacc","files":1,"time":1269224578,"description":"[align=center]\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showforum=395][IMG]http://img21.imageshack.us/img21/8945/freeculture.gif[/IMG][/URL]\n[/align]\n\n26th Chaos Communication Congress - Here be dragons \n[IMG]http://events.ccc.de/congress/2009/wiki/skins/herebedragons/img/26C3_topbar.jpg[/IMG]\n[URL=http://events.ccc.de]http://events.ccc.de[/URL]\n\nSpeakers[URL=http://events.ccc.de/congress/2009/Fahrplan/speakers/1036.en.html]\taestetix[/URL]\n[URL=http://events.ccc.de/congress/2009/Fahrplan/speakers/1187.en.html]\tequinox[/URL]\n[URL=http://events.ccc.de/congress/2009/Fahrplan/speakers/2779.en.html]\tEric Michaud[/URL]\n[URL=http://events.ccc.de/congress/2009/Fahrplan/speakers/313.en.html]\tmc.fly[/URL]\nSchedule\nDay \tDay 1 - 2009-12-27\nRoom \tSaal3\nStart time \t16:00\nDuration \t01:00\nInfo\nID \t3504\nEvent type \tLecture\nTrack \tCommunity\nLanguage used for presentation \tEnglish\n\nla nostra darknet ed i suoi punti luminosi\n\ncostruire connessioni per spazi e persone\n\nCostruire una rete privata per connettere il tuo vicinato. Perche' sentiamo che le soluzioni piu' comuni siano terribili dal punto di vista dello spreco delle risorse e quello che pensiamo vada meglio.\n\nSalite a bordo.\n\nIn questo talk vi daro' l'opportunita' di dare un'occhiara alle sfumature di grigio dell'interconnessione di reti di hackerspaces e di persone. Mc.Fly presenta ChaosVPN, rinato in questo darknettesco approccio ed ottenendo momentum dagli hackerspaces stabiliti negli USA e in EU con spazi come NYC Resistor, Pumping Station: One, Noisebridge e c-base. L'Agora Network sara' presentata da Aestetix e Eric per coprire gli aspetti tecnici e comunitari e spiegare cosa asspettarsi. Equinox mostrera' il lato white-ish  chiamato dn42 - la vecchia ma simpatica signora che collega gran parte degli spazi tedeschi e giovanili come sublab ed entropia.\n\nFare leva sugli sforzi della rete ChaosVPN negli USA e' l'Agora Network (Attualmente in Private Beta). Facendo questo non dovremo duplicare gli sforzi di ogniuno coinvolto che abbiamo &quot;settled&quot; su una piattaforma standard usando tincd [scusate per la traduzione]. Con hasckespaces che spuntano molto rapidamente e con successo negli USA negli ultimi 24mesi abbiamo pensato che sia necessario. Agora e' una servizio mesh vpn che serve a legarli tutti assiee in una comune intranet. Sulla rete le persone ospiteranno macchine per VMs, sviluppo, file hosting, servizi telefonici PBX, ed un numero di cluster di alte performance a disposizione degli utenti che stiamo attualmente sviluppando incluso quelli forniti dagli utenti dei nodi. Nel processo diverse universita' negli US hanno chiesto di entrare a fare parte della rete per diverse opportunita' di ricerca non precedentemente disponibili a loro.\n\ndn42 e' costruito con tunnels (OpenVPN, GRE, tinc, ecc) ed fa uso di BPG - lo stesso protocollo di routing dinamico sul quale funziona Internet, ma con meno reti nella tabella di routing. Gettiamo inoltre un po di luce sia sugli aspetti tecnici che sociali del dn24. La nostra camminata inizia con fondazioni tecniche e continua trattando cio' che BGP ci permette di fare a livello sociale. Vedremo anche come il flusso di traffico possa essere progettato tenendo conto di limitazioni esternet (pensa ad esempio alla tua DSL asimmetrica di casa [ADSL]), ed ultimo ma non il meno importante: discuteremo diversi casi di attacchi intenzionali e come vengono affrontati. Mentre dn42 e' il nostro terreno di gioco per testare e modellare tutta questa roba, gran parte di esso si applica benissimo anche ad internet.\n\nQuesto talk e' da qualche parte attorno all'entrata al livello immediato [scusate per la trad]. Dovreste gia' sapere cosa e' una sottorete IP, un route ed il routing dinamico.\n\nAllegati:\n\n[URL=http://events.ccc.de/congress/2009/Fahrplan/attachments/1497_darknet.pdf]    * (application/pdf - 731.4 KB)\n\nLinks\n\n[URL=http://dn42.net/]    * dn42[/URL]\n\n\n\n\nEN:\n\nour darknet and its bright spots\n\nbuilding connections for spaces and people\n\nBuilding a private network to connect your neighbourhood. Why we feel common solutions are terrible on resources and what we think is better.\n\nGet on board.\n\nThis talk will give you the opportunity to take a look at the shades of grey of interconnecting hackerspaces and people's networks. Mc.Fly presents ChaosVPN, reborn in its darknet-ish approach and gaining momentum from established hackerspaces in the US and Europe with spaces like NYC Resistor, Pumping Station: One, Noisebridge and c-base. The Agora Network will be presented by Aestetix and Eric in covering the community and technical aspects and what to expect. Equinox will show you the white-ish side called dn42 - the old but nice lady that connects mostly german people and younger spaces like sublab and entropia.\n\nLeveraging the efforts of the ChaosVPN network in the US is the Agora Network (Currently In Private Beta). By doing this we are not having to duplicate the efforts of every one involved we have settled on a standard platform utilising tincd. With hackerspaces popping up very rapidly and successfully in the US for the last 24 months we find this necessary. Agora is a mesh vpn service that serves to tie them all together on a common intranet. On the network people will be hosting machines for VMs, development, file hosting, PBX phone services, and a number of high performance clusters at the disposal of users which we are currently developing including those provided by node users. In the process several universities in the US have asked to join the network for several research opportunities not previously available to them.\n\ndn42 is built with tunnels (OpenVPN, GRE, tinc, etc) and has BGP running over them - the same dynamic routing protocol the internet runs on, albeit with less networks in the routing table. We will shed some light on both the technical and social aspects of dn42. Our walk starts at technical foundations and heads over to what BGP allows us to do on a social level. We'll also see how the flow of traffic can be engineered according to external constraints (think your plain asymmetric DSL at home), and last but not least we'll discuss different cases of maliciousness and how they're treated. While dn42 is our playground for testing and modelling all this stuff, most of it apples to the internet as well.\n\nThis talk is somewhere around entry to immediate level. You should roughly know what an IP subnet, a route and dynamic routing is.\nAttached files\n\n[URL=http://events.ccc.de/congress/2009/Fahrplan/attachments/1497_darknet.pdf]    * (application/pdf - 731.4 KB)\n\nLinks\n\n[URL=http://dn42.net/]    * dn42[/URL]\n\n\n[ Info sul file ]\n\nNome: 26c3-3504-en-our_darknet_and_its_bright_spots.mp4\nData: 14/01/2010 01:37:24\nDimensione: 611,567,864 bytes (583.237 MB)\n\n[ Info generiche ]\n\nDurata: 00:52:04 (3124.12 s)\nTipo di contenitore: MP4/MOV\nMajor brand: ISO Base Media version 512\nCompatible brands: JVT AVC\nData creazione: 1/01/1970 00:00:00 UTC\nData modifica: 1/01/1970 00:00:00 UTC\nStreams totali: 2\nTipo stream n. 1: video (avc1) {\fVideoHandler}\nTipo stream n. 2: audio (AAC Low complexity) {\fSoundHandler}\nAudio streams: 1\n\n[ Dati rilevanti ]\n\nRisoluzione: 720 x 576\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\n\nCodec: avc1\nRisoluzione: 720 x 576\nFrame aspect ratio: 5:4 = 1.25\nPixel aspect ratio: 25777493:23592960 = 1.092592\nDisplay aspect ratio: 25777493:18874368 = 1.365740\nFramerate: 25 fps\nFrames totali: 78103\nBitrate: 1497.828272 kbps\n\n[ Traccia audio ]\n\nCodec: AAC Low complexity\nBitrate: 63.996213 kbps\nCanali: 1\nFrequenza: 44100 Hz\n\n[ Info sulla codifica H.264 ]\n\nSPS id: 0\n  Profile: Baseline@L3\n  Num ref frames: 1\n  Aspect ratio: Custom pixel shape (59:54 = 1.092592)\n  Chroma format idc: YUV 4:2:0\nPPS id: 0 (SPS: 0)\n  Codifica entropica: CAVLC\n  Weighted prediction: No\n  Weighted bipred idc: No\n  8x8dct: No\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\nAvvertenza: Se vuoi un rapporto piÃƒÂ¹ completo e preciso clicca su &quot;Analisi DRF&quot;\n\nRapporto generato da AVInaptic (18-11-2007) in data 14 gen 2010, h 15:42:24\n\n\n\nBanda: 20kB/s 24/24 7/7 fino ad assestamento della release\n\nse vi piace questa release forse vi interesseranno anche le atre mie rel:\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?act=allreleases&amp;st=0&amp;filter=gioacchino2&amp;sb=1&amp;sd=0&amp;cat=0&amp;mid=294618]http://forum.tntvillage.scambioetico.org/t...&amp;mid=294618[/URL]\n\nnota: in questi giorni il download e' abbastanza veloce (OLTRE 300kB/s ) siccome c'e' molta gente in DHT e su altri trackers\n\n\n[IMG]http://events.ccc.de/congress/2009/Fahrplan/images/conference-128x128.png[/IMG]\n\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=198523]link[/URL]\n","torrent":{"xt":"urn:btih:84aeb23a4db7f93346684b2c370b0658580b265d","amp;dn":"Our+darknet+and+its+bright+spots+-+Hacking+-+26C3+%5BMP4-ENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84aeb23a4db7f93346684b2c370b0658580b265d","infoHashBuffer":{"type":"Buffer","data":[132,174,178,58,77,183,249,51,70,104,75,44,55,11,6,88,88,11,38,93]},"announce":[],"urlList":[]}}