{"title":"SpaceMonger 2.1.1 + patcher","uid":8725610,"size":1294559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:85521b0e2478c51376c6fe3730ae39a9baba97ec&amp;dn=SpaceMonger+2.1.1+%2B+patcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"almostD","files":-1,"time":1374511126,"description":"What is it?\n\nSpaceMonger is a tool for keeping track of the free space on your computer. Each file or folder on a given drive is displayed in a box in the main window whose size is a relative comparison to all the other files in your system. So, for example, if the &quot;Windows&quot; box takes up 90% of the screen, the &quot;C:Windows&quot; folder and all its sub-folders and files are taking up 90% of your &quot;C:&quot; drive.\n\n\nWhat does it do?\n\nScans any drive that Windows can see. Including USB drives, mapped network drives, and so on. After scanning it shows you a view with files and folder taking up a visual percentage of the screen to give you a very quick way to estimate where you file space is going. You can drill down folders and get an idea of the space usage within individual folder or a person's file space.\n\n\nHow do I use it?\n\n\nThis guide is for the free 1.x version\n\nSpaceMonger is a single exe file allowing you to run it from USB drives or a network share very easily. You will be presented with a blank screen. Clicking open in the top right will show you a list of top level drives to analyse. Once done it will present you with a view something like the image in Figure 1.\n\nDouble clicking on any of the folders will set that folder as the root allowing it to fill the screen and showing in more detail the files and folder within.\n\n\nEnjoy it, this software is GREAT!","torrent":{"xt":"urn:btih:85521b0e2478c51376c6fe3730ae39a9baba97ec","amp;dn":"SpaceMonger+2.1.1+%2B+patcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85521b0e2478c51376c6fe3730ae39a9baba97ec","infoHashBuffer":{"type":"Buffer","data":[133,82,27,14,36,120,197,19,118,198,254,55,48,174,57,169,186,186,151,236]},"announce":[],"urlList":[]}}