{"title":"The Human Canvas - The World's Best Body Paintings (gnv64)","uid":11320336,"size":47854326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85da6419d9cf033c3236143aea7d9fbf28dcbe24&amp;dn=The+Human+Canvas+-+The+World%27s+Best+Body+Paintings+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"gnv65","files":-1,"time":1414596632,"description":"The Human Canvas - The World's Best Body Paintings\nby Karala Barendregt\nIMPACT | November 2014 | ISBN-10: 1440337004 | ePUB | 34.5 mb\n\nInside the Magical World of Bodypainting\nFrom fine art to fashion and from advertising to competition, the world of bodypainting is vast and beautiful. With The Human Canvas you will get front row seats to the pageantry of mind-blowing images from accomplished artists around the world. Many of these artists have won the coveted championship at the World Bodypainting Festival and every one holds a special place within this secret, joyful world of creativity and art. With gorgeous images and inside peeks into the minds and processes of the artists, this book will inspire and amaze you.\nThis book was inspired by the World Champion artists Brian Wolfe, who succumbed in his fight against pancreatic cancer in October 2013. A portion of the proceeds from this project will go to support Brian Wolfe's wife and young daughter.\n\nAbout the Author\nKarala B. is an artist and author from Sydney, Australia, living in the south of Austria. She is mostly known for her work in the body art industry, having written the first-ever combined work on body art, which included the history of the art form, its modern uses and profiles of iconic artists of the movement. Karala began her work in the industry in 1999 and worked for the World Bodypainting Association from 2004 until 2010, researching the art form and its growth. She then dedicated her time to public speaking and writing books and articles to spread knowledge of the artists and their work in Europe, Australia and North America","torrent":{"xt":"urn:btih:85da6419d9cf033c3236143aea7d9fbf28dcbe24","amp;dn":"The+Human+Canvas+-+The+World%27s+Best+Body+Paintings+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85da6419d9cf033c3236143aea7d9fbf28dcbe24","infoHashBuffer":{"type":"Buffer","data":[133,218,100,25,217,207,3,60,50,54,20,58,234,125,159,191,40,220,190,36]},"announce":[],"urlList":[]}}