{"title":"My.Kitchen.Rules.s06e10.WS.PDTV.x264.BF1.mkv","uid":11704954,"size":640861442,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:865d485bafd809411dd20d5e314d7d66f7490dc3&amp;dn=My.Kitchen.Rules.s06e10.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"bigfish5","files":1,"time":1424047667,"description":"My Kitchen Rules Australia Series 6 Episode 10\n\nOyster Farmers Matt and Rob are feeling confident going into their Instant Restaurant but their nerves may get the better of them. Hosted by Pete Evans and Manu Feildel.\n\nMatt and Rob Victoria\nAn oyster bar is the dream. \nBest mates Matt and Rob have experienced a lot in life together. From mischievous school boys to high school peers, university pals, flatmates and now business partners, their bond is more like family.\nThey both have sisters so see their friendship as the brother they never had. &quot;But we probably get along better than brothers,&quot; says Matt. &quot;I reckon brothers probably would get on each other's nerves more.&quot;\nThese young marine biologists, both 31, from Melbourne made a leap of faith three years ago and invested in an oyster farm in Coffs Harbour.\nRob admits it was a very big decision buying a business together. &quot;It was a bit of a life changer really that one,&quot; he says. &quot;It's coming along well. We're going in the direction we want to. We're still in the building phase but we think we've got the farm almost at full capacity now.&quot;\nThat equates to between 50,000 and 60,000 oysters in the water. And while initially they were selling their oysters wholesale to fish markets and restaurants, they are hoping to diversify in the future.\nExplains Matt: &quot;We want to try out a number of different recipes and see what's popular and what works and hopefully from there we can get into a permanent spot - an oyster bar is the dream.&quot;\nMatt has been seeing girlfriend Mel for just over a year and they are now in a long- distance relationship while the boys focus on the farm.\nRob, on the other hand, says he enjoys his bachelor ways. Nicknamed Thor, Rob has a striking resemblance to his cousin who played the famous character, former Home and Away actor Chris Hemsworth. It could be in part thanks to his sculpted body courtesy of his daily sessions in the gym.\nBut his greatest love is fly fishing. &quot;I spend basically all my free time on weekends fly fishing,&quot; says Rob. &quot;I like to trek around the ocean, estuaries and rivers up in the mountains. I like everything that it involves: kayaks, boats, rafts, hiking.&quot;\nMatt has his sights set on becoming a surfer after making the move to the coast. &quot;I like water sports. I like a lot of board sports so I like wake boarding, I love snow boarding, and trying to learn how to surf now is the next one. I have my wet suit and my surfboard and I just need to get out there and practice,&quot; he says.\nMatt says their strength in the competition is their attention to detail thanks to their scientific backgrounds. &quot;I tend to be pretty good at following procedures and recipes, going back to all the lab work I've done,&quot; he says.\nThey say the divide in the kitchen is much the same as in their business.\n&quot;It will be like our business and our working relationship where there isn't necessarily a boss. I think we both have different strengths and weaknesses so we try to play to those. If somebody is good at something we let them take lead and run with it,&quot; says Matt.\nRob says like many males, desserts will be their Achilles heel in the competition.\nA generally health conscious eater, he says he never cooks desserts. In fact, he rarely even eats them.\n&quot;I steer clear of dessert. I can't remember the last time I ordered a dessert when I went out. I don't really ever do it,&quot; he admits.\nBut their definite advantage is their ability to cook seafood and their love of the barbecue for grilling","torrent":{"xt":"urn:btih:865d485bafd809411dd20d5e314d7d66f7490dc3","amp;dn":"My.Kitchen.Rules.s06e10.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"865d485bafd809411dd20d5e314d7d66f7490dc3","infoHashBuffer":{"type":"Buffer","data":[134,93,72,91,175,216,9,65,29,210,13,94,49,77,125,102,247,73,13,195]},"announce":[],"urlList":[]}}