{"title":"The Senses - A Comprehensive Reference","uid":15570161,"size":155870476,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:867cbcf3b635c32ab0051d766685b20c15f8b880&amp;dn=The+Senses+-+A+Comprehensive+Reference&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"clouderone","files":1,"time":1471246656,"description":"The Senses - A Comprehensive Reference - Allan I. Basbaum et al. (AP, 2008).pdf\r\n\r\nThis major new publishing event provides the first up-to-date, cutting-edge, comprehensive reference work combining volumes on all major sensory modalities in one set in three decades. Under the guidance of a distinguished team of international experts, 6 volumes collected 300 articles from all the top scientists laying out our current knowledge on the anatomy, physiology, and molecular biology of sensory organs. Topics covered include the perception, psychophysics, and higher order processing of sensory information, as well as disorders and new diagnostic and treatment methods.\r\n\r\nWritten for a wide audience, this reference work provides students, scholars, medical doctors, and anyone interested in neuroscience a comprehensive overview of the knowledge accumulated on the function of sense organs, sensory systems, and how the brain processes sensory input. Leading scholars from around the world contributed articles, making The Senses a truly international portrait of sensory physiology. The set is the definitive reference on sensory neuroscience on the market, and will provide the ultimate entry point into the review and original literature in Sensory Neuroscience, and be a natural place for interested students and scientists to deepen their knowledge.\r\n\r\n* The only current reference available covering neurobiology, physiology, anatomy, and molecular biology of sense organs and the processing of sensory information in the brain\r\n* Edited by experts in the field, with contributions from the most active researchers providing a dynamic and authoritative account of the topics\r\n* Includes full color illustrations and top-quality presentation\r\n* Also available online via ScienceDirect","torrent":{"xt":"urn:btih:867cbcf3b635c32ab0051d766685b20c15f8b880","amp;dn":"The+Senses+-+A+Comprehensive+Reference","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867cbcf3b635c32ab0051d766685b20c15f8b880","infoHashBuffer":{"type":"Buffer","data":[134,124,188,243,182,53,195,42,176,5,29,118,102,133,178,12,21,248,184,128]},"announce":[],"urlList":[]}}