{"title":"Nine Algorithms That Changed The Future  - The Ingenious Ideas T","uid":9674482,"size":9517750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86f651e9fc6ca5d238354fb807716752558f36ac&amp;dn=Nine+Algorithms+That+Changed+The+Future++-+The+Ingenious+Ideas+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1393537271,"description":"Paperback: 232 pages\nPublisher: Princeton University Press (May 5, 2013)\nLanguage: English\nISBN-10: 0691158193\nISBN-13: 978-0691158198\n\nEvery day, we use our computers to perform remarkable feats. A simple web search picks out a handful of relevant needles from the world's biggest haystack: the billions of pages on the World Wide Web. Uploading a photo to Facebook transmits millions of pieces of information over numerous error-prone network links, yet somehow a perfect copy of the photo arrives intact. Without even knowing it, we use public-key cryptography to transmit secret information like credit card numbers; and we use digital signatures to verify the identity of the websites we visit. How do our computers perform these tasks with such ease?\n\nThis is the first book to answer that question in language anyone can understand, revealing the extraordinary ideas that power our PCs, laptops, and smartphones. Using vivid examples, John MacCormick explains the fundamental &quot;tricks&quot; behind nine types of computer algorithms, including artificial intelligence (where we learn about the &quot;nearest neighbor trick&quot; and &quot;twenty questions trick&quot;), Google's famous PageRank algorithm (which uses the &quot;random surfer trick&quot;), data compression, error correction, and much more.\n\nThese revolutionary algorithms have changed our world: this book unlocks their secrets, and lays bare the incredible ideas that our computers use every day.","torrent":{"xt":"urn:btih:86f651e9fc6ca5d238354fb807716752558f36ac","amp;dn":"Nine+Algorithms+That+Changed+The+Future++-+The+Ingenious+Ideas+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f651e9fc6ca5d238354fb807716752558f36ac","infoHashBuffer":{"type":"Buffer","data":[134,246,81,233,252,108,165,210,56,53,79,184,7,113,103,82,85,143,54,172]},"announce":[],"urlList":[]}}