{"title":"DuckTales: Remastered v1.0.2","uid":13545851,"size":616932406,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:87c436a023dfa819a089d48479aeceed7242f2a7&amp;dn=DuckTales%3A+Remastered+v1.0.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Androider","files":2,"time":1455515165,"description":"One of the most cherished 8-bit titles of all time returns with the mobile release of DuckTales: Remastered! \r\n\r\nJoin Scrooge McDuck in an epic adventure across the world to discover the five Legendary Treasures! Embark on a journey to the Himalayas, Amazon, Transylvania, African mines, and Moon using Scrooge's secret map. \r\n\r\nBut watch out for the evil sorceress Magica De Spell and notorious Beagle Boys – they're on a quest to steal Scrooge's fortune and will stop at nothing. \r\n\r\nHe may have to risk it all to save his nephews, Huey, Dewey and Louie, but not without epic boss fights along the way! Hold on to your top hat and play as Scrooge McDuck as you travel to the far corners of the world! \r\n\r\nGAMEPLAY FEATURES:\r\n\r\n• PLAY as Scrooge McDuck in this remastering of the classic, side-scrolling platformer game\r\n• EXPLORE the Himalayas, Amazon, Transylvania, African mines, and Moon in search of the five Legendary Treasures\r\n• ATTACK enemies with Scrooge's iconic pogo jump and cane swing \r\n• BATTLE and DEFEAT villains in epic boss fights\r\n• POWER UP with invincibility and discover extra hearts to increase health\r\n• COLLECT gems to UNLOCK over 90 pieces of production art from the original TV series\r\n• BLUETOOTH controller supported \r\n\r\nDuckTales: Remastered retains the authenticity of its 8-bit predecessor and features an expanded story with all new, improved graphics. DuckTales fans can relive the classic TV series from the 1980's, complete with the original voice-actors and exclusive production art from the show's archives. \r\n\r\nBut this timeless tale is bound to spin up a new generation of fans by introducing a uniquely hand-crafted, simple and fun game for all ages.\r\n\r\nREMASTERED HIGHLIGHTS:\r\n\r\n• Hand-drawn animated sprites and richly painted level backgrounds \r\n• Original voice talent, including Alan Young, Frank Welker, Russi Taylor and June Foray\r\n• New Easy mode for casual and younger players, and new Extreme mode for devoted fans\r\n• Digitally-enhanced soundtrack featuring modern amplified iterations of the classic melodies\r\n• Expanded storyline and character narration\r\n\r\nWhat's New:\r\n\r\n- Improved controls\r\n- Tuned speed of lava in final chase for Lucky Dime\r\n- Abbreviated cinematic option\r\n- Minor bug fixes and performance optimizations\r\n\r\nMore Info:\r\n \nhttps://play.google.com/store/apps/details?id=com.disney.ducktalesremastered_goo\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.disney.ducktalesremastered_goo' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:87c436a023dfa819a089d48479aeceed7242f2a7","amp;dn":"DuckTales%3A+Remastered+v1.0.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87c436a023dfa819a089d48479aeceed7242f2a7","infoHashBuffer":{"type":"Buffer","data":[135,196,54,160,35,223,168,25,160,137,212,132,121,174,206,237,114,66,242,167]},"announce":[],"urlList":[]}}