{"title":"Ms. Marvel-Captain Marvel (Carol Danvers-Kamala Khan) + Extras","uid":9775329,"size":13269549726,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87f53b03496b6c35d9e37ab98619481564f61d4b&amp;dn=Ms.+Marvel-Captain+Marvel+%28Carol+Danvers-Kamala+Khan%29+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"nemesis43","files":514,"time":1395023146,"description":"Carol Danvers\n\nAfter encountering the Kree hero Captain Marvel, Carol Danvers was accidentally subjected to otherworldly radiation that transformed her into a superhuman warrior. Calling herself Ms. Marvel, she established herself as one of Marvel's most powerful and prominent heroes both as a solo heroine and as a member of the Avengers. Recently, she has adopted the mantle of Captain Marvel for herself.\n\nKamala Khan\n\n\n\nKamala Khan was the youngest of two children from a traditional Pakistani Family in New Jersey. Despite her traditional roots, Kamala was the typical American teenager. Wanting to be herself but still make her family proud. For several years, Kamala was a fan of superheroes especially the Avengers and more importantly, Carol Danvers. So much that she started writing online fan-fiction about the Avengers and Captain Marvel. Even going as far as joining the Carol Danvers Corps online.\n\nIt was during a high school party that Kamala decided to try and fit in with the &quot;regular crowd&quot; that Kamala realized that it wasn't for her. She left the party abruptly and on her way home was encased by the Terrigen Mists that were released during Infinity revealing that Kamala was a descendant of the Inhumans. As she was encased in a cocoon as her powers were developed, Kamala was put in a dream like state where a dream avatar of Captain Marvel asked her: &quot;Who do you want to be?&quot; Kamala replied: &quot;I want to be you.&quot; In doing so, she burst from the cocoon looking exactly like Carol in her old black unitard costume. After a panic, Kamala learned she had gained shape shifting powers. Able to change her appearance or parts of her body at will. She eventually changed back to her own appearance and took on the identity of the all-new, Ms. Marvel intending to be a superhero like Carol.\n","torrent":{"xt":"urn:btih:87f53b03496b6c35d9e37ab98619481564f61d4b","amp;dn":"Ms.+Marvel-Captain+Marvel+%28Carol+Danvers-Kamala+Khan%29+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f53b03496b6c35d9e37ab98619481564f61d4b","infoHashBuffer":{"type":"Buffer","data":[135,245,59,3,73,107,108,53,217,227,122,185,134,25,72,21,100,246,29,75]},"announce":[],"urlList":[]}}