{"title":"Silverstein-Rescue-2011-FNT","uid":6335366,"size":125194751,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8897fa2e3035d801fccbee3122b1f8bdff0c521a&amp;dn=Silverstein-Rescue-2011-FNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"tta854","files":21,"time":1303439118,"description":"- Release Info -------------------------------------------------------------- -\n\n  Artist:      Silverstein\n  Album:       Rescue\n  Label:       Hopeless Records\n  Playtime:    60:45 min\n  Genre:       Hardcore\n  URL:        &lt;a href=&quot; http://www.silversteinmusic.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.silversteinmusic.com&lt;/a&gt;\n  Rip date:    2011-04-21\n  Street date: 2011-04-26\n  Size:        125.18 MB\n  Type:        Normal\n  Quality:     273 kbps / 4410Hz / Joint Stereo\n\n- Release Notes ------------------------------------------------------------- -\n\n  &quot;Becoming a staple in the diet of any post-hardcore fan, Silverstein have\n  returned with their fifth studio full-length, Rescue. Finally off Victory,\n  it's time for them to hit the scene hard and get the recognition they've\n  needed for years now. It fills all the necessities and expectations of a\n  post-hardcore record: melodic chorus', gruff breakdowns, and adorable clean\n  sections. But what has always set Silverstein apart since day one has been\n  their punk and hardcore influences (on the re-release of Discovering The\n  Waterfront, they covered Lifetime's &quot;Rodeo Clown&quot;), and Rescue sees this take\n  charge a lot more. Coupling the signature sound they've developed with their\n  punk background, Rescue is a full palette of beautiful colors, waiting to be\n  painted on your ears.\n\n  Covering all their bases, &quot;Forget Your Heart&quot; and &quot;Intervention&quot; have the\n  structure and dynamic of Silverstein songs you've been hearing since When\n  Broken is Easily Fixed. Clean lines with a tinge of reverb and chorus, chunky,\n  mid-2000s metalcore riffs, and the dichotomy of the sing/scream dynamic\n  executed with precision. What &quot;Intervention&quot; brings to the table, along with\n  &quot;Medication&quot; and &quot;Burning Hearts,&quot; is the classic, fast punk d-beat to the\n  rhythm section. It pushes the verses on at a quick tempo that requires a heavy\n  amount of head bobbing, and perhaps a bit of air drumming. This direct punk\n  influence laces into many of the sections flawlessly like Silverstein has\n  never done before. The songwriting and transitions are the best they've had\n  thus far.\n\n  Beyond the punk influence, &quot;The Artist&quot; plays out like a new-age hardcore\n  track and features Brendon Murphy of Counterparts. On the harder edge of\n  things, the intro to &quot;Live to Kill&quot; screams &quot;We live to kill each other. We\n  are the wealthy and the poor&quot; completely a'capella that gives the opening some\n  serious energy to feed off of. The dynamics are played well throughout by not\n  clustering the melodic and harder songer together, but spreading them out\n  giving it a roller coaster feel.\n\n  Unlike the newest wave of super over-produced post-hardcore acts,\n  Silverstein's Rescue may have one of my favorite productions I've heard in\n  years. The levels are perfect as the bass bleeds into the mix to uphold some\n  of the heavier riffs, but is given room to move and be heard during the\n  slower, cleaner part. The snare and bass contrast perfectly with neither\n  sounding too crisp and the cymbals sustain out perfectly without overtaking\n  the mix when they ring out or cut off too early when they need to be silenced.\n  The guitars hold the thick crunch from their Orange and VHT amps known for\n  that tone and are shaped nicely into the mix.\n\n  There's a very easy recognition of Silverstein's veteran status and that\n  they're not going anywhere soon. Rescue reshapes Silverstein's best attributes\n  into a post-hardcore juggernaut and continues to cement their lasting value\n  and impact on modern music. While not the most progressive of pieces, the\n  record is a testament to Silverstein's ability to reinvent themselves in\n  interesting ways.&quot;\n\n- Track List ---------------------------------------------------------------- -\n\n  01. Medication                                                        ( 4:29)\n  02. Sacrifice                                                         ( 2:34)\n  03. Forget Your Heart                                                 ( 3:42)\n  04. Intervention                                                      ( 3:04)\n  05. Good Luck With Your Lives                                         ( 3:22)\n  06. Texax Mickey (Feat. Anthony Raneri)                               ( 2:39)\n  07. The Artist (Feat. Brendan Murphy)                                 ( 3:04)\n  08. Burning Hearts                                                    ( 3:02)\n  09. Darling Harbour                                                   ( 2:51)\n  10. Live to Kill                                                      ( 2:33)\n  11. Replace You                                                       ( 3:22)\n  12. In Memory Of...                                                   ( 4:45)\n  13. Burning Hearts (Acoustic)                                         ( 3:27)\n  14. Texas Mickey (Demo)                                               ( 3:03)\n  15. Intervention (Demo)                                               ( 3:11)\n  16. In Memory Of... (Demo)                                            ( 4:39)\n  17. Dancing on My Grave (From &quot;Transitions&quot; EP)                       ( 3:16)\n  18. Replace Your (Acoustic) (From &quot;Transitions&quot; EP)                   ( 3:42)\n\n- --------------------------------------------------------------------------- -\n\n\n\n\nnew....seed and enjoy","torrent":{"xt":"urn:btih:8897fa2e3035d801fccbee3122b1f8bdff0c521a","amp;dn":"Silverstein-Rescue-2011-FNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8897fa2e3035d801fccbee3122b1f8bdff0c521a","infoHashBuffer":{"type":"Buffer","data":[136,151,250,46,48,53,216,1,252,203,238,49,34,177,248,189,255,12,82,26]},"announce":[],"urlList":[]}}