{"title":"Slint - Discography 1989-2014 [FLAC]","uid":10085342,"size":5877638092,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8898e28d076e0ab8a9bd4271bcfa6daa2a031de9&amp;dn=Slint+-+Discography+1989-2014+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"rudown78","files":102,"time":1399083970,"description":"Though largely overlooked during their relatively brief lifespan, Slint grew to become one of the most influential and far-reaching bands to emerge from the American underground rock community of the 1980s; innovative and iconoclastic, the group's deft, extremist manipulations of volume, tempo, and structure cast them as clear progenitors of the post-rock movement that blossomed during the following decade.\n\nWhatever the extent of Slint's own influence, the group grew out of Louisville, Kentucky's legendary Squirrel Bait, another seminal band that languished in relative obscurity during its own lifetime but ultimately spawned the likes of Gastr del Sol, Big Wheel, and Bastro. Guitarist/vocalist Brian McMahan formed his first group at the age of 12; within a few years, he teamed with drummer Britt Walford, and after the addition of vocalist Peter Searcy, guitarist David Grubbs, and bassist Clark Johnson, they founded Squirrel Bait in the mid-'80s. After two ferocious records, a self-titled 1985 effort and 1987's Skag Heaven, the group disbanded, leaving McMahan and Walford to continue on as Slint with guitarist David Pajo and bassist Ethan Buckler.\n\nWith producer Steve Albini, the quartet recorded 1989's Tweez, issued on their own Jennifer Hartman label; a collection of odd stylistic approaches, fractured rhythms, and strange lyrical fragments, the album owed debts to few (if any) historical precedents and steadfastly defied easy classification. Shortly after the record's completion, Buckler left to form King Kong, and was replaced by bassist Todd Brashear for 1991's Spiderland, an even more sophisticated and adventurous set.\nSlint - Discography 1989-2014 [FLAC]\n\n\nWith the exception of a posthumous 1994 EP (originally recorded between the two full-length albums), Spiderland was Slint's swan song, although the individual members remained key figures in the independent scene. After attending art college, Pajo joined the ranks of Tortoise, while Walford (under the alias Shannon Doughton) played drums with the Breeders before rejoining Buckler in King Kong. McMahan and Brashear, meanwhile, aided Will Oldham in his ever-shifting Palace aggregate (which additionally housed Pajo and Walford at one point or another); McMahan and Pajo also briefly reunited as members of the For Carnation, while Slint came together for a well-received series of reunion concerts in 2007.\n\nIn 2014, Touch &amp; Go released an ambitious expanded edition of Spiderland that included a remastered version of the original album, as well as 79 minutes of outtakes, demos, and other bonus material. The new edition of Spiderland also included a DVD of Breadcrumb Trail, a documentary by Lance Bangs about Slint and the making of Spiderland; the film also received a limited theatrical release. To celebrate the release of the film and the Spiderland box set, Slint reunited for a brief U.S concert tour.\n\n\n1989 - Tweez\n1991 - Spiderland\n1994 - Slint [EP]\n2014 - Spiderland [Remastered Box Set] (2CD+DVD)\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:8898e28d076e0ab8a9bd4271bcfa6daa2a031de9","amp;dn":"Slint+-+Discography+1989-2014+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8898e28d076e0ab8a9bd4271bcfa6daa2a031de9","infoHashBuffer":{"type":"Buffer","data":[136,152,226,141,7,110,10,184,169,189,66,113,188,250,109,170,42,3,29,233]},"announce":[],"urlList":[]}}