{"title":"George Carlin - It's Bad For Ya","uid":4474932,"size":159519044,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88f8beb4e63d0bceb2e2e4e0f6898726f2f27874&amp;dn=George+Carlin+-+It%5C%27s+Bad+For+Ya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"JoeMimic","files":28,"time":1225301763,"description":"For more than five decades, the multi-award-winning comedian George Carlin used his razor sharp humor to point out hypocrisy in peoples actions and words.\n\nAnd now, Its Bad For Ya, Carlins last recorded concert from March 2008 makes its CD debut on Eardrum Records on July 29th. Eardrum Records was launched as a record label by Carlin 1986 to re-master and re-issue his back catalog on compact disc as well as release all of the subsequent recordings by the comedian. Eardrum Records is manufactured and distributed exclusively by Laugh.com.\n\nIts Bad For Ya features Carlin's noted irreverent observations on such taboo subjects as religion, death, patriotism and big business, as well as pungent examinations of modern language and the decrepit state of the American culture.Carlin said of this CD release, Doing new stuff is a point of pride with me. People may not consider it so, but stand-up comedy is one of the performing arts, and artists are supposed to grow and evolve over time. Through the years, my technique has sharpened, my writing has improved and even my observations have grown richer.Proud of the fact that every two years he came with a new hour of material, Carlin continued, &quot;I can't do old material; I would feel like a failure. Essentially, this job is that of a writer, but a writer who doesn't produce new work all the time is not a writer he's a typist.In all, Carlin has released 22 solo albums (18 stand-up albums and 4 audio books), which have been nominated for Grammy Awards ten times and taken home the coveted prize four times. In 1972, a recording contract led to the release of FM &amp; AM,an album that went Gold, the first of four successive Gold albums that Carlin recorded during the first half of the 1970's. As further proof of Carlin's continuous ability to push the comic envelope and make audiences laugh and think; he starred in an unprecedented 14 HBO specials spanning four decades. Carlin will always remain part of the popular lexicon as his &quot;Seven Dirty Words&quot; routine were the subject of the 1978 U.S. Supreme Court case F.C.C. v. Pacifica Foundation, in which a narrow 5-4 decision by the justices affirmed the government's right to regulate spoken-word performances on the public airwaves. \n\nDescription From Laugh.com\n\nAlbum ripped in 320k bitrate. Trying this again with new connection.","torrent":{"xt":"urn:btih:88f8beb4e63d0bceb2e2e4e0f6898726f2f27874","amp;dn":"George+Carlin+-+It%5C%27s+Bad+For+Ya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88f8beb4e63d0bceb2e2e4e0f6898726f2f27874","infoHashBuffer":{"type":"Buffer","data":[136,248,190,180,230,61,11,206,178,226,228,224,246,137,135,38,242,242,120,116]},"announce":[],"urlList":[]}}