{"title":"USMLE Step 2 Secrets 3rd Edition","uid":7180726,"size":20432149,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a0063f5f71e11f3b0dd5a6cf2dc5db1c704fb81&amp;dn=USMLE+Step+2+Secrets+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Raryn","files":3,"time":1334256800,"description":"DRM Free ebook of USMLE Step 2 Secrets (mobi format) and a PDF conversion of the same. The PDF isn't perfect, but works well enough.\n\nUSMLE Step 2 Secrets is an easy-to-read review perfect for busy students like you. Adam Brochert, MD-who scored in the 99th percentile on the Step 2 USMLE-and Theodore X. O'Connell, MD-author of several review and clinical reference books-present essential questions and answers covering the important concepts you need to know to score well on the USMLE Step 2 exam: key conditions you will be expected to recognize, all specialty and subspecialty topics, and necessary clinical concepts.\n\n    Learn the most important questions and answers with the proven format of the highly acclaimed Secrets Series.\n\n    Master all specialty and subspecialty topics covered on Step 2.\n\n    Identify key facts and secrets using the Top 100 Secrets chapter.\n\n    Review material quickly and easily thanks to bulleted lists, algorithms, and illustrations.\n\n    Apply the pearls, tips, memory aids, and &quot;secrets&quot; from well-known and highly popular authors, Adam Brochert, MD and Theodore X. O'Connell, MD.\n\n    Find information quickly with a second color highlighting chapter and section titles, legends, bullets and icons, and key terms.\n","torrent":{"xt":"urn:btih:8a0063f5f71e11f3b0dd5a6cf2dc5db1c704fb81","amp;dn":"USMLE+Step+2+Secrets+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a0063f5f71e11f3b0dd5a6cf2dc5db1c704fb81","infoHashBuffer":{"type":"Buffer","data":[138,0,99,245,247,30,17,243,176,221,90,108,242,220,93,177,199,4,251,129]},"announce":[],"urlList":[]}}