{"title":"Fraps 3.4.1 (2-click run)(registred)","uid":8652148,"size":5311725,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8a1e592895b955792938ee41e54652eddb6a0e9e&amp;dn=Fraps+3.4.1+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1373134161,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDescription:\nFraps is a universal Windows application that can be used with games using DirectX or OpenGL graphic technology.  In its current form Fraps performs many tasks and can best be described as:\n\nBenchmarking Software - Show how many Frames Per Second (FPS) you are getting in a corner of your screen.  Perform custom benchmarks and measure the frame rate between any two points.  Save the statistics out to disk and use them for your own reviews and applications.\n\nScreen Capture Software - Take a screenshot with the press of a key!  There's no need to paste into a paint program every time you want a new shot.  Your screen captures are automatically named and timestamped.\n\nRealtime Video Capture Software - Have you ever wanted to record video while playing your favourite game?  Come join the Machinima revolution!  Throw away the VCR, forget about using a DV cam, game recording has never been this easy!  Fraps can capture audio and video up to 7680x4800 with custom frame rates from 1 to 120 frames per second!\n\nInstallation instructions:\n1. Execute the Fraps 3.4.1 (2-click run)(registred).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:8a1e592895b955792938ee41e54652eddb6a0e9e","amp;dn":"Fraps+3.4.1+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a1e592895b955792938ee41e54652eddb6a0e9e","infoHashBuffer":{"type":"Buffer","data":[138,30,89,40,149,185,85,121,41,56,238,65,229,70,82,237,219,106,14,158]},"announce":[],"urlList":[]}}