{"title":"Bedini SG the complete Beginner's Handbook.","uid":9464393,"size":12764590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a54b7bd16d03cec48830114813d6a9be7cdd221&amp;dn=Bedini+SG+the+complete+Beginner%27s+Handbook.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"veetveetmano","files":-1,"time":1389425861,"description":"Dear Friend,\n\nCollectively, we have known John Bedini for over 40 years. Needless to say, during that time, we have seen countless experiments performed by John that are nothing short of breathtaking. Because of this, we have some insights into the inner workings of John's technology that most other people don't have.\n\nOne project that is definitely near and dear to our hearts is the Bedini SG. The Bedini SG has become a &quot;right of passage&quot; for anyone wanting to learn about REAL free energy methods. The Bedini SG is also the only design in the entire free energy field that has created a global phenomena during the last decade that has stood the test of time.\n\nThousands of people from all over the world have built model after model of the Bedini SG energizers. Unfortunately, some have performed better than others. In Fact, only a small percentage of the Bedini SG builds come close to performing as well as John's.\n\nOne of the primary reasons for this is that most Bedini SG replication attempts really don't adhere to John's exact instructions. Some people simply look at the schematic and get whatever parts they think will work, put them together, and then wonder why they don't produce spectacular results.\n\nThis Complete Bedini SG Handbook solves this problem by giving you the most detailed, step-by-step instructions, that have ever been compiled. It gives the exact recommendations on the parts to use, size of wire, etc... By following these instructions, anyone can build a Bedini SG just like John builds his!\n\nIn addition to the instructions on how to build it, you will see the full explanation of how the Bedini SG circuit actually works. This has never been discussed in this kind of detail before. Theories have been advanced by dozens of people all over the internet regarding their ideas about how the machine works. Here, finally, we explain exactly what John has been trying to explain on the internet for years - how the circuit actually functions!\n\nThis includes a chapter on BOTH modes of running, including the illusive &quot;Attraction Mode&quot;, which can produce superior results in most cases.\n","torrent":{"xt":"urn:btih:8a54b7bd16d03cec48830114813d6a9be7cdd221","amp;dn":"Bedini+SG+the+complete+Beginner%27s+Handbook.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a54b7bd16d03cec48830114813d6a9be7cdd221","infoHashBuffer":{"type":"Buffer","data":[138,84,183,189,22,208,60,236,72,131,1,20,129,61,106,155,231,205,210,33]},"announce":[],"urlList":[]}}