{"title":"The Confidence Trap: A History of Democracy in Crisis (2014)","uid":11664724,"size":4127067,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a8d30040facab032163e0b378c7dff5182364ee&amp;dn=The+Confidence+Trap%3A+A+History+of+Democracy+in+Crisis+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1418038307,"description":"The Confidence Trap: A History of Democracy in Crisis from World War I to the Present\n\npdf\n\nWhy do democracies keep lurching from success to failure? The current financial crisis is just the latest example of how things continue to go wrong, just when it looked like they were going right. In this wide-ranging, original, and compelling book, David Runciman tells the story of modern democracy through the history of moments of crisis, from the First World War to the economic crash of 2008.\n\nA global history with a special focus on the United States, The Confidence Trap examines how democracy survived threats ranging from the Great Depression to the Cuban missile crisis, and from Watergate to the collapse of Lehman Brothers. It also looks at the confusion and uncertainty created by unexpected victories, from the defeat of German autocracy in 1918 to the defeat of communism in 1989. Throughout, the book pays close attention to the politicians and thinkers who grappled with these crises: from Woodrow Wilson, Nehru, and Adenauer to Fukuyama and Obama.\n\nThe Confidence Trap shows that democracies are good at recovering from emergencies but bad at avoiding them. The lesson democracies tend to learn from their mistakes is that they can survive them--and that no crisis is as bad as it seems. Breeding complacency rather than wisdom, crises lead to the dangerous belief that democracies can muddle through anything--a confidence trap that may lead to a crisis that is just too big to escape, if it hasn't already. The most serious challenges confronting democracy today are debt, the war on terror, the rise of China, and climate change. If democracy is to survive them, it must figure out a way to break the confidence trap","torrent":{"xt":"urn:btih:8a8d30040facab032163e0b378c7dff5182364ee","amp;dn":"The+Confidence+Trap%3A+A+History+of+Democracy+in+Crisis+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8d30040facab032163e0b378c7dff5182364ee","infoHashBuffer":{"type":"Buffer","data":[138,141,48,4,15,172,171,3,33,99,224,179,120,199,223,245,24,35,100,238]},"announce":[],"urlList":[]}}