{"title":"(Fresh Girls Media) First Time Anal Cuties (480p)","uid":15962914,"size":716946791,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8add6f8c2374ae018ecc1893a869bc572fa101ec&amp;dn=%28Fresh+Girls+Media%29+First+Time+Anal+Cuties+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"distinc","files":13,"time":1475692183,"description":"(Fresh Girls Media) First Time Anal Cuties (480p)\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=212257323\r\n \nhttp://imagedisco.net/?g=967683127\r\n\r\n\r\nPlot:\r\n\r\nThis is looks to be a compilation of Dirt Pipe Divas scenes. Only one hole gets used, the asshole. None of these girls take dick in there mouths or pussys. They all gape some and all take a manner of creampie.\r\n\r\n1) 21 year old Cuban surfer girl Isa Mendez (AKA Abbi Roads), has dark hair, some tats, a bald pussy, and sweet little natural tits: interview, tease, dude enters frame and rims her, fingers her ass first one then two, anal doggy, RCA, anal cowgirl, gape, reverse anal pile driver, little more rimming, anal pile driver, anal doggy for the creampie\r\n\r\n2) Brunette Brees Kelly has a bald pussy and nice little natural tits: interview, tease, dude enters frame and rims her, see him apply lube to her asshole, finger one then two, anal doggy, she uses a vibrator on her clit, rims her, reverse pile driver, rims her, RCA, gape, doggy with some gaping for the cream pie \r\n\r\n3) 19 year old Chloe Brook has dyed blonde hair, a well trimmed bush, navel piercing and nice little natural titties: interview, posing, he rims her, anal doggy, more rimming more doggy with some gape, RCA, anal cowgirl, doggie with some gape, cums on her asshole and she makes it gurgle\r\n\r\n4) Wearing a plaid skirt and black shirt 20 year old Sofie (Sophie) Carter has dyed red hair, a bald pussy, and sweet little natural tits: interview, posing, he licks her butthole briefly then sticks his cock in there doggy, RCA, anal cowgirl, reverse anal pile driver, anal piledriver, anal doggy for the creampie","torrent":{"xt":"urn:btih:8add6f8c2374ae018ecc1893a869bc572fa101ec","amp;dn":"%28Fresh+Girls+Media%29+First+Time+Anal+Cuties+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8add6f8c2374ae018ecc1893a869bc572fa101ec","infoHashBuffer":{"type":"Buffer","data":[138,221,111,140,35,116,174,1,142,204,24,147,168,105,188,87,47,161,1,236]},"announce":[],"urlList":[]}}