{"title":"Daughters of the Dust","uid":8016238,"size":1028021666,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b1882c8e5b7f22185a2128239d928252a5d2816&amp;dn=Daughters+of+the+Dust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"cozy8","files":1,"time":1358107265,"description":"Daughters of the Dust is a 1991 independent film written, directed and produced by Julie Dash; it is the first feature film by an African-American woman distributed theatrically in the United States. It tells the story of three generations of Gullah women in the Peazant family on St. Helena Island in 1902, as they prepare to migrate to the North.\n\nFeaturing an unusual narrative device, the film is told by the Unborn Child. Ancestors are part of the movie, as the Peazant family has lived on the island since their first people were brought as slaves centuries before. The movie gained critical praise, for its rich language and use of song, and lyrical use of visual imagery. It won awards at the Sundance Film Festival and others.\n\nThe film features Cora Lee Day, Alva Rogers, Barbara-O, Turla Hoosier, Vertamae Grosvenor, and Kaycee Moore. It was filmed on Saint Helena Island in South Carolina.\nIn 2004, Daughters of the Dust was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant&quot;.\n\nDash has published two books related to the film: Daughters of the Dust: The Making of an African-American Woman's Film (1992), which includes the screenplay; and Daughters of the Dust: A Novel (1997), set 20 years after the events in the film.","torrent":{"xt":"urn:btih:8b1882c8e5b7f22185a2128239d928252a5d2816","amp;dn":"Daughters+of+the+Dust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b1882c8e5b7f22185a2128239d928252a5d2816","infoHashBuffer":{"type":"Buffer","data":[139,24,130,200,229,183,242,33,133,162,18,130,57,217,40,37,42,93,40,22]},"announce":[],"urlList":[]}}