{"title":"GoldenEye: Source 5.0","uid":15562224,"size":2187190903,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8b21339e560fb6d3dc6246565abf2e5d2ed9b745&amp;dn=GoldenEye%3A+Source+5.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"inerax","files":1,"time":1471149052,"description":"http://www.moddb.com/mods/goldeneye-source \r\n\r\nGoldenEye: Source is a total conversion modification of Half-Life 2. It is a fan made artistic recreation, released for free, with a primary goal in mind; To bring the memories and experiences from the original GoldenEye64 back to life using Source' Orange Box Technology. As one of the premier and consistently released HL2 mods, GE:S has been seen out and about, reviewed by the best, and played by hundreds and thousands of PC gamers for Eight long years and running.\r\n\r\n\r\nWe want you to look at this mod and remember the first best multiplayer first-person shooter ever made. We are doing our best to bring in the opinions of the community to create a game that everyone is going to enjoy. But, we are not here to recreate the game exactly how it was in GE64. A lot of things have changed since they first designed the original, mainly in technology and gamers experiences. We are here to take the game even further but at the same time provide a lot of those fun elements that hardcore GE64 fans will enjoy. We've got experienced team members all across the board, from professional level, to amateurs looking to make it into the business working hard to make this dream a reality.\r\n\r\nWe focus on a daily basis to keep the original feel for the game that we all know and love. Adding new and fun game play features is our secondary mission, along with new maps and weapons that will keep the game feeling fresh. By getting together with all of our development team, and asking ourselves &quot;What are the things we always wanted to see and do?&quot;, we think we created and implemented interesting ideas into the mod for fans and gamers to enjoy!\r\n\r\n\r\nDespite the success of the mod it is with a heavy heart that we say good bye to Nickster our GoldenEye Source mod leader. He passed away on May 24, 2006, at his home at the age of 27. We as a mod team hereby dedicate this mod fully to Nickster. Tragically his life ended too soon and we as a team wish his family and relatives the best of luck after this difficult period. He would want us to continue on no matter what the costs and we sincerely hope he is in a better place. This mod is for you Nickster, from the GoldenEYE: Source team","torrent":{"xt":"urn:btih:8b21339e560fb6d3dc6246565abf2e5d2ed9b745","amp;dn":"GoldenEye%3A+Source+5.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b21339e560fb6d3dc6246565abf2e5d2ed9b745","infoHashBuffer":{"type":"Buffer","data":[139,33,51,158,86,15,182,211,220,98,70,86,90,191,46,93,46,217,183,69]},"announce":[],"urlList":[]}}