{"title":"Nikki Lane - All or Nothin' [2014] [Album][FLAC]","uid":10262085,"size":272425003,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b97482c32d1af9bb7061fdb3c466af8971f96f1&amp;dn=Nikki+Lane+-+All+or+Nothin%27+%5B2014%5D+%5BAlbum%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":15,"time":1401475898,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: New West #CD 6306\nCountry: USA\nYear: May 6, 2014\nGenre: Americana\nFormat: CD,Album\n\n\n01 Right Time\n02 Good Man\n03 I Don't Care\n04 You Can't Talk to Me Like That\n05 Seein' Double\n06 Love's on Fire [Duet with Dan Auerbach]\n07 All or Nothin'\n08 Sleep with a Stranger\n09 Man Up\n10 Out of My Mind\n11 Wild One\n12 Want My Heart Back\n\n\n\n\nOn her sophomore full-length and debut for New West, singer and songwriter Nikki Lane teams with producer Dan Auerbach and an all-star cast of players to turn in a spirited offering of rock &amp; roll Americana. Lane wrote or co-wrote everything on the date. While she never strays too far from upstart country, there are some startling textures and backdrops in most of these songs that expand their reach into other genres. Despite its Waylon Jennings-esque two-four strut, opener &quot;Right Time&quot; is bathed in reverb, a distorted bassline, and a psychedelic pedal steel. While she has openly acknowledged Lucinda Williams as one of her major influences, it has never been more keenly felt than in Lane's delivery on &quot;Good Man&quot; with its saturated, broken-hearted, American Gothic romanticism. Auerbach paints her yearning vocal with glockenspiels, a honky tonk piano filtered through an echo chamber, layered pedal steel, and cracking snares. The slow, confessional narrative in &quot;You Can't Talk to Me Like That&quot; is a simple old-school country song with a twist: its backing vocal by the McCrary Sisters is modeled on classic girl group charts, and the B-3 comes right out of Bob Dylan's mid-'60s albums. Lead single &quot;Seeing Double&quot; is drenched in urgent surf guitars, reverbed snares, and whining pedal steel. Despite its quick tempo, Lane's vocal is unhurried; her South Carolina drawl slips through syllables, bleeding one line into the next. Auerbach is her vocal duet partner on &quot;Love's on Fire.&quot; Though it begins as an acoustic country song, it unfolds into a full-blown epic with gorgeous fiddle, steel, and brushed snares and tom-toms. Their voices entwine perfectly in the verses and choruses. Lane co-wrote the honky tonk waltz &quot;Out of My Mind&quot; with J. Spaceman of Spiritualized. Saturated in acoustic guitars and upright piano, its soaring pedal steel recalls the production of a young Billy Sherrill. Carey Kotsionis' backing vocal underscores Lane's as the ache in its narrative is laid bare. The Hammond organ in &quot;Wild One&quot; fuels a sassy kiss-off song. Lane's songs and delivery are strong throughout All or Nothin'; they're more polished and crafted than those on Walk of Shame. With Auerbach as a partner, her vocals and arrangements co-exist to wed past to present both simultaneously and effortlessly","torrent":{"xt":"urn:btih:8b97482c32d1af9bb7061fdb3c466af8971f96f1","amp;dn":"Nikki+Lane+-+All+or+Nothin%27+%5B2014%5D+%5BAlbum%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b97482c32d1af9bb7061fdb3c466af8971f96f1","infoHashBuffer":{"type":"Buffer","data":[139,151,72,44,50,209,175,155,183,6,31,219,60,70,106,248,151,31,150,241]},"announce":[],"urlList":[]}}