{"title":"Herman Melville - Moby-Dick (The California Edition) (pdf)","uid":8672718,"size":6973286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ca4bcee1e24e97f560bd6158ba3aa792a798814&amp;dn=Herman+Melville+-+Moby-Dick+%28The+California+Edition%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373528282,"description":"Herman Melville (Barry Moser, illus.) - Moby-Dick; or, the Whale (Univ. of California Press, 1983). 577 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nA few months ago I posted another edition of Moby Dick: that one had extensive study helps, including a line-by-line commentary. The edition of Moby Dick in this new torrent is the polar opposite: it contains only two things -- the text and a series of gorgeous illustrations by Barry Moser. This is a truly beautiful edition of the novel, with a wonderfully appropriate typeface and page layout. In addition, since the typeface is dark and heavy, and the illustrations are &quot;boxcut engravings&quot; which look a lot like woodcuts, the whole book scanned beautifully. This pdf looks great on a tablet.\n\n\ndescription:\n\nThis trade edition of Moby-Dick is a reduced version of the Arion Press Moby-Dick, which was published in 1979 in a limited edition of 250 copies and has been hailed as a modern masterpiece of bookmaking. It was hand set under the supervision of one of America's finest book designers and printers. The initial letters that begin each chapter were designed especially for this book and christened &quot;Leviathan.&quot; The illustrations, of places, creatures, objects or tools, and processes connected with nineteenth-century whaling, are original boxwood engravings by Massachusetts artist Barry Moser. The text of Moby-Dick used in this edition is based on that used in the critical edition of Melville's works published by the Northwestern University Press and the Newberry Library.\nThis reduced version is smaller in size than the Arion edition and the California deluxe edition, but it includes all of the original pages and illustrations. It is printed in black only throughout, and it is not slipcased.","torrent":{"xt":"urn:btih:8ca4bcee1e24e97f560bd6158ba3aa792a798814","amp;dn":"Herman+Melville+-+Moby-Dick+%28The+California+Edition%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca4bcee1e24e97f560bd6158ba3aa792a798814","infoHashBuffer":{"type":"Buffer","data":[140,164,188,238,30,36,233,127,86,11,214,21,139,163,170,121,42,121,136,20]},"announce":[],"urlList":[]}}