{"title":"Baldurs Gate II Enhanced Edition Patch v1.3 (GOG)","uid":11823377,"size":637167859,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8ca62499e2fc721cf871fa1015e02350b3f0d130&amp;dn=Baldurs+Gate+II+Enhanced+Edition+Patch+v1.3+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"pacolovac","files":2,"time":1429372399,"description":"== About the game:\nKidnapped. Imprisoned. Tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright.\nCan you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence that haunts your dreams? Or will you embrace your monstrous nature, carve a swath of destruction across the realms, and ascend to godhood as the new Lord of Murder?\nBaldur's Gate II: Enhanced Edition brings this critically acclaimed role-playing experience to back to life.\n\n\n== Features:\nThe Final Chapter - Baldur's Gate II: Enhanced Edition includes Baldur's Gate II: Shadows of Amn and Baldur's Gate II: Throne of Bhaal, the epic conclusion of the Bhaalspawn saga.\nFour New Party Members - Bundled with Baldur's Gate II: Enhanced Edition are four new characters that can join you on your journey.\nThe Black Pits 2: Gladiators of Thay - Explore the tactical depth of high-level Dungeons &amp; Dragons combat. Undermine your captors and prey upon their weaknesses while you dodge traps and battle for your life against Demi-Liches, Mind Flayers, and Githyanki.\nEasy Multiplayer - Baldur's Gate II: Enhanced Edition makes it easy to find, list, and join multiplayer games, even while behind a firewall.\nWidescreen and More - Baldur's Gate II: Enhanced Edition features full widescreen support, remastered area artwork from original renders, and a host of other interface and gameplay improvements.\n\n\n== Version:This is a patch to v1.3.2064 or GOG setup v2.0.1.2 from December 2014\nYou need to have your base game already installed - GOG version\n\n\n== Version changes:\nRead the release notes included with this torrent for all the changes. Some of them: \nImproved pathfinding\nPriest alignments updated\nGerman and Spanish text translations\nRomances remembered from Baldur's Gate\nImproved character creation\nImproved inventory management\nmore than a hundred discrete issues fixed throughout the Shadows of Amn campaign\nSeveral issues in the Throne of Bhaal campaign have been found and resolved. \nMultiplayer quest event fixes and improved multiplayer stability\nand more...\n\n\n== Instructions:It's a GOG version, just launch setup\nClick options to chose location and accept EULA, install \nPlay - Enjoy - Seed - give me what I need\nSpeed! Yeah!\n\n\n== System requirements:Minimum:\n1 GHz Processor\nGraphics card OpenGL 2.0 compatible\n512 MB RAM\nSound card Windows Compatible \nWin Xp 32\n2.5 GB disk space\n\nRecommended:\nIntel Core 2 Duo or equivalent\n3d card with DX9\n512 MB RAM \nWin 7, 8\nDirectX 9.0c\n2.5 GB disk space\n\n\n\n If you enjoyed the game then share with others by seeding!\nSupport game development and buy the game!\n\nGame developed by Overhaul Games (Beamdog) and published by Atari","torrent":{"xt":"urn:btih:8ca62499e2fc721cf871fa1015e02350b3f0d130","amp;dn":"Baldurs+Gate+II+Enhanced+Edition+Patch+v1.3+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca62499e2fc721cf871fa1015e02350b3f0d130","infoHashBuffer":{"type":"Buffer","data":[140,166,36,153,226,252,114,28,248,113,250,16,21,224,35,80,179,240,209,48]},"announce":[],"urlList":[]}}