{"title":"Glassblowing for Laboratory Technicians 2nd ed - R. Barbour","uid":15738070,"size":5542719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d2cb328be14e4af2c396b3a4cdeb8c1fd8c8e31&amp;dn=Glassblowing+for+Laboratory+Technicians+2nd+ed+-+R.+Barbour&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1472862397,"description":"Glassblowing for Laboratory Technicians 2nd ed - R. Barbour (Pergamon, 1978).pdf\r\n\r\nGlassblowing for Laboratory Technicians, Second Edition introduces the laboratory technician to the technique of glassblowing. Vacuum line accessories and their applications are described, along with the vacuum technique and interchangeable ground-glass joints. Laboratory glassworking hazards as well as intermediate and advanced glassblowing are also considered. \r\nThis book is comprised of 12 chapters and opens with an overview of glass and its composition, followed by a discussion on glass tubes and rods and how they are stored. The next chapter focuses on some obvious hazards that will be encountered in glassworking, including sharp glass edges, hot glass and tools, gas and mercury, and the glassworking flame. The reader is then introduced to the laboratory workshop for glassblowing; the process of glass annealing; glass-to-metal seals; and elementary, intermediate, and advanced glassblowing. The vacuum technique is also described, along with types of pumps, vacuum gauges, and the operation of a vacuum system. The final chapter explains how a glassblowing class should be conducted. \r\nThis monograph will be a useful resource for laboratory technicians and those who may be concerned with either the training of glassblowers or with glassblowing","torrent":{"xt":"urn:btih:8d2cb328be14e4af2c396b3a4cdeb8c1fd8c8e31","amp;dn":"Glassblowing+for+Laboratory+Technicians+2nd+ed+-+R.+Barbour","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d2cb328be14e4af2c396b3a4cdeb8c1fd8c8e31","infoHashBuffer":{"type":"Buffer","data":[141,44,179,40,190,20,228,175,44,57,107,58,76,222,184,193,253,140,142,49]},"announce":[],"urlList":[]}}