{"title":"AudioRealism.Drum.Machine.v1.1.3.VSTi.AU.MAC.OSX.UB-DYNAMiCS","uid":5483855,"size":11829262,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8d70866bb45f9d531c9a450de397002dac5df9d4&amp;dn=AudioRealism.Drum.Machine.v1.1.3.VSTi.AU.MAC.OSX.UB-DYNAMiCS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"psystereo","files":-1,"time":1270588854,"description":"AudioRealism Drum Machine 1.1.3 VSTi AU MAC OSX UB | 11.1 MB\n\nBooming bassdrums, saucy cymbals and crispy snares can be used to describe the sound of drum machines from the early 80's. ADM contains three classic vintage drum machines from that era rolled into one, combined with a 32-step internal sequencer and pattern controlled fx (PCF). Get all your patterns into ADM via the Import Rebirth function or directly from your old 909 via sysex (we will provide a free tool for dumping sysex).\n\nADM contains 25 drum generators, each one carefully modeled after the classics' analog circuits and 4 PCM players, for a total of 34 sounds (some generators have two sounds). Certain sounds have been extended with extra parameters, like the tuning and attack of the 606 bassdrum. The accents effect on bridged-T oscillators that make up the bassdrum and tom-tom sounds has been closely simulated and the hihats and cymbals sound and react very close to the originals.\n\nThe complete list of sounds is as follows: BD808, BD909, BD606, SD808, SD909, SD606, LT808, MT808, HT808, LC808, MC808, HC808, LT909, MT909, HT909, LT606, HT606, RS808, CL808, RS909, MA808, CP808, CP909, CB808, CRASH909*, OH606, OH808, OH909*, CH606, CH808, CH909*, CY606, CY808, RIDE909*.\n\nThe PCF can be used to automate any of the drum machines parameters, for instance it's possible to change the cutoff and Q parameters for each step. In fact it can control any of the drum machines parameters, for example you can set the amount of snappy on each step or switch from maracas to handclap on specific steps, giving the illusion of more polyphony (something that had to be done by hand on the original machine). The PCF can also control the amount of mangle (a type of distortion) on specific steps, and if the FX should be applied to a sound or not.\n\nFeatures:\n\n* Three realtime switchable drum machine models\n* Internal 32 step sequencer with global accent per step, four prescale selections per pattern, flam and shuffle, 128 patterns per instance\n* Pattern transformation functions: Expand, shrink, swap, duplicate steps, randomize pattern, randomize part, cut/copy/paste pattern and parts\n* Undo function for pattern transformation functions\n* Pattern Controlled FX (PCF) which can control any of the parameters for each step\n* Various pattern transformation functions\n* Full MIDI CC with learning function\n* Rebirth pattern import\n* Imports 909 Sysex\n* Two MIDI modes (Pattern and Note)\n* Tempo sync to host\n* Polyphony: 11 parts total\n* Outputs: 11 individual unprocessed (VST version only to date), 2 master outputs (processed)\n* Pattern library\n* Trigger your own .wav and .aif samples\n* 80+ example patterns\n\nAudioRealism.Drum.Machine.v1.1.3.VSTi.AU.MAC.OSX.UB-DYNAMiCS","torrent":{"xt":"urn:btih:8d70866bb45f9d531c9a450de397002dac5df9d4","amp;dn":"AudioRealism.Drum.Machine.v1.1.3.VSTi.AU.MAC.OSX.UB-DYNAMiCS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d70866bb45f9d531c9a450de397002dac5df9d4","infoHashBuffer":{"type":"Buffer","data":[141,112,134,107,180,95,157,83,28,154,69,13,227,151,0,45,172,93,249,212]},"announce":[],"urlList":[]}}