{"title":"Gwen_Stefani-The_Sweet_Escape-2006-DeBT_iNT","uid":6447980,"size":86092830,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e07441ea171e950111b2d2978f549bd4f64e3c5&amp;dn=Gwen_Stefani-The_Sweet_Escape-2006-DeBT_iNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MAFIAA.","files":15,"time":1307333488,"description":"     ARTiST.... Gwen Stefani\n\n     TiTLE..... The Sweet Escape\n\n     LABEL..... Interscope\n\n     GENRE..... Alt. Rock\n\n     RiP.DATE.. 2011-06-03\n\n     STOREDATE. 2006-12-05\n\n     SOURCE.... CD\n\n     QUALiTY... 243 kbps / 4410kHz / Joint Stereo\n\n     TRACKS.... 12  / 46:57\n\n     SIZE...... 86.06    MB\n\n     RIPPER.... EAC Secure with LAME 3.98.4\n\n     URL.......\n\n\n\n\n\nNR. TRACKNAME                                  TiME\n\n\n\n1   Wind It Up                                  3:09\n\n2   The Sweet Escape                            4:06\n\n3   Orange County Girl                          3:23\n\n4   Early Winter                                4:44\n\n5   Now That You Got It                         2:59\n\n6   4 in the Morning                            4:51\n\n7   Yummy                                       4:57\n\n8   Fluorescent                                 4:18\n\n9   Breakin' Up                                 3:47\n\n10  Don't Get It Twisted                        3:37\n\n11  U Started It                                3:08\n\n12  Wonderful Life                              3:58\n\n---------------------------------------------------------\n\n\n\n                                  TOTAL TiME: 46:57 MIN\n\n                                  TOTAL SIZE: 86.06  MB\n\n\n\n\n\n                                     \u0011RELEASE NOTES\u0010\n\n\n\n Awkward and alluring in equal measures, Gwen\n\n Stefani's 2004 solo debut,\n\n Love.Angel.Music.Baby., did its job: it made Gwen\n\n a bigger star on her own than she was as the lead\n\n singer of No Doubt. With that established and her\n\n long-desired wish for a baby finally fulfilled,\n\n there was no rush for Gwen to get back to her\n\n regular gig, so she made another solo album, The\n\n Sweet Escape, which expanded on what really sold\n\n her debut: her tenuous connections to Californian\n\n club culture. There was always a sense of\n\n artifice behind the turn-of-the-century makeover\n\n that brought Gwen from a ska-punk sweetheart to a\n\n dance club queen, but that doesn't mean it didn't\n\n work at least on occasion, most spectacularly so\n\n on the gloriously dumb marching-band rap of\n\n &quot;Hollaback Girl,&quot; the Neptunes production that\n\n turned L.A.M.B. into a blockbuster. There, as on\n\n her duet with Eve on &quot;Let Me Blow Ya Mind,&quot; Gwen\n\n made the transition into a modern-day material\n\n girl with ease, but when she tried to shoehorn\n\n this ghetto-fabulous persona into her original\n\n new wave girl character, it felt forced, nowhere\n\n more so than on the Linda Perry written and\n\n produced &quot;What You Waiting For.&quot; Gwen doesn't\n\n make that mistake again on The Sweet Escape -- by\n\n and large, she keeps these two sides of her\n\n personality separate, favoring the streets and\n\n nightclubs to the comfort of her new wave home.\n\n Just because she wants to run in the streets\n\n doesn't mean she belongs there; she continues to\n\n sound far more comfortable mining new wave pop,\n\n as only a child of the '80s could. As always,\n\n it's those celebrations of cool synths and\n\n stylish pop hooks that work the best for Stefani,\n\n whether she's approximating the chilliness of\n\n early-MTV new romantics on &quot;Wonderful Life,&quot;\n\n mashing Prince and Madonna on &quot;Fluorescent,&quot; or\n\n lying back on the coolly sensual &quot;4 in the\n\n Morning.&quot;\n\n\n\n Only once on the album is she able to bring this\n\n style and popcraft to a heavy dance track, and\n\n that's on the irresistible Akon-produced title\n\n track, driven by a giddy &quot;wee-oh!&quot; hook and\n\n supported by a nearly anthemic summertime chorus.\n\n Tellingly, the Neptunes, the architects of her\n\n best dance cuts on L.A.M.B., did not produce this\n\n track, but they do have a huge presence on The\n\n Sweet Escape, helming five of the 12 songs, all\n\n but one being tracks that weigh down the album\n\n considerably. The exception is &quot;U Started It,&quot; a\n\n light and nifty evocation of mid-period Prince,\n\n with its lilting melody, silken harmonies, and\n\n pizzicato strings. It sounds effortless and\n\n effervescent, two words that do not apply to\n\n their other four productions, all skeletal,\n\n rhythm-heavy tracks that fail to click.\n\n Sometimes, they're merely leaden, as on the\n\n stumbling autobiographical rap &quot;Orange County\n\n Girl&quot;; sometimes, they're cloying and crass, as\n\n on the rather embarrassing &quot;Yummy&quot;; sometimes\n\n they have an interesting idea executed poorly, as\n\n on &quot;Breakin' Up,&quot; a breakup song built on a dying\n\n cell phone metaphor that's interesting in theory\n\n but its stuttering, static rhythms and repetitive\n\n chorus are irritating in practice. Also\n\n interesting in theory is the truly bizarre lead\n\n single, &quot;Wind It Up,&quot; where the Neptunes force\n\n fanfares and samples from The Sound of Music's\n\n &quot;The Lonely Goatherd&quot; into one of their typical\n\n minimalist tracks, over which Gwen spouts off\n\n clumsy material-minded lyrics touting her fashion\n\n line and her shape. Nothing in this track really\n\n works, but it's hard not to listen to it in\n\n wonder, since its unwieldy rhythms and rhymes\n\n capture everything that's currently wrong about\n\n Stefani.\n\n\n\n From the stilted production to the fashion\n\n fetish, all the way down to her decision to rap\n\n on far too much of the album, all the dance-pop\n\n here seems like a pose, creating the impression\n\n that she's a glamour girl slumming on a weekend\n\n night -- something that her self-proclaimed\n\n Michelle Pfieffer in Scarface &quot;coke whore&quot;\n\n makeover showcased on the album's cover doesn't\n\n do much to dissuade. If the dance production on\n\n The Sweet Escape were better, these hipster\n\n affectations would be easier to forgive, but\n\n they're not: they're canned and bland, which only\n\n accentuates Stefani's stiffness. These misfires\n\n are so grand they overshadow the many good\n\n moments on The Sweet Escape, which are invariably\n\n those songs that stay true to her long-standing\n\n love of new wave pop (not coincidentally, these\n\n include every production from her No Doubt\n\n bandmate Tony Kanal). These are the moments that\n\n give The Sweet Escape its sweetness, and while\n\n they may require a little effort to dig out,\n\n they're worth the effort, since it proves that\n\n beneath the layers of bling, Gwen remains the\n\n SoCal sweetheart that has always been as spunky\n\n and likeable as she has been sexy.","torrent":{"xt":"urn:btih:8e07441ea171e950111b2d2978f549bd4f64e3c5","amp;dn":"Gwen_Stefani-The_Sweet_Escape-2006-DeBT_iNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e07441ea171e950111b2d2978f549bd4f64e3c5","infoHashBuffer":{"type":"Buffer","data":[142,7,68,30,161,113,233,80,17,27,45,41,120,245,73,189,79,100,227,197]},"announce":[],"urlList":[]}}