{"title":"Radiohead - Kid A (2000) WMA320","uid":6398797,"size":118403697,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e172e66173bb6971ab2bba010a014752146273e&amp;dn=Radiohead+-+Kid+A+%282000%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1305604648,"description":"In the year 2000, Radiohead ditched its former &quot;real&quot; rock sound for Pink-Floydian, electronic post-rock. The result was &quot;Kid A,&quot; where they relearned everything they knew about music from scratch. Some people loved it. Some didn't get it, and felt it was &quot;pretentious.&quot; But there's one undeniable thing -- this chilly, eerie collection is a marvelously complex piece of work. \n\nAn ominous keyboard melody and gibberish vocals open the album in &quot;Everything In Its Right Place,&quot; sounding a bit like a possessed radio. Then the fuzz and hums kick in, adding a spacey dimension to an already strange melody. A drum melody kicks in in the title track, followed by the ghostly rock of &quot;National Anthem&quot; and unearthly lament of &quot;How to Disappear Completely.&quot; \n\nAnother &quot;real&quot; rock song kicks in with the darkly desperate &quot;Optimistic,&quot; flanked by a pair of softer, eerie songs. &quot;Idioteque&quot; throws all the rules out the window with sharp percussion backed by weird waves of sound and Thom Yorke's high vocals. And finally it ends on the same note it began -- a stately organ -- in the harp-accented &quot;Motion Picture Soundtrack.&quot; \n\nIn a musical world where anything that has a guitar can be called &quot;rock,&quot; it's difficult to find music that is really creative. It's even harder to find a band that is willing to take risks, and expand their art. But those things can be found in Radiohead, and the evidence is in &quot;Kid A&quot; -- whether listeners think it's a wild success or a pretentious failure, it has to be admitted that it takes guts to try out something this different. \n\nThom Yorke's vocals are often described as whiny, but they are suited to the music here. Sometimes it's as little as backing &quot;ooh oohs,&quot; and sometimes he's lamenting about ice ages and suicidal cries of &quot;This isn't happening/I'm not here.&quot; Do the lyrics make sense? Not at first glance, at least -- they're more like a part of the music than lyrics in themselves. \n\nAnd hoo boy, the music. Few bands do panoramic electronic soundscapes as Radiohead does here, scratched with wailing voices and eerie noises. More ordinary instruments are included, but add to the strange atmosphere rather than grounding it -- razor-sharp percussion, mellow organ, rippling harp strings, and subtle, swelling strings. \n\nThe Radiohead of &quot;Kid A&quot; is looking at a bleak, cold place, but not one that is ugly or alienating. Instead, you just want to sink into it and experience its beauty, no matter how cold or bleak it is. A true modern classic.\n\nby E. A Solinas\n\nTRACKLIST:\n\n01 - Everything In Its Right Place.wma                           \n02 - Kid A.wma                                                   \n03 - The National Anthem.wma                                     \n04 - How To Disappear Completely.wma                             \n05 - Treefingers.wma                                             \n06 - Optimistic.wma                                              \n07 - In Limbo.wma                                                \n08 - Idioteque.wma                                               \n09 - Morning Bell.wma                                            \n10 - Motion Picture Soundtrack.wma                               \n11 - Hidden Track.wma   \n\nWMA 320Kbps 44100Hz STEREO\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!  \n","torrent":{"xt":"urn:btih:8e172e66173bb6971ab2bba010a014752146273e","amp;dn":"Radiohead+-+Kid+A+%282000%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e172e66173bb6971ab2bba010a014752146273e","infoHashBuffer":{"type":"Buffer","data":[142,23,46,102,23,59,182,151,26,178,187,160,16,160,20,117,33,70,39,62]},"announce":[],"urlList":[]}}