{"title":"Roma (Adolfo Aristarain,2004) [DVDRip-Spanish]","uid":6506702,"size":732540928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e7f9b92d1d20d4724be18ae4e720c1422225d25&amp;dn=Roma+%28Adolfo+Aristarain%2C2004%29+%5BDVDRip-Spanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"jla362","files":1,"time":1309449430,"description":"La irrupciÃƒÂ³n del periodista Manuel Cueto (Juan Diego Botto) en la vida del escritor JoaquÃƒÂ­n GÃƒÂ³ÃƒÂ±ez (JosÃƒÂ© SacristÃƒÂ¡n), a instancias de la editorial para la que JoaquÃƒÂ­n estÃƒÂ¡ escribiendo su ÃƒÂºltimo libro, provocarÃƒÂ¡ un desasosiego en la solitaria vida del escritor, aislado del mundo y huidizo de sus propios recuerdos. Acostumbrado a la soledad de los ÃƒÂºltimos aÃƒÂ±os, el encuentro con el joven periodista le despertarÃƒÂ¡ emociones olvidadas que le transportarÃƒÂ¡n a las dÃƒÂ©cadas de los cincuenta y sesenta, en pos de su niÃƒÂ±ez y sus locos aÃƒÂ±os de juventud vividos en Buenos Aires. Los errores propios de quien comienza a experimentarlo todo en la vida; el recuerdo de los amigos; la importancia de la lealtad; la influencia del cine y el jazz; el sabor del primer amor y la experiencia de otros muchos; y la ÃƒÂ­ntima relaciÃƒÂ³n que guardÃƒÂ³ con sus padres y, en especial, con su madre, Roma (SusÃƒÂº Pecoraro), una mujer inteligente, fuerte, comprensiva y comprometida con los ideales de juventud de su hijo le llevarÃƒÂ¡n a reflexionar sobre la influencia de la confianza que su madre depositÃƒÂ³ en ÃƒÂ©l en su juventud. A ella, sin duda, JoaquÃƒÂ­n le debe el haber sido siempre un espÃƒÂ­ritu libre, bohemio, fiel a sÃƒÂ­ mismo y a los ideales que juntos, un dÃƒÂ­a, al calor de la memoria del padre, soÃƒÂ±aron. Y es precisamente el recuerdo imborrable de Roma el que despertarÃƒÂ¡ en JoaquÃƒÂ­n el deseo y la impaciencia por recuperar todo lo que hasta ese momento creÃƒÂ­a perdido.","torrent":{"xt":"urn:btih:8e7f9b92d1d20d4724be18ae4e720c1422225d25","amp;dn":"Roma+%28Adolfo+Aristarain%2C2004%29+%5BDVDRip-Spanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7f9b92d1d20d4724be18ae4e720c1422225d25","infoHashBuffer":{"type":"Buffer","data":[142,127,155,146,209,210,13,71,36,190,24,174,78,114,12,20,34,34,93,37]},"announce":[],"urlList":[]}}