{"title":"The Murder Of My Sweet - Beth Out Of Hell (2015) 320ak","uid":12256124,"size":171238819,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e9a73eab0d888ec69a7424c5a5d3c7af8a944d1&amp;dn=The+Murder+Of+My+Sweet+-+Beth+Out+Of+Hell+%282015%29+320ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"analogkid6103","files":14,"time":1440096654,"description":"Frontiers Music Srl will release &quot;Beth Out Of Hell&quot;, the New album From the Swedish symphonic metal band THE Murder OF MY SWEET, on August 21.\n&quot;Beth Out of Hell&quot; is an apocalyptic love story where Lucifer's Daughter falls in love with the Archangel Michael,&quot; says THE Murder OF MY SWEET singer Angelica Rylin. \n\n&quot;The story in the New album basically takes off right where we left you with the last three songs of 'Bye Bye Lullabye'.&quot;Adds THE Murder OF MY SWEET drummer and producer Daniel Flores: &quot;It took us three years to record this album, and the reason for that is that we wanted to give the fans an album they truly deserve. \nWe made a conscious effort to keep all the songs very interesting and diverse, much like in a film or a musical.\n&quot;THE Murder OF MY SWEET released its debut album, &quot;Divanity&quot;, in 2009 and received swift praise From media around the world. \nMuch of the positive response was directed at the heavy orchestrations and Angelica Rylin's strong, soaring vocals. The CD's first single, &quot;Bleed Me Dry&quot;, reached a peak position of No. 14 on the Swedish international singles chart. In the summer of both 2010 and 2011, the band toured in Sweden, France and Germany and played at festivals like Sweden Rock, Rock Weekend, Baltic Festival, Raismes Fest and Wacken Open Air. \nThe darker Nordic months were spent in the studio where Flores and Rylin worked on the follow-up album, &quot;Bye, Bye Lullaby&quot;, which was released in 2012.\nNow THE Murder OF MY SWEET is back with its most ambitious and exciting album to date. The CD is definitely darker and heavier compared to their previous two records, but still features the trademark over-the-top symphonic arrangements, cinematic elements and riffs the band is known for. \nThis release also marks the debut of the band's New bass player, Patrik Janson (PLATITUDE). \n\n:00An EPK \n\nTrack listing\n\n01. Hell On Earth\n02. The Awakening\n03. World In Ashes\n04. Always The Fugitive\n05. Bitter Love\n06. Still\n07. Humble Servant\n08. Requiem For A Ghost\n09. Euthanasia\n10. Tide After Tide11\n11. Poets By Default\n12. Heaven Succumb\n13. Means To An End\n\n\n\n&quot;Beth Out of Hell&quot; \n\n&quot;Beth Out of Hell&quot; THE Murder OF MY SWEET is:Angelica Rylin: lead and background vocals Daniel Flores: drums, keyboards, vocalsChristopher Vetter: guitarPatrik Janson: bass","torrent":{"xt":"urn:btih:8e9a73eab0d888ec69a7424c5a5d3c7af8a944d1","amp;dn":"The+Murder+Of+My+Sweet+-+Beth+Out+Of+Hell+%282015%29+320ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e9a73eab0d888ec69a7424c5a5d3c7af8a944d1","infoHashBuffer":{"type":"Buffer","data":[142,154,115,234,176,216,136,236,105,167,66,76,90,93,60,122,248,169,68,209]},"announce":[],"urlList":[]}}