{"title":"The John Butler Trio - Flesh And Blood (320CBR) [MentalZero]","uid":9606301,"size":126322926,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8eaef9b11900c25ece5a434a047d522b62b5e045&amp;dn=The+John+Butler+Trio+-+Flesh+And+Blood+%28320CBR%29+%5BMentalZero%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MentalZero","files":-1,"time":1392224736,"description":"John Butler views his new album as more human than his last.\n\nThe John Butler Trio will begin its first extensive national tour in four years in March to showcase Flesh and Blood, which will be out on Friday, February 7, 2014.\n\nAnd Butler says, unlike 2010's April Uprising, which was &quot;at times aggressive and bodacious&quot;, the new album will reflect a sense of introspection, belonging and contentment.\n\n&quot;This one (Flesh &amp; Blood) is more like I've been on country and I've been staring at the fire, and I've been playing backgammon with my kids, the musician says.\n\n&quot;It's Flesh &amp; Blood in the sense that it's fallible, it's fragile, it's a human thing.&quot;\n\nOne of the tracks, Wings are Wide, was inspired by his late grandmother Phillipa.\n\nAfter the death of Butler's grandfather, Phillipa decided she would give her husband's guitar to one of their children who could play the instrument.\n\nBut it wasn't until a generation later, when a teenage Butler took it upon himself to learn, that it was finally passed on.\n\n&quot;It was like this excalibur stuck in a rock; no one could get it out,&quot; Butler describes.\n\n&quot;Everyone had a go at trying to get it out and for some reason this pimply 16-year-old who was into playing The Smiths and and The Cure (succeeded).&quot;\n\nButler said he wrote Wings are Wide from his grandmother's point of view.\n\n&quot;I played that guitar next to her in bed, played Waltzing Matilda with her after she had passed,&quot; he said.\n\n&quot;She had been a widow for 50 years... she missed her man.\n\n&quot;She wanted to go; she was tired, she had been tired for a while.&quot;","torrent":{"xt":"urn:btih:8eaef9b11900c25ece5a434a047d522b62b5e045","amp;dn":"The+John+Butler+Trio+-+Flesh+And+Blood+%28320CBR%29+%5BMentalZero%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eaef9b11900c25ece5a434a047d522b62b5e045","infoHashBuffer":{"type":"Buffer","data":[142,174,249,177,25,0,194,94,206,90,67,74,4,125,82,43,98,181,224,69]},"announce":[],"urlList":[]}}