{"title":"Autodesk Roadway Design for InfraWorks 360 Essentials[PDF] [Stor","uid":10825887,"size":3464783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fef42b757966498cc965fe09913a58d75e9741c&amp;dn=Autodesk+Roadway+Design+for+InfraWorks+360+Essentials%5BPDF%5D+%5BStor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"steelballz","files":-1,"time":1408579876,"description":"Description\nAutodesk Roadway Design for InfraWorks 360 Essentials\nAuthor:Chappell, Eric\nPublisher and Published Date:Sybex (June 16 2014)\nISBN-10:1118862031\nISBN-13:9781118862032\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nYour guide to quickly learning InfraWorks\n\nAutodesk InfraWorks Essentials is a complete, hands-on tutorial for InfraWorks, the powerful design tool that lets you quickly generate 3D models to create infrastructure designs and proposals. This Autodesk Official Press book shows you the right way to take advantage of versatile InfraWorks features. From creating models in the context of the existing environment to crafting stunning proposals, you'll become comfortable with every step of the design process. After working through this start-to-finish tutorial, you'll be able to productively use InfraWorks for civil project design that's fully integrated with existing real-world characteristics.\n\nIn Autodesk InfraWorks Essentials, you'll learn everything you need for everyday design projects.\n\n360 full-color pages full of screenshots and illustrations\nDetailed step-by-steps on importing GIS and other data\nCreate roadways, buildings, railways, and more\nLearn how to use the powerful Styles feature\nDownload before and after files, so you can start anywhere\n\nThis is the perfect tutorial for using InfraWorks to quickly create infrastructure designs, win project bids, speed up the approval process, and collaborate remotely across platforms.\n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:8fef42b757966498cc965fe09913a58d75e9741c","amp;dn":"Autodesk+Roadway+Design+for+InfraWorks+360+Essentials%5BPDF%5D+%5BStor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fef42b757966498cc965fe09913a58d75e9741c","infoHashBuffer":{"type":"Buffer","data":[143,239,66,183,87,150,100,152,204,150,95,224,153,19,165,141,117,233,116,28]},"announce":[],"urlList":[]}}