{"title":"The Infinite Resource by Ramez Naam","uid":9625180,"size":6919879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9012f655580de6d3247db1e248a4f10ac5a0249b&amp;dn=The+Infinite+Resource+by+Ramez+Naam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"PirateBook","files":2,"time":1392579390,"description":"\nClimate change. Finite fossil fuels. Fresh water depletion. Rising commodity prices. Ocean acidification. Overpopulation. Deforestation. Feeding the world's billions.\nWe're beset by an array of natural resource and environmental challenges. They pose a tremendous risk to human prosperity, to world peace, and to the planet itself.\n\nYet, if we act, these problems are addressable. Throughout history we've overcome similar problems, but only when we've focused our energies on innovation. For the most valuable resource we have isn't oil, water, gold, or land - it's our stockpile of useful ideas, and our continually growing capacity to expand them.\n\nIn this remarkable book, Ramez Naam charts a course to supercharge innovation - by changing the rules of our economy - that can lead the whole world to greater wealth and human well-being, even as we dodge looming resource crunches and environmental disasters and reduce our impact on the planet.\n\nFrom solar power to desalination, from next generation crops to next generation batteries, from technologies that could scrub carbon from our skies to those that could turn our garbage dumps into piles of valuable resources - solutions are possible: \n\nBut only if we invest in innovation, and only if we put the right incentives in place around the globe. This book shows the scope of the problems, the landscape of the solutions, and policy changes we need to make to bring those solutions to fruition.\n\nGenre: Non Fiction , Science","torrent":{"xt":"urn:btih:9012f655580de6d3247db1e248a4f10ac5a0249b","amp;dn":"The+Infinite+Resource+by+Ramez+Naam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9012f655580de6d3247db1e248a4f10ac5a0249b","infoHashBuffer":{"type":"Buffer","data":[144,18,246,85,88,13,230,211,36,125,177,226,72,164,241,10,197,160,36,155]},"announce":[],"urlList":[]}}