{"title":"Terrahawks Full Series (1983-1984) Season 01-03 (Gerry Anderson)","uid":5169174,"size":8883248478,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:901933dc204520da9c26a6209d48679fffb168be&amp;dn=Terrahawks+Full+Series+%281983-1984%29+Season+01-03+%28Gerry+Anderson%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"7even11","files":-1,"time":1258585792,"description":"Terrahawks, entire series, all seasons (very rare!)\n\n\nAlso look here:\nhttp://thepiratebay.se/torrent/5178873/Terrahawks_1x01-1x08_Aspect_Ratio_Fix\n\n*THIS IS A RARE TORRENT SO SEED IT!*\n\n---\n\nTerrahawks Set in the year 2020, the series followed the adventures of the Terrahawks, a taskforce responsible for protecting Earth from invasion by a group of extraterrestrial androids and aliens led by Zelda. Like Anderson's previous puppet series, futuristic vehicles and technology featured prominently in each episode.\n\nTerrahawks (technically, the Earth Defense Squadron) is an elite task force that protects Earth from alien invasion.\n\n    * Doctor &quot;Tiger&quot; Ninestein (real first name unknown): The team's leader, so named as he is the ninth clone created by Dr. Gerhard Stein. Somewhat bloodthirsty, his first reaction to alien contact is often to blast it out of the sky. In between alien attacks, he's often seen trying (and failing) to beat the high score on his favourite video-game. Ninestein's catchphrase is, &quot;I have a theory...&quot;, and when frustrated he often cries, &quot;Flaming thunderbolts!&quot; If he is killed, he can be replaced within 24 hours by another of the nine clones; his nickname of &quot;Tiger&quot; comes from the myth of cats similarly having &quot;nine lives&quot;.\n\n    * Captain Mary Falconer: Battlehawk's pilot. She acts as Ninestein's second-in-command, weighing his offensive tendencies with her own regard for the value of life...whether in regards to one of Zelda's henchmen, or to the Zeroids.\n\n    * Captain Kate Kestrel (real name: Katherine Westley): The pilot of the Hawkwing fighter aircraft, Kate is also an internationally famous pop singer. Her record company is &quot;Anderburr Records&quot; - a portmanteau of &quot;Anderson&quot; and &quot;Burr&quot;.\n\n    * Lieutenant Hawkeye (real name: Hedley Howard Henderson III): The Hawkwing's gunner. Due to a track-and-field accident, his eyes have been replaced with micro-computers that enhance his targeting abilities. When given an order, he always replies &quot;aye-aye&quot; as a pun on his name.\n\n    * Lieutenant Hiro (full name unknown): The commander of the Spacehawk, Hiro keeps a large collection of flowers to which he gives names and reads poetry. His thick Japanese accent is sometimes a source of humour.\n\nSergeant Major Zero action figure produced by Bandai\n\n    * Zeroids: Spherical robots that perform ground operations and serve as the firepower for the Spacehawk. There are two leaders among the Zeroids who exhibit human-like capacity for thought and emotion (much to Ninestein's annoyance); Sergeant Major Zero (voiced by Windsor Davies), commands the Zeroids stationed on Earth, while Space Sergeant 101 directs the Zeroids stationed aboard Spacehawk. Other Zeroids are given distinct personality traits of their own, such as Dix-huit (French for the number eighteen), who speaks French and has a handlebar moustache, and 55, who bobs up and down in rhyme. They can increase their mass (becoming as heavy as a black hole), which allows them to perform devastating body-crash manoeuvres. This is often accompanied by a cry of &quot;St-roll on!&quot;\n\n    * Colonel Johnson (first name unknown): The head of WASA (World Aeronautics &amp; Space Administration). Ostensibly Terrahawks' co-director, his authority is constantly overridden by Ninestein.\n\nIMG: http://bayimg.com/eAEMoaaco\nIMDB: http://www.imdb.com/title/tt0085099/\nOriginal run: October 3, 1983 - July 24, 1984\n\nAlso look here:\nhttp://thepiratebay.se/torrent/5178873/Terrahawks_1x01-1x08_Aspect_Ratio_Fix\n","torrent":{"xt":"urn:btih:901933dc204520da9c26a6209d48679fffb168be","amp;dn":"Terrahawks+Full+Series+%281983-1984%29+Season+01-03+%28Gerry+Anderson%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"901933dc204520da9c26a6209d48679fffb168be","infoHashBuffer":{"type":"Buffer","data":[144,25,51,220,32,69,32,218,156,38,166,32,157,72,103,159,255,177,104,190]},"announce":[],"urlList":[]}}