{"title":"The Rise of the New Oil Order (Petroleum.Business.Economics)","uid":5289816,"size":1910047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:907435dbd30ad845b77c18720f35b1da9ba694f9&amp;dn=The+Rise+of+the+New+Oil+Order+%28Petroleum.Business.Economics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"asperge","files":3,"time":1263860617,"description":"The Rise of the New Oil Order demonstrates that there are vast reserves of oil to meet an increasing demand. Oil will remain the world's primary strategic resource and an invaluable commodity. But oil will come from different sources (mainly North America), will be of a different kind (unconventional), and will be produced with different technologies by different types of companies. The oil market will not be regulated by OPEC but by the consumers and producers together, who will create the mechanisms to achieve price stability at a higher level. In this new context, the book examines the strategies of the traditional players (the US, Russia, Japan, the European Union, Iran, Saudi Arabia, Venezuela, Mexico) and of the new ones (Alberta, Saskatchewan, China, India, Brazil, Kazakhstan, Nigeria and West Africa). The book offers a very different explanation of the recent rise of the price of oil. The increase of' demand in China and India is not the key factor. Other rational and irrational factors may explain the speculation and market manipulation that occurred, especially in 2007-2008. The Rise of the New Oil Order is a manifesto and a practical roadmap with specific proposals to restore a healthy market equilibrium to this most critical of commodities. It is a book that brings transparency to consumers and investors, companies, banks, and governments, while casting aside irrational beliefs and simplistic explanations. The book is based on a seven-hour interview session with two of Switzerland's most knowledgeable business reporters. &lt;a href=&quot;\nhttp://www.academyfinance.ch/newoilorder/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.academyfinance.ch/newoilorder/&lt;/a&gt;\n\n----------------------------------------------\n\nThe document is a djvu file. To read djvu files : http://windjview.sourceforge.net/","torrent":{"xt":"urn:btih:907435dbd30ad845b77c18720f35b1da9ba694f9","amp;dn":"The+Rise+of+the+New+Oil+Order+%28Petroleum.Business.Economics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"907435dbd30ad845b77c18720f35b1da9ba694f9","infoHashBuffer":{"type":"Buffer","data":[144,116,53,219,211,10,216,69,183,124,24,114,15,53,177,218,155,166,148,249]},"announce":[],"urlList":[]}}