{"title":"DC Comics Science Fiction Graphic Novels","uid":5249846,"size":167034915,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9077df4ce6fe531f487bb34362467583dda4c560&amp;dn=DC+Comics+Science+Fiction+Graphic+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"brodahisou","files":-1,"time":1262286800,"description":"DC Comics published from 1985 to 1987 a second line of graphic novels, called DC Science Fiction Graphic Novel.  Rather than being original stories, the graphic novels of this line were instead adaptations of works published by well-known authors of science fiction.  These were edited by the legendary Julius Schwartz, making use of his connections to recruit the famous authors whose works were adapated.  This was the last editorial work Schwartz did before retiring.\n\n\nHell on Earth\nThree people are affected by the physical if restrained presence of Satan in their midst.  The story addresses the question of whether having Satan physically among us would make the Earth any worse, given the foibles of humanity.\nWritten by Robert Bloch and adapted by Robert Loren Fleming and Keith Giffen.\n\n\nNightwings\nIn a decadent and caste-based future humanity is divided into guilds, each having a specific job to do.  The story focuses on a Watcher, whose mission is to watch the skies with some sophisticated equipment and to inform the Defenders in the event of an alien invasion. Along with a young Flier girl and a Changeling, he visits the old city of Roum, and becomes entangled in events including the possibility of invasion.\nWritten by Robert Silverberg and adapted by Cary Bates and Gene Colan.\n\n\nFrost and Fire\nOn an unknown planet people are cursed to only live for eight days due to radiation poisoning.  Moved by his ancestors racial memories Sim makes it his goal to extend his life and reach the distant rocket that first brought them to the planet.\nWritten by Ray Bradbury and adapted by Klaus Janson.\n\n\nThe Merchants of Venus\nColonists are needed for the Venus Project to leave the overcrowded Earth to live on Venus.  This leaves the Venus Project Personnel Director with a dilemma: Creative and resourceful people are needed for the colonization effort, but, anyone who is creative or resourceful does perfectly fine making a life for themselves on Earth - so they have no reason or desire to travel to Venus to make a living.  The Merchants of Venus is a satire of runaway free market capitalism and features the first appearance of the alien race, the Heechee.\nWritten by Frederick Pohl and adapted by Victoria Petersen and Neal McPheeters.\n\n\nDemon with a Glass Hand\nTrent is a man with no memory of his life before the past ten days. His left hand has been replaced by an advanced computer shaped like his missing hand, but with three fingers missing.  The computer tells him they must be reattached before it can tell Trent what is going on.  Unfortunately for Trent the missing appendages are in the hands of humanoid aliens called the Kyben, who are out to kill him.\nOriginally aired as an episode of the Outer Limits in 1964.  The script was written by Harlan Ellison and adapted for the graphic novel by Marshall Rogers.\n\n\nThe Magic Goes Away\nThe Warlock is a powerful sorcerer in excess of 200 years of age.  He observes that when he stays in one place too long, his powers dwindle and will return only when he leaves that place.  The Warlock realizes that magic is fueled by a non-renewable resource, which would cause great concern among the magicians, as it was through their magic that nations enforced their wills both internally and abroad.  The widespread diminishing of magical power triggers a quest on the part of the most powerful of the magicians of the time to harness a new source of magic.\nWritten by Larry Niven and adapted by Paul Kupperberg and Jan Duursema.\n\n\nSandkings\nA millionaire named Simon Kress buys four colonies of 'sandkings'- highly intelligent antlike creatures - as an addition to his collection of exotic pets. Problems occur when he forces the sandkings to make war on one another for his amusement, only to find they are a more sophisticated species than he bargained for.\nWritten by George R. R. Martin and adapted by Doug Moench, Pat Broderick and Neal McPheeters.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:9077df4ce6fe531f487bb34362467583dda4c560","amp;dn":"DC+Comics+Science+Fiction+Graphic+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9077df4ce6fe531f487bb34362467583dda4c560","infoHashBuffer":{"type":"Buffer","data":[144,119,223,76,230,254,83,31,72,123,179,67,98,70,117,131,221,164,197,96]},"announce":[],"urlList":[]}}