{"title":"The Help 2011 720p BRRip_WhiteBuffallo","uid":7008676,"size":912778659,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:919b6227f2795609a9e952ea1a0f92190b6401cc&amp;dn=The+Help+2011+720p+BRRip_WhiteBuffallo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"whitebuffallo","files":11,"time":1328315236,"description":"This is my first upload.......and this is a great movie....So please pass on a good word if you like it!!!!\n\n[b]Review by Roger Ebert:[/b]\n\n&quot;The Help&quot; is a safe film about a volatile subject. Presenting itself as the story of how African-American maids in the South viewed their employers during Jim Crow days, it is equally the story of how they empowered a young white woman to write a best-seller about them, and how that book transformed the author's mother. We are happy for the two white women, and a third, but as the film ends it is still Jackson, Mississippi and Ross Barnett is still governor.\n\nStill, this is a good film, involving and wonderfully acted. I was drawn into the characters and quite moved, even though all the while I was aware it was a feel-good fable, a story that deals with pain but doesn't care to be that painful. We don't always go to the movies for searing truth, but more often for reassurance: Yes, racism is vile and cruel, but hey, not all white people are bad.\n\nThe story, based on Kathryn Stockett's best-seller, focuses on Skeeter Phelan (Emma Stone), a recent college graduate who comes home and finds she doesn't fit in so easily. Stone has top billing, but her character seems a familiar type, and the movie is stolen, one scene at a time, by two other characters: Aibileen Clark (Viola Davis) and Minny Jackson (Octavia Spencer).\n\nBoth are maids. Aibileen has spent her life as a nanny, raising little white girls. She is very good at it, and genuinely gives them her love, although when they grow up they have an inexorable tendency to turn into their mothers. Minny is a maid who is fired by a local social leader, then hired by a white-trash blonde. Davis and Spencer have such luminous qualities that this becomes their stories, perhaps not entirely by design.\n\nThe society lady, Hilly Holbrook (Bryce Dallas Howard), is a relentless social climber who fires Minny after long years of service. The blonde is Celia Foote (Jessica Chastain, from &quot;The Tree of Life&quot;), who is married to a well-off businessman, is desperate to please him, and knows never learned anything about being a housewife.\n\nMinny needs a job, and is happy to work for her. Celia wants her only during the days, when her husband is away, so that he'll think he's eating her cooking and enjoying her housekeeping. Minny helps her with these tasks and many more, some heart-breaking, and fills her with realistic advice. Chastain is unaffected and infectious in her performance.\n\nCelia doesn't listen to Minny's counsel, however, when she attends a big local charity event (for, yes, Hungry African Children), and the event provides the movie's comic centerpiece. Celia's comeuppance doesn't have much to do with the main story, but it gets a lot of big laughs. Some details about a pie seem to belong in a different kind of movie.\n\nSkeeter convinces Aibileen and then Minny to speak frankly with her, sharing their stories, and as the book develops so does her insight and anger. A somber subplot involves the mystery of why Skeeter's beloved nanny, who worked for the family for 29 years, disappeared while Skeeter was away at school. Her mother (Alison Janney) harbors the secret of the nanny's disappearance, and after revealing it she undergoes a change of heart in a big late scene of redemption.\n\nTwo observations, for what they're worth. All the white people in the movie smoke. None of the black people do. There are several white men with important speaking roles, but only two black men, including a preacher, who have much to say.\n\nThere was a 1991 movie named &quot;The Long Walk Home&quot; that starred Whoopi Goldberg and Sissy Spacek as a maid and her employer at the time of the Montgomery Bus Boycott. It had sharper edges than &quot;The Help.&quot; But I suppose the Stockett novel has many loyal readers, and that this is the movie they imagined while reading it. It's very entertaining. Viola Davis is a force of nature and Octavia Spencer has a wonderfully expressive face and flawless comic timing. Praise, too for Emma Stone, Bryce Dallas Howard and Alison Janney. They would have benefitted from a more fearless screenplay\n\n[u][b]Specs:[/b][/u]\n\n[b]General[/b]\n\nComplete name: The Help 2011 720p BRRip_White Buffallo.mp4\nFormat: MPEG-4\nFormat profile: Base Media\nCodec ID: isom\nFile size: 852 MiB\nDuration: 2h 26mn\nOverall bit rate mode: Variable\nOverall bit rate: 814 Kbps\nEncoded date: UTC 2011-11-18 02:00:49\nTagged date: UTC 2011-11-18 02:00:49\n\n[b]Video[/b]\n\nID: 1\nFormat: AVC\nFormat/Info: Advanced Video Codec\nFormat profile: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f5bd9c929db5b9c6dbc4&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nFormat settings, CABAC: Yes\nFormat settings, ReFrames: 5 frames\nCodec ID: avc1\nCodec ID/Info: Advanced Video Coding\nDuration: 2h 26mn\nBit rate: 778 Kbps\nMaximum bit rate: 4 600 Kbps\nWidth: 1 280 pixels\nHeight: 688 pixels\nDisplay aspect ratio: 1.860\nFrame rate mode: Constant\nFrame rate: 23.976 fps\nColor space: YUV\nChroma subsampling: 4:2:0\nBit depth: 8 bits\nScan type: Progressive\nBits/(Pixel*Frame): 0.037\nStream size: 814 MiB (96%)\nWriting library: x264 core 116 r2074 2641b9e\nEncoded date: UTC 2011-11-18 02:00:49\nTagged date: UTC 2011-11-18 02:01:50\n\n[b]Audio[/b]\n\nID: 2\nFormat: AAC\nFormat/Info : Advanced Audio Codec\nFormat profile: HE-AAC / LC\nCodec ID: 40\nDuration: 2h 26mn\nBit rate mode: Variable\nBit rate: 33.0 Kbps\nMaximum bit rate: 59.6 Kbps\nChannel(s): 2 channels\nChannel positions: Front: L R\nSampling rate: 48.0 KHz / 24.0 KHz\nCompression mode: Lossy\nStream size: 34.5 MiB (4%)\nEncoded date: UTC 2011-11-18 02:01:49\nTagged date : UTC 2011-11-18 02:01:50","torrent":{"xt":"urn:btih:919b6227f2795609a9e952ea1a0f92190b6401cc","amp;dn":"The+Help+2011+720p+BRRip_WhiteBuffallo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"919b6227f2795609a9e952ea1a0f92190b6401cc","infoHashBuffer":{"type":"Buffer","data":[145,155,98,39,242,121,86,9,169,233,82,234,26,15,146,25,11,100,1,204]},"announce":[],"urlList":[]}}