{"title":"Ronald Grigor Suny - The Cambridge History of Russia, Vol. 3 - T","uid":9922017,"size":9477388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e0555ab2cf27a2b6ef6e443a0856f01986fdb2&amp;dn=Ronald+Grigor+Suny+-+The+Cambridge+History+of+Russia%2C+Vol.+3+-+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":4,"time":1397007352,"description":"Description\nProduct Details\nBook Title: The Cambridge History of Russia, Vol. 3: The Twentieth Century\t\nBook Author: Ronald Grigor Suny (Editor)\nHardcover: 866 pages\nPublisher: Cambridge University Press; 1 edition (December 18, 2006)\nLanguage: English\nISBN-10: 0521811449\nISBN-13: 978-0521811446\n\nThe third volume of The Cambridge History of Russia provides an authoritative political, intellectual, social and cultural history of the trials and triumphs of Russia and the Soviet Union during the twentieth century. It encompasses not only the ethnically Russian part of the country but also the non-Russian peoples of the tsarist and Soviet multinational states and of the post-Soviet republics. Beginning with the revolutions of the early twentieth century, chapters move through the 1920s to the Stalinist 1930s, World War II, the post-Stalin years and the decline and collapse of the USSR. The contributors attempt to go beyond the divisions that marred the historiography of the USSR during the Cold War to look for new syntheses and understandings. The volume is also the first major undertaking by historians and political scientists to use the new primary and archival sources that have become available since the break-up of the USSR.\n\nReview\n&quot;Ronald Grigor Suny...has assembled a distinguished group of contributors for his latest survey of the world's first socialist society.&quot; -Benjamin Nathans, Journal of Modern History\n\nBook Description\nThe third volume of The Cambridge History of Russia provides an authoritative political, intellectual, social and cultural history of Russia and the Soviet Union during the twentieth century. This is the first major undertaking by historians to use the new sources that became available after the break-up of the USSR.\n\nMost Helpful Customer Review\n5.0 out of 5 stars Splendid study of Russia in the 20th century November 9, 2010\nBy William Podmore\nPart 1 covers Russia's story through time from 1900 to the present. Part 2 looks at themes and trends - economic and demographic change, rural development, industrialisation, women, non-Russians in the USSR, the western republics, science and technology, culture, foreign policy, and the road to communism.\nRonald Suny writes, &quot;The totalitarian approach turned an apt if not wholly accurate description into a model, complete with predictions of future trajectories. The concept exaggerated similarities and underestimated differences between quite distinct regimes, ignoring the contrast between an egalitarian, internationalist doctrine (Marxism) that the Soviet regime failed to realise and the inegalitarian, racist and imperialist ideology (Fascism) that the Nazis implemented only too well. Little was said about the different dynamics in a state capitalist system with private ownership of property (Nazi Germany) and those operating in a completely state-dominated economy with almost no production for the market (Stalin's USSR), or how an advanced industrial economy geared essentially to war and territorial expansion (Nazi Germany) differed from a programme for modernising a backward, peasant society and transforming it into an industrial, urban one (Stalinist Soviet Union). The T-model led many political scientists and historians to deal almost exclusively with the state, the centre and the top of the political pyramid, and make deductions from a supposedly fixed ideology, while largely ignoring social dynamics and the shifts and improvisations that characterised both Soviet and Nazi policies. Even more pernicious were the predictive parallels: since Nazi Germany had acted in an expansionist, aggressive way, it could be expected that another totalitarian regime would also be aggressive and expansionist. Indeed, during the Cold War Western media and governments fostered the notion that the USSR was poised and ready to invade Western Europe. Any concessions to Soviet Communism were labelled `appeasement', a direct analogy to Western negotiations with the Nazis in the 1930s.&quot;\nDavid R. Shearer writes, &quot;the litany of statistics chronicling Soviet industrial achievements under Stalin was and still is impressive. In the Russian republic, alone, construction of new energy sources jumped the number of kilowatt hours of energy generated from 3.2 billion in 1928 to 31 billion in 1940. Coal production increased from 10 to 73 million tons per year, iron ore from 1 to 5.5 million tons, steel from 2 to 9 million tons. The Soviet Union went from an importer to an exporter of natural gas, producing 560 million metric tons by 1932.&quot;\nSpending on science tripled between 1927-28 and 1933 and doubled between 1933 and 1940. In the 1930s, the Soviet Union spent a greater proportion of its national income on science than any other country. The number of research scientists grew from 18,000 in 1929 to 46,000 in 1935. David Holloway sums up, &quot;Important though the Lysenko affair was, it did not characterize Stalinist science as a whole.&quot;\nThe proportion of women in institutions of higher education rose from 31 per cent in 1926 to 43 per cent in 1937 and to 77 per cent in World War Two, then fell to 52 per cent in 1955 and 42 per cent in 1962. As Barbara Engel comments, &quot;Most of the women who benefited derived from lower-class backgrounds.&quot;\nDavid R. Shearer points out, &quot;Although the famine hit Ukraine hard, it was not, as some historians argue, a purposefully genocidal policy against Ukrainians. ... no evidence has surfaced to suggest that the famine was planned, and it affected broad segments of the Russian and other non-Ukrainian populations both in Ukraine and in Russia.&quot;\nPeter Gatrell notes, &quot;The state also derived a degree of legitimacy from the promise and the reality of economic growth, technological modernisation and social progress. There were genuine and important gains in literacy and life expectancy from one generation to the next. In the words of a broadly hostile critic, Soviet economic policies secured `some broad acquiescence on the part of the people' [Alexander Gerschenkron, Economic backwardness in historical perspective, Harvard University Press, 1962, p. 29]. That acquiescence rested upon Soviet-style welfare provision and opportunities for upward social mobility, which generated a sense of civic commitment and left a positive legacy.&quot;\nIn the 1970s, living standards, incomes and literacy rates rose dramatically. Between 1950 and 1975 Soviet agricultural output more than doubled, the world's fastest growth rate in volume and per head.\nBut with the counter-revolution led by Gorbachev and Yeltsin came disaster. In 1996, Russia's income per head was 47 per cent of 1992's level; agricultural production was 36 per cent lower in 1997 than in 1990. Wages in 1995 were 55 per cent of their 1985 level; wages in 2000 were still only 50 per cent of their 1990 level. Unemployment rose from 3.6 million - 4.8 per cent - in 1992 to 8.9 million - 10 per cent - in 1998. There were 8.2 million fewer industrial workers in 1998 than in 1991, a 36.8 per cent fall. Science lost half its workers.","torrent":{"xt":"urn:btih:91e0555ab2cf27a2b6ef6e443a0856f01986fdb2","amp;dn":"Ronald+Grigor+Suny+-+The+Cambridge+History+of+Russia%2C+Vol.+3+-+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e0555ab2cf27a2b6ef6e443a0856f01986fdb2","infoHashBuffer":{"type":"Buffer","data":[145,224,85,90,178,207,39,162,182,239,110,68,58,8,86,240,25,134,253,178]},"announce":[],"urlList":[]}}