{"title":"Janet Evanovich The Heist","uid":8657585,"size":3927357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e304f3174bf21640f3be6fea7c0f69356d248c&amp;dn=Janet+Evanovich+The+Heist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"BlackTar","files":-1,"time":1373242524,"description":"From Janet Evanovich, #1 New York Times bestselling author of the Stephanie Plum novels, and Lee Goldberg, bestselling author and television writer for Monk, comes the first adventure in an electrifying new series featuring an FBI agent who always gets her man, and a fearless con artist who lives for the chase.\n\nFBI Special Agent Kate O'Hare is known for her fierce dedication and discipline on the job, chasing down the world's most wanted criminals and putting them behind bars. Her boss thinks she is tenacious and ambitious; her friends think she is tough, stubborn, and maybe even a bit obsessed. And while Kate has made quite a name for herself for the past five years the only name she?s cared about is Nicolas Fox?an international crook she wants in more ways than one.            \n\nAudacious, handsome, and dangerously charming, Nicolas Fox is a natural con man, notorious for running elaborate scams on very high-profile people. At first he did it for the money. Now he does it for the thrill. He knows that the FBI has been hot on his trail - particularly Kate O'Hare, who has been watching his every move. For Nick, there's no greater rush than being pursued by a beautiful woman....even one who aims to lock him up. But just when it seems that Nicolas Fox has been captured for good, he pulls off his greatest con of all: He convinces the FBI to offer him a job, working side by side with Special Agent Kate O'Hare.\n\nProblem is, teaming up to stop a corrupt investment banker who's hiding on a private island in Indonesia is going to test O'Hare's patience and Fox's skill. Not to mention the skills of their ragtag team made up of flamboyant actors, wanted wheelmen, and Kate's dad. High-speed chases, pirates, and Toblerone bars are all in a day?s work...if O'Hare and Fox don't kill each other first.","torrent":{"xt":"urn:btih:91e304f3174bf21640f3be6fea7c0f69356d248c","amp;dn":"Janet+Evanovich+The+Heist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e304f3174bf21640f3be6fea7c0f69356d248c","infoHashBuffer":{"type":"Buffer","data":[145,227,4,243,23,75,242,22,64,243,190,111,234,124,15,105,53,109,36,140]},"announce":[],"urlList":[]}}