{"title":"Midnight Obsession (Joe D'Amato, Adult Tip Top / DvdRip / 1995)","uid":11712083,"size":1688964719,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:922f54b736fc6e2093a22a493de0e43aeabdd06f&amp;dn=Midnight+Obsession+%28Joe+D%27Amato%2C+Adult+Tip+Top+%2F+DvdRip+%2F+1995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"2.No.2","files":1,"time":1424378505,"description":"Midnight Obsession (Joe D'Amato, Adult Tip Top / DvdRip / 1995)\n\nWhen a young American woman gets caught attempting to smuggle contraband across borders, she opens herself up to exploitation by a multitude of perverts. Shuffled from detention center to detention center as she awaits the legal process, she encounters all manner of horny bureaucrats who relish the thought of getting a fresh piece of American ass as a conquest of their job. So, ladies, be careful what you use latex condoms for because agencies such as Homeland Security in the U.S. as well as its foreign counterparts are keen on looking in places where one would not expect. At travel departure gates one may be expected to bend over for more than a quickie these days, where a gaggle of ogling men in uniforms gets their jollies off by exercising the power of their position. That's what happens to the protagonist in this film. Let's see how she extricates herself from this Midnight Obsession.\n\nWho'd ever thought that a drug smuggler could find true love - if not true lust - in a foreign prison? Acclaimed European diector Joe D'Amato, that's who. In this twist on the classic film Midnight Express, D'Amato serves up a tale of a gorgeous female smuggler who's in the wrong place at the right time, which lands her in a prison where not just the warden is having affairs with the female prisoners, but the coed convicts are getting in on it as well! With that kind of rehabilitative process, no wonder no one wants to escape! You've never seen a penile--er, penal system quite like this!\n\nAnita Rinaldi, Erika Bella (as Erica Bella), Shalimar (as Letizia Shalimar), Luisita Duarte, Ildiko (as Cinthia Ildiko), Cristina Valenti (as Cristina Ross), Suzy Cat (as Susanna Katona), Alberto Rey (as Alberto Louis), Felix, Guisy Carrara, Jean-Yves Le Castel (as Joe Calzone), Philippe Soine, Roberto Malone, Silvio Evangelista (as Silvio Lada)\n\nFeature, European, Anal, A2M\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=wggpivgveo1m.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=wggpivgveo1m.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=o7llfs9dq21y.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=o7llfs9dq21y.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:922f54b736fc6e2093a22a493de0e43aeabdd06f","amp;dn":"Midnight+Obsession+%28Joe+D%27Amato%2C+Adult+Tip+Top+%2F+DvdRip+%2F+1995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"922f54b736fc6e2093a22a493de0e43aeabdd06f","infoHashBuffer":{"type":"Buffer","data":[146,47,84,183,54,252,110,32,147,162,42,73,61,224,228,58,234,189,208,111]},"announce":[],"urlList":[]}}