{"title":"Catherine Coulter - FBI Series+ ,lit,mobi,KK","uid":6797019,"size":14207239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92c369e2f3a0b7986815fb9c905b981ab034382e&amp;dn=Catherine+Coulter+-+FBI+Series%2B+%2Clit%2Cmobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1320452162,"description":"Catherine Coulter - FBI Series+ ,lit,mobi\n\n\nEarly years\n \nCoulter grew up on a horse ranch in Texas in the United States.[2] She comes from a family of creative people. Her grandmother, who died at the young age of 37, was also a writer. Coulter's father is a painter and singer, and her mother is a retired concert pianist.[3]\n \nCoulter wrote her first two novels, fifteen pages each, when she was fourteen.[3] While a freshman at the University of Texas, Coulter wrote poetry.[3] After earning her undergraduate degree from the University of Texas, Coulter attended Boston College and earned a Master's degree in early 19th-century European history.[2]\n \nCoulter took a job as a speech writer for a Wall Street company president. Because her husband was a medical student, she spent many of her evenings alone, reading romance novels. One night when they were home together, Coulter found herself in the middle of a particularly bad book and threw it across room, asserting that even she could do better. Her husband challenged her to prove herself, and the two spent the weekend plotting out a storyline for a gothic romance. Coulter wrote the novel in the evenings.[3]\n \n[edit] Writing career\n \nWhen Coulter finished writing her novel she sent it to an editor at Signet. Three days later Signet offered her a three-book contract.[3] That first novel, The Autumn Countess, was published by Penguin Books in 1978. By 1982, she was earning enough to quit her job and become a full-time writer.[4]\n \nSince then she has written over fifty books and has had forty-two consecutive New York Times Bestsellers since 1988.[2] Her thriller The Maze was her first book to place on the New York Times Hardcover Bestseller list, while The Cove spent nine weeks on the New York Times Paperback Bestseller list and sold over one million copies.[2] Coulter generally publishes one historical romance and one suspense novel each year, and has been busily rewriting many of her earlier Regency romances to turn them into longer historical romances.[5]\n\n\nEnjoy!","torrent":{"xt":"urn:btih:92c369e2f3a0b7986815fb9c905b981ab034382e","amp;dn":"Catherine+Coulter+-+FBI+Series%2B+%2Clit%2Cmobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c369e2f3a0b7986815fb9c905b981ab034382e","infoHashBuffer":{"type":"Buffer","data":[146,195,105,226,243,160,183,152,104,21,251,156,144,91,152,26,176,52,56,46]},"announce":[],"urlList":[]}}