{"title":"The Trap  What Happened To Our Dream Of Freedom? (Adam Curtis","uid":3795702,"size":1538142208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92c88b481212012001375877eedc521f83fdb50f&amp;dn=The+Trap++What+Happened+To+Our+Dream+Of+Freedom%3F+%28Adam+Curtis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Pharos2001","files":3,"time":1188945701,"description":"The Trap ÃƒÂ¢?? What Happened To Our Dream Of Freedom?  \n\nIndividual freedom is the dream of our age. It's what our leaders promise to give us, it defines how we think of ourselves and, repeatedly, we have gone to war to impose freedom around the world. But if you step back and look at what freedom actually means for us today, it's a strange and limited kind of freedom. \n  \nPoliticians promised to liberate us from the old dead hand of bureaucracy, but they have created an evermore controlling system of social management, driven by targets and numbers. Governments committed to freedom of choice have presided over a rise in inequality and a dramatic collapse in social mobility. And abroad, in Iraq and Afghanistan, the attempt to enforce freedom has led to bloody mayhem and the rise of an authoritarian anti-democratic Islamism. This, in turn, has helped inspire terrorist attacks in Britain. In response, the Government has dismantled long-standing laws designed to protect our freedom. \n  \nThe Trap is a series of three films by Bafta-winning producer Adam Curtis that explains the origins of our contemporary, narrow idea of freedom. \n  \nIt shows how a simplistic model of human beings as self-seeking, almost robotic, creatures led to today's idea of freedom. This model was derived from ideas and techniques developed by nuclear strategists during the Cold War to control the behaviour of the Soviet enemy. \n  \nMathematicians such as John Nash developed paranoid game theories whose equations required people to be seen as selfish and isolated creatures, constantly monitoring each other suspiciously ÃƒÂ¢?? always intent on their own advantage. \n  \nThis model was then developed by genetic biologists, anthropologists, radical psychiatrists and free market economists, and has come to dominate both political thinking since the Seventies and the way people think about themselves as human beings. \n  \nHowever, within this simplistic idea lay the seeds of new forms of control. And what people have forgotten is that there are other ideas of freedom. We are, says Curtis, in a trap of our own making that controls us, deprives us of meaning and causes death and chaos abroad. \n\nXviD 720*404\nMP3 128Kbps (ABR)\n+/- 500Mb 59 minutes per episode\n\n1.\tF**k you buddy.\n2.\tThe lonely robot.\n3.\tWe will force you to be free.\n","torrent":{"xt":"urn:btih:92c88b481212012001375877eedc521f83fdb50f","amp;dn":"The+Trap++What+Happened+To+Our+Dream+Of+Freedom%3F+%28Adam+Curtis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c88b481212012001375877eedc521f83fdb50f","infoHashBuffer":{"type":"Buffer","data":[146,200,139,72,18,18,1,32,1,55,88,119,238,220,82,31,131,253,181,15]},"announce":[],"urlList":[]}}