{"title":"Subnautica - Beta 1950","uid":12165904,"size":3276882238,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92d94b1e43360f4b89f7a71d95b1bf692e6d3fdb&amp;dn=Subnautica+-+Beta+1950&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"dauphong","files":1,"time":1438033930,"description":"About This Game\nSubnautica is an open world, underwater exploration and adventure game currently under construction at Unknown Worlds, the independent developer behind Natural Selection 2.\nDive Into a Vast Underwater World\n\n\n\nAfter crash landing on an alien ocean world, the only way to go is down. Subnautica's oceans range from sun drenched shallow coral reefs to treacherous deep-sea trenches. Manage your oxygen supply as you explore Kelp Forests, plateaus, reefs, and winding cave systems. The water teems with life: Some of it helpful, much of it harmful.\nScavenge, Craft, and Survive\n\n\n\nAfter waking up in your Life Pod, the clock is ticking to find water, food, and to develop the equipment you need to explore. Collect resources from the ocean around you. Craft knives, lights, diving gear and personal water craft. Venture deeper and further form to find rarer resources, allowing you to craft more advanced items.\nConstruct Underwater Habitats\n\n\n\nBuild bases on the sea floor. Choose layouts and components, and manage hull-integrity as depth and pressure increase. Use your base to store resources, park vehicles, and replenish oxygen supplies as you explore the vast ocean.\nDisrupt the Food Chain\n\n\n\nThe ocean teems with life: Use the ecosystem to help you. Lure and distract a threatening creature with a fresh fish, or simply swim as fast as you can to avoid gnashing jaws of roaming predators","torrent":{"xt":"urn:btih:92d94b1e43360f4b89f7a71d95b1bf692e6d3fdb","amp;dn":"Subnautica+-+Beta+1950","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d94b1e43360f4b89f7a71d95b1bf692e6d3fdb","infoHashBuffer":{"type":"Buffer","data":[146,217,75,30,67,54,15,75,137,247,167,29,149,177,191,105,46,109,63,219]},"announce":[],"urlList":[]}}