{"title":"Behind The Green Mask: UN Agenda 21 - Rosa Koire","uid":11715584,"size":2375650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9305f54529f09c61197e19b60c4fb2ed1b5099ea&amp;dn=Behind+The+Green+Mask%3A+UN+Agenda+21+-+Rosa+Koire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1424555463,"description":"\nIf you've been wanting an interesting, clearly written, how-to-manual for identifying and fighting UN Agenda 21, here it is. Agenda 21--All the information you need to understand what is happening in your town, why it's happening, who is behind it, and what you can do to stop it. BEHIND THE GREEN MASK: U.N. Agenda 21 is 172 pages of truth. Part history, part current events, part hand-to-hand combat, and part blueprint for keeping your freedom, this is one book that you'll put to work immediately. Boots on the ground and all hands on deck is the order of the day. Awareness is the first step in the Resistance.\n\nAbout the author:\n Rosa Koire, ASA, is the executive director of the Post Sustainability Institute. She is a forensic commercial real estate appraiser specializing in eminent domain valuation. Her nearly 30 years of experience analyzing land use and property value enabled her to recognize the planning revolution sweeping the country. While fighting to stop a huge redevelopment project in her city she researched the corporate, political, and financial interests behind it and found UN Agenda 21. Impacting every aspect of our lives, UN Agenda 21/Sustainable Development is a corporate manipulation using the Green Mask of environmental concern to forward a globalist plan. Rosa speaks across the nation and is a regular blogger on her website Democrats Against UN Agenda 21 dot com","torrent":{"xt":"urn:btih:9305f54529f09c61197e19b60c4fb2ed1b5099ea","amp;dn":"Behind+The+Green+Mask%3A+UN+Agenda+21+-+Rosa+Koire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9305f54529f09c61197e19b60c4fb2ed1b5099ea","infoHashBuffer":{"type":"Buffer","data":[147,5,245,69,41,240,156,97,25,126,25,182,12,79,178,237,27,80,153,234]},"announce":[],"urlList":[]}}