{"title":"The Beatles - Dont Let Me Down [original promo].VOB","uid":10394928,"size":114075648,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:932b84354b8a84dd068d941008aece6f92761d65&amp;dn=The+Beatles+-+Dont+Let+Me+Down+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1403256277,"description":"The Beatles - Dont Let Me Down [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Don't Let Me Down&quot; is a song by the Beatles (with Billy Preston), recorded in 1969 during the Let It Be sessions. It was written by John Lennon and credited to Lennon and McCartney.\n\nWritten by Lennon as an anguished love song to Yoko Ono, Paul McCartney interpreted it as a &quot;genuine plea&quot;, with Lennon saying to Ono, &quot;I'm really stepping out of line on this one. I'm really just letting my vulnerability be seen, so you must not let me down.&quot; Lennon's vocals work their way into screams, presaging the primal scream stylings of the following year's John Lennon/Plastic Ono Band album.\n\nMultiple versions of &quot;Don't Let Me Down&quot; were recorded by the Beatles during the tumultuous Get Back (Let It Be) recording sessions. The version recorded on 28 January 1969 was released as a B-side to the single &quot;Get Back&quot;, recorded the same day. &quot;Get Back&quot; reached number one and &quot;Don't Let Me Down&quot; reached number thirty five on the US Billboard Hot 100.\n\nThey performed &quot;Don't Let Me Down&quot; twice during their rooftop concert of 30 January 1969, one of which was included in the Let It Be film, directed by Michael Lindsay-Hogg. When the &quot;Get Back&quot; project was revisited, Phil Spector dropped &quot;Don't Let Me Down&quot; from the Let It Be album.\n\nRichie Unterberger of Allmusic called it &quot;one of the Beatles' most powerful love songs&quot;,[11] and Roy Carr and Tony Tyler called it &quot;a superb sobber from misery-expert J. W. O. Lennon, MBE. And still one of the most highly underrated Beatle underbellies.&quot;\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Don't_Let_Me_Down_(Beatles_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Don't_Let_Me_Down_(Beatles_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/AAoFIaAFn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAoFIaAFn&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:03:21\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:932b84354b8a84dd068d941008aece6f92761d65","amp;dn":"The+Beatles+-+Dont+Let+Me+Down+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932b84354b8a84dd068d941008aece6f92761d65","infoHashBuffer":{"type":"Buffer","data":[147,43,132,53,75,138,132,221,6,141,148,16,8,174,206,111,146,118,29,101]},"announce":[],"urlList":[]}}