{"title":"The God Argument - The Case Against Religion And For Humanism By","uid":9727121,"size":3481258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:936ac6415f162e8d2e9caa9b87c04a03f3dcf55b&amp;dn=The+God+Argument+-+The+Case+Against+Religion+And+For+Humanism+By&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1394308454,"description":"Paperback: 288 pages\nPublisher: Bloomsbury USA (March 4, 2014)\nLanguage: English\nISBN-10: 1620401924\nISBN-13: 978-1620401927\n\nExamining all the arguments for and against religion and religious belief--across the range of reasons and motives that people have for being religious and how they stand up to scrutiny--The God Argument is a landmark book in the ongoing debate about the place of religion and secularism in our world. \n\nWhile A. C. Grayling is a clear critic of religion as a guiding force, unlike some of religion's opponents, he carefully considers the various arguments for the existence of God and the many reasons people believe in a deity. More important, he then offers a powerful alternative to religion as a world-view--humanism--an approach to life for those who wish to live with intellectual integrity, based on reason, evidence, and a desire to do and be good, and one which does not interfere with people's rights to their own beliefs and freedom of expression.\n\nHumanism, as Grayling reveals it, is an ethics of sympathy and tolerance based on the best endeavor to make sense of human nature and the human condition. Though humanism recognizes why the various faiths first arose, it nevertheless argues that organized religion should no longer be given a privileged position in society. \n\nThoughtfully provocative, intellectually expansive, The God Argument makes a powerful case that secular belief, free of religious dogma, allows for a much more compassionate and caring worldview.\n\nAbout the Author\nA.C. Grayling is professor of philosophy and master of the New College of the Humanities, London. He is the author of the acclaimed Among the Dead Cities: The History and Moral Legacy of the WWII Bombing of Civilians in Germany and Japan, Descartes: The Life and Times of a Genius, Toward the Light of Liberty: The Struggles for Freedom and Rights That Made the Modern Western World, and, most recently, The Good Book: A Humanist Bible. A former fellow of the World Economic Forum at Davos and past chairman of the human rights organization June Fourth, he contributes frequently to the Times, Financial Times, the Economist, New Statesman, and Prospect. Grayling's play Grace, co-written with Mick Gordon, was acclaimed in London and New York. He lives in London.","torrent":{"xt":"urn:btih:936ac6415f162e8d2e9caa9b87c04a03f3dcf55b","amp;dn":"The+God+Argument+-+The+Case+Against+Religion+And+For+Humanism+By","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"936ac6415f162e8d2e9caa9b87c04a03f3dcf55b","infoHashBuffer":{"type":"Buffer","data":[147,106,198,65,95,22,46,141,46,156,170,155,135,192,74,3,243,220,245,91]},"announce":[],"urlList":[]}}