{"title":"Steampunk! An Anthology of Fantastically Rich and Strange Storie","uid":15485725,"size":552606857,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:93d1077bbc6e8db9a858310f6e1690c47f030bf8&amp;dn=Steampunk%21+An+Anthology+of+Fantastically+Rich+and+Strange+Storie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Laverna","files":11,"time":1470319427,"description":"Steampunk! An Anthology of Fantastically Rich and Strange Stories - Kelly Link\r\n\r\nImagine an alternate universe where romance and technology reign. Where tinkerers and dreamers craft and re-craft a world of automatons, ornate clockworks, calculating machines, and other marvels that never were. Where scientists and schoolgirls, fair folk and Romans, intergalactic bandits, Utopian revolutionaries, and intrepid orphans — decked out in corsets, clockwerk suits, and tall black boots — solve dastardly crimes, escape from monstrous predicaments, consult oracles, and hover over volcanoes in steam-powered airships.\r\n\r\nHere, in the first major steampunk anthology for young adults, fourteen masters of speculative fiction, including two graphic storytellers, embrace the genre’s established blend of sci-fi and fantasy, action and adventure, history and romance, and refashion it in surprising ways and in settings as diverse as Canada, New Zealand, Appalachia, Wales, ancient Rome, future Australia, and alternate California. Visionaries Link and Grant have invited all-new interpretations, explorations, and expansions, taking a genre already rich, strange, and inventive in the extreme and challenging contributors to remake it from the ground up. The result is an anthology that defies even as it defines the genre. With fantastically strange stories by M. T. Anderson, Holly Black, Libba Bray, Shawn Cheng, Cassandra Clare, Cory Doctorow, Dylan Horrocks, Kathleen Jennings, Elizabeth Knox, Kelly Link, Garth Nix, Christopher Rowe, Delia Sherman, and Ysabeau S. Wilce.\r\n\r\nRead by Sarah Coomes, Nico Evers-Swindell, Shannon McManus, Arthur Morey\r\nFormat: MP3\r\nBitrate: 96 Kbps\r\nLength: 12 hrs and 46 mins\r\nUnabridged Audiobook\r\nRelease Date:10-12-11","torrent":{"xt":"urn:btih:93d1077bbc6e8db9a858310f6e1690c47f030bf8","amp;dn":"Steampunk%21+An+Anthology+of+Fantastically+Rich+and+Strange+Storie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93d1077bbc6e8db9a858310f6e1690c47f030bf8","infoHashBuffer":{"type":"Buffer","data":[147,209,7,123,188,110,141,185,168,88,49,15,110,22,144,196,127,3,11,248]},"announce":[],"urlList":[]}}