{"title":"Eat Yourself Beautiful - Supercharged Food (gnv64)","uid":10100245,"size":41230583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9461c86928d35f4a63212395468347296a1f0d00&amp;dn=Eat+Yourself+Beautiful+-+Supercharged+Food+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":-1,"time":1399384925,"description":"Eat Yourself Beautiful - Supercharged Food\nby Lee Holmes\nMurdoch Books | February 2014 | ISBN 9781743369609 | ePUB | 175 pages | 39.3 mb\n\nEat Yourself Beautiful is a guide to achieving inner and outer health and ageless beauty through simple, delicious recipes using nutritionally rich, anti- inflammatory 'super' foods. Many of the dishes in this inspiring and practical book are gluten, wheat, yeast and sugar-free, individually identified by at-a- glance icons. Also included are beauty-friendly menu plans and shopping lists; advice on what foods to avoid; how to detox; and advice on identifying hidden food sensitivities, allergies and inflammation.\nRecipes range from super smoothies and health drinks (including 'The fountain of youth' and Complexion blend tea) to delectable breakfast treats such as Quirky quinoa muffins and Almond and apple pancakes. Lighter options include energy snacks such as Tamari nibble mix and summery salads including Spinach, almond and strawberry as well as a range of warming soups. Lunch and dinner are covered, too, with frittatas, pizzas and pasta dishes, stir-fries and curries. Desserts to eat in the name of beauty include Foolish fudge brownies, Raspberry-studded pumpkin pie and Healthy carrot cake.\n\nAbout the Author\nAuthor Lee Holmes discovered supercharged foods after she was diagnosed with an autoimmune disease in 2006. Eager to find a drug-free solution, she became a keen food and health researcher and developed a diet regime that led to her full recovery. Lee is a regular columnist for WellBeing magazine and a writer for Miranda Kerr's Kora Organics blog. She is also the author of the highly successful Supercharged Food and the popular website www.superchargedfood.com \n\nCONTENTS\nCover\nDedication\nTitle\nIntroduction\nsuper smoothies and drinks\nbreakfast\nsnacks, sides and basics\nsoups and salads\nlunch\ndinner\ndesserts and baking\nindex\nacknowledgements\nCopyright","torrent":{"xt":"urn:btih:9461c86928d35f4a63212395468347296a1f0d00","amp;dn":"Eat+Yourself+Beautiful+-+Supercharged+Food+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9461c86928d35f4a63212395468347296a1f0d00","infoHashBuffer":{"type":"Buffer","data":[148,97,200,105,40,211,95,74,99,33,35,149,70,131,71,41,106,31,13,0]},"announce":[],"urlList":[]}}