{"title":"Superman - The Man Of Steel 01-06 (1986|Digital|TLK-Empire)","uid":10012100,"size":102402088,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:94e0b3eb6e2542bdcc73f6d83834173dbb9d8ca9&amp;dn=Superman+-+The+Man+Of+Steel+01-06+%281986%7CDigital%7CTLK-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"VikTSlick","files":6,"time":1398114041,"description":"John Byrne's awesome re-invention of Superman as a more toned-down character was controversial at the time of publication, and indeed he quit the various Superman titles soon afterwards because of lack of support from DC editorial. DC didn't use this version in promo materials and the like and it seemed like they tried to distance themselves from this newer, more fragile hero. However, ironically enough, as time has passed nearly all of Byrne's vision has come to fruition. And the work itself is a terrific read, a completely modern (at the time) new take on the Man of Steel's origins after the continuity reboot in 1985's Crisis On Infinite Earths with wonderful art by Dick Giordano. Promotional info for the collected edition - &quot;In 1986, John Byrne was recruited from Marvel Comics to reinvent Superman for a brand-new audience. Along with inker Dick Giordano, Byrne reimagined the look of Superman, Lois Lane, Krypton and Lex Luthor.\nThe relationships between Superman and Lois, Superman and Batman, and Superman and Luthor were reexamined and tweaked for modern readers. Old villains such as Bizarro returned and new ones, such as Magpie, were introduced.\n\nIt was the dawn of a new age for the Man of Steel that endures today. See how it all began in this collection of the first six stories. Includes a foreword by Ray Bradbury.&quot;\n\nThis is all six issues of the character-defining miniseries, in digital format thanks to Tyrant Lizard King-Empire. There is a one-volume edition that collects the entire mini into a single TPB and it is also digital and HD; however I prefer the single issues whenever possible in general, and it is a bit more space-friendly in terms of MB used. Also, these have not been torrented yet aside from the weeklies, so I'm putting them up in case anyone is interested in reading this great series in digital. THanks to TLK-Empire for their efforts, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:94e0b3eb6e2542bdcc73f6d83834173dbb9d8ca9","amp;dn":"Superman+-+The+Man+Of+Steel+01-06+%281986%7CDigital%7CTLK-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94e0b3eb6e2542bdcc73f6d83834173dbb9d8ca9","infoHashBuffer":{"type":"Buffer","data":[148,224,179,235,110,37,66,189,204,115,246,216,56,52,23,61,187,157,140,169]},"announce":[],"urlList":[]}}