{"title":"Beyond Basic Bluegrass Rhythm Guitar (with TAB)","uid":6095558,"size":666480049,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:951f4d1f2b140d2255c079528175e281841c98ba&amp;dn=Beyond+Basic+Bluegrass+Rhythm+Guitar+%28with+TAB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"fiddletune","files":3,"time":1294756575,"description":"Beyond Basic Bluegrass Rhythm Guitar (with TAB)\n\nLearn to back up bluegrass songs, fiddle tunes, contest pieces and Texas swing standards like a pro! Master flatpicker and teacher Steve Kaufman takes rhythm playing to a whole new level with this in-depth lesson, specially formulated for players who want to go beyond the basics.\n\nSteve passes along a complete understanding of great rhythm technique as he builds your skills through exercises and play-along sessions. You'll develop &quot;muscle memory&quot; to get to difficult chords quickly, learn percussive pick strokes, develop your ear for filling out back-up parts, and grasp how it all fits together to create solid bluegrass rhythm guitar.\n\nThis DVD is packed with powerful ideas and challenging tunes that will help you develop exactly the right feel for the music you are accompanying. Steve guides you through walking bass lines, chord progressions, substitutions, complex chord shapes and rich accompaniment ideas for a variety of tunes, including Little Rock Getaway, Wayfaring Stranger, St. Anne's Reel, Kentucky Waltz, Sweet Georgia Brown, Alabama Jubilee and Sally Goodin.","torrent":{"xt":"urn:btih:951f4d1f2b140d2255c079528175e281841c98ba","amp;dn":"Beyond+Basic+Bluegrass+Rhythm+Guitar+%28with+TAB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"951f4d1f2b140d2255c079528175e281841c98ba","infoHashBuffer":{"type":"Buffer","data":[149,31,77,31,43,20,13,34,85,192,121,82,129,117,226,129,132,28,152,186]},"announce":[],"urlList":[]}}