{"title":"BBS.The.Documentary.dvdrip-INFOFALLOUT","uid":3535883,"size":2468950785,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:964ffb5c773c4bbe0ae9a1f83d7f8ef096170c41&amp;dn=BBS.The.Documentary.dvdrip-INFOFALLOUT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"tajisen","files":16,"time":1160331487,"description":"- AN INFOFALLOUT RELEASE -                                                                                       \n====================================================================================================\n===============================IN ASSOCIATION WITH THE DOCUMENTARY ARCHIVE==========================\n====================================================================================================\n=============TITLE: BBS: The Documentary                              =============                                                                              \n=============SOURCE:                         DVD ======RIPPER: Acey the Sexiest Hippie =============\n=============CODEC:                   XviD 1.0.3 ======RLS DATE:             6/12/2005 =============\n=============RELATED URL: http://www.bbsdocumentary.com/                               =============\n====================================================================================================\n======================================RELEASE NOTES/DESCRIPTION:====================================\n\nLong before the Internet escaped from the lab, connecting the planet and redefining what it meant to\nmeant to be a computer user... \n\n...there was a brave and pioneering band of hobbyists who spent their time, money and sanity setting\nup their home computers and phone lines to welcome anyone who called. By using a modem, anyone who \nknew the phone number of these machines could connect to them, leave messages, play games, send and \nreceive files in a virtual community... and millions did. \n\nThey called these places &quot;Bulletin Board Systems&quot;, or BBSes. Their collections of messages, rants\nthoughts and dreams became the way that an entire generation learned about being online. \n\nWhen the Internet grew in popularity in the early 1990s, the world of the BBS faded, changed, and\nbecame a part of the present networked world -- but it wasn&amp;#039;t the same. \n\nIn the Summer of 2001, Jason Scott, a computer historian and proprietor of the textfiles.com, \nnoticed the lack of materials covering the history of these BBSes. So, he took it upon himself to\nproduce what turned out to be one of the most comprehensive histories on the subject.\n\nFour years, thousands of miles of travelling, and over 200 interviews later, &quot;BBS: The Documentary&quot;,\na series of 8 episodes about the history of the BBS, is now available. Spanning 3 DVDs and totalling \nfive and a half hours, this documentary consists of eight episodes each covering different aspects \nof this important story in the annals of computer history.\n\nIdeal as either a teaching tool or a reminder of things past, the BBS Documentary Collection brings \nback this nearly-forgotten time in a way that will tell the story... one caller at a time. \n\n====================================DESCRIPTIONS OF THE EPISODES===================================\nBaud introduces the story of the beginning of the BBS, including interviews with Ward Christensen \nand Randy Suess, who used a snowstorm as an inspiration to change the world. \n\nSysops and Users introduces the stories of the people who used BBSes, and lets them tell their own\nstories of living in this new world. \n\nMake it Pay covers the BBS industry that rose in the 1980&amp;#039;s and grew to fantastic heights before\ndisappearing almost overnight. \n\nFidonet covers the largest volunteer-run computer network in history, and the people who made it a\njoy and a political nightmare. \n\nArtscene tells the rarely-heard history of the ANSI Art Scene that thrived in the BBS world, where\nart was currency and battles waged over nothing more than pure talent. \n\nHPAC (Hacking Phreaking Anarchy Cracking) hears from some of the users of &quot;underground&quot; BBSes and\ntheir unique view of the world of information and computers. \n\nNo Carrier wishes a fond farewell to the dial-up BBS and its integration into the Internet. \n\nCompression tells the story of the PKWARE/SEA legal battle of the late 1980s and how a fight that\nbroke out over something as simple as data compression resulted in waylaid lives and lost opportunity.","torrent":{"xt":"urn:btih:964ffb5c773c4bbe0ae9a1f83d7f8ef096170c41","amp;dn":"BBS.The.Documentary.dvdrip-INFOFALLOUT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"964ffb5c773c4bbe0ae9a1f83d7f8ef096170c41","infoHashBuffer":{"type":"Buffer","data":[150,79,251,92,119,60,75,190,10,233,161,248,61,127,142,240,150,23,12,65]},"announce":[],"urlList":[]}}