{"title":"Paul McCartney - All The Best [1987][320 KBPS]","uid":9398393,"size":176485699,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9686ef3fcca8fb0b5e65b61728d7e689cde2ddcf&amp;dn=Paul+McCartney+-+All+The+Best+%5B1987%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"LameDuck69","files":22,"time":1388019946,"description":"Paul McCartney - All The Best [1987]\n\n\n\n\n01. Band On The Run  \n02. Jet  \n03. Ebony And Ivory  \n04. Listen To What The Man Said  \n05. No More Lonely Nights  \n06. Silly Love Songs  \n07. Let 'Em In  \n08. Say Say Say  \n09. Live And Let Die  \n10. Another Day  \n11. C Moon  \n12. Junior's Farm  \n13. Uncle Albert/Admiral Halsey  \n14. Coming Up  \n15. Goodnight Tonight  \n16. With A Little Luck  \n17. My Love  \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nSir James Paul McCartney, MBE (born 18 June 1942) is an English musician, singer, songwriter, multi-instrumentalist and composer. With John Lennon, George Harrison and Ringo Starr, he gained worldwide fame as a member of the Beatles, and his songwriting partnership with Lennon is one of the most celebrated of the 20th century. After the band's break-up, he pursued a solo career, and later formed Wings with his first wife, Linda, and Denny Laine.\n\nGuinness World Records described McCartney as the &quot;most successful composer and recording artist of all time&quot;, with 60 gold discs and sales of over 100 million albums and 100 million singles, and as the &quot;most successful songwriter&quot; in United Kingdom chart history.[1] More than 2,200 artists have covered his Beatles song &quot;Yesterday&quot;, more than any other song in history. Wings' 1977 release &quot;Mull of Kintyre&quot; is one of the all-time best-selling singles in the UK. Inducted into the Rock and Roll Hall of Fame as a solo artist in March 1999, McCartney has written, or co-written 32 songs that have reached number one on the Billboard Hot 100, and as of 2013[update] he has sold over 15.5 million RIAA-certified units in the United States. McCartney, Lennon, Harrison and Starr received MBEs in 1965, and in 1997, McCartney was knighted for his services to music.\n\nMcCartney has released an extensive catalogue of songs as a solo artist and has composed classical and electronic music. He has taken part in projects to promote international charities related to such subjects as animal rights, seal hunting, landmines, vegetarianism, poverty, and music education. He has married three times and is the parent of five children.\n\n-----------------------------------------------------------------------------------\n\nAll the Best! is the second official compilation album of Paul McCartney music, after 1978's Wings Greatest, and was released in 1987. The album contains tracks from the beginning of his solo career in 1970 up to (on British and Canadian editions) the newly recorded &quot;Once Upon a Long Ago.&quot; The track inclusion and running order varies slightly between UK and US editions of All the Best! to reflect the popularity of particular songs in each country. CD and vinyl versions of the British edition also vary, as the time constraints of a single compact disc versus a double-vinyl album led to the elimination of three cuts on the British CD edition.\n\nReleased just as McCartney was beginning work on his next major studio album, All the Best! was a big success, reaching number 2 in the UK (being kept off number one by George Michael's debut solo album Faith) and although it peaked at number 62 in the US, it eventually went double platinum there.\n\n","torrent":{"xt":"urn:btih:9686ef3fcca8fb0b5e65b61728d7e689cde2ddcf","amp;dn":"Paul+McCartney+-+All+The+Best+%5B1987%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9686ef3fcca8fb0b5e65b61728d7e689cde2ddcf","infoHashBuffer":{"type":"Buffer","data":[150,134,239,63,204,168,251,11,94,101,182,23,40,215,230,137,205,226,221,207]},"announce":[],"urlList":[]}}