{"title":"Beloe solntse pustyni aka White Sun of the Desert","uid":5177968,"size":1860614454,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96892b52df9d8ef411fe21b6ebc95829bf3ab690&amp;dn=Beloe+solntse+pustyni+aka+White+Sun+of+the+Desert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1259080828,"description":"Vladimir Motyl - Beloe solntse pustyni aka White Sun of the Desert (1970)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066565&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066565&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51TNJ1VQ0DL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51TNJ1VQ0DL._SS500_.jpg&lt;/a&gt;\n\nAmong Soviet movies there are more expensive (Bondarchuk's War and Peace) and more intellectual (Sokurov, Tarkovsky), but The White Sun of the Desert remains the best known and the most popular Russian film ever made. If you ask people (especially men) who were born and raised in the former Soviet Union, you will be convinced by their enthusiastic response and expression of love for this movie. It is rare indeed for a work of art to elicit such a uniform and unconditional admiration, and there must be something about this film which deserves such a reaction from several hundred million people.\n\nThere is a lot of myths and legends surrounding the creation of this film.\nOne legend (which is probably true) has it that, after the movie was made, it was censored and &quot;put on the shelf&quot; never to be seen again. Then, one dark and stormy night, there was a call to the State Film Archives from Brezhnev's dacha (suburban mansion). They were asking for something new for the &quot;big boss&quot; to watch. The clerk on duty, scared out of his wits, picked up a reel-box and sent it with the awaiting car. Brezhnev (who was not senile yet) liked the movie and asked why it has not been released. The rest is history.\n\nThe timeless appeal of this movie, as any other true work of art, is that you can watch it time after time, never tire of it, and find something new and interesting about it. Every kind of viewer will find something to like about this film: excellent direction, good actor's work, well-developed characters, unusual plot line, and a lot of action. And the best of all: it is based on the true events.\nThe original intent of the movie was to shoot another action flick about the Red Army fighting anti-soviet bands in the Middle Asia after the Civil War. Another legend has it that when one of the old Red Army soldiers who participated in actual fighting was asked by the script-writer and director about the difficulties of the time, he thought about it for a while and then said that the most difficult question was what to do with all those women coming from harems of bandits who were either killed or in hiding. That created the wonderful story line of the movie. \n\n   ----------\n\nThis is a Russian classic worth checking out if your are interesting in having a knowledge of world cinema, or a must-see if you are an educated action-film fan. It is reportedly watched by Russian cosmonauts before every space launch. It is also considered the most memorable of the &quot;Ostern&quot; sub-genre of action films.\n\nOsterns were action flics set in Central Asia during the 1920s (or as late as the 30s), during or after the period of the Russian Civil War, when the Soviets reconquered the Turkic and Mongol peoples who had regained some autonomy during the chaos of the Bolshevik Revolution.\n\nThe White Sun of the Desert has all the political sensitivity of a 1930s Western, but it is still widely revered in Russia (perhaps that says something about the people, I won't speculate). Apparently the lines in this film are as allegorical to modern Russian dialogue as those of The Wizard of Oz are to American vernacular. While most of that sarcasm and culturally classic dialogue flew right over my head in the subtitles (if they even made it into the translation), its still a fun enough film to watch just on its more basic merits. The story is simple, the costumes comfortable, the locale exotic and interesting, and much of the sarcasm translates visually. \n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-19.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-19.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-18.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-18.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-18.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-18.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-16.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-16.png&lt;/a&gt;\n\n-----------my rip-----------\n\n~~~~~~ Beloe solntse pustyni.avi ~~~~~~                                     \n\n                                                               \n\nFile Size (in bytes):...........................1,186,381,824                     \n\n                                                                                \n\n--- Video Information ---                                                       \n\nVideo Codec Name:...............................XviD ISO MPEG-4              \n\nDuration (hh:mm:ss):............................1:20:10                \n\nFrame Count:....................................120226             \n\nFrame Width (pixels):...........................640                  \n\nFrame Height (pixels):..........................480                  \n\nAspect Ratio:...................................1.333                     \n\nFrames Per Second:..............................25.000          \n\nVideo Bitrate (kbps):...........................1835                 \n\n......MPEG-4......B-VOP........................                    \n\nQuality Factor (bits/pixel)/frame:..............0.239&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \n\nAudio Sample Rate (Hz):.........................48000             \n\nAudio Bitrate(kbps):............................128                 \n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \n\nAudio Channel Count:............................2           \n\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE \n\n","torrent":{"xt":"urn:btih:96892b52df9d8ef411fe21b6ebc95829bf3ab690","amp;dn":"Beloe+solntse+pustyni+aka+White+Sun+of+the+Desert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96892b52df9d8ef411fe21b6ebc95829bf3ab690","infoHashBuffer":{"type":"Buffer","data":[150,137,43,82,223,157,142,244,17,254,33,182,235,201,88,41,191,58,182,144]},"announce":[],"urlList":[]}}