{"title":"Greek Season 1 and 2 Full","uid":4977443,"size":15792361696,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:96921595514996da6b86fc27b6f38bbab5c8c89b&amp;dn=Greek+Season+1+and+2+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":9,"uploader":"daeni","files":43,"time":1246074205,"description":"College. It's a rush. \n\nA Freshman arrives at his sisters college (much to her dismay). He decides to pledge a fraternity on campus. After catching his sister's boyfriend with another girl, he ends up at his rival fraternity trying to go from geek to Greek and grow up in the process.  Written by gatetraveler\n\nRusty Cartwright arrives on the campus of Cyprus-Rhodes University, much to the dismay of big sister Casey. Rusty finds that his sister neglected to mention having a brother. Evan offers Rusty a spot in the Omega Chi Delta fraternity, as long as he does not tell Casey about him sleeping with Rebecca Logan (a pledge at the sorority rush who was heavily courted as she was a senators daughter). Rusty tells Casey and ends up accepting an offer from Kappa Tau Gamma president Cappie. Rusty must deal with his own life and relationships and his new relationship with Casey. Casey now has to decide between stable Evan or fun-loving Cappie whom she really loves. Written by gatetraveler\n\nFreshman Rusty arrives at college and decides he no longer wants to be the boring geek from high school. Now he must deal with his sister, sorority girl Casey, who denies his existence, Evan, his sister's boyfriend who denied him a bid to his fraternity because he told Casey about his infidelity, Dale his uptight roommate who thinks Greeks are only about drinking and fornication, and Calvin and his new friend who is in Evan's fraternity and having trouble dealing with his homosexuality. Written by Gatetraveler \n\n// IMDB","torrent":{"xt":"urn:btih:96921595514996da6b86fc27b6f38bbab5c8c89b","amp;dn":"Greek+Season+1+and+2+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96921595514996da6b86fc27b6f38bbab5c8c89b","infoHashBuffer":{"type":"Buffer","data":[150,146,21,149,81,73,150,218,107,134,252,39,182,243,139,186,181,200,200,155]},"announce":[],"urlList":[]}}