{"title":"Medical Nutrition Therapy (4th Ed)(gnv64)","uid":9384966,"size":34354420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:969ca946968c2af295198d1a2a1ed364fd6cc923&amp;dn=Medical+Nutrition+Therapy+%284th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gnv65","files":-1,"time":1387787593,"description":"Medical Nutrition Therapy - A Case Study Approach (4th Ed)\nby Marcia Nelms and Sara Long Roth\nCengage Learning | May 2013 | ISBN-10: 1133593151 | True PDF | 456 pages | 32.7 mb\n\nBuilding a bridge from classroom to clinical practice, this casebook is composed of 34 realistic case studies appropriate for introductory and advanced level courses in nutrition and diet therapy. Each case study uses the medical record as its structure. The student &quot;solves the case&quot; by using the information provided such as hospital admission data, laboratory test results, intake/output records, and the physician's progress notes. The case is followed by a series of questions that focus on pathophysiology; assessment; clinical, nutritional and behavioral outcomes; interventions; and appropriate follow-up for the patient. This &quot;real world&quot; approach helps to prepare the student for the professional setting. Objectives for student learning within each case are built around the nutrition care process and competencies for dietetic education.\n\nAbout the Authors\nDr. Nahikian-Nelms is currently a professor of clinical health and rehabilitation sciences and director of the dietetic internship in the Division of Medical Dietetics at The Ohio State University. She has practiced as a dietitian and public health nutritionist for over 25 years. She is the lead author for the textbooks: Nutrition Therapy and Pathophysiology, Medical Nutrition Therapy: A Case Study Approach and Food and Culture.\nSARA LONG ROTH, PhD, RD, is Professor in the Department of Animal Science, Food and Nutrition and Director, Didactic Program in Dietetics at Southern Illinois University Carbondale. Prior to obtaining her PhD in health education, she practiced as a clinical dietitian for 11 years. Dr. Long is coauthor of Understanding Nutrition Therapy and Pathophysiology, Medical Nutrition Therapy: A Case Study Approach, Foundations and Clinical Applications of Nutrition: A Nursing Approach, and Essentials of Nutrition and Diet Therapy. \n\nCONTENTS\nPreface xi\nAcknowledgments xv\nAbout the Authors xvii\nIntroducing Case Studies, or Finding Your Way Through a Case Study xix\nUnit One - ENERGY BALANCE AND BODY WEIGHT 1\nUnit Two - NUTRITION THERAPY FOR CARDIOVASCULAR DISORDERS 33\nUnit Three - NUTRITION THERAPY FOR UPPER GASTROINTESTINAL DISORDERS 69\nUnit Four - NUTRITION THERAPY FOR LOWER GASTROINTESTINAL DISORDERS 91\nUnit Five - NUTRITION THERAPY FOR HEPATOBILIARY AND PANCREATIC DISORDERS 127\nUnit Six - NUTRITION THERAPY FOR ENDOCRINE DISORDERS 153\nUnit Seven - NUTRITION THERAPY FOR RENAL DISORDERS 205\nUnit Eight - NUTRITION THERAPY FOR HEMATOLOGICAL DISORDERS 239\nUnit Nine - NUTRITION THERAPY FOR NEUROLOGICAL DISORDERS 265\nUnit Ten - NUTRITION THERAPY FOR PULMONARY DISORDERS 299\nUnit Eleven - NUTRITION THERAPY FOR METABOLIC STRESS AND CRITICAL ILLNESS 325\nUnit Twelve - NUTRITION THERAPY FOR NEOPLASTIC DISEASE 377\nUnit Thirteen - NUTRITION THERAPY FOR HIV/AIDS 401\nAppendices\nA Common Medical Abbreviations 413\nB Normal Values for Physical Examination 417\nC Routine Laboratory Tests with Nutritional Implications 419\nD Exchange Lists for Diabetes Meal Plan Form and Food Lists Nutrient Information 421\nIndex 423","torrent":{"xt":"urn:btih:969ca946968c2af295198d1a2a1ed364fd6cc923","amp;dn":"Medical+Nutrition+Therapy+%284th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969ca946968c2af295198d1a2a1ed364fd6cc923","infoHashBuffer":{"type":"Buffer","data":[150,156,169,70,150,140,42,242,149,25,141,26,42,30,211,100,253,108,201,35]},"announce":[],"urlList":[]}}