{"title":"Spy Game (2001) DVDRip","uid":4602729,"size":1511803281,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:97a9eef83782a8e45a232c5ceefd4694b165704f&amp;dn=Spy+Game+%282001%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"guido_r","files":6,"time":1230311340,"description":"CIA operative Nathan Muir (Redford) is on the brink of retirement when he finds out that his protege Tom Bishop (Pitt) has been arrested in China for espionage. No stranger to the machinations of the CIA's top echelon, Muir hones all his skills and irreverent manner in order to find a way to free Bishop. As he embarks on his mission to free Bishop, Muir recalls how he recruited and trained the young rookie, at that time a sergeant in Vietnam, their turbulent times together as operatives and the woman who threatened their friendship. Written by ck \n\n1991: the Cold War is ending. Just days before the US President is to visit China for trade talks, a CIA operative named Bishop is captured in a rogue operation at a Chinese prison. He'll be shot in 24 hours unless the President steps in. CIA honchos hunker down at Langley, controlling the damage to the diplomatic mission by hanging Bishop out to dry. Enter Nathan Muir, one day before retirement from the Agency, the man who recruited and trained Bishop. Can he find a way to get the President to free Bishop; if that fails, can he engineer a rescue? He hangs around Langley, telling stories about Bishop, as he gathers intelligence, looks for opportunities, and runs his own spy game.","torrent":{"xt":"urn:btih:97a9eef83782a8e45a232c5ceefd4694b165704f","amp;dn":"Spy+Game+%282001%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97a9eef83782a8e45a232c5ceefd4694b165704f","infoHashBuffer":{"type":"Buffer","data":[151,169,238,248,55,130,168,228,90,35,44,92,238,253,70,148,177,101,112,79]},"announce":[],"urlList":[]}}