{"title":"The Lean Entrepreneur: How Visionaries Create Products, Innovate","uid":8910261,"size":305231480,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97c9c9584603c08b92f8369382ee5ad0a9c71bf0&amp;dn=The+Lean+Entrepreneur%3A+How+Visionaries+Create+Products%2C+Innovate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"leopardog","files":12,"time":1379003591,"description":"The Lean Entrepreneur: How Visionaries Create Products, Innovate with New Ventures, and Disrupt Markets by Brant Cooper, Patrick Vlaskovits and Eric Ries\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/111829534X/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/111829534X/4353-20&lt;/a&gt;\n\nMP3 FORMAT\n\n    #3 The New York Times Bestseller\n    #10 The New York Times Monthly Business Bestseller \n    USA Today Bestseller \n    Amazon.com Editors' Picks for Best Books of the Month in Business and Leadership\n\nYou are not a Visionary . . . yet. The Lean Entrepreneur shows you how to become one.\n\nMost of us believe entrepreneurial visionaries are born, not made. Our media glorify business outliers like Bezos, Branson, Gates, and Jobs as heroes with X-ray vision who can look to the future, see clearly what will be, imagine a fully formed product or experience, and then simply make the vision real.\n\nMany in our entrepreneur community still believe that to be visionary, we must merely execute on a seemingly good idea and ignore all doubt. With this mindset, companies build doomed products in a vacuum; enterprises make ill-fated innovation investment decisions; and employees and shareholders come along for an uncomfortable ride.\n\nFalling prey to the Myth of the Visionary confuses talented entrepreneurs, product managers, innovators, and investors. It leads us to heartbreaking, costly, and preventable failures in new product and venture development.\n\nThe Lean Entrepreneur moves us beyond this myth. It combines powerful customer insight, rapid experimentation, and easily actionable data from the Lean Startup methodology to empower individuals, companies, and entire teams to evolve their vision, solve problems, and create value at the speed of the Internet.\n\nAnyone can be visionary. The Lean Entrepreneur shows you how to:\n\n    Apply actionable tips, tricks, and hacks from successful lean entrepreneurs\n    Leverage the Innovation Spectrum to disrupt existing markets and create new ones\n    Drive strategies for efficient market testing with Minimal Viable Products\n    Engage customers with Viability Testing and radically reduce the time and budget for product development\n    Rapidly create cross-functional innovation teams that devour roadblocks and set new benchmarks\n    Bring your organization critical focus on the power of loyal customers and valuable products you can build to serve them\n    Leverage instructive tools, skill-building exercises, and worksheets along with bonus online videos","torrent":{"xt":"urn:btih:97c9c9584603c08b92f8369382ee5ad0a9c71bf0","amp;dn":"The+Lean+Entrepreneur%3A+How+Visionaries+Create+Products%2C+Innovate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c9c9584603c08b92f8369382ee5ad0a9c71bf0","infoHashBuffer":{"type":"Buffer","data":[151,201,201,88,70,3,192,139,146,248,54,147,130,238,90,208,169,199,27,240]},"announce":[],"urlList":[]}}