{"title":"The Age of Lincoln and the Art of American Power [PDF &amp; Epub","uid":10698235,"size":6737096,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97d456c8f55c16d480b867c6848aa8d6d31bdca7&amp;dn=The+Age+of+Lincoln+and+the+Art+of+American+Power+%5BPDF+%26amp%3B+Epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"F1restorm","files":-1,"time":1407202436,"description":"The Age of Lincoln and the Art of American Power, 1848-1876\nAuthor: William Nester\nPublished: 2014\nPublisher: Potomac Books\nISBN: 9781612346588\nFormat: Retail PDF and retail epub\n_____________________________________________________________________________________\n\nAlthough Abraham Lincoln was among seven presidents who served during the tumultuous years between the end of the Mexican War and the end of the Reconstruction era, history has not been kind to the others: Zachary Taylor, Millard Fillmore, Franklin Pierce, James Buchanan, Andrew Johnson, and Ulysses S. Grant.\n\nIn contrast, history sees Abraham Lincoln as a giant in character and deeds. During his presidency, he governed brilliantly, developed the economy, liberated four million people from slavery, reunified the nation, and helped enact the Homestead Act, among other accomplishments. He proved to be not only an outstanding commander in chief but also a skilled diplomat, economist, humanist, educator, and moralist.\n\nLincoln achieved that and more because he was a master of the art of American power. He understood that the struggle for hearts and minds was the essence of politics in a democracy. He asserted power mostly by appealing to people's hopes rather than their fears. All along he tried to shape rather than reflect prevailing public opinions that differed from his own. To that end, he was brilliant at bridging the gap between progressives and conservatives by reining in the former and urging on the latter.\n\nHis art of power ultimately reflected his unswerving devotion to the Declaration of Independence's principles and the Constitution's institutions, or as he so elegantly expressed it, to a government of the people, by the people, and for the people.\n","torrent":{"xt":"urn:btih:97d456c8f55c16d480b867c6848aa8d6d31bdca7","amp;dn":"The+Age+of+Lincoln+and+the+Art+of+American+Power+%5BPDF+%26amp%3B+Epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97d456c8f55c16d480b867c6848aa8d6d31bdca7","infoHashBuffer":{"type":"Buffer","data":[151,212,86,200,245,92,22,212,128,184,103,198,132,138,168,214,211,27,220,167]},"announce":[],"urlList":[]}}