{"title":"Sapiens - Yuval Noah Harari - Audiobook - Unabridged mp3","uid":16021250,"size":881883899,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9867f6b61bf5dc68c60aac3921e1f82d5d975cf1&amp;dn=Sapiens+-+Yuval+Noah+Harari+-+Audiobook+-+Unabridged+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"OddioVizyule","files":22,"time":1476333951,"description":"Sapiens: A Brief History of Humankind - Audiobook (Unabridged mp3)\r\n\r\nBy Yuval Noah Harari\r\n\r\nRead by Derek Perkins\r\n\r\n\r\nFrom a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution. A #1 international bestseller that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be human.\r\n\r\nOne hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one remaining species - homo sapiens. What happened to the others? And what may happen to us?\r\n\r\nMost books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. From examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas.\r\n\r\nDr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become?","torrent":{"xt":"urn:btih:9867f6b61bf5dc68c60aac3921e1f82d5d975cf1","amp;dn":"Sapiens+-+Yuval+Noah+Harari+-+Audiobook+-+Unabridged+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9867f6b61bf5dc68c60aac3921e1f82d5d975cf1","infoHashBuffer":{"type":"Buffer","data":[152,103,246,182,27,245,220,104,198,10,172,57,33,225,248,45,93,151,92,241]},"announce":[],"urlList":[]}}