{"title":"Thief 3 Deadly Shadows-Razor1911","uid":3303637,"size":2187049937,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:986a7a18cfa817cea8fe743098a4e1439a352036&amp;dn=Thief+3+Deadly+Shadows-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Platus","files":151,"time":1111231105,"description":"GAME NOTES:\n  ~~~~~~~~~~    \n  You are Garrett, the master thief. Rarely seen and never caught, Garrett is\n  the best that ever was. Able to sneak past any guard, pick any lock, and\n  break into the most ingeniously secured residences. Garrett steals from the\n  wealthy and gives to himself, making his living in the dark and foreboding\n  City. Here crime and corruption are commonplace, wealthy nobles prey on the\n  poor and each other, and magic and machinery coexist uneasily. World weary\n  and cynical, Garrett wants nothing more than to be left alone to ply his\n  trade. But things never work out that way. \n  \n  According to ancient prophecies, a Dark Age is approaching. He's determined\n  to stop this darkness before it comes, before someone loses an eye...or\n  worse. \n  \n  Garrett begins a cautious collaboration with the Keepers, an enigmatic and\n  secretive group. They supply prophetic Glyphs he needs to avert the\n  approaching doom, and he supplies the raw nerve, caustic wit, and artistic\n  thievery that they lack. He sneaks his way through castles, mansions,\n  prisons, cathedrals, dungeons, and museums, past armed guards, hired muscle,\n  angry thugs, hideous monsters, and much worse. He's out to steal the\n  City's oldest treasures - treasures that can help stop the darkness\n  foretold in the prophecies.\n  \n  But things quickly go awry. Disaster looms closer with every step Garrett\n  takes. In his efforts to prevent the Dark Age, he has inadvertently roused\n  an ancient hidden evil. To make matters worse, the Keepers, sworn to protect\n  the City and maintain the balance, instead find themselves decaying from\n  their very core. In their desperate search for the One who will betray them,\n  their eyes turn to Garrett. \n  \n  Once again, Garrett finds himself without allies, standing alone between the\n  City and the forces that would crush it. Will his skills be enough to save\n  the dying City? Can he survive betrayal, assassins, and war in the\n  labyrinthine city streets? Will he destroy or be destroyed by the evil he\n  awoke? And finally, what must he do to get what he wants most of all: to be\n  left alone plying his trade as the City's greatest... Thief?\n  \n  Features: \n  - Cutting-edge Action Stealth Gameplay -- Hide in the shadows, sneak past\n    the guards, or ambush them from the darkness!\n  \n  - Huge Arsenal of Thieves' Tools -- Including lock picks, a blackjack,\n    arrows, wall climbing gloves, oil flasks, flash bombs, and a dagger.\n  \n  - An Entire City to Explore -- Break into any building, mug nobles on the\n    streets, spend your loot, and earn a reputation. Feel like a real thief in\n    a cityscape of unparalleled responsiveness and interactivity.\n  \n  - Advanced Artificial Intelligence -- AI guards that see and hear, track\n    evidence and suspiciousness, search for intruders, fight, give chase, and\n    perform lip synching, facial expressions, and hundreds of lines of\n    real-time dialog.\n  \n  - Dynamic Lighting and Shadow System -- Every character and object casts\n    realistic, dynamic shadows that effect stealth gameplay.\n\n  \n  RELEASE NOTES:\n  ~~~~~~~~~~~~~\n  The installer seems to be buggy for some.  If you get the &amp;quot;wrong volume&amp;quot;\n  error, just reinsert/remount CD1, click try again and you should be good\n  to go.\n\n\n  INSTALLATION NOTES:\n  ~~~~~~~~~~~~~~~~~~\n  Extract, mount/burn the bins/cues, install, copy crack over from CD3, play\n  &amp;amp;amp; enjoy!\n\n\n  GROUP GREETS:\n  ~~~~~~~~~~~~\n  To the honorable competition...\n\n                                      /\n                        Razor 1911   /__   Since 1985\n                                    /  /\n                                   /__/__\n\n              SUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\n     IF YOU ENJOYED THIS PRODUCT, BUY IT!  SOFTWARE AUTHORS DESERVE SUPPORT!!\n\nGLÃ–M INTE ATT SEEDA SÃ… MYCKET NI KAN NÃ„R .TORRENTEN Ã„R NERLADDAD! TACK","torrent":{"xt":"urn:btih:986a7a18cfa817cea8fe743098a4e1439a352036","amp;dn":"Thief+3+Deadly+Shadows-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986a7a18cfa817cea8fe743098a4e1439a352036","infoHashBuffer":{"type":"Buffer","data":[152,106,122,24,207,168,23,206,168,254,116,48,152,164,225,67,154,53,32,54]},"announce":[],"urlList":[]}}