{"title":"PC - Cuban Missile Crisis The Aftermath [English]","uid":3424255,"size":1602132918,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9872ab0379c91b78a60b8985a66c921e87f28ebe&amp;dn=PC+-+Cuban+Missile+Crisis+The+Aftermath+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"changoboy","files":113,"time":1135542599,"description":"Cuban Missile Crisis: The Aftermath thrusts players into a world ravaged by the military-political confrontation between the USA and USSR in 1962. The game offers a different interpretation of the events that followed the famous global standoff over the small island nation. In Cuban Missile Crisis: The Aftermath, the two cold-war powerhouse nations unleash their nuclear arsenal on the world, leveling Cuba and turning it, along with the majority of the world, into a radioactive desert. The remaining world citizens thus find themselves in a war fighting for their very survival... Cuban Missile Crisis: The Aftermath is a real-time strategy game combined with a turn-based global strategy mode, forcing players to use tactical troop movements while managing their resources and armies. With all the gameplay one has come to expect from the Blitzkrieg engine, gamers that enjoyed such games as &quot;Sudden Strike&quot; and &quot;Blitzkrieg&quot; are going to jump right into this title. In Cuban Missile Crisis: The Aftermath,?not only will players be able to enjoy all their familiar tactics, they will be introduced to way more metal as they field post WWII armaments and weapons of mass destruction.","torrent":{"xt":"urn:btih:9872ab0379c91b78a60b8985a66c921e87f28ebe","amp;dn":"PC+-+Cuban+Missile+Crisis+The+Aftermath+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9872ab0379c91b78a60b8985a66c921e87f28ebe","infoHashBuffer":{"type":"Buffer","data":[152,114,171,3,121,201,27,120,166,11,137,133,166,108,146,30,135,242,142,190]},"announce":[],"urlList":[]}}