{"title":"Manjhi.(2015)-DVD.Rip.-HEVC-1CD-DDR","uid":12616913,"size":732339784,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:994ee9bc5ce02e373c2bb0e2b54ddd5471528b97&amp;dn=Manjhi.%282015%29-DVD.Rip.-HEVC-1CD-DDR+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"SaM","files":1,"time":1445531279,"description":"DDR Presents\r\n\r\n\r\nManjhi-The Mountain Man(2015)\r\n(A film by Ketan Mehta)\r\n\r\nHindi - DVD rip - 720x304p (2.35:1)- 698 MB - x.265.AAC (Dolby-II) - 1 Hrs:59 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/UOG \nhttp://extraimago.com/image/UOY \nhttp://extraimago.com/image/UOB \nhttp://extraimago.com/image/UOe \nhttp://extraimago.com/image/UOZ \nhttp://extraimago.com/image/UOK \nhttp://extraimago.com/image/UOJ \nhttp://extraimago.com/image/UO0 \nhttp://extraimago.com/image/UOz \nhttp://extraimago.com/image/UOU \nhttp://extraimago.com/image/UOM\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/UOD\r\n\r\nSynopsis:\r\nDasrath Manjhi was a common villager, living in village Gehlore, District Gaya, Bihar. The village was at the foot of a hill, which forced the villagers to either cross the hill or take a detour of over 40 kilomtres to reach the nearest town. Dasrath and his wife Phaguniya live a contented life until tragedy strikes. Phaguniya, pregnant, loses her balance and falls from the hill. The villagers take her to the nearest town, but Phaguniya cannot be saved, the delay and the long journey takes its toll. Dasrath is left alone with two young children.\r\n\r\nDevastated by his wife's death, Dasrath vows to cut a road through the mountain, that would lessen the distance to the town to only a few kilometres. The villagers think he is mad, but Dasrath Manjhi is made of sterner stuff. Single handedly, with only a hammer and a crowbar as equipment, he starts to break down the mountain stone by stone.\r\n\r\n22 years later, Dasrath Manjhi has beaten all odds and proved all predictions wrong..\r\n\r\nComments:\r\nBased on a true story, Manjhi is a tale of steely resolve against superhuman odds. Dasrath Majhi did the impossible - he broke down a mountain to force a path through it. Not just a path, but a 30 foot wide motorable road, that cut the distance to the nearest town to just 4-5 Km from nearly 75 kilometres.\r\n\r\nThe tale is told with the usual embellishments. We see Dasrath's love life, the apathy of officialdom, the crusading journalist, the corruption, the exploitation of his labour etc. even to the extent of a mnaxalite encounter! After all how long could the filmmaker, even a filmmaker of the stature of Ketan Mehta keep your interest going with just tales of digging and breaking stones! To his credit though, Ketan Mehta never deviates from the key theme - the determination of Dasrath Manjhi. The sub-plots hold our interest but are not much more than passing curiosities. Some of them though are a little overstretched, like Dasrath travelling to Delhi as a protester of the emergency imposed by Mrs.Gandhi.\r\n\r\nMehta's job is made easier by an immaculate performance by Nawazuddin Siddiqui as Dasrath Manjhi. He brings his character to life, both as a scamp who wins the heroine's heart and elopes with her to the elderly Dasrath who says &quot;keep faith in yourself, not in God. Perhaps God needs to have faith in humans..&quot; Radhika Apte as Phaguniya is somewhat less impressive and in some scenes, she comes across as much more anglicized than you would expect. I likes the three songs composed by Sandesh Shandilya and the beautiful cinematography of Rajiv Jain. Some of the scenes of the village and the mountain are breathtaking.\r\n\r\nThis is no run-of-the-mill movie. It touches a chord in your heart and makes you want to go out and do your bit to support the Dasrath Manjhis of this world. Therein lies the success of Ketan Mehta as the Director.\r\n\r\nUploader's Notes:\r\nWe had unfortunately, a defective DVD to work with. About 38 minutes into the DVD, there was a break that put the video ans audio out of sync. We have managed to correct that with a minimal impact on your visual as well as audible pleasure. The rip itself is in 10-bit HEVC and designed to bring out the beautiful scenery in all its glory. Detail has been carefully preserved and you will like the rip for its sheer visual quality alone.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt3449292/","torrent":{"xt":"urn:btih:994ee9bc5ce02e373c2bb0e2b54ddd5471528b97","amp;dn":"Manjhi.%282015%29-DVD.Rip.-HEVC-1CD-DDR+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994ee9bc5ce02e373c2bb0e2b54ddd5471528b97","infoHashBuffer":{"type":"Buffer","data":[153,78,233,188,92,224,46,55,60,43,176,226,181,77,221,84,113,82,139,151]},"announce":[],"urlList":[]}}