{"title":"The Beatles - Rubber Soul (1965) WMA320","uid":6283777,"size":97328961,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99c4b517b33fb6f39cb23d5cc5c40416b28119e7&amp;dn=The+Beatles+-+Rubber+Soul+%281965%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301540231,"description":"To say that &quot;Rubber Soul&quot; was merely groundbreaking, is like saying the Titanic was just another boat! With the release of this timeless masterpiece, the Beatles effectively rewrote the rock-n-roll rulebook. In doing so, they launched themselves into a four-year spell in which they were simply untouchable. Every element of &quot;Rubber Soul&quot; -- from its ultra-hip cover to the magnificent songs -- turned the rock world on its collective ear in 1965.\nUltimately, when judging the merit of an album, it all boils down to the quality of the songs and &quot;Rubber Soul&quot; is chock full of classics. &quot;In My Life&quot;, &quot;Norwegian Wood&quot;, &quot;Michelle&quot; and &quot;Nowhere Man&quot; are permanently ingrained in public consciousness. In a nutshell, they are essential elements of mid-20th Century pop culture. &quot;Drive My Car&quot; -- the album's rockin' opener --and John's seething &quot;Girl&quot; are pure pop pleasures. Paul's catchy &quot;You Won't See Me&quot; is a bitter send-off politely dressed in three-part harmony. The most surprising element of &quot;Rubber Soul&quot;, however, was the emergence of George as a songwriting force. The Quiet One penned a pair of beauties with &quot;Think For Yourself&quot; and &quot;If I Needed Someone&quot;. Each of &quot;Rubber Soul's&quot; 14 songs worked cohesively in terms of sound and theme. In other words, this wasn't two hit singles and a bunch of filler -- this was a &quot;concept&quot; album. The Beatles were growing up and soon the entire rock community would follow suit.\n\nThe influence of &quot;Rubber Soul&quot; was widespread. Upon first hearing the album, an awestruck Brian Wilson was said to have shook his head in disbelief. Wilson, of course, eventually recovered and answered the Beatles with his stunning &quot;Pet Sounds&quot; the following year. The most amazing attribute of &quot;Rubber Soul&quot; is that it was recorded in a single month! (Under immense pressure from the record company which was desperate for a Christmas offering from the Fabs.) Remarkably, the double-sided single &quot;Day Tripper/ We Can Work it Out&quot; was also recorded during these sessions, yet was never considered for inclusion on the long-player. Yes, that's how good the Beatles were in 1965, a banner year in rock's history. The Beach Boys, James Brown, Dylan, the Stones and Smokey Robinson all blazed a trail in '65, but ultimately the Fab Four grabbed the rock-n-roll mantle and ran with it. They were the trendsetters and &quot;Rubber Soul&quot; was their vehicle. I'd give this album 10 stars if I could !! \n\nby paperbackriter\n\nTRACKLIST:\n\n01 - Drive My Car.wma                                       \n02 - Norwegian Wood (The Bird Has Flown).wma                \n03 - You Won't See Me.wma                                   \n04 - Nowhere Man.wma                                        \n05 - Think For Yourself.wma                                 \n06 - The Word.wma                                           \n07 - Michelle.wma                                           \n08 - What Goes On.wma                                       \n09 - Girl.wma                                               \n10 - I'm Looking Through You.wma                            \n11 - In My Life.wma                                         \n12 - Wait.wma                                               \n13 - If I Needed Someone.wma                                \n14 - Run For Your Life.wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:99c4b517b33fb6f39cb23d5cc5c40416b28119e7","amp;dn":"The+Beatles+-+Rubber+Soul+%281965%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c4b517b33fb6f39cb23d5cc5c40416b28119e7","infoHashBuffer":{"type":"Buffer","data":[153,196,181,23,179,63,182,243,156,178,61,92,197,196,4,22,178,129,25,231]},"announce":[],"urlList":[]}}