{"title":"Handcuffed Anal Thai Cryogen","uid":11760280,"size":1324411730,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:99d3b6df2618437916b9b0457536afff6d7ebcfa&amp;dn=Handcuffed+Anal+Thai+Cryogen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1426562758,"description":"Xam does anything for money. She answered the advert at the cryogenic laboratory that requested young fit specimens for temporary employment with suitable remuneration. She turned up in what she considered suitable slutwear, which was totally ignored when they threw her into a vat of liquid nitrogen. A few years later, the research leader at the laboratory deemed it was time to retrieve all the frozen specimens. All except Xam had turned into frozen slush, most certainly dead and no chance of revival. Xam however, thawed out unharmed, held her hand out and demanded money. She usually does short time, or if she really likes you stays all night. But a few years in frozen hell was quite unusual. So, why did Xam survive? Quite simply, large quantities of sperm all the way through her intestinal tract. That means that she has been fucked up her ass and down her throat by loads of guys. It sort of acts like antifreeze. Xam does not know a thing about that. She does not even know that ten years have gone by. All she knows is she does anything for money, especially anal sex while being chained up. Open the freezer and get the video out","torrent":{"xt":"urn:btih:99d3b6df2618437916b9b0457536afff6d7ebcfa","amp;dn":"Handcuffed+Anal+Thai+Cryogen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d3b6df2618437916b9b0457536afff6d7ebcfa","infoHashBuffer":{"type":"Buffer","data":[153,211,182,223,38,24,67,121,22,185,176,69,117,54,175,255,109,126,188,250]},"announce":[],"urlList":[]}}