{"title":"Star Wars - The Essential Reader's Companion (Epub,Mobi) Gooner","uid":9674302,"size":152451642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99e0fb9d0d9634f8a222df50093961e237e33c12&amp;dn=Star+Wars+-+The+Essential+Reader%27s+Companion+%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1393531958,"description":"Star Wars: The Essential Reader's Companion by Pablo Hidalgo\n\n\nFormat: mobi/epub\nGenre: Science Fiction/Reference\nPrint Length: 496 pages\nRelease Date: 2 October 2012\n\nTHE DEFINITIVE WORD ON STAR WARS FICTION\n\nThe legendary motion picture Star Wars has spawned two big-screen sequels and three prequels - and decades of bestselling fiction. From the original movie tie-in novel through the monumental Fate of the Jedi series, legions of devoted readers have helped expand science fiction's most celebrated film saga into a page-turning print sensation. Now, for the first time, a comprehensive overview of these sweeping Star Wars adventures is presented in one beautifully illustrated volume.\n\nStar Wars: The Essential Reader's Companion spans the entire galaxy of published Star Wars fiction-movie novelizations, original stand alone and series novels, short stories, eBook novellas, young adult titles, and comics - and features:\n\nA concise synopsis of each story, including key characters and planets\nExclusive behind-the-scenes facts and anecdotes about authors, plot and character development, continuity notes, and significance in the Star Wars Expanded Universe\nDetails on which novels are linked to Star Wars comic books from Dark Horse and Marvel\nA chronological listing of titles, spanning the 25,000-year history of the Star Wars universe and placing each story in its proper context\nMore than one hundred full-color original paintings throughout by some of fans' favorite artists \n\nWhether skimming through fateful eras from the Old Republic to the New Jedi Order; delving deep into the ancient history of the Lost Tribe of the Sith or the tumultuous Clone Wars; crossing paths - and lightsabers - with Dark Lords such as Plagueis or Bane, Sidious or Vader; helming the Millennium Falcon with Han Solo; or mastering the Force with Luke Skywalker, this one-of-a-kind, one-stop reference is a must for fans looking to maximize their knowledge of the sprawling Star Wars Expanded Universe. \n\nAuthors:\n\nPablo Hidalgo is the brand communications manager at Lucasfilm, a resident Star Wars authority who helps ensure consistency across a wide array of Star Wars projects. \n\nJeff Carlisle is a freelance illustrator and concept designer who has spent a good portion of the last decade in a Galaxy Far, Far Away. He has designed or illustrated for various Star Wars projects, such as books, magazines, web comics, role-playing and miniatures games, trading cards, posters, art prints, sketch cards, and even paper airplanes.\n\nJoe Corroney has been professionally creating Star Wars artwork for books, games, trading cards, comic books, posters, and magazines since 1997. Currently, in addition to Star Wars, he?s illustrating for IDW?s True Blood and Star Trek ongoing comic book series. \n\nBrian Rood is a freelance illustrator who spends most of his time creating new artwork for the Star Wars galaxy. His work can be found on numerous licensed Star Wars products, including toy packaging, Blu-ray packaging, trading cards, and a large assortment of Star Wars fine art reproductions with ACME Archives Direct. \n\nChris Scalf began drawing his favorite moments from the science fiction and monster shows he loved watching on TV. In 2006 Chris was hired to paint his first Star Wars project, the R2-D2 mailboxes for the USPS. \n\nDarren Tan was born and raised in Malaysia where he grew up drawing spaceships, dinosaurs, and the stuff of his imagination, which was fueled by movies and computer games. Inspired by these, he went on to study animation and later graduated as a computer animator from Sheridan College, Canada.\n\nChris Trevas is a freelance illustrator for Star Wars books, games, trading cards, packaging, and many other products. His book credits include four Star Wars: Essential Guides for Del Rey as well as several Star Wars technical guides and blueprints.","torrent":{"xt":"urn:btih:99e0fb9d0d9634f8a222df50093961e237e33c12","amp;dn":"Star+Wars+-+The+Essential+Reader%27s+Companion+%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e0fb9d0d9634f8a222df50093961e237e33c12","infoHashBuffer":{"type":"Buffer","data":[153,224,251,157,13,150,52,248,162,34,223,80,9,57,97,226,55,227,60,18]},"announce":[],"urlList":[]}}