{"title":"De.Aanslag.1986.Dvd5.Hollands.Glorie","uid":10487536,"size":4536439438,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99ff3749939e86bd96e3ad7b80dccb3431322ab5&amp;dn=De.Aanslag.1986.Dvd5.Hollands.Glorie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"hendriknld","files":11,"time":1404496910,"description":"De aanslag is een film uit 1986 van Fons Rademakers met in de hoofdrollen Derek de Lint, Marc van Uchelen, John Kraaijkamp Sr. en Monique van de Ven.\nHet scenario van de film is gebaseerd op het gelijknamige boek van Harry Mulisch uit 1982. De Aanslag was succesvol in de Nederlandse bioscopen (310.665 bezoekers) en ook in andere landen. In 1987 won de film een Oscar in de categorie Beste Buitenlandse film.\n________________________________________\nNederland begin 1945. De bezetting van Nederland door de Duitsers duurt al bijna vijf jaar. De winter is extreem hard en de bevolking lijdt honger en kou. In het huis van de familie Steenwijk wordt geprobeerd om de allesbrander aan te houden en het schaarse eten te verdelen. Dan klinken er schoten. Peter Steenwijk, de oudste zoon, ziet politie-inspecteur Fake Ploeg in de sneeuw liggen. Ploeg stond bekend als landverrader en is vermoedelijk geliquideerd door het verzet. Hij is doodgeschoten voor het huis van de buren. Maar dan komen de buren naar buiten en leggen het lijk voor het huis van de familie Steenwijk.\nAngstig kruipt de familie bij elkaar, ze weten dat de Duitsers represailles zullen uitvoeren als vergelding voor de aanslag. Anton Steenwijk ziet zijn broer Peter de deur uitrennen. Niet lang daarna vallen de Duitsers het huis binnen. De ouders van Anton worden weggevoerd. Later hoort Anton dat ze samen met een aantal gijzelaars zijn gefusilleerd. Zijn broer Peter is op de vlucht doodgeschoten. Het huis wordt in brand gestoken en Anton wordt meegenomen en in een cel gezet. Er blijkt nog iemand te zijn. De cel is niet verlicht en Anton hoort alleen de stem van een vrouw. Het blijkt dat zij, samen met een man, Ploeg heeft geliquideerd. Later wordt Anton meegenomen in een Duitse vrachtauto die naar Amsterdam rijdt. Onderweg wordt het konvooi waarin ze rijden onder vuur genomen bij een luchtaanval.\nEenmaal in Amsterdam wordt Anton opgehaald door zijn oom. Als de oorlog voorbij is gaat Anton naar school. Na zijn examen gaat hij medicijnen studeren. In 1956 woont Anton nog altijd in Amsterdam als er rellen uitbreken vanwege de Russische inval in Hongarije. Tegenstanders van de inval belagen de kantoren van het communistische blad De Waarheid en andere aanhangers van de communistische partij. Anton blijft binnen, maar krijgt onverwacht bezoek van de zoon van Fake Ploeg met wie hij op school heeft gezeten. Ploeg junior heeft nog een steen in zijn hand. Hij is vijandig naar Anton, vanwege de vernederingen die hij moest ondergaan als zoon van een landverrader. Na het incident studeert Anton af en wordt anesthesist. Tijdens de Paasdagen in Londen in 1960 komt hij een vrouw tegen die lijkt op de vrouw uit de gevangeniscel uit 1945. Ze trouwen en krijgen een kind, Sandra.\nAls Anton en zijn vrouw de begrafenis bijwonen van een oud-verzetsstrijder praat Anton met Cor Takes. Takes is ook oud-verzetsstrijder en een verbitterd man. Het wordt Anton al snel duidelijk dat Takes indertijd met zijn vriendin Fake Ploeg heeft doodgeschoten. Takes op zijn beurt realiseert zich dat zijn vriendin in een heel andere gevangenis was opgesloten en dat hij haar had kunnen bevrijden. In 1969 gaat Anton scheiden om een aantal jaren later te hertrouwen. Samen met zijn dochter Sandra bezoekt hij nog een keer de plaats in Haarlem waar zijn ouders en broer zijn gestorven. Niet veel later krijgt Anton een burn out. Zijn nooit verwerkte verleden speelt hem parten. Nog altijd probeert hij te achterhalen waarom indertijd zijn buren het lijk van Ploeg bij zijn huis legden. Hij gaat het rustiger aandoen en probeert met zich zelf in het reine te komen. Als hij later meeloopt met de anti-kernrakettendemonstratie in Amsterdam ontmoet hij ook zijn toenmalige buurmeisje. Zij vertelt dat haar vader bang was dat zijn salamanders zouden worden gedood en hij daarom het lichaam van Ploeg verplaatste. Anton hoort het aan en beseft nu pas hoe het toeval een rol heeft gespeeld. Alles valt op zijn plaats en hij weet nu dat hij het verleden kan laten rusten.\n","torrent":{"xt":"urn:btih:99ff3749939e86bd96e3ad7b80dccb3431322ab5","amp;dn":"De.Aanslag.1986.Dvd5.Hollands.Glorie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ff3749939e86bd96e3ad7b80dccb3431322ab5","infoHashBuffer":{"type":"Buffer","data":[153,255,55,73,147,158,134,189,150,227,173,123,128,220,203,52,49,50,42,181]},"announce":[],"urlList":[]}}