{"title":"Lonely Planet - Eastern USA - 3rd Edition (2016) Gooner","uid":14716113,"size":220092907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a02bf062f623c1160f0461387afc77715b52ba3&amp;dn=Lonely+Planet+-+Eastern+USA+-+3rd+Edition+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1464469847,"description":"Lonely Planet - Eastern USA (Travel Guide) - 3rd Edition (2016) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: Lonely Planet; 3 edition (15 April 2016)\r\nLanguage: English\r\nISBN-10: 174321863X\r\nISBN-13: 978-1743218631\r\n\r\n#1 best-selling guide to Eastern USA\r\n\r\nLonely Planet Eastern USA is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Hail a yellow cab in New York City, take in some honky-tonk in Nashville, or laze in the dunes of Cape Cod; all with your trusted travel companion. Get to the heart of the Eastern USA and begin your journey now!\r\n\r\nInside Lonely Planet Eastern USA Travel Guide:\r\n\r\n* Color maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including customs, history, art, literature, cinema, music, architecture, politics, landscapes, road trips and scenic drives, outdoor activities, wildlife, cuisine and wine\r\n\r\n* Over 50 color maps\r\n\r\n* Covers New York, New Jersey, Pennsylvania, New England, Washington DC, New Orleans, Florida, the Great Lakes, North Carolina, South Carolina, Tennessee, Kentucky, Georgia, Alabama, Mississippi, Arkansas and more\r\n\r\nThe Perfect Choice: Lonely Planet Eastern USA , our most comprehensive guide to Eastern USA, is perfect for those planning to both explore the top sights and take the road less traveled.\r\n\r\n* Looking for a guide focused on New York City, Washington DC, or Boston? Check out Lonely Planet's New York City guide, Washington, DC guide, or Boston guide for a comprehensive look at what each of these cities has to offer; or Lonely Planet's Pocket guides to these cities which are handy-sized guides focused on the can't-miss sights for a quick city visit.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet's USA guide for a comprehensive look at all the country has to offer, or Best of USA, a photo-rich guide to the country's most popular attractions.\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:9a02bf062f623c1160f0461387afc77715b52ba3","amp;dn":"Lonely+Planet+-+Eastern+USA+-+3rd+Edition+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a02bf062f623c1160f0461387afc77715b52ba3","infoHashBuffer":{"type":"Buffer","data":[154,2,191,6,47,98,60,17,96,240,70,19,135,175,199,119,21,181,43,163]},"announce":[],"urlList":[]}}