{"title":"The Lion in Winter (1968)","uid":3363855,"size":915279872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a3e499831928a8cfed86c1b75ba4ffe8a403213&amp;dn=The+Lion+in+Winter+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"disobedient","files":1,"time":1122896628,"description":"The Lion in Winter\n------------------\nPeter O'Toole - Henry II (Acadamy Award Nominee)\nKatharine Hepburn - Eleanor of Aquitaine (Acadamy Award Winner)\nAnthony Hopkins - Richard\nJohn Castle - Geoffrey\nNigel Terry - John\nTimothy Dalton - King Philip of France (Film Debut)\n\nThe year is 1183, and King Henry II of England is planning a Christmas reunion with his three sons and estranged (and imprisoned) wife, Eleanor, to decide who is to be heir to the throne.  There's John, the timid and stupid son (who later becomes John I, signer of the Magna Carta); Richard, the warrior (later King Richard the Lionhearted); then there's Geoffrey, the devious and conniving schemer.\n\nBased on the successful Broadway play, this movie won a slew of Academy Awards (including Best Screenplay/Adaptation)--all justly deserved.  The witty banter between O'Toole and Hepburn may remind many of Shakespear's &quot;Taming of the Shrew,&quot; though with far more vitriol.  In my opinion, one of the finest performances from O'Toole and Hepburn, though the entire cast was brilliant.\n\n---\n\nOn a more personal note:\n\nWhile TPB is a great place for new releases, I'd love to see more classics like this put online.  Instead of complaining, I'm doing something about it.  If you enjoy this torrent, please consider making your own the next time you rent a classic DVD to watch for yourself.  There are several programs out there that make the process relatively effortless, and it would be much appreciated by the community.  Thank you.\n\nFinally, my apologies for the slow transfer speed.  I do what I with the limited resources I have available.  If you're on a fat pipe, please consider seeding for as long as possible, or at least 1:1.  Again, thanks.","torrent":{"xt":"urn:btih:9a3e499831928a8cfed86c1b75ba4ffe8a403213","amp;dn":"The+Lion+in+Winter+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3e499831928a8cfed86c1b75ba4ffe8a403213","infoHashBuffer":{"type":"Buffer","data":[154,62,73,152,49,146,138,140,254,216,108,27,117,186,79,254,138,64,50,19]},"announce":[],"urlList":[]}}