{"title":"JOHN MAYER","uid":9612883,"size":4407582772,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9a5871310f2f422950c462a6dc053c5a78bd853d&amp;dn=JOHN+MAYER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":7,"uploader":"jmwreck","files":151,"time":1392355919,"description":"John Clayton Mayer (/ËˆmeÉª.É™r/ MAY-É™r)[1] (born October 16, 1977) is an American recording artist, producer,[2] and environmentalist. Born in Bridgeport, Connecticut, and raised in Fairfield, he attended Berklee College of Music in Boston. He moved to Atlanta in 1997, where he refined his skills and gained a following, and he now lives in Montana.[3] His first two studio albums, Room for Squares (2001) and Heavier Things (2003), did well commercially, achieving multi-platinum status.[4] In 2003, he won a Grammy Award for Best Male Pop Vocal Performance for &quot;Your Body Is a Wonderland.&quot;[5]\n\nMayer began his career performing mainly acoustic rock, but gradually began a transition towards the blues genre in 2005 by collaborating with renowned blues artists such as B. B. King, Buddy Guy, and Eric Clapton, and by forming the John Mayer Trio. The blues influence can be heard throughout his 2005 live album Try! with the John Mayer Trio and his third studio album Continuum, released in September 2006. At the 49th Annual Grammy Awards in 2007, Mayer won Best Pop Vocal Album for Continuum and Best Male Pop Vocal Performance for &quot;Waiting on the World to Change&quot;. He released his fourth studio album, Battle Studies, in November 2009. His fifth album, Born and Raised, which saw another musical style shift, was released in May 2012, followed by his sixth album Paradise Valley in August 2013. He has sold over ten million albums in the U.S. and over 20 million albums worldwide.\n\nMayer's career pursuits have extended to comedy, graphic design, television hosting, and writing; he has written pieces for magazines, most notably for Esquire. He has performed at charity organizations and participates in various environmental causes.","torrent":{"xt":"urn:btih:9a5871310f2f422950c462a6dc053c5a78bd853d","amp;dn":"JOHN+MAYER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a5871310f2f422950c462a6dc053c5a78bd853d","infoHashBuffer":{"type":"Buffer","data":[154,88,113,49,15,47,66,41,80,196,98,166,220,5,60,90,120,189,133,61]},"announce":[],"urlList":[]}}