{"title":"All About History - Issue 42 2016 True PDF","uid":15635065,"size":42310986,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a83e4a34ab6d42ae3e1d8c32fb418ea32086f97&amp;dn=All+About+History+-+Issue+42+2016+True+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"shtihl22","files":1,"time":1471979325,"description":"**********Description***********\r\n\r\n\r\nEnglish | 100 pages | True PDF | 40 MB\r\n\r\nBringing History to life for readers of all ages\r\n\r\nAll About History is the only history magazine that is as entertaining as it is educational. From Ancient Rome to Ancient Egypt, Tudor kings to Victorian inventors, and the trenches of World War I to the jungles of World War II, every issue of All About History puts you at the heart of the action with breathtaking photography, amazing illustrations and thrilling true stories from acclaimed historians.\r\n\r\nHereâ™s a date you might recognise: 1066. Thatâ™s the year that Halleyâ™s comet made a rare appearance in the sky, one of only a dozen or so in the last millenium. Its 76-year orbit means that most people will only get to see it once in their lives, so it was quite an event even when it last appeared in 1986.001_AAH_001\r\n\r\nSpace and history are as inextricably linked as Halleyâ™s comet from the Battle of Hastings, which makes All About History, the new magazine from the makers of All About Space and How It Works, the perfect complementary read to anyone interested in space: by learning about history, we can learn more about space and vice-versa.\r\n\r\nItâ™s packed with facts and insight into the past, with expert knowledge and eyewitness accounts of the most famous events in recent history.\r\n\r\nMeanwhile, nearly 1,000 years ago in feudal England, Halleyâ™s comet also caused a big stir. The bright new ‘star with long hairâ™ was taken as a bad omen for King Harold, who had broken his oath to King William of France and was considered to have incurred the wrath of God. The story has it that Harold later took an arrow in the eye at the battle of Hastings and was killed, clearing the way for William to seize control of England.\r\n\r\nRegardless of whether anyone knew what Halleyâ™s Comet really was back in the Eleventh century, it was still deemed important enough to record on one of the most famous artifacts in history, the Bayeux Tapestry:\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================","torrent":{"xt":"urn:btih:9a83e4a34ab6d42ae3e1d8c32fb418ea32086f97","amp;dn":"All+About+History+-+Issue+42+2016+True+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a83e4a34ab6d42ae3e1d8c32fb418ea32086f97","infoHashBuffer":{"type":"Buffer","data":[154,131,228,163,74,182,212,42,227,225,216,195,47,180,24,234,50,8,111,151]},"announce":[],"urlList":[]}}