{"title":"Frida - Salma Hayek - Diego Luna - Alfred Molina","uid":4353455,"size":731647664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ada46726e496a1a3dbbfd42d69956ab2e6b6029&amp;dn=Frida+-+Salma+Hayek+-+Diego+Luna+-+Alfred+Molina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"TheLabMan","files":1,"time":1219288576,"description":"  Won 2 Oscars. Another 12 wins &amp; 28 nominations\n\n                  Rated R for sexuality/nudity and language. \n\n\n&quot;Frida&quot; chronicles the life Frida Kahlo (Salma Hayek) shared unflinchingly and openly with Diego Rivera (Alfred Molina), as the young couple took the art world by storm. From her complex and enduring relationship with her mentor and husband to her illicit and controversial affair with Leon Trotsky, to her provocative and romantic entanglements with women, Frida Kahlo lived a bold and uncompromising life as a political, artistic, and sexual revolutionary.  Written by Anonymous \n\n\n                              Interview:\n\n                       SALMA HAYEK (Frida Kahlo)\n\nYou&amp;#039;ve been passionate about this project for a long time.\nEight years.\n\nWhat was it about this woman that really inspired you?\n\nThere was something about the woman and there was something about the time the woman lived in. About the woman: her courage to be unique. She was never conventional about anything she did. She was always herself and it was not easy. She started exploring her womanhood at a very early age. She got caught with a librarian right before the accident. She was not allowed to go back to the school after the accident because of this. It&amp;#039;s not in any books, but Alejandro [Gomez Arias] said, &quot;How could you do this to me? How could you do this, period?&quot; She said, &quot;That&amp;#039;s who I am.&quot;\n\nShe was never apologetic about who she was. She did little paintings that nobody liked. She lived with this monster of the art. She was not influenced by what he was doing; she never changed. Even though people would never buy it, she kept true to her own style.\n\nI think also, the fact that she took all these different tragedies or difficulties and made the best out of them. [She] not only made the best out of them, but did it in an interesting way. From paint, she did art and poetry. From the infidelities of her husband, she found freedom.\n\n\nCould you relate to her?\n\nI would like to learn from her. It is definitely an inspiration and I&amp;#039;d like to take it in. I&amp;#039;m working on it.\n\n\nWhat did you do to physically get into the role? Did you actually shave your upper lip?\n\nI did that but it didn&amp;#039;t work. Now, I&amp;#039;m stuck with it. I had a shoe that was one centimeter taller than the other one. It was very difficult to know exactly where she stood on the limping. I talked to many people that knew her and some people would say she never limped, some people would say she always limped, and some people would say she limped sometimes. So what I did is have the shoe bigger than the other one and then try not to limp, try to hide it. But then at times when I thought she was very tired or going through a hard time, I would surrender to whatever that did naturally. I&amp;#039;d stop trying.\n\n\nDo you believe the romance between Frida and Diego Rivera was based on obsession or passion?\n\nI think there was always passion. I think there were very profound elements that transformed the passion, not just for sexuality, but they really had passion for each other in many different levels. The passion was not just passion but actually transformed into true love. I think these people learned, through the years, to accept each other exactly as they were and to love each other exactly for what they were.\n\nI think that Frida was the only woman that kept challenging Diego for the right reasons - and she always surprised him. I think he truly believed she was a genius and he was the only one who had a vision for it, or the strongest vision for it. When he dies, he leaves a document that says the house that they lived in, the blue house, has to become a museum for Frida Kahlo. Had it not been for his vision, we probably would have never discovered Frida - if she hadn&amp;#039;t had that museum. He knew that at the time she was not appreciated, but he knew there was going to come a generation that was going to totally get her.\n\nI think there are very profound symbols of love in this story. What I like about this story, aside from the fact that it&amp;#039;s completely different than any love story I&amp;#039;ve ever seen, is that it&amp;#039;s not a story about falling in love. It&amp;#039;s a story about staying in love. People don&amp;#039;t want to make those stories because they&amp;#039;re not as romantic. They&amp;#039;re very hard to tell.\n\n\nDid this character stay with you or could you get out of it easily?\n\nI can break it very easily because she&amp;#039;s been in my life since I was 14 and she&amp;#039;s still in my life today. It stays in my heart. So, I don&amp;#039;t feel a complete detachment. I can break away from trying to be her, or feeling that I am her or trying to play her, because still she&amp;#039;s around.\n\n\nHow did you handle some of the bisexual scenes?\n\nIt&amp;#039;s not a big deal. You have to be somebody. This is what that person was into. The same way when you have to get into somebody that you&amp;#039;re not attracted to. They have bad breath and you have to pretend you&amp;#039;re in love.\n","torrent":{"xt":"urn:btih:9ada46726e496a1a3dbbfd42d69956ab2e6b6029","amp;dn":"Frida+-+Salma+Hayek+-+Diego+Luna+-+Alfred+Molina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ada46726e496a1a3dbbfd42d69956ab2e6b6029","infoHashBuffer":{"type":"Buffer","data":[154,218,70,114,110,73,106,26,61,187,253,66,214,153,86,171,46,107,96,41]},"announce":[],"urlList":[]}}