{"title":"Clinical Anatomy of the Cranial Nerves [PDF] [StormRG]","uid":10704766,"size":2323098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b26d43fbbdd20176eaad25eba726d47606f2aac&amp;dn=Clinical+Anatomy+of+the+Cranial+Nerves+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":-1,"time":1407267557,"description":"Author: Paul Rea\nPaperback: 178 pages\nPublisher: Academic Press; 1 edition (May 20, 2014)\nLanguage: English\nISBN-10: 0128008989\nISBN-13: 978-0128008980\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nClinical Anatomy of the Cranial Nerves combines anatomical knowledge, pathology, clinical examination, and explanation of clinical findings, drawing together material typically scattered throughout anatomical textbooks. All of the pertinent anatomical topics are conveniently organized to instruct on anatomy, but also on how to examine the functioning of this anatomy in the patient. Providing a clear and succinct presentation of the underlying anatomy, with directly related applications of the anatomy to clinical examination, the book also provides unique images of anatomical structures of plastinated cadaveric dissections. These images are the only ones that exist in this form, and have been professionally produced in the Laboratory of Human Anatomy, University of Glasgow under the auspices of the author. These specimens offer a novel way of visualizing the cranial nerves and related important anatomical structures.\n\nAnatomy of cranial nerves described in text format with accompanying high-resolution images of professional, high-quality prosected cadaveric material, demonstrating exactly what the structures (and related ones) look like\n\nSuccinct yet comprehensive format with quick and easy access to facts in clearly laid out key regions, common throughout the different cranial nerves\n\nIncludes clinical examination and related pathologies, featuring diagnostic summaries of potential clinical presentations and clinically relevant questions on the anatomy of these nerves","torrent":{"xt":"urn:btih:9b26d43fbbdd20176eaad25eba726d47606f2aac","amp;dn":"Clinical+Anatomy+of+the+Cranial+Nerves+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b26d43fbbdd20176eaad25eba726d47606f2aac","infoHashBuffer":{"type":"Buffer","data":[155,38,212,63,187,221,32,23,110,170,210,94,186,114,109,71,96,111,42,172]},"announce":[],"urlList":[]}}