{"title":"BurnAware Professional 9.4 - SeuPirate","uid":15919301,"size":9856057,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9b3ce5f0671b841f3760f2d5278635bf368db793&amp;dn=BurnAware+Professional+9.4+-+SeuPirate&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SeuPirate","files":2,"time":1475236374,"description":"BurnAware Professional 9.4 - SeuPirate\r\n\r\nBurnAware is the ultimate disc burning software. BurnAware Free is one of the most popular free CD, DVD, Blu-ray Disc burning software available for Windows. Using this program you can easily create and burn Audio and MP3 CD, Data and DVD-Video disc, ISO and Cue Image, erase or format rewritable disc, copy your CD or DVD to ISO image.\r\n\r\nBurnAware is a full-fledged, easy-to-use burning software which allows users to write all types of files such as digital photos, pictures, archives, documents, music and videos to CDs, DVDs and Blu-ray Discs. With BurnAware, you also be able to create bootable or multisession discs, high-quality Audio CDs and Video DVDs, make and burn ISO images, copy and backup discs, extract audio tracks, erase and verify data, recover data from multisession or unreadable discs.\r\n\r\nKey Benefits\r\nOne of the most noticeable feature is an user interface – clean, effective, easy-to-use and multilingual. Another great benefits are low CPU usage while burning and very stable burning process. Plus support of latest OS - Windows 10, as well as any version starting from Windows XP, both 32 and 64 bits.\r\n\r\nAdvanced Options\r\nBesides standard options, BurnAware offers many advanced options such as BOOT settings, UDF partition and versions, ISO levels and restrictions, session selection, CD-Text for track and disc, byte by byte verification, direct copying, disc spanning and many more.\r\n\r\nHome Page - http://www.burnaware.com/\r\n\r\nBy:\r\n\r\nSeuPirate","torrent":{"xt":"urn:btih:9b3ce5f0671b841f3760f2d5278635bf368db793","amp;dn":"BurnAware+Professional+9.4+-+SeuPirate","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b3ce5f0671b841f3760f2d5278635bf368db793","infoHashBuffer":{"type":"Buffer","data":[155,60,229,240,103,27,132,31,55,96,242,213,39,134,53,191,54,141,183,147]},"announce":[],"urlList":[]}}