{"title":"The Deadline - A Novel About Project Management","uid":10141699,"size":439734494,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9b5ad022c3955c083d370bbf6f225b24fc18fdac&amp;dn=The+Deadline+-+A+Novel+About+Project+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mihkel186","files":-1,"time":1400009642,"description":"The Deadline: A Novel About Project Management by Tom DeMarco\nAudiobook : MP3/128Kbps : English\n\nNB: This audiobook was created from the physical source by first digitizing it using OCR technique and then converted to audio using TTS technique.\n\nPublisher's Summary:\n\nFrom prolific and influential consultant and author Tom DeMarco comes a project management novel that vividly illustrates the principles - and the outright absurdities - that affect the productivity of a software development team.\n\nWith his trademark wit set free in the novel format, DeMarco centers the plot around the development of six software products. Mr. Tompkins, a manager downsized from a giant telecommunications company, divides the huge staff of developers at his disposal into eighteen teams - three for each of the software products. The teams are different sizes and use different methods, and they compete against each other and against an impossible deadline.\n\nWith these teams - and with the help of numerous &quot;fictionalized&quot; consultants who come to his aid - Tompkins tests the project management principles he has gathered over a lifetime. Each chapter closes with journal entries that form the core of the eye-opening approaches to management illustrated in this entertaining novel.\n\n(C)1997 Tom DeMarco; (P)1997 Dorset House Publishing Co., Inc.\n","torrent":{"xt":"urn:btih:9b5ad022c3955c083d370bbf6f225b24fc18fdac","amp;dn":"The+Deadline+-+A+Novel+About+Project+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b5ad022c3955c083d370bbf6f225b24fc18fdac","infoHashBuffer":{"type":"Buffer","data":[155,90,208,34,195,149,92,8,61,55,11,191,111,34,91,36,252,24,253,172]},"announce":[],"urlList":[]}}