{"title":"OpenGL ES 2 for Android A Quick - Start Guide (2013) (PDF+EPUB)","uid":8846543,"size":41097064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9bc6a0727ce4ab4972bbb09f0754eddcb0516986&amp;dn=OpenGL+ES+2+for+Android+A+Quick+-+Start+Guide+%282013%29+%28PDF%2BEPUB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"KaavaBoT","files":2,"time":1377408871,"description":"OpenGL ES 2 for Android A Quick - Start Guide (2013) (PDF+EPUB)\n\n\nAuthor: Kevin Brothaler\nRelease TiTLe: &quot;OpenGL ES 2 for Android: A Quick-Start Guide&quot;\nLanguage: English \nISBN: 1937785343 \nYear: 2013 \n325 pages \nFormat: PDF+EPUB \nSize: 39.1MB\n\nAndroid is booming like never before, with millions of devices shipping every day. It's never been a better time to learn how to create your own 3D games and live wallpaper for Android. You'll find out all about shaders and the OpenGL pipeline, and discover the power of OpenGL ES 2.0, which is much more feature-rich than its predecessor. If you can program in Java and you have a creative vision that you'd like to share with the world, then this is the book for you.\n\nThis book will teach you everything you need to know to create compelling graphics on Android. You'll learn the basics of OpenGL by building a simple game of air hockey, and along the way, you'll see how to initialize OpenGL and program the graphics pipeline using shaders. Each lesson builds upon the one before it, as you add colors, shading, 3D projections, touch interaction, and more.\n\nThen, you'll find out how to turn your idea into a live wallpaper that can run on the home screen. You'll learn about more advanced effects involving particles, lighting models, and the depth buffer. You'll understand what to look for when debugging your program, and what to watch out for when deploying to the market.\n\nOpenGL can be somewhat of a dark art to the uninitiated. As you read this book, you'll learn each new concept from first principles. You won't just learn about a feature; you'll also understand how it works, and why it works the way it does. Everything you learn is forward-compatible with the just-released OpenGL ES 3, and you can even apply these techniques to other platforms, such as iOS or HTML5 WebGL.\n\n\nPlease Rate and Comment\n\nPlease Seed atleast upto 1:1 Ratio","torrent":{"xt":"urn:btih:9bc6a0727ce4ab4972bbb09f0754eddcb0516986","amp;dn":"OpenGL+ES+2+for+Android+A+Quick+-+Start+Guide+%282013%29+%28PDF%2BEPUB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bc6a0727ce4ab4972bbb09f0754eddcb0516986","infoHashBuffer":{"type":"Buffer","data":[155,198,160,114,124,228,171,73,114,187,176,159,7,84,237,220,176,81,105,134]},"announce":[],"urlList":[]}}