{"title":"FX.Football-HI2U ","uid":10788398,"size":513302148,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9bc7f6c6679dccff3d425651ecfaecdf16d55c75&amp;dn=FX.Football-HI2U+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1408229390,"description":"\t\t\t\t\t\t\n\t\t\t\t\t\t\tHI2U!\n\nFX Football (c) FX Interactive\n\nRelease Date: 16th August, 2014\nProtection: Steam\nType: Simulation\nSize: 11 x 50mb\n\nDescription:\n\nTHE FOOTBALL MANAGER FOR EVERY FAN\n\nUser-friendly, easy to grasp and fun to master. FX Football believes in offering\na game system designed for every football fan out there: agile, powerful, full\nof options and extremely fun\n\nA LEADER IN THE LOCKER ROOM\n\nSigning the new contract. Getting to know your squad. Discovering the clubs\nfacilities. Being presented to your supporters. Finding your starting lineup\nBringing out the best in every player. Watching them grow under your guidance\nCheering them on when they display rehearsed moves on the field. Feeling the\nfans support\n\nIts small details like these that remind you why you love football\n\nA MANAGER IN THE OFFICE\n\nAs the clubs manager, you will be responsible for making all the decisions:\nexpanding the stadium, hiring your coaching staff, signing and renewing players\nfixing ticket prices... Lay the foundations for a truly competitive team\n\nAND A MENTOR IN THE ACADEMY\n\nPlan and direct your youth divisions tactics and training sessions. Keep an eye\non every one of your young footballers until you find a true talent. Enhance his\nperformance by increasing his confidence: give him the chance to play with the\nfirst team and realize his full potential. You might just turn him into a world\nclass star\n\nfeatures:\n\nMake yourself a career as club manager and work your way up to the top. Win\nachievements with different teams. Earn yourself a reputation: &quot;Lucky charm&quot;\n&quot;Giant Killer&quot; or &quot;Professor&quot;, an expert in finding future stars in your youth\ndivisions, among many others\n\nUnited Kingdom, Germany, France, Spain, Italy... The first and second\ndivisions of all of these competitions are played simultaneously, along with the\nthird division in the Spanish and Italian championships. Leagues, cups\ninternational tournaments, preseason matches... 450 teams, each and every one of\nthem in constant evolution\n\nMore than 11,700 players created one by one that will become truly unique\nunder your leadership. Players grow and evolve depending on your actions\nThroughout their career they can acquire Achievements that will in turn affect\nthe entire game universe\n\nUpgrade and expand your stadium, customizing the facilities to adapt them to\nthe football club you wish to create\n\nDon t just sit on the bench. Make decisions and apply them from the sideline\nto change game dynamics: choose when your team should put pressure on rival\nplayers, when to use the flanks, when to keep the ball... Or design your own\nmoves on the field in real time!\n\nInstantly customize players, kits and shields with MyTeam, the editor that\ngives you total control; create your ideal squad, a club with football legends\nor the team of friends you play with on the weekends\n\nA game in constant evolution with new features suggested by the community:\nmanager track record; fun and agile transfer system; squad stats; player\nevaluation after each match; top scorers, goalkeepers and footballers with most\nassists; lineup of the week; sponsors; trophy room; man-to-man markings\n\nInstall:\n\nUnrar, mount/burn, install, copy crack from Crack folder on the CD to where\nyou installed the game. Enjoy\n\t\t\t\t\t\t","torrent":{"xt":"urn:btih:9bc7f6c6679dccff3d425651ecfaecdf16d55c75","amp;dn":"FX.Football-HI2U+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bc7f6c6679dccff3d425651ecfaecdf16d55c75","infoHashBuffer":{"type":"Buffer","data":[155,199,246,198,103,157,204,255,61,66,86,81,236,250,236,223,22,213,92,117]},"announce":[],"urlList":[]}}