{"title":"Hatchet(2006)DVDRip.AC3(ENG)-DROCK","uid":6391090,"size":732329984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9bf53a2b074242087c50e1682baab6587d015e32&amp;dn=Hatchet%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"drock232","files":-1,"time":1305361195,"description":"A handful of college students looking for a good time are thrown into a world of danger in this homage to the slasher film cycle of the 1970s and '80s. Ben (Joel David Moore) has just been given his walking papers by his girlfriend and is deeply depressed. Needing a pick-me-up, Ben and his friend Marcus (Deon Richmond) head to New Orleans for Mardi Gras, and take in a &quot;Haunted Swamp Tour,&quot; with master of ceremonies Shawn (Parry Shen) guiding guests through a spooky patch of bayou country. Along the way, Ben and Marcus meet a pair of half-bright exotic dancers, Misty (Mercedes McNab) and Jenna (Joleigh Fioreavanti), as well as Marybeth (Tamara Feldman), a pretty girl who is secretive about her past. As they tour the swamp, Shawn tells his customers about the local legend of Victor Crowley, a deformed man who was taunted by the other children living near the swamp until he was nearly bludgeoned with an axe by his father while trying to open the door of their burning shack. While Ben and Marcus don't think much of the story at first, it doesn't take long before they have serious reason to believe Victor Crowley is still at large -- and is looking to settle some old scores. Hatchet received its world premiere at the 2006 Tribeca Film Festival. \n\nRipped with Autogk.\n\nLength: 1 Hour 29 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:9bf53a2b074242087c50e1682baab6587d015e32","amp;dn":"Hatchet%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bf53a2b074242087c50e1682baab6587d015e32","infoHashBuffer":{"type":"Buffer","data":[155,245,58,43,7,66,66,8,124,80,225,104,43,170,182,88,125,1,94,50]},"announce":[],"urlList":[]}}