{"title":"JamTrackCentral - Andy James - Album Backings","uid":7903956,"size":178891457,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9c43d3ba74e89e951bf24b7bce08bed2db5d8807&amp;dn=JamTrackCentral+-+Andy+James+-+Album+Backings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"RecycleBin32","files":17,"time":1355040436,"description":"The anticipation has been huge and they have been a long time coming, but we can officially announce that Andy James' 2011 acclaimed solo album backing tracks are now exclusively available to download at JTC.\nSince he released his incredible self titled 3rd solo record, Andy has been inundated with requests for the backing tracks to be released. This download includes the backings for Angel Of Darkness, The Storm, What Lies Beneath, War March and Bullet In The Head. And we wouldn't be JTC if there wasn't TAB involved, so you get all 65 pages of TAB for each of these tracks too. Yep, 65!!\nOn top of that, there are two exclusive live video recordings included of Andy performing full length versions of Bullet Through The Head and War March, aimed to help you analyse just how to play those tasty metal riffs.\nIn this Deluxe Edition you also get the full album in high quality 320k format\nFor Andy James fans this is a no-brainer and for those of you that haven't yet checked Andy out and who like your tracks of metal proportion then this is perfect for you. There are more tasty metal licks, riffs and techniques in this album than you could ever imagine! It's time to learn from the master.\n\nWHAT'S INCLUDED...\n5 backing tracks.\n65 pages of complete TAB and notation in PDF and GuitarPro formats.\n2 live video performances of Bullet In The Head and War March. \n\n\nSEED :)\nComment if you like my torrents :) :)\n\n- Recyclebin32","torrent":{"xt":"urn:btih:9c43d3ba74e89e951bf24b7bce08bed2db5d8807","amp;dn":"JamTrackCentral+-+Andy+James+-+Album+Backings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c43d3ba74e89e951bf24b7bce08bed2db5d8807","infoHashBuffer":{"type":"Buffer","data":[156,67,211,186,116,232,158,149,27,242,75,123,206,8,190,210,219,93,136,7]},"announce":[],"urlList":[]}}