{"title":"Ophthalmology, 4E (Yanoff) [PDF] [StormRG]","uid":10030253,"size":178035477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c93065e25512a96f3cab862ef95570c41079c39&amp;dn=Ophthalmology%2C+4E+%28Yanoff%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398330282,"description":"Author: Myron Yanoff, Jay S. Duker\nHardcover: 1428 pages\nPublisher: Saunders; 4 edition (December 30, 2013)\nLanguage: English\nISBN-10: 1455739847\nISBN-13: 978-1455739844\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\nGet the quick answers you need on every aspect of clinical ophthalmology and apply them in your day-to-day practice. The latest edition of Ophthalmology by Drs. Yanoff and Duker presents practical, expert, concise guidance on nearly every ophthalmic condition and procedure, equipping you to efficiently overcome whatever clinical challenges you may face.\n\n\n* Focus on the clinically actionable information you need thanks to a more streamlined format.\n\n* Make optimal use of the newest drug therapies, including Anti-VEGF treatment for wet ARMD and bevacizumab treatment for complications of diabetes. \n\n* Get authoritative guidance on the newest treatment options for cornea disorders, including evolving ocular surface reconstruction techniques and new cornea procedures such as DSEK. \n\n* Apply the latest advances in the diagnosis and treatment of ocular disease, including new drug therapies for retinal disorders; today's expanded uses of optical coherence tomography (OCT) and high-resolution imaging modalities; new corneal, cataract and refractive surgical approaches; and new developments in molecular biology and genetics, ocular surface disease, glaucoma testing, neuro-ophthalmology, uveitis, ocular tumors, and much more.\n\n* Visualize how to proceed by viewing more than 2200 illustrations (1,900 in full color) depicting the complete range of clinical disorders, imaging methods, and surgical techniques.\n\n* Hone and expand your surgical skills by watching 40 brand-new videos demonstrating key techniques in cornea, cataract, refractive, retina and glaucoma surgery.\n\n* Spend less time searching thanks to a user-friendly visual format designed for quick, &quot;easy-in easy-out&quot; reference and an instant understanding on any topic.","torrent":{"xt":"urn:btih:9c93065e25512a96f3cab862ef95570c41079c39","amp;dn":"Ophthalmology%2C+4E+%28Yanoff%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c93065e25512a96f3cab862ef95570c41079c39","infoHashBuffer":{"type":"Buffer","data":[156,147,6,94,37,81,42,150,243,202,184,98,239,149,87,12,65,7,156,57]},"announce":[],"urlList":[]}}