{"title":"Lisa Kleypas - Someone to Watch Over Me (Bow Street Runner  Seri","uid":9618032,"size":230302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9caee38b98f708e97a0c9ee5128e49a9920a6252&amp;dn=Lisa+Kleypas+-+Someone+to+Watch+Over+Me+%28Bow+Street+Runner++Seri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"taylorman","files":1,"time":1392445580,"description":"Grant Morgan is one of London's most eligible and unattainable bachelors. He's also a powerful member of the Bow Street Runners, and when he's called to the waterfront late one night to investigate a drowning victim, Grant is stunned to recognize the face of Vivien Rose Duvall, a well-known woman of the night. He's even more startled when he realizes that she's alive. With no one to care for her, Grant carries Vivien to his home and revives her, only to learn that she is suffering from amnesia.\n\nVivien hesitantly accepts her handsome rescuer's claim that she is his mistress, despite her misgivings about her true identity. Nevertheless, she can't deny the marks on her throat that prove her near-drowning in the Thames was not an accident, and now she must trust the man who claims her as his paramour, for her life is in danger. As Grant searches for Vivien's attacker, the two find themselves falling in love, all the while struggling to stay one step ahead of the evil forces that will stop at nothing to see Vivien dead.","torrent":{"xt":"urn:btih:9caee38b98f708e97a0c9ee5128e49a9920a6252","amp;dn":"Lisa+Kleypas+-+Someone+to+Watch+Over+Me+%28Bow+Street+Runner++Seri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9caee38b98f708e97a0c9ee5128e49a9920a6252","infoHashBuffer":{"type":"Buffer","data":[156,174,227,139,152,247,8,233,122,12,158,229,18,142,73,169,146,10,98,82]},"announce":[],"urlList":[]}}