{"title":"Stronghold 3 (2011) PC","uid":6801119,"size":4120128108,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9dfdb61a0efa0ff77cdcd85af1069196942d7d07&amp;dn=Stronghold+3+%282011%29+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"nightvol","files":-1,"time":1320686159,"description":" &lt;a href=&quot;http://lostpic.net/images/6c2216c51f9d7a20d8fc564a02fd45d1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://lostpic.net/images/6c2216c51f9d7a20d8fc564a02fd45d1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://lostpic.net/images/d9c25fb5f2f93b65935e4b5882a6d040.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lostpic.net/images/d9c25fb5f2f93b65935e4b5882a6d040.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://lostpic.net/images/b33b0ff74c8a0ef7002eb6687c65bd0d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lostpic.net/images/b33b0ff74c8a0ef7002eb6687c65bd0d.jpg&lt;/a&gt;\n\nYear: 2011\nDeveloper: FireFly Studios\nPlatform: PC\nLanguage: English, Russian, Polish, Czech\nGenre: Strategy (Real-time) / 3D\n\nOn the game:\nReturn to the Middle Ages! Dedicated to medieval Stronghold series has become famous thanks to the harmonious combination of elements characteristic of different genres. Building castles and settlements, management of politics and economics of their territories, exciting battles involving hundreds of soldiers in real time - all of it is stored and updated with new features to Stronghold 3, created using the latest technologies.\n\nFeatures:\n# Beautiful far. The new graphics engine Trinigy Vision Engine has allowed to implement the Middle Ages in all its glory.\n# We will build a city. The construction process has become more realistic. Now when placing objects in the field players are not limited to the hidden &quot;grid&quot;: erect buildings can be, focusing on the features of the landscape and other buildings. In addition, from now on the walls of fortresses can be done not only straight but also curved, and create all kinds of defenses, such as the bastions and insurmountable obstacles.\n# In war as in war. In Stronghold 3 - for the first time in the history of the series - uses modern physics engine Havok. Siege, attack and defense locks are now a grand sight to see the players eyes will appear from the crumbling shells hit the wall, raging buildings, scattering in all directions, stones, logs and ... people.\n# Day and night - day off. Night battles will be more dramatic and tense because of the extremely limited visibility. Players must be creative to find an enemy who is hiding in the darkness of the night, or on the contrary - to use the darkness to their advantage.\n# Playing in different ways. In large-scale military campaign, fans of the series will face a powerful opponent, who was considered dead. In the economic campaign will focus on all economic issues in order to develop the kingdom. If desired, the results will appear in the online ranking results. In addition, the game includes the historic battle. But fans of competition in Stronghold 3 network will offer new multiplayer modes, which can participate in up to eight players.\n# A creative approach. For those who love not only play but also to create, in Stronghold 3 provides a comprehensive toolkit that allows you to create maps and share them with each other.\n\n1. Mount the disk image in Daemon Tools or similar supporting mount a virtual drive disk image format iso.\n2. Install the game by following the instructions of the program-installation.\n3. Copy the contents of the folder &quot;Crack&quot; folder where to install the game.\n4. If necessary (if elected Russian. Language) interface of the game be localized by copying the contents of the folder &quot;Local&quot; in the folder where to install the game, with subsequent replacement.\n\nOperating system: Windows XP SP3/Vista SP2 / 7\nProcessor: Dual Core 2.0 GHz\nMemory: 2 GB\nVideo: 256 MB, GeForce 7900 GS / Radeon HD 2600 XT, DirectX 9.0c\nSound: DirectX 9.0c compatible\nFree space on HDD: 5 GB\nDVD-ROM speed: 8x","torrent":{"xt":"urn:btih:9dfdb61a0efa0ff77cdcd85af1069196942d7d07","amp;dn":"Stronghold+3+%282011%29+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dfdb61a0efa0ff77cdcd85af1069196942d7d07","infoHashBuffer":{"type":"Buffer","data":[157,253,182,26,14,250,15,247,124,220,216,90,241,6,145,150,148,45,125,7]},"announce":[],"urlList":[]}}