{"title":"F. William Engdahl ebook collection","uid":15404348,"size":33387541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9eb678cdc96c60718fdbc6793c1af57723a23d6b&amp;dn=F.+William+Engdahl+ebook+collection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Replicant70","files":7,"time":1469488643,"description":"F. William Engdahl is an award-winning geopolitical analyst, strategic risk consultant, author, professor and lecturer.\r\n\r\nHe has been researching and writing about the world political scene for more than thirty years. His various books on geopolitics—the interaction between international power politics, economics and geography—have been translated into 14 foreign languages from Chinese to French, from German to Japanese.\r\n\r\nHis most recent works trace the strategies and events that led to the rise of the US as an international superpower. He describes the emergence after 1945 of an American power as a new kind of Empire not based upon sole military occupation of land, but control of vital resources. Domination was through creation of an informal empire where control of finance, of the basic food chain, of energy—above all of oil, would be the basis for what would become the greatest concentration of power in history, an American Sole Superpower after the collapse of the Soviet Union.\r\n\r\nBorn in Minnesota, William Engdahl grew up in Texas. After earning a degree in politics from Princeton University, and graduate study in comparative economics at Stockholm University, he worked as an economist and investigative freelance journalist in New York and Europe.\r\n\r\nHe has lectured on contemporary geopolitics as Visiting Professor at Beijing University of Chemical Technology and delivers talks and private seminars around the world on different aspects of economics and politics with focus on political risk. He has given talks at the Ministry of Science and Technology Conference on Alternative Energy, Beijing; London Centre for Energy Policy Studies of Hon. Sheikh Zaki Yamani; Turkish-Eurasian Business Council of Istanbul, Global Investors' Forum (GIF) Montreaux Switzerland; Bank Negara Indonesia; the Russian Institute of Strategic Studies; the Chinese Ministry of Science and Technology (MOST), Croatian Chamber of Commerce and Economics.\r\n\r\nF. William Engdahl also contributes regularly to a number of international publications on economics and political affairs including Asia Times, FinancialSense.com, 321.gold.com, The Real News, RT.com OpEdge, RT TV, Asia Inc., GlobalResearch.com, Japan's Nihon Keizai Shimbun and Foresight magazine. He has been a frequent contributor to the New York Grant'sInvestor.com, European Banker and Business Banker International, Globus in Croatia, and has been interviewed on various geopolitical topics on numerous international TV and radio programs including USA Coast-to-Coast with George Noory, Al Jazeera, CCTV and Sina.com (China), Korea Broadcasting System (KBS), and Channel 1 Russian TV.\r\n\r\nWilliam is a Research Associate of Michel Chossudovsky's Centre for Research on Globalization in Montreal, Canada and member of the editorial board of Eurasia magazine. He currently lives in Germany and in addition to writing and giving interviews on current events, consults as a political risk economist for various private organizations, major European banks and private investor groups. Why the &quot;F.&quot; in F. William Engdahl? That's an interesting question","torrent":{"xt":"urn:btih:9eb678cdc96c60718fdbc6793c1af57723a23d6b","amp;dn":"F.+William+Engdahl+ebook+collection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb678cdc96c60718fdbc6793c1af57723a23d6b","infoHashBuffer":{"type":"Buffer","data":[158,182,120,205,201,108,96,113,143,219,198,121,60,26,245,119,35,162,61,107]},"announce":[],"urlList":[]}}