{"title":"The Bonobo and The Atheist Audiobook Frans de Waal 2013  Audio B","uid":8917953,"size":260996014,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9ed056651650e79b1dc686c0aff2375f3e63cff8&amp;dn=The+Bonobo+and+The+Atheist+Audiobook+Frans+de+Waal+2013++Audio+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Zatankai","files":20,"time":1379189578,"description":"The Bonobo and The Atheist (Audiobook) By Frans de Waal, read by Jonathan Davis\nUnabridged edition 2013 | 9 hours and 9 mins | ISBN: n/a | ASIN: B00D1YRSD4 | MP3 64 kbps | 248 MB\n\nIn this lively and illuminating discussion of his landmark research, esteemed primatologist Frans de Waal argues that human morality is not imposed from above but instead comes from within. Moral behavior does not begin and end with religion but is in fact a product of evolution.\n\n\nFor many years, de Waal has observed chimpanzees soothe distressed neighbors and bonobos share their food. Now he delivers fascinating fresh evidence for the seeds of ethical behavior in primate societies that further cements the case for the biological origins of human fairness. Interweaving vivid tales from the animal kingdom with thoughtful philosophical analysis, de Waal seeks a bottom-up explanation of morality that emphasizes our connection with animals. In doing so, de Waal explores for the first time the implications of his work for our understanding of modern religion. Whatever the role of religious moral imperatives, he sees it as a &quot;Johnny-come-lately&quot; role that emerged only as an addition to our natural instincts for cooperation and empathy.\n\nBut unlike the dogmatic neo-atheist of his book's title, de Waal does not scorn religion per se. Instead, he draws on the long tradition of humanism exemplified by the painter Hieronymus Bosch and asks reflective readers to consider these issues from a positive perspective: What role, if any, does religion play for a well-functioning society today? And where can believers and nonbelievers alike find the inspiration to lead a good life?\n\nRich with cultural references and anecdotes of primate behavior, The Bonobo and the Atheist engagingly builds a unique argument grounded in evolutionary biology and moral philosophy. Ever a pioneering thinker, de Waal delivers a heartening and inclusive new perspective on human nature and our struggle to find purpose in our lives.","torrent":{"xt":"urn:btih:9ed056651650e79b1dc686c0aff2375f3e63cff8","amp;dn":"The+Bonobo+and+The+Atheist+Audiobook+Frans+de+Waal+2013++Audio+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed056651650e79b1dc686c0aff2375f3e63cff8","infoHashBuffer":{"type":"Buffer","data":[158,208,86,101,22,80,231,155,29,198,134,192,175,242,55,95,62,99,207,248]},"announce":[],"urlList":[]}}