{"title":"Matthew Mather - Darknet","uid":11984714,"size":306055443,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f3ff1e3e5e7f39b024505b6c3b835c9ca0974fc&amp;dn=Matthew+Mather+-+Darknet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Cybotage","files":55,"time":1433318218,"description":"A terrifying new breed of predator evolves...\nA dark secret determined to stay hidden...\n\nA prophetic and frighteningly realistic novel set in present-day New York, Darknet is the story of one man's odyssey to overcome a global menace pushing the world toward oblivion, and his incredible gamble to risk everything to save his family.\n\nJake O'Connell left a life of crime and swore he'd never return, but his new life as a stock broker in New York is ripped away when his childhood friend Sean Womack is murdered. Thousands of miles away in Hong Kong, data scientist Jin Huang finds a list of wealthy dead people in a massive banking conspiracy. Problem is, some of the people don't stay dead. As Jin begins her investigation, she's petrified to discover her own name on the growing list of dead-but-alive...\n\nOn the run, they race across continents to uncover a dark secret spreading like a cancer into the world.  Why was Sean killed, and how is the list of wealthy dead connected? Are some of them really coming back to life? But all this becomes irrelevant when Jake's wife and daughter are attacked...\n\n\nRead by Tom Taylorson\nFormat: MP3\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:9f3ff1e3e5e7f39b024505b6c3b835c9ca0974fc","amp;dn":"Matthew+Mather+-+Darknet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3ff1e3e5e7f39b024505b6c3b835c9ca0974fc","infoHashBuffer":{"type":"Buffer","data":[159,63,241,227,229,231,243,155,2,69,5,182,195,184,53,201,202,9,116,252]},"announce":[],"urlList":[]}}