{"title":"Legend of Mana (u) [PSX]","uid":3396099,"size":343766371,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:9fd55095d558a9f240f2df282727a40f7dd9c7eb&amp;dn=Legend+of+Mana+%28u%29+%5BPSX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Frezzno","files":1,"time":1129233818,"description":"Legend of Mana PSX\n\nRar packed\nCDs: 1\nImage type: ccd,img,sub\nLanguage: US\nGame description:\nhttp://www.psxa2z.com/gpgs/BT0538.html\n\nMy description:\nI like this RPG because it doesn't follow the line of other RPGs. You don't wonder around in a big world solving quests. In this game you create your own world. The pieces of the world have been turned into artefacts and when you find one and release that piece you will be able to enter that place and other mysteries and artefacts will be revealed. The battle system is good. as you fight and gains exp you'll get new moves, yes it's action. Different weapons got their own spectacular moves and there're a lot of weapons to choose. The intro score is made by the same auther as The kingdom Hearts, and sang by another great japanese artist. I don't remember their names but it's amezing, the language of that song is in old swedish.\n\nPCSXBOX configurations:\nBios yes\nOld frameskip on\nFramelimit on\n\nThe intro FMV will have some stuttering sound and only left speaker but the game will run perfect. If you use regualr frameskip the intro will be ok but the ingame graffic transitions between the events will be jumpy. Also there are some wierd sound when walking on wooded surface, elsewere is perfect sound. Don't use HLE because it will hang after the nice swedish song, no mather what.\n\n\nOther games that I have and all works on the Xbox. Make request here if you want.\n\nAlundra ( http://thepiratebay.se/details.php?id=3389495 )\nAlundra 2\nBrigandine US ( http://thepiratebay.se/details.php?id=3388482 )\nBrigandine Grand Edition Jap\nBubble Bobble 2\nBust a Groove 1 and 2\nChrono Cross ( http://thepiratebay.se/details.php?id=3388893 )\nDiablo\nDigimon World ( http://thepiratebay.se/details.php?id=3394521 )\nFinal Fantasy VII\nLegand of Dragoon ( http://thepiratebay.se/details.php?id=3392365 )\nLunar 2 Eternal Blue Complete\nR-Type Delta\nSalamander DX\nStar Ocean the 2nd Story (Doesn't work on the pcsxbox, hangs on the first battle, sorry.)\nTop Shop\n\n/Frezzno\n\n\n- PSX - PCSXBOX - PSXBOX ----------------------------------------------\nPlaying PSX games on xbox is not only cool, it's also fun and pleasent.\nSometimes it's even better than playing on a real Playstation. That is\nif you got the game to actually work, which seems to be a difficult\ntask. Because of that few will choose to play PSX on the Xbox and a\ngame will be hard to find, as it already is. The Xbox community is big\nand by introducing the PSX there a dying race might rise again, or at\nleast not be forgotten. And others, both old and new, will have a\nchance to enjoy what once ruled the earth. Please help this community\nby uploading more games and include this entire tag to your description\nalong with details of Pcsxbox configuration for the game. By having\nthis tag a game will be easy to find and surely work on the Xbox when\nmaking a search on PCSXBOX or exclusively PSXBOX. While making a simple\nsearch on PSX others can enjoy it on other systems as well.\n\n/Thanks for sharing.\n-----------------------------------------------------------------------","torrent":{"xt":"urn:btih:9fd55095d558a9f240f2df282727a40f7dd9c7eb","amp;dn":"Legend+of+Mana+%28u%29+%5BPSX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fd55095d558a9f240f2df282727a40f7dd9c7eb","infoHashBuffer":{"type":"Buffer","data":[159,213,80,149,213,88,169,242,64,242,223,40,39,39,164,15,125,217,199,235]},"announce":[],"urlList":[]}}