{"title":"America's Next Top Model Cycle 21 Episode 1 S21E01 (The Boyz R B","uid":11015138,"size":250959927,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a0972e2d35f61d301c3db114ba6691ab6646c1f6&amp;dn=America%27s+Next+Top+Model+Cycle+21+Episode+1+S21E01+%28The+Boyz+R+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"magisterjieko","files":1,"time":1410459790,"description":"The Boyz R Back\nOriginal Airdate: August 18, 2014[8][9]\n\nThe season begins with thirty-one hopefuls being flown to Los Angeles for an inaugural EDM themed runway show. Cycle twenty contestant Cory Hindorff and Tyra Banks reveal that runway coach J. Alexander is back on the judging panel.\n\nImmediately afterwards, the models square off in pairs on the runway. Their assignment is to take selfies on the runway for people on social media to see. After the runway show, each contestant is interviewed by the judges before the first cut is made. One of the models, Jamie Rae, arrives several hours after the runway show has concluded.\n\nThe following day, all of them are taken to a bowling alley for elimination. Each semi finalist is asked to bowl in order to reveal what is on the score screen. Those who will continue for the second week of casting are greeted with a mark of approval on the screen. Those who have been eliminated are met with a rejection notice. At the conclusion of the episode, the contestants are reminded that only fourteen contestants will make the final cast and move into the top model home.","torrent":{"xt":"urn:btih:a0972e2d35f61d301c3db114ba6691ab6646c1f6","amp;dn":"America%27s+Next+Top+Model+Cycle+21+Episode+1+S21E01+%28The+Boyz+R+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0972e2d35f61d301c3db114ba6691ab6646c1f6","infoHashBuffer":{"type":"Buffer","data":[160,151,46,45,53,246,29,48,28,61,177,20,186,102,145,171,102,70,193,246]},"announce":[],"urlList":[]}}