{"title":"Paris and the Surrealists (Art Photo Ebook).pdf","uid":10142477,"size":30250683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0b56d9ce4b2804fbe99a0cdaabc20531c7368cd&amp;dn=Paris+and+the+Surrealists+%28Art+Photo+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1400021858,"description":"1992 / pdf / English / 160 pag / Thames and Hudson / 28.8 MB\n\nFrom Publishers Weekly\n\nIn a volume that is digressive yet evocative of Paris's lure, Melly ( The Life and Work of Scottie Wilson ) attempts to &quot;provide a parallel text&quot; for photos by Woods. Melly is nearest his goal when he reminisces about his decidedly unglamorous youthful wanderings through the city and his 1952 meeting with his hero, esteemed surrealist Andre Breton; Woods's duotone images, their grays so warm as to appear brown, often portray shop windows, monuments, street scenes that one might witness on an aimless stroll or from a seat in a cafe. However, the Parisian spirit at times effectively conjured here is lost during extensive reviews of three books Melly feels best express surrealist ideals and the flavor of Paris: Louis Aragon's Paris Peasant and Breton's Nadja and Mad Love . Overall, this collaboration repeatedly asserts but ultimately does not demonstrate that &quot;although historic surrealism is entombed in libraries and museums, its marvelous phantom still haunts the city of its birth.&quot; \n\nFrom Library Journal\n\nLondoners Melly and Woods have combined their talents not only to demonstrate why Surrealism had its inception in Paris but to cite evidence that &quot;its marvelous phantom still haunts the city of its birth.&quot; Melly's highly personal narrative recalls his first impressions of Paris in 1949 and his introduction to Surrealism. More than 35 years later, he traces the steps of the Surrealist writers and artists, touring the cafes, passageways, shop windows, and sculptural adornments that grace Paris and sparked the Surrealist imagination. Woods's 104 striking duotone prints perfectly reflect the Parisian aura of Surrealism. Melly also analyzes literary works by Andre Breton and Louis Aragon who were so influential to the movement. Those enamored of Paris will be captivated by this unconventional view. Recommended for browsing collections.\n- Joan Levin, MLS, Chicago","torrent":{"xt":"urn:btih:a0b56d9ce4b2804fbe99a0cdaabc20531c7368cd","amp;dn":"Paris+and+the+Surrealists+%28Art+Photo+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0b56d9ce4b2804fbe99a0cdaabc20531c7368cd","infoHashBuffer":{"type":"Buffer","data":[160,181,109,156,228,178,128,79,190,153,160,205,170,188,32,83,28,115,104,205]},"announce":[],"urlList":[]}}