{"title":"What the Dog Saw - Malcolm Gladwell [Qwerty80]","uid":7881419,"size":348090,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0df94d7c075e3891124b3f4a33bea3caad5928e&amp;dn=What+the+Dog+Saw+-+Malcolm+Gladwell+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"KatQwerty","files":3,"time":1354502903,"description":"What is the difference between choking and panicking? Why are there dozens of varieties of mustard-but only one variety of ketchup? What do football players teach us about how to hire teachers? What does hair dye tell us about the history of the 20th century?\n\nIn the past decade, Malcolm Gladwell has written three books that have radically changed how we understand our world and ourselves: The Tipping Point; Blink; and Outliers. Now, in What the Dog Saw, he brings together, for the first time, the best of his writing from The New Yorker over the same period.\n\nHere is the bittersweet tale of the inventor of the birth control pill, and the dazzling inventions of the pasta sauce pioneer Howard Moscowitz. Gladwell sits with Ron Popeil, the king of the American kitchen, as he sells rotisserie ovens, and divines the secrets of Cesar Millan, the &quot;dog whisperer&quot; who can calm savage animals with the touch of his hand. He explores intelligence tests and ethnic profiling and &quot;hindsight bias&quot; and why it was that everyone in Silicon Valley once tripped over themselves to hire the same college graduate.\n\n&quot;Good writing,&quot; Gladwell says in his preface, &quot;does not succeed or fail on the strength of its ability to persuade. It succeeds or fails on the strength of its ability to engage you, to make you think, to give you a glimpse into someone else's head.&quot; What the Dog Saw is yet another example of the buoyant spirit and unflagging curiosity that have made Malcolm Gladwell our most brilliant investigator of the hidden extraordinary.","torrent":{"xt":"urn:btih:a0df94d7c075e3891124b3f4a33bea3caad5928e","amp;dn":"What+the+Dog+Saw+-+Malcolm+Gladwell+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0df94d7c075e3891124b3f4a33bea3caad5928e","infoHashBuffer":{"type":"Buffer","data":[160,223,148,215,192,117,227,137,17,36,179,244,163,59,234,60,170,213,146,142]},"announce":[],"urlList":[]}}