{"title":"Protected Music Converter 1.7 + Serial  (DRM Removal for Itunes)","uid":6044420,"size":6717795,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a101e4604444340e2131323190d0ab3d0ddb03af&amp;dn=Protected+Music+Converter+1.7+%2B+Serial++%28DRM+Removal+for+Itunes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Lucy1948","files":2,"time":1292457808,"description":"Protected Music Converter is a software tool you can use for conversion of wide range of different audio file formats to most commonly used formats like MP3, OGG, WMA, WAV. This software is especially useful in case if you have protected music files you want to listen on playback device, which doesn't support particular DRM technology, like MP3 CD player, iPod/iPhone, Zune or other portable digital player, cell phone, Pocket PC, etc.\n\n\n#Main features of Protected Music Converter:\n* Straight and easy to use interface\nYou can easily convert your music file with just few mouse clicks: add your music files to batch list, select appropriate output format and press start button. You can create custom profiles for output format settings or use build-in standard profiles, Drag'n'Drop, Copy/Paste from MS Explorer are also included.\n* Protected music files conversion\nAll protected music files playable by both Windows Media Player and QuickTime Player can be converted to unprotected MP3, WMA, OGG, WAV. This is not protection removal though, software just plays protected files and places resulting sound into unprotected music file.\n* Wide range of supported input formats\nAll music files with filename extensions listed below are supported as valid input files for Protected Music Converter: wma, m4p, m4b, m4a, aac, ulw, au, sd2, amr, gsm, adts, caf, mpeg, mpg, m1s, m1v, m1a, m75, m15, mp2, mpm, mpv, mpa, snd, 3gp, 3gpp, m4v, swa, amc, 3g2, 3gp2, drv-ms, aif, aiff, aifc, asf, asx, wm, wmx, wmd, wmz, mp3, wax, ogg, wav\n* Batch conversion support\nIf you have massive amount of files you want to convert this software is exactly what you need to speed up the process.\n* Most recent audio codecs support\nProtected Music Converter uses most recent audio codecs, it internally supports WMA and OGG formats, for MP3 encoding it uses LAME encoder 3.97\n* Eligible Price\nYou can get it all with life-time technical support and all future updates for only $24.95 US Dollars\n\n#System requirements:\n* Windows NT, Windows 2003 32bit, Windows XP 32bit, Windows Vista 32bit\n* 256 Mb of free RAM\n* Windows Media Player 9 or higher\n* About 15Mb of free hard drive space","torrent":{"xt":"urn:btih:a101e4604444340e2131323190d0ab3d0ddb03af","amp;dn":"Protected+Music+Converter+1.7+%2B+Serial++%28DRM+Removal+for+Itunes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a101e4604444340e2131323190d0ab3d0ddb03af","infoHashBuffer":{"type":"Buffer","data":[161,1,228,96,68,68,52,14,33,49,50,49,144,208,171,61,13,219,3,175]},"announce":[],"urlList":[]}}