{"title":"David Burns - Feeling Good (Revised, 1999)","uid":4787177,"size":10038705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1404c3c185e7d2a5003ee8ee8eafa5f2ef15084&amp;dn=David+Burns+-+Feeling+Good+%28Revised%2C+1999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SatchMo7","files":1,"time":1237589164,"description":"This book is was voted the best self-help book out of 1000 books by 500 therapists. There have been several studies done that show that simply reading and following this book creates permanent cures 70% of the time, drug free. It's also a good handbook for the mind for everyone. Create a forward email with this book in it and pass it on to the whole world.\n\nOpen it up and hit ctrl+L for fullscreen for best reading ;)\n\nSatchMo\n\n\nfrom the pen of David Burns M.D....\n\n\nI have been centrally involved in the development of cognitive therapy, and this book is the first to describe these methods to the general public. The systematic application and scientific evaluation of this approach in treating clinical depression traces its origins to the innovative work of Drs. Albert Ellis and Aaron T. Beck, who began to refine their unique approach to mood transformation in the mid-1950's and early 1960's.* Their pioneering efforts began to emerge into prominence in the past decade because of the research that many mental-health professionals have undertaken to refine and evaluate cognitive therapy methods at academic institutions in the United States and abroad.\n\nCognitive therapy is a fast-acting technology of mood modification that you can learn to apply on your own. It can help you eliminate the symptoms and experience personal growth so you can minimize future upsets and cope with depression more effectively in the future.\n\nThe simple, effective mood-control techniques of cognitive therapy provide:\n\nRapid Symptomatic Improvement: In milder depressions, relief from your symptoms can often be observed in as short a time as twelve weeks.\n\nUnderstanding: A clear explanation of why you get moody and what you can do to change your moods. You will learn what causes your powerful feelings; how to distinguish &quot;normal&quot; from &quot;abnormal&quot; emotions; and how to diagnose and assess the severity of your upsets.\n\nSelf-control: You will learn how to apply safe and effective coping strategies that will make you feel better whenever you are upset. I will guide you as you develop a practical, realistic, step-by-step self-help plan. As you apply it, your moods can come under greater voluntary control.\n\nPrevention and Personal Growth: Genuine and long-lasting prophylaxis (prevention) of future mood swings can effectively be based on a reassessment of some basic values and attitudes which lie at the core of your tendency toward painful depressions. I will show you how to challenge and reevaluate certain assumptions about the basis for human worth.\n\nThe problem-solving and coping techniques you learn will encompass every crisis in modem life, from minor irritations to major emotional collapse. These will include realistic problems, such as divorce, death, or failure, as well as those vague, chronic problems that seem to have no obvious external cause, such as low self-confidence, frustration, guilt, or apathy.\n\nThe question may now occur to you, &quot;Is this just another self-help pop psychology?&quot; Actually, cognitive therapy is one of the first forms of psychotherapy which has been shown to be effective through rigorous scientific research under the critical scrutiny of the academic community. This therapy is unique in having professional evaluation and validation at the highest academic levels. It is not just another self-help fad but a major development that has become an important part of the mainstrem of modem psychiatric research and practice. Cognitive therapy's academic foundation. has enhanced its impact and should give it staying power for years to come. But don't be turned off by the professional status that cognitive therapy has acquired. Unlike much traditional psychotherapy, it is not occult and anti-intuitive. It is practical and based on common sense, and you can make it work for you.\n\nThe first principle of cognitive therapy is that all your moods are created by your &quot;cognitions,&quot; or thoughts. A cognition refers to the way you look at things--your perceptions, mental attitudes, and beliefs. It includes the way you interpret things--what you say. about something or someone to yourself. You feel the way you do right now because of the thoughts you are thinking at this moment.\n\nLet me illustrate this. How have you been feeling as you read this? You might have been thinking, &quot;Cognitive therapy sounds too good to be true. It would never work for me.&quot; If your thoughts run along these lines, you are feeling skeptical or even discouraged. What causes you. to feel that way? Your thoughts. You create those feelings by the dialogue you are having with yourself about this book!\n\nConversely, you may have felt a sudden uplift in mood because you thought, &quot;Hey, this sounds like something which might finally help me.&quot; Your emotional reaction is generated not by the sentences you are reading but by the way you are thinking. The moment you have a certain thought and believe it, you will experience an immediate emotional response. Your thought actually creates the emotion.\n\n--This text refers to the Paperback edition.","torrent":{"xt":"urn:btih:a1404c3c185e7d2a5003ee8ee8eafa5f2ef15084","amp;dn":"David+Burns+-+Feeling+Good+%28Revised%2C+1999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1404c3c185e7d2a5003ee8ee8eafa5f2ef15084","infoHashBuffer":{"type":"Buffer","data":[161,64,76,60,24,94,125,42,80,3,238,142,232,234,250,95,46,241,80,132]},"announce":[],"urlList":[]}}