{"title":"Shrek 4 Forever After - The Final Chapter[ac3 5.1 mp4 - Plus Don","uid":6029170,"size":1922544769,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a22a787c70c9507af3bb6bc86a536b452b1a0039&amp;dn=Shrek+4+Forever+After+-+The+Final+Chapter%5Bac3+5.1+mp4+-+Plus+Don&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"alanwatson","files":-1,"time":1292013584,"description":"Titles Comprise:\n\nShrek Forever After:\n\nIt started with a loveable ogre... who befriended a talking donkey... and rescued a beautiful princess in the unforgettable story that broke the mould for all animated films to follow. Now comes Shrek Forever After, the hilarious and fitting finale to this record-breaking, Oscar-winning movie phenomenon.\n\nLonging for the days when he was a &quot;real ogre&quot;, Shrek signs a deal with Rumpelstiltskin to get his roar back... but turns his world upside down in the process. Donkey suddenly can't remember his best friend; Fiona is now a tough warrior princess; and Puss in Boots is one fat cat! Together, they have just 24 hours to reverse the contract and restore happily FOREVER after to close the final chapter in this fine family film\n\nDonkey's Christmas Shrektacular:\n\nDonkey Decks the Swamp!\n\nDeck the halls with Donkey's laughter in this all-new holiday collection. Donkey presents his very own carolling stage show featuring his Far Far Away pals in this merry, musical treat with all the trimmings! Join in the fun as they bring their own Shrektacular spirit to festive holiday songs, a fun Donkey Decoration scramble, and a hilarious virtual Yule Log that's so funny... it's on fire.\n\n\nbe aware the donkey dvd included in my opinion is a complete waste of time but hey ,each to our own? , i sat through like 20 minutes of a fireplace with xmas songs !!/no wonder it was free with the boxset hmmm","torrent":{"xt":"urn:btih:a22a787c70c9507af3bb6bc86a536b452b1a0039","amp;dn":"Shrek+4+Forever+After+-+The+Final+Chapter%5Bac3+5.1+mp4+-+Plus+Don","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22a787c70c9507af3bb6bc86a536b452b1a0039","infoHashBuffer":{"type":"Buffer","data":[162,42,120,124,112,201,80,122,243,187,107,200,106,83,107,69,43,26,0,57]},"announce":[],"urlList":[]}}