{"title":"The German Army at Ypres, 1914","uid":15744614,"size":8767164,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2c8712ebbe75a603c6c9e83c51831d0fb386d14&amp;dn=The+German+Army+at+Ypres%2C+1914&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"marty14","files":1,"time":1472953505,"description":"The German Army at Ypres, 1914 by Jack Sheldon [epub]\r\n\r\nThis book will be the first complete account of the operations of the German army in the battles north of Lille in the late autumn of 1914. The main emphasis will be placed on the battles around Ypres against the Old Contemptibles of the BEF, but the fighting against the French and Belgian armies will also be featured, thus providing fresh and broader insights into a campaign. There are those who believe the BEF was all that saved world civilization as the first year of the Great War drew to its end.\r\n\r\nThe book uses the comprehensive histories of the participating German regiments found in the Kriegsarchiv in Munich and the Hauptstaatsarchiv in Stuttgart. Their use adds authority and authenticity to the book.\r\n\r\nThe narrative adopts a chronological approach. The book focuses on some of the most bitterly disputed battles of the first three months of the war, when the Germans strained to achieve a breakthrough and the BEF resisted heroically, at the price of its own destruction.\r\n\r\nThe book employs a similar format to the author’s previous works; the greater part of the text uses the words of the German participants themselves and the primary focus of the book covers the experiences of the fighting troops at regimental level and below. Linking paragraphs provide historical context and commentary and evidence from senior commanders will be introduced as necessary","torrent":{"xt":"urn:btih:a2c8712ebbe75a603c6c9e83c51831d0fb386d14","amp;dn":"The+German+Army+at+Ypres%2C+1914","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c8712ebbe75a603c6c9e83c51831d0fb386d14","infoHashBuffer":{"type":"Buffer","data":[162,200,113,46,187,231,90,96,60,108,158,131,197,24,49,208,251,56,109,20]},"announce":[],"urlList":[]}}