{"title":"Jim Fey - Love &amp; Logic Parenting Videos","uid":10661817,"size":1233080424,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a41470bb490296bc2a169215d092faa17af46dd9&amp;dn=Jim+Fey+-+Love+%26amp%3B+Logic+Parenting+Videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"acer47x","files":-1,"time":1406738707,"description":"Calming the Chaos (behavior improvement strategies for the child with ADHD)\n\nFour Steps to Responsibility (techniques to lead children to responsible decision making)\n\nLove and Logic (Love me enough to set some limits)\n\nLove and Logic (Parenting with Love and logic- teaching Children responsibilities)\n\nLove and Logic (Preparing Adolescents for responsible adulthood)\n\nShaping Self-Concept (encouraging kids to take risks and learn)\n\nWinning the Homework Battle (helping children discover and celebrate their strengths)\n\nWhat is love and logic?\nIf you do not have the books and you're a parent, get them now. The best I can do is an audio...These are amazing tools to let parents understand that children need to make mistakes while young, they need to know the consequences of their actions so when they become the adult they will have the proper tools and knowledge to be successful\n\n&quot;This is an approach to raising kids that provides loving support from parents while at the same time expecting kids to be respectful and responsible.\n\nThis program is known as Parenting with Love and Logic, a philosophy founded by Jim Fay and Foster W. Cline, M.D., and based on the experience of a combined total of over 75 years working with and raising kids.\n\nMany parents want their kids to be well prepared for life, and they know this means kids will make mistakes and must be held accountable for those mistakes. But these parents often fail to hold the kids accountable for poor decisions because they are afraid the kids will see their parents as being mean. The result is they often excuse bad behavior, finding it easier to hold others, including themselves, accountable for their children's irresponsibility.&quot;","torrent":{"xt":"urn:btih:a41470bb490296bc2a169215d092faa17af46dd9","amp;dn":"Jim+Fey+-+Love+%26amp%3B+Logic+Parenting+Videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a41470bb490296bc2a169215d092faa17af46dd9","infoHashBuffer":{"type":"Buffer","data":[164,20,112,187,73,2,150,188,42,22,146,21,208,146,250,161,122,244,109,217]},"announce":[],"urlList":[]}}