{"title":"Elvis Presley - Elvis Presley (1956) Legacy Edition Reissue 2011","uid":8935251,"size":305722123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a5aaa7ba889bb2d82d71fbee61ef2b12438cef13&amp;dn=Elvis+Presley+-+Elvis+Presley+%281956%29+Legacy+Edition+Reissue+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"l.diliberto","files":58,"time":1379548191,"description":"Elvis Presley - Elvis Presley (1956) Legacy Edition Reissue 2011 [Mp3 320] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=360136&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=360136&lt;/a&gt;\n\nAnno: July 1954 to January 1956 L.E.R. (2011)\nGenere: Rock and Roll \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://blog-imgs-45.fc2.com/m/a/n/manitame/20120107224047ccb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog-imgs-45.fc2.com/m/a/n/manitame/20120107224047ccb.jpg&lt;/a&gt;\n\nToday it all seems so easy -- RCA signs up the kid from Memphis, television gets interested at around the same time, and the rest is history. The circumstances surrounding this album were neither simple nor promising, however, nor was there anything in the history of popular music up to that time to hint that Elvis Presley was going to be anything other than &quot;Steve Sholes' folly,&quot; which was what rival executives were already whispering. So a lot was unsettled and untried at the first of two groups of sessions that produced the Elvis Presley album -- it wasn't even certain that there was any reason for a rock &amp; roll artist to cut an album, because teenagers bought 45s, not LPs. The first of Elvis' RCA sides yielded one song, &quot;Heartbreak Hotel,&quot; that seemed a potential single, but which no one thought would sell, and a few tracks that would be good enough for an album, if there were one. But no one involved knew anything for sure about this music. Seventeen days later, &quot;Heartbreak Hotel&quot; was released, and for about a month it did nothing -- then it began to move, and then Elvis appeared on television, and had a number one pop single. The album Sholes wanted out of Elvis came from two groups of sessions in January and February, augmented by five previously unissued songs from the Sun library. This was as startling a debut record as any ever made, representing every side of Elvis' musical influences except gospel -- rockabilly, blues, R&amp;B, country, and pop were all here in an explosive and seductive combination. Elvis Presley became the first rock &amp; roll album to reach the number one spot on the national charts, and RCA's first million dollar-earning pop album.\n\nLegacy's 2011 reissue of Elvis Presley is a double-disc set that pairs his classic debut with its sequel, Elvis, adding a bunch of non-LP singles and EP tracks, including several massive hits. Compared to the simultaneously released five-disc box Young Man with the Big Beat, this seems small but it contains the cream of Presley's glorious 1956, which will be enough for listeners either on a budget or those not in need of such a thorough examination. \n\n.: Tracklist :.\n\nSide One\n\nOriginal 1. &quot;Blue Suede Shoes&quot; Carl Perkins 1:58\nOriginal 2. &quot;I'm Counting on You&quot; Don Robertson 2:24\nOriginal 3. &quot;I Got A Woman&quot; Ray Charles and Renald Richard 2:23\nOriginal 4. &quot;One-Sided Love Affair&quot; Bill Campbell 2:09\nOriginal 5. &quot;I Love You Because&quot; Leon Payne 2:42\nOriginal 6. &quot;Just Because&quot; Sydney Robin, Bob Shelton, Joe Shelton 2:32\nOriginal 7. &quot;Tutti Frutti&quot; Dorothy LaBostrie and Richard Penniman 1:59\nOriginal 8. &quot;Tryin' to Get to You&quot; Rose Marie McCoy and Charles Singleton 2:33\nOriginal 9. &quot;I'm Gonna Sit Right Down and Cry (Over You)&quot; Howard Biggs and Joe Thomas 2:05\nOriginal 10. &quot;I'll Never Let You Go (Lil' Darlin')&quot; Jimmy Wakely 2:25\nOriginal 11. &quot;Blue Moon&quot; Richard Rodgers and Lorenz Hart 2:43\nOriginal 12. &quot;Money Honey&quot; Jesse Stone 2:36\n13. &quot;Heartbreak Hotel&quot; Mae Axton, Tommy Durden, Elvis Presley 2:08\n14. &quot;I Was The One&quot; Aaron Schroeder, Claude DeMetrius, Hal Blair, Bill Peppers 2:34\n15. &quot;My Baby Left Me&quot; Arthur Crudup 2:12\n16. &quot;Lawdy Miss Clawdy&quot; Lloyd Price 2:08\n17. &quot;Shake, Rattle &amp; Roll&quot; Jesse Stone 2:37\n\nSide two\n\n1. &quot;Rip It Up&quot; Robert Blackwell and John Marascalco 1:50\n2. &quot;Love Me&quot; Jerry Leiber and Mike Stoller 2:41\n3. &quot;When My Blue Moon Turns to Gold Again&quot; Gene Sullivan and Wiley Walker 2:18\n4. &quot;Long Tall Sally&quot; Robert Blackwell, Enotris Johnson, Richard Penniman 1:51\n5. &quot;First in Line&quot; Aaron Schroeder and Ben Weisman 3:21\n6. &quot;Paralyzed&quot; Otis Blackwell and Elvis Presley 2:18\n7. &quot;So Glad You're Mine&quot; Arthur Crudup 2:18\n8. &quot;Old Shep&quot; Red Foley 4:10\n9. &quot;Ready Teddy&quot; Robert Blackwell and John Marascalco 1:55\n10. &quot;Anyplace is Paradise&quot; Joe Thomas 2:26\n11. &quot;How's the World Treating You?&quot; Chet Atkins and Boudleaux Bryant 2:23\n12. &quot;How Do You Think I Feel&quot; Webb Pierce and Wiley Walker 2:10\n13. &quot;I Want You, I Need You, I Love You&quot; Lou Kosloff and George Mysels 2:40\n14. &quot;Hound Dog&quot; Jerry Leiber and Mike Stoller 2:16\n15. &quot;Don't Be Cruel&quot; Otis Blackwell and Elvis Presley 2:30\n16. &quot;Anyway You Want Me (That's How I Will Be)&quot; Cliff Owens and Aaron Schroeder 2:13\n17. &quot;Too Much&quot; Lee Rosenberg and Bernard Weinman 2:31\n18. &quot;Playing for Keeps&quot; Stan Kesler 2:50\n19. &quot;Love Me Tender&quot; Vera Matson and Elvis Presley 2:41","torrent":{"xt":"urn:btih:a5aaa7ba889bb2d82d71fbee61ef2b12438cef13","amp;dn":"Elvis+Presley+-+Elvis+Presley+%281956%29+Legacy+Edition+Reissue+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5aaa7ba889bb2d82d71fbee61ef2b12438cef13","infoHashBuffer":{"type":"Buffer","data":[165,170,167,186,136,155,178,216,45,113,251,238,97,239,43,18,67,140,239,19]},"announce":[],"urlList":[]}}