{"title":"[FSX] MegaSceneryEarth - Floridia Complete State scenery","uid":9279456,"size":14574921118,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5b20906e2fbbc97ad260599540f747c4e264b30&amp;dn=%5BFSX%5D+MegaSceneryEarth+-+Floridia+Complete+State+scenery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"toler820","files":22,"time":1385913709,"description":"Fly the entire state - BORDER to BORDER - of The Sunshine State - Florida in photoreal detail.\n\nFlorida is 65,755 square miles in size and has 593 airports. You'll see everything that you see in Florida in real life in the scenery.\n\nImagery is clear and crisp 50 cm source throughout for a stunningly realistic scenery.\n\nAs an added bonus, we now provide all the VFR and IFR charts in digital PDF format to enable you to get the most out of your scenery. This includes Sectionals, IFR enroute charts and 785 page book of Instrument Approach plates, Airport Diagrams, SIDs and STARs, and an Airport Facility Directory. The charts are downloadable along with your scenery files.\n\nSome of the cities and landmarks you'll get to enjoy as you explore Florida include:\n\nCities: Miami, Jacksonville, Tampa, Saint Petersburg, Hialeah, Orlando, Fort Lauderdale, Tallahassee\n\nLakes &amp; Water Bodies: Lake Okeechobee, Lake George, Lake Apopka, Lake Kissimmee, Tampa Bay, Charlotte Harbor, Biscayne Bay, 1800 miles of coastal Gulf of Mexico and Atlantic Ocean shoreline including the Florida Keys.\n\nMountains &amp; Hills: N/A. Florida is extremely flat with an average elevation of 100 ft!\n\nState Parks &amp; National Forests: Osceola, Apalachicola, Ocala, Big Cypress, The Everglades and dozens of state forests.\n\nMajor Rivers: St Johns, Withlacoochee, St Mary's, Suwanee, Apalachicola. 50,000 miles of rivers in total.\n\nDiscover the rest of it all for yourself! There's so much to see in Florida!","torrent":{"xt":"urn:btih:a5b20906e2fbbc97ad260599540f747c4e264b30","amp;dn":"%5BFSX%5D+MegaSceneryEarth+-+Floridia+Complete+State+scenery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5b20906e2fbbc97ad260599540f747c4e264b30","infoHashBuffer":{"type":"Buffer","data":[165,178,9,6,226,251,188,151,173,38,5,153,84,15,116,124,78,38,75,48]},"announce":[],"urlList":[]}}