{"title":"UK - 2015 - River - Series 1 - 6 (1280x720 ) Episodes","uid":12925855,"size":5731589398,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a6da193875aa0371a17d2bc03b7674ac89518f0f&amp;dn=UK+-+2015+-+River+-+Series+1+-+6+%281280x720+%29+Episodes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"bnaron","files":8,"time":1449466803,"description":"UK - 2015 - River\r\n                             Series 1\r\n                        6 (1280x720 ) Episodes\r\n\r\n\r\nShow Description Courtesy of: TheTVDB.com\r\n\r\nRespected police officer John River is a brilliant detective, whose fractured mind traps him between the living and the dead. River struggles to come to terms with the recent loss of a close colleague as he chases a suspect across London - with tragic consequences. Now at odds with authorities both within and outside of the police service, River finds himself in a precarious position as he seeks to bring closure to the mother of murdered teenager Erin Fielding, who blames him for failing to keep his promise to bring her daughter back alive. \r\n\r\nSeries 1 - 6 Episodes (Video: 1280x720, H264, 2000kbps)\r\n                      (Audio: ACC,242kbps, 48kHz, 6 Channel)\r\n\r\nEpisode Description:\r\n\r\n2015-10-13 - Episode 1\r\n\r\nJohn River is a respected police officer haunted by the murder victims whose secrets he must uncover. Struggling to come to terms with the recent loss of a close colleague, River chases a potential suspect across London, with tragic consequences. In his fragile mental state, he comes under increasing pressure both from the press and within the police force as calls for his dismissal grow. Meanwhile, the mother of a murdered teenager is growing increasingly desperate - the boyfriend has confessed but no body has been found, and she blames River for failing to make good on his promise to find her daughter.\r\n\r\n\r\n2015-10-20 - Episode 2\r\n\r\nStill wracked with grief over the death of his friend and partner Jackie 'Stevie' Stevenson, River and his colleagues must attend her wake. There he is surprised to come across her brother Jimmy - recently released after serving sixteen years for a brutal murder, in which Stevie's own evidence was key. River reaches breaking point as he begins to suspect that the man he chased to his death was innocent. The victim's pregnant and unstable girlfriend is on the warpath and pursues River, only to find in him an unexpected ally in a confusing world.\r\n\r\n\r\n2015-10-27 - Episode 3\r\n\r\nWith his career and access to the Stevie case resting on the outcome of his psychiatric report, River must keep his unofficial investigations into Stevie's death to himself. This sends tensions high with his new partner Ira, who fears being dragged down by River's instability, and Chrissie, who needs River working on his own caseload, most pressingly investigating a suspicious workplace accident that has left a foreman fighting for his life.\r\n\r\nBut River's mind is elsewhere as the discovery that Stevie has been keeping secrets forces him to reassess how well he knew his best friend and colleague. Unearthing new information about who Stevie spoke with in the lead-up to her murder throws suspicion on somebody close to her - somebody with real motive.\r\n\r\n\r\n2015-11-03 - Episode 4\r\n\r\nRiver's state of mind reaches crisis point as the team launch a manhunt to find the man who owned the car used in Stevie's murder. Was she really as lonely as River thought? As he tries to survive the torment of an uncontrollable manifest, a concerned Rosa encourages River to start attending a group she runs for like-minded troubled souls, with mixed results.\r\n\r\nMeanwhile a drunken evening at Chrissie's reveals that River may not be the only one with a less-than-perfect personal life. And when he discovers the surprising identity of someone Stevie spoke to the night she died, it looks like he's blown the case wide open.\r\n\r\n\r\n2015-11-10 -  Episode 5\r\n\r\nFollowing the murder in the public library, River and Ira must track down the killer. Their journey takes them deep into the world of the undocumented migrant community in London, a world of international hostels and immigration lawyers. They begin to get a sense of what it was that Stevie might have been unravelling before she died. Was it these investigations she was punished for?\r\n\r\nAnd as River finds himself back at the hearing voices group, an unfortunate contribution leads to River being drawn closer to Rosa, his colleague and counsellor. But as River finally finds some solace, Ira is led into the heart of the storm, and the spotlight is thrown onto somebody with an awful lot to lose.\r\n\r\n\r\n2015-11-17 - Episode 6\r\n\r\nRiver is convinced that Stevie's investigation into the exploitation of undocumented migrants holds the key to her murder. Further questioning of someone close to the team reveals a system of immigration cases that could lead into some very unexpected places. When a common link to certain businesses is found, it all starts to fall into place for River, with unfortunate repercussions.\r\n\r\nAs Stevie's loved ones reel from the truths unearthed, River holds the future in his hands. How will he keep his final promises to Stevie? How can he keep her secrets for her and do what is right? And, if he solves her murder, can he cope with losing her forever?","torrent":{"xt":"urn:btih:a6da193875aa0371a17d2bc03b7674ac89518f0f","amp;dn":"UK+-+2015+-+River+-+Series+1+-+6+%281280x720+%29+Episodes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6da193875aa0371a17d2bc03b7674ac89518f0f","infoHashBuffer":{"type":"Buffer","data":[166,218,25,56,117,170,3,113,161,125,43,192,59,118,116,172,137,81,143,15]},"announce":[],"urlList":[]}}