{"title":"Liars and Outliers-Brice Schneier","uid":8920858,"size":3477826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a766368dcd1320294a3ac29d7e6e20a091a77d22&amp;dn=Liars+and+Outliers-Brice+Schneier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"EdgarS789","files":2,"time":1379250649,"description":"The book discusses securityÂ’s unique role in facilitating and stabilizing human society. It looks at how and why security evolved, why it works the way it does, and -- this is the timely part -- what is it about the information society that changes everything. Schneier will model the fundamental trade-off of societal security -- individual self-interest vs. societal group interest -- as a group prisoner's dilemma problem, and use that metaphor to examine the basic mechanics of societal security. Written in SchneierÂ’s engaging and riveting voice, the book will be divided into three parts: Understanding People, Understanding Security, and Understanding TodayÂ’s World. The first part covers the Natural History of Security, The Economics of Security, The Psychology of Fear and Risk, The Psychology of Security Trade-Offs, The Honest Majority, and The Dishonest Minority. The second part covers Societal Security, The PrisonerÂ’s Dilemma, Using Morals to Solve a PrisonerÂ’s Dilemma, Using Reputation to Solve a PrisonerÂ’s Dilemma, Using Rules to Solve a PrisonerÂ’s Dilemma, and Security Solutions for a PrisonerÂ’s Dilemma. And in the third part, he walks the reader through PrisonerÂ’s Dilemmas in a Market Economy, Organizations and the PrisonerÂ’s Dilemma, Why Does This Fail So Often?, The PrisonerÂ’s Dilemma in the Information Society, and The Future of Societal Security. He concludes with the rhetorical dialogue with the reader of Does Society Need a Dishonest Minority?","torrent":{"xt":"urn:btih:a766368dcd1320294a3ac29d7e6e20a091a77d22","amp;dn":"Liars+and+Outliers-Brice+Schneier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a766368dcd1320294a3ac29d7e6e20a091a77d22","infoHashBuffer":{"type":"Buffer","data":[167,102,54,141,205,19,32,41,74,58,194,157,126,110,32,160,145,167,125,34]},"announce":[],"urlList":[]}}