{"title":"HALO COMBAT EVOLVED: ANNIVERSARY - COMPLEX - XBOX360 - RF {BOOB","uid":6810899,"size":8104331534,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a78840c172341b307c9510ba453af17ac20c3cfa&amp;dn=+HALO+COMBAT+EVOLVED%3A+ANNIVERSARY+-+COMPLEX+-+XBOX360+-+RF+%7BBOOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":6,"uploader":"boobsman","files":89,"time":1321032822,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-67F3_4EBD2921.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-67F3_4EBD2921.jpg&lt;/a&gt;\n\nHalo: Combat Evolved Anniversary is a spectacularly remastered version of the original \\\\\\&quot;Halo\\\\\\&quot; campaign, created in celebration of the 10th anniversary of one of the most beloved franchises in gaming history. With a bounty of new features including cooperative play over Xbox LIVE, a bundle of some of the most beloved multiplayer maps in \\\\\\&quot;Halo\\\\\\&quot; history reimagined for Xbox LIVE, new challenges and a new story to uncover, \\\\\\&quot;Halo: Anniversary\\\\\\&quot; is a must-have experience, coming exclusively to Xbox 360.\n\nDeveloped by 343 Industries in collaboration with Saber Interactive and Certain Affinity, Halo: Combat Evolved Anniversary immerses you in the landmark campaign and genre-defining multiplayer game that helped revolutionize the first-person shooter genre and sparked one of the most iconic science-fiction universes of all time.\n\nStunningly remastered campaign: Relive the award-winning adventure that defined \\\\\\&quot;Halo: Combat Evolved\\\\\\&quot; as one of the best games of the decade with breathtaking next-gen graphics and audio remastered for the Xbox 360. Engage in epic-scale battles against the backdrop of the eponymous \\\\\\&quot;Halo\\\\\\&quot; ringworld, and relive nostalgic memories with the ability to toggle Classic mode to play the original version.\n\nOnline campaign co-op: For the first time, experience the story that started it all with a friend on Xbox LIVE* and launch a cooperative assault against the Covenant, whether you live across the street or halfway around the world\n\nClassic \\\\\\&quot;Halo\\\\\\&quot; multiplayer maps reimagined: Wage battle on six detailed remakes of some of the most beloved \\\\\\&quot;Halo\\\\\\&quot; multiplayer maps of all time, and bring the fight to the Covenant on a stunning and resonant new Firefight map.1 Remastered in the \\\\\\&quot;Halo: Reach\\\\\\&quot; engine and inspired by maps from \\\\\\&quot;Halo: Combat Evolved\\\\\\&quot; and \\\\\\&quot;Halo 2,\\\\\\&quot; these iconic battlefields reignite the heart-pounding multiplayer action of the original favorites and let you relive epic confrontations like you\\\\\\'ve never experienced them. Developed in collaboration with Certain Affinity, the new multiplayer maps are included on the \\\\\\&quot;Halo: Anniversary\\\\\\&quot; game disc, which means players will not need to own the original \\\\\\&quot;Halo: Reach\\\\\\&quot; game to play. The first of the new remakes to be revealed at E3 Expo 2011 will be the fan-favorite map Damnation.\n\nNew challenges and enhanced story: Unlock up to 1,000 Achievement points as you clash with online opponents and battle through the campaign, and uncover never-before-revealed backstories told in motion-graphic form that foreshadow new mysteries in the story of Halo 4\n\nXGD3 BURN GUIDE: http://nickthegr33k.eu/XGD3burn.pdf\n\nTHIS IS A SCENE RELEASE, ALL CREDIT GOES TO THE ORIGINAL RIPPER!!!","torrent":{"xt":"urn:btih:a78840c172341b307c9510ba453af17ac20c3cfa","amp;dn":"+HALO+COMBAT+EVOLVED%3A+ANNIVERSARY+-+COMPLEX+-+XBOX360+-+RF+%7BBOOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a78840c172341b307c9510ba453af17ac20c3cfa","infoHashBuffer":{"type":"Buffer","data":[167,136,64,193,114,52,27,48,124,149,16,186,69,58,241,122,194,12,60,250]},"announce":[],"urlList":[]}}