{"title":"In the Line of Fire - A Memoir (gnv64)","uid":15428333,"size":15147592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a812fa30197e3fe3a734a0fa14e9412f6ce0baea&amp;dn=In+the+Line+of+Fire+-+A+Memoir+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gnv65","files":4,"time":1469695241,"description":"In the Line of Fire - A Memoir\r\nby Pervez Musharraf\r\nSimon &amp; Schuster | 2006 | ISBN-10: 074329582X | scanned PDF | 368 pages | 14.4 mb\r\n\r\nIt is almost unprecedented for a head of state to publish a memoir while still in office. But Pervez Musharraf is no ordinary head of state. As President of Pakistan since 1999, his is one of the most dangerous jobs in the world, and he continues to play a crucial role in the global war on terror. A one-time supporter of the Taliban, a general who fought in several wars, President Musharraf took a decisive turn against militant Islam in 2001. Since then he has survived two assassination attempts; rooted out militants in his own government; helped direct countless raids against al-Qaeda both in his cities and in the mountains; and tracked Osama bin Laden with technical and human intelligence. IN THE LINE OF FIRE is astonishingly revealing and honest about dozens of topics of intense interest to the world. Among its many revelations: exactly how Pakistani authorities tracked down and smashed three major al-Qaeda control centres in the mountains; how al-Qaeda's many-layered structure was revealed after the assassination attempts; Bin Laden's current position within the al-Qaeda hierarchy; what it has been like to deal with Bush and Blair; how Pakistan and India have avoided nuclear confrontation; and much more. The terrible earthquake of 2005, killing nearly 40,000 Pakistanis, is just one chapter in a life and career that has been filled with danger and drama. The worldwide launch of President Musharraf's memoir promises to be a sensation.\r\n\r\nCONTENTS\r\nPREFACE\r\nPROLOGUE - FACE-TO-FACE WITH TERROR \r\nPART ONE - IN THE BEGINNING \r\nPART TWO - LIFE IN THE ARMY \r\nPART THREE - THE HIJACKING DRAMA PHOTOS\r\nPART FOUR - REBUILDING THE NATION \r\nPART FIVE - THE WAR ON TERROR \r\nPART SIX - PAKISTAN AT HOME AND ABROAD \r\nEPILOGUE - REFLECTIONS \r\nINDEX\r\n \nhttps://s32.postimg.org/650d953ut/In_the_Line_of_Fire_A_Memoir.jpg","torrent":{"xt":"urn:btih:a812fa30197e3fe3a734a0fa14e9412f6ce0baea","amp;dn":"In+the+Line+of+Fire+-+A+Memoir+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a812fa30197e3fe3a734a0fa14e9412f6ce0baea","infoHashBuffer":{"type":"Buffer","data":[168,18,250,48,25,126,63,227,167,52,160,250,20,233,65,47,108,224,186,234]},"announce":[],"urlList":[]}}