{"title":"Rabbits - David Lynch 2002 [DVDrip Eng Sub ITA] TNT Village","uid":6426812,"size":313358489,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8289af782b773b710e3e4005639d88590c2b641&amp;dn=Rabbits+-+David+Lynch+2002+%5BDVDrip+Eng+Sub+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"l.diliberto","files":2,"time":1306502237,"description":"Rabbits - David Lynch 2002 [DVDrip Eng Sub ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=63824&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=63824&lt;/a&gt;\n\n.: Plot :.\n\nRabbits is a 2002 series of short video films written and directed by David Lynch. It depicts three humanoid rabbits in a room, played by Scott Coffey, Laura Elena Harring and Naomi Watts. Their disjointed conversations are interrupted by a random laugh track. Rabbits is presented with the tagline &quot;In a nameless city deluged by a continuous rain... three rabbits live with a fearful mystery&quot;. As with most of David Lynch's films, the score was composed by Angelo Badalamenti.\n\nRabbits takes place entirely within a single box set representing the living room of a house. Within the set, three humanoid rabbits enter, exit, and converse. One, Jack, is male and wears a smart suit. The other two, Suzie and Jane, are female, one of whom wears a dress, the other a dressing gown. In each episode, the rabbits converse in non sequiturs, each of which seems to have no connection to the line that came before. The lines invoke mystery, and include &quot;Were you blonde?&quot;, &quot;Something's wrong&quot;, &quot;I wonder who I will be&quot;, &quot;I only wish they would go somewhere&quot;, &quot;It had something to do with the telling of time&quot;, and &quot;no one must find out about this&quot;. The disordered but seemingly related lines the rabbits speak suggest that the dialogue could be pieced together into sensible conversations, but concrete interpretations are elusive.\n\nSome of the rabbits' lines are punctuated by a seemingly random laughtrack, in the manner of a sitcom. In addition, whenever Jack enters, the unseen audience whoops and applauds at great length. The rabbits themselves, however, remain serious throughout.\n\nIn some episodes, mysterious events take place, including the appearance of a burning hole in the wall and the intrusion of a strange, demonic voice. Three episodes involve a solo performance by one rabbit, in which they recite strange poetry.\n\n.: Trama :.\n\nRabbits ÃƒÂ¨ una serie di 9 cortometraggi scritta e diretta da David Lynch nel 2002. E' stata realizzata e pubblicata per www.davidlynch.com, dove ÃƒÂ¨ visibile soltanto ai membri registrati.\n\nOgni episodio si svolge nella stessa stanza in penombra (un salotto), (Naomi Watts, Laura Harring e Scott Coffey) che si muovono e interagiscono in modo bizzarro, interrotti da risate registrate a volume altissimo, senza tagli di montaggio (eccezion fatta per l'episodio 6, nel quale ÃƒÂ¨ presente un unico &quot;taglio&quot; sul telefono che squilla). In sottofondo, la presenza costante della pioggia e qualche tuono, che ogni volta fa perdere la messa a fuoco della telecamera. L'inquadratura ÃƒÂ¨ fissa, mimando un proscenio teatrale. La serie si pone a metÃƒÂ  tra il genere noir e quello surreale. La colonna sonora originale ÃƒÂ¨ di Angelo Badalamenti.\n\nProtagonisti della serie sono tre conigli, dei quali si puÃƒÂ² solamente supporre una qualche parentela reciproca, che si muovono e interagiscono in modo bizzarro. Il format ÃƒÂ¨ quello di una sitcom, con tanto di risate del pubblico registrate; negli episodi, perÃƒÂ², non ci sono battute divertenti e il pubblico applaude e ride in momenti apparentemente inappropriati (specialmente quando uno dei conigli parla del tempo). L'azione ÃƒÂ¨ minima e lunghe pause intercorrono nei dialoghi tra i personaggi, che risultano incoerenti per la maggior parte del tempo (con soventi allusioni a un non specificato &quot;esso&quot;). A un certo punto i conigli recitano a turno strofe incoerenti di poesia, cominciando da Jane e finendo con Suzie; il tutto viene interrotto da improvvisi lampi di consapevolezza, smorzati velocemente da un fiammifero acceso sullo sfondo. Con un effetto simile, una bocca diabolica viene mostrata due volte nello show, mentre biascica parole senza un senso apparente. CiÃƒÂ² che emerge chiaramente ÃƒÂ¨ che qualcosa di tenebroso ÃƒÂ¨ accaduto in seno alla famiglia, un &quot;terribile mistero&quot; che la serie, comunque, non espliciterÃƒÂ  mai.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img600.imageshack.us/img600/7623/rabbitsr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img600.imageshack.us/img600/7623/rabbitsr.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPaese \tUSA\nAnno \t2002\nDurata \t50 min\nGenere \tnoir\nRegia \tDavid Lynch\nSoggetto \tDavid Lynch\nSceneggiatura \tDavid Lynch\nProduttore \tDavid Lynch\nFotografia \tDavid Lynch\nMontaggio \tDavid Lynch\nMusiche \tAngelo Badalamenti\nScenografia \tJeremy Alter\n\nCast: Scott Coffey \t... \tJack\nRebekah Del Rio \t... \tJane\nLaura Harring \t... \tJane\nNaomi Watts \t... \tSuzie \n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione: 298 MB\nDurata: 00:42:39\n\nVideo Codec: DivX 4 (OpenDivX)\nVideo Bitrate: 847 kb/s\nRisoluzione: 720 x 576\nFPS (Frames/sec):25.000\nQF (Frame quality): 0.082\n\nAudio Codec: 0x0055(MP3, ISO) MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s total (2 chnls)\nFreq Audio: 44100Hz","torrent":{"xt":"urn:btih:a8289af782b773b710e3e4005639d88590c2b641","amp;dn":"Rabbits+-+David+Lynch+2002+%5BDVDrip+Eng+Sub+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8289af782b773b710e3e4005639d88590c2b641","infoHashBuffer":{"type":"Buffer","data":[168,40,154,247,130,183,115,183,16,227,228,0,86,57,216,133,144,194,182,65]},"announce":[],"urlList":[]}}