{"title":"Auschwitz - The Nazis and the Final Solution  (BBC)","uid":5025022,"size":4405314855,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8ae8d56df7f1414536d02904b2632b6e11e5819&amp;dn=Auschwitz+-+The+Nazis+and+the+Final+Solution++%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"sheila6","files":13,"time":1248646246,"description":"Combining rare footage with CGI illustrations and dramatic reconstructions, this documentary attempts to unfold the story and horrific ideologies behind the microcosmic Nazi State of Auschwitz. \n\nAuschwitz has a unique place in history. It is where the largest mass murder ever recorded occurred. It is hard to grasp how and why such a chilling place existed. This untold story of Auschwitz marks the 60th anniversary of the liberation of the camp.\n\n&quot;We need to make an attempt to understand how and why such horrors happened if we are ever to be able to stop them occurring again.&quot; Laurence Rees\n\nWritten and produced by BAFTA Award winning producer Laurence Rees, and using fresh new research, Auschwitz offers a unique perspective on the camp in which more than one million people were ruthlessly murdered.\n\nThe series follows the trail of evil from the very first origins of Auschwitz as a place to hold Polish political prisoners, through the Nazi solution for what they called 'the Jewish problem', to the development of the camp as a mechanised factory for mass murder. It interweaves exceptional new testimony from camp survivors and members of the SS with archive footage and drama reconstructions of some of the key decision-making moments.\n\nThe series is the result of three years of in-depth research, drawing on the close involvement of the world experts on the period. It is based on nearly 100 interviews with survivors and perpetrators, many of whom are speaking in detail for the first time.\n\nSensitively shot drama sequences, filmed on location using German and Polish actors, bring recently discovered documents to life on screen, whilst specially commissioned computer images give a historically accurate view of Auschwitz-Birkenau at all its many stages.\n\nThe computer animated images are based on plans from the Auschwitz construction office, which were captured after the war, eye-witness testimony and aerial photos.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a8ae8d56df7f1414536d02904b2632b6e11e5819","amp;dn":"Auschwitz+-+The+Nazis+and+the+Final+Solution++%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8ae8d56df7f1414536d02904b2632b6e11e5819","infoHashBuffer":{"type":"Buffer","data":[168,174,141,86,223,127,20,20,83,109,2,144,75,38,50,182,225,30,88,25]},"announce":[],"urlList":[]}}