{"title":"Hemi Sync Collection  Between worlds, Meditation and more","uid":4184021,"size":763070027,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a94aac0122cf697152be3c6f74088c8335338557&amp;dn=Hemi+Sync+Collection++Between+worlds%2C+Meditation+and+more&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Starlife","files":5,"time":1210562814,"description":"In the collection:\nPain Control\nConcentration\nTransendece verbal\nTransendece Non Verbal\nBetween worlds\n\n\nThe patented Hemi-SyncÃ‚Â® process has been refined with over 40 years of research and development. Ongoing experimentation, data collection and analysis are conducted at The Monroe Institute's laboratory facilities to demonstrate the correlation between subjective experiential reports and objective electronic measurements.\n\nSuch research is indispensable in revealing the influence of specific Hemi-SyncÃ‚Â® sound patterns on consciousness. Over the years, these efforts have resulted in the development of scores of individual products for specific applications such as focused attention, stress management, meditation, sleep enhancement, and pain management, to name a few.\n\nThanks to the cooperation of notable medical institutions and universities, the scientifically and clinically proven Hemi-SyncÃ‚Â® technology continues to be the focus of a variety of specialized research projects. In addition, many therapists, physicians, educators, and other professionals use Hemi-SyncÃ‚Â® extensively.\n\nThe Hemi-SyncÃ‚Â® process is internationally acclaimed. Thousands of people have journeyed from around the world to attend The Monroe Institute's life-enhancing residential programs. These programs, conducted at the Institute's training facilities in Virginia, are dedicated to developing, exploring, and applying expanded states of consciousness using the extraordinary Hemi-SyncÃ‚Â® sound technologies.\n\nPain Management \nListening to Pain Management can help you reduce pain signals until they no longer seem significant. You will also learn an effective, time-proven method to diminish pain signals anywhere. Use Pain Management to help restore the vitality and dynamic energy needed for the perfect functioning of both mind and body. This remarkable Hemi-SyncÃ‚Â® exercise helps you balance and equalize your mental, emotional, and physical self and guides you gently into a deeply, restorative sleep. (Mind Food - Verbal) 44 min. \n\nConcentration\nPerfect for any mental task requiring focus and concentration - use at home, work or school while studying, reading, working on a computer or balancing a checkbook. Play in the background or use with headphones to enhance mental capabilities while stimulating creativity and imagination. (Mind Food - Non-verbal) 58 min. \n\nTranscendence \nMove beyond your thoughts and daily concerns as you listen to the deeply relaxing Hemi-SyncÃ‚Â® sound patterns of Transcendence. The verbal guidance and Hemi-SyncÃ‚Â® signals incorporated on Track/Side 1 will lead you in the exploration of expanded states of consciousness. Create your own experiences with Track/Side 2, an extended free flow exploration without verbal guidance. Transcendence will leave you centered, focused, and totally refreshed. (Mind Food - Track/Side 1 - Verbal; Track/Side 2 - Nonverbal) 73 min. \n\nBetween Worlds\nAn extraordinary sojourn into a dreamlike shamanic landscape. The captivating shamanic music of Don Peyote and Naasko is combined with Hemi-Sync to guide your inner journey. Sounds from the rain forest contribute to the surreal, organic ambience. Vivid images emerge as time blurs and the world disappears. For optimum results, listen to this experiential composition in one session?preferably in a darkened, meditative environment. Instruments featured: didgeridoo, flutes, mbira, synthesizer, indigenous chants, shamanic percussion and field recordings. Length: 52 minutes \n\nClick my name to see more interesting torrents and collections.\nUnconditional Love and evolving Light to you.\nStarlife\n","torrent":{"xt":"urn:btih:a94aac0122cf697152be3c6f74088c8335338557","amp;dn":"Hemi+Sync+Collection++Between+worlds%2C+Meditation+and+more","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94aac0122cf697152be3c6f74088c8335338557","infoHashBuffer":{"type":"Buffer","data":[169,74,172,1,34,207,105,113,82,190,60,111,116,8,140,131,53,51,133,87]},"announce":[],"urlList":[]}}