{"title":"The Year Without Pants pdf &amp; epub Gooner","uid":8946697,"size":9477548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9736c53c79d69303321e8336b8eb0eed659212d&amp;dn=The+Year+Without+Pants+pdf+%26amp%3B+epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1379793600,"description":"A behind-the-scenes look at the firm behindand the unique work culture that contributes to its phenomenal success\n50 million websites, or twenty percent of the entire web, use WordPress software. The force behindis a convention-defying company called Automattic, Inc., whose 120 employees work from anywhere in the world they wish, barely use email, and launch improvements to their products dozens of times a day. With a fraction of the resources of Google, Amazon, or Facebook, they have a similar impact on the future of the Internet. How is this possible? What's different about how they work, and what can other companies learn from their methods?\n\nTo find out, former Microsoft veteran Scott Berkun worked as a manager atleading a team of young programmers developing new ideas. The Year Without Pants shares the secrets ofphenomenal success from the inside. Berkun's story reveals insights on creativity, productivity, and leadership from the kind of workplace that might be in everyone's future.\n\nOffers a fast-paced and entertaining insider's account of how an amazing, powerful organization achieves impressive results\nIncludes vital lessons about work culture and managing creativity\nWritten by author and popular blogger Scott Berkun (scottberkun.com)\nThe Year Without Pants shares what every organization can learn from the world-changing ideas for the future of work at the heart of Automattic's success.\n\nThis comes in both .epub and .pdf format","torrent":{"xt":"urn:btih:a9736c53c79d69303321e8336b8eb0eed659212d","amp;dn":"The+Year+Without+Pants+pdf+%26amp%3B+epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9736c53c79d69303321e8336b8eb0eed659212d","infoHashBuffer":{"type":"Buffer","data":[169,115,108,83,199,157,105,48,51,33,232,51,107,142,176,238,214,89,33,45]},"announce":[],"urlList":[]}}