{"title":"A man for all seasons (1966) 720 X 480 DivX with  Paul Scofield","uid":5162932,"size":849045698,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a9e25a5c62c1f59386fef4df76ee17c6b423a31f&amp;dn=A+man+for+all+seasons+%281966%29+720+X+480+DivX+with++Paul+Scofield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"mrizzo2","files":-1,"time":1258251506,"description":"This is a re-launch of this successful movie title on a multi-tracker torrent\nthis time around. Please join in to seed if youve previously downloaded it. dank!\n\nExcellent picture and sound quality. 720 X 480 colour video 128k audio\n\nAcademy Award winner - best picture, 1966\n\nPlease check the net for any compatible subtitles if you should need them.\nYou can also download an excellent program from Denmark, on the Internet\n(its either free or donation supported I would think - its worth paying\nsomething for)called &quot;Subtitle editor&quot;. You can use it to make any improvements\nto exisiting subtitles on the net, or to create your own for your community.\n\n\nThis is a work that is much studied in schools, including the University\nDepartments of English literature and even Political Philosophy. Its a must for \nall thinking minds, to come to terms with the issues involved, and sensibly so.\n\nThe reformation came at an important time for England. In any event it was\nmainly overdue given the harsh constraints of following dictates from Rome that\ndid not fit with the needs of the people at the time, particularly in respect\nof divorce as a legitimate alternative to &quot;Royal execution&quot; of Queens to fit\nthe letter of the law as it were. The conflict between those who follow a sense\nof conscience and duty - based on legalities and semantics rather than dictates\nof the best spirited cause.\n\nThere are those that assign a certain value to certain gestures or oaths, not\nallowing an encroachment into this sense of perfect allegiance, even while\nbeing unable to maintain a reasonable conscience instead, all too often as a\nresult of such shallow thinking.\n\nOn the other hand human nature and its best disposition on such matters - it\nreally deals with composition in fact - after all it is my claim that we are\ndifferently endowed each one of us as to our sense of right reason in these\nmatters to the extent of identifying altogether differing orientations between\nmen. Should someone lose his life and high office - executed in fact for not\nallowing his conscience to be bothered by agreeing to divorce as an option for\nthe king of the day? Watch the movie and decide for yourself.\n\nMichael Rizzo Chessman\nplease see my reviews at moviesbyrizzo.info","torrent":{"xt":"urn:btih:a9e25a5c62c1f59386fef4df76ee17c6b423a31f","amp;dn":"A+man+for+all+seasons+%281966%29+720+X+480+DivX+with++Paul+Scofield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9e25a5c62c1f59386fef4df76ee17c6b423a31f","infoHashBuffer":{"type":"Buffer","data":[169,226,90,92,98,193,245,147,134,254,244,223,118,238,23,198,180,35,163,31]},"announce":[],"urlList":[]}}