{"title":"Finding Your Voice (Writing) [Epub &amp; Mobi] [StormRG]","uid":10287829,"size":691750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9fa52e9537ae785e1de247cab4b70d5dce10d35&amp;dn=Finding+Your+Voice+%28Writing%29+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"krystine","files":-1,"time":1401815321,"description":"Finding Your Voice: How to Put Personality in Your Writing\nAuthor: Les Edgerton\nPublished: 2012\nPublisher: Blue Skies Books\nASIN: B007VEGNS6\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nYou know a great literary &quot;voice&quot; when you hear it: David Sedaris' humorous cynicism. Elmore Leonard's weary, smart-mouthed dialogue. Nick Hornby's simple yet imaginative descriptions. It's the kind of writing you should aspire to, right?\n\nWell...not quite. Each of these authors found success in part by developing their own unique voice: a writing style that helped define - and throw the spotlight on - their work.\n\nNow Les Edgerton shows you how to develop a voice of your own, one that rises above the literary din because of its individuality, not in spite of it!\n\nInside, he provides guidelines, advice and dozens of exercises for recognizing and developing a natural style that will make your characters, stories and dialogue better and more memorable. You'll learn:\n\n- How to make any piece you write unmistakably yours and yours alone\n- What agents and editors really think about using your own voice\n- How to write better by ignoring the rules\n- The keys to getting your voice and personality on the page\n- How to get back the unique voice you may have lost by trying to write like someone else\n\nWhether you write fiction, non-fiction or poetry, Finding Your Voice is a must for your personal library. Let's face it - editors, agents and readers all want to read something fresh and new. By finding your voice, you'll be giving them exactly what they want!","torrent":{"xt":"urn:btih:a9fa52e9537ae785e1de247cab4b70d5dce10d35","amp;dn":"Finding+Your+Voice+%28Writing%29+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9fa52e9537ae785e1de247cab4b70d5dce10d35","infoHashBuffer":{"type":"Buffer","data":[169,250,82,233,83,122,231,133,225,222,36,124,171,75,112,213,220,225,13,53]},"announce":[],"urlList":[]}}