{"title":"Essentials of Advanced Composite Fabrication and Repair","uid":15454153,"size":22336013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa1a17b1327f96320f9470cc5312f45cc17a0a7b&amp;dn=Essentials+of+Advanced+Composite+Fabrication+and+Repair&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1469967780,"description":"Essentials of Advanced Composite Fabrication and Repair - Louis C. Dorworth et al. (Abaris Training, 2009).pdf\r\n\r\n&quot;Essentials of Advanced Composite Fabrication and Repair&quot; is the complimentary text to the basic Abaris Training composite courses. The text assumes no prior knowledge about advanced composite materials, and gradually makes the reader conversant in composite terminology. Although largely geared toward the aerospace industry, it will also appeal to readers working in sporting goods, wind energy, marine and motor sports industries. After giving a comprehensive description of what composites are and how they work, the book breaks the materials down into their constituents; different types of fibers; carbon, aramid, glass, and others; matrix materials; ceramics, thermoplastic and specifically thermoset resins and their different chemistries. It then goes into detail about design considerations and guidelines, various tooling concepts, manufacturing methods, and accepted repair theories and concepts. Other sections include the most up-to-date information on adhesive bonding technology, core materials, materials testing and non-destructive inspection (NDI) techniques and equipment","torrent":{"xt":"urn:btih:aa1a17b1327f96320f9470cc5312f45cc17a0a7b","amp;dn":"Essentials+of+Advanced+Composite+Fabrication+and+Repair","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa1a17b1327f96320f9470cc5312f45cc17a0a7b","infoHashBuffer":{"type":"Buffer","data":[170,26,23,177,50,127,150,50,15,148,112,204,83,18,244,92,193,122,10,123]},"announce":[],"urlList":[]}}