{"title":"Axure.RP.Pro.v6.0.0.2894.for.MacOSX-BEAN [ak]","uid":6408158,"size":28931307,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:ab955d11804e39865182375d5b12767f45af1f12&amp;dn=Axure.RP.Pro.v6.0.0.2894.for.MacOSX-BEAN+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1305883464,"description":"Axure RP Pro 6.0.0.2894 for MacOSX\n\nAxure RP is the leading tool for rapidly creating wireframes, prototypes and specifications for applications and web sites. Axure RP enables application designers to create wireframes, flow diagrams, prototypes, and specifications for applications and web sites faster and easier than creating static mockups with their current tools. Used by professionals including business analysts, information architects, usability experts, product managers, and IT consultants around the world from Fortune 1000 companies to independent agencies. Axure RP has become an essential tool for successful application design.\n\nWireframes are an effective tool for collecting and presenting functionality, navigation, and content of an application or web site. Attaching annotations or notes to elements or widgets on the wireframe eliminate guesswork and help clarify specific functions. With Axure RP Pro, creating annotated wireframes is fast and effective, allowing you to focus on the design instead of the documentation.\n\nWireframes: Rapidly design user interfaces in a familiar drag and drop environment with features like snap to grid and zoom.\nSitemap: Create and organize pages in the sitemap.\nWidgets: Use ready-made widgets including buttons, form fields, shapes, and dynamic elements. Edit and format them in a familiar environment.\nMasters: Create your own reusable design elements like headers and footers. A change to a master is reflected everywhere the master is used.\nAnnotations and Interactions: Add organized notes, links, and dynamic interactions as you design the wireframe.\n\nPrototyping is an effective way to simplify documentation, elicit increased user input, identify missing requirements earlier, and minimize extraneous requirements. Reams of documentation can be captured in annotated, interactive screens that grab the attention of stakeholders and users. With Axure RP Pro, creating interactive, browser-based prototypes is as simple as a click of a button and does not require writing a single line of code! Generate interactive HTML prototypes with the click of a button. Demonstrate and test your design with working links, interactions, and conditional logic. View annotations by clicking note icons next to annotated widgets. Share your HTML prototypes with teammates and clients to view in Internet Explorer or Firefox without installing a player.\n\nSpecifications are an effective way to document, communicate, and achieve agreement on a design. With Axure RP, generate easy-to-read, professional functional specifications that coincide with the flow diagrams and annotated wireframes in your design. Generate functional specifications to Microsoft Word format in seconds complete with screenshots, annotations, and interactions. Use built-in templates or create customized templates with your look. Select single column or two-column layouts. Choose and configure content for your specification like screenshots, annotation fields, and widget text.\n\nKey benefits:\nÃ‚Â» Design efficiently.\nÃ‚Â» Experience your design early to test ideas.\nÃ‚Â» Engage stakeholders to gather valuable feedback.\nÃ‚Â» Automate specifications avoiding tedious documentation.\nÃ‚Â» Enable design collaboration.\n\nFeatures:\nÃ‚Â» Easy to use\nÃ‚Â» Masters for quick changes\nÃ‚Â» Instantly generate functional prototypes\nÃ‚Â» Interactive prototypes with annotations\nÃ‚Â» Instantly generate specifications\nÃ‚Â» Customizable\nÃ‚Â» Check in/check out system\nÃ‚Â» Version control\n\nHome Page - http://www.axure.com/\n","torrent":{"xt":"urn:btih:ab955d11804e39865182375d5b12767f45af1f12","amp;dn":"Axure.RP.Pro.v6.0.0.2894.for.MacOSX-BEAN+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab955d11804e39865182375d5b12767f45af1f12","infoHashBuffer":{"type":"Buffer","data":[171,149,93,17,128,78,57,134,81,130,55,93,91,18,118,127,69,175,31,18]},"announce":[],"urlList":[]}}