{"title":"Laura De Giorgio - Sexual Magnetism with Deep Trance Hypnosis","uid":8298765,"size":263426500,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:abce9bcb86bf970f4875c2d5902501a2d26cc4af&amp;dn=Laura+De+Giorgio+-+Sexual+Magnetism+with+Deep+Trance+Hypnosis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"mikem777","files":26,"time":1364171193,"description":"Sexual energy is the essence of vitality - and what you can do with it may be yet beyond your wildest imagination. People who have an abundance of sexual energy have not only greater sexual appeal, but also a greater appetite for life, greater confidence. They find it easier to get what they desire in life because they become naturally magnetic and people like to be around them. Around some intensely sexually magnetic people you can almost feel electric sparks and you'd just love to share those fireworks. Some people channel their sexual energy into sexual pursuits, some into business pursuits and some like to use it for healing, rejuvenation and for spiritual pursuits. You can use the techniques you learn in this program to improve in some way every area of your life, whether you'd like the opposite sex to fly to you like bees fly to honey and embark upon sensual adventures, or upon successful business adventures or even spiritual adventures.\n\nDevelop Sexually Magnetic Personality\nGenerate Sexual Energy\nProject Sexual Energy to One Person or to a Group of People\nProject Sexual Energy through your eyes, handshake, others parts of your body, or simply with your mind\nProject Sexual Energy to a person (or people) who is present\nProject Sexual Energy to a person who is physically absent - also known as &quot;Remote Seduction&quot;\nEstablish Rapport with another person\nPace and Lead another person\nRead Sexual Body Language\nUse Sexual Body Language to Establish Sexual Rapport\nUse Essential Hypnotic Language Patterns\nMentally Activate and Stimulate the Sexual Energy Center of another person\nCreate a Sexually Magnetic Aura around you\n\nIncludes several books about tantra and sacred sexuality.","torrent":{"xt":"urn:btih:abce9bcb86bf970f4875c2d5902501a2d26cc4af","amp;dn":"Laura+De+Giorgio+-+Sexual+Magnetism+with+Deep+Trance+Hypnosis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abce9bcb86bf970f4875c2d5902501a2d26cc4af","infoHashBuffer":{"type":"Buffer","data":[171,206,155,203,134,191,151,15,72,117,194,213,144,37,1,162,210,108,196,175]},"announce":[],"urlList":[]}}