{"title":"Pinker, S. - Better Angels of Our Nature 2011 AUDIO","uid":6886392,"size":972195861,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac045e115c5ef61ec50754f0d7ce6f746fa550d9&amp;dn=Pinker%2C+S.+-+Better+Angels+of+Our+Nature+2011+AUDIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":6,"time":1323848907,"description":"Audio Books : Educational : MP3/Variable : English\nWe've all had the experience of reading about a bloody war or shocking crime and asking, &quot;What is the world coming to?&quot; But we seldom ask, &quot;How bad was the world in the past?&quot; In this startling new book, the best-selling cognitive scientist Steven Pinker shows that the world of the past was much worse. In fact, we may be living in the most peaceable era in our species' existence.\nEvidence of a bloody history has always been around us: the genocides in the Old Testament and crucifixions in the New; the gory mutilations in Shakespeare and Grimm; the British monarchs who beheaded their relatives and the American founders who dueled with their rivals; the nonchalant treatment in popular culture of wife-beating, child abuse, and the extermination of native peoples. Now the decline in these brutal practices can be quantified.\nWith the help of more than a hundred graphs and maps, Pinker presents some astonishing numbers. Tribal warfare was nine times as deadly as war and genocide in the 20th century. The murder rate in medieval Europe was more than thirty times what it is today. Slavery, sadistic punishments, and frivolous executions were unexceptionable features of life for millennia, then suddenly were targeted for abolition. Wars between developed countries have vanished, and even in the developing world, wars kill a fraction of the numbers they did a few decades ago. Rape, battering, hate crimes, deadly riots, child abuse, cruelty to animals - all substantially down.How could this have happened, if human nature has not changed? What led people to stop sacrificing children, stabbing each other at the dinner table, or burning cats and disemboweling criminals as forms of popular entertainment? Was it reading novels, cultivating table manners, fearing the police, or turning their energies to making money? Should the nuclear bomb get the Nobel Peace Prize for preventing World War III? Does rock and roll deserve the blame for the doubling of violence in the 1960s - and abortion deserve credit for the reversal in the 1990s?\nNot exactly, Pinker argues. The key to explaining the decline of violence is to understand the inner demons that incline us toward violence (such as revenge, sadism, and tribalism) and the better angels that steer us away. Thanks to the spread of government, literacy, trade, and cosmopolitanism, we increasingly control our impulses, empathize with others, bargain rather than plunder, debunk toxic ideologies, and deploy our powers of reason to reduce the temptations of violence.\nWith the panache and intellectual zeal that have made his earlier books international best sellers and literary classics, Pinker will force you to rethink your deepest beliefs about progress, modernity, and human nature. This gripping book is sure to be among the most debated of the century so far.","torrent":{"xt":"urn:btih:ac045e115c5ef61ec50754f0d7ce6f746fa550d9","amp;dn":"Pinker%2C+S.+-+Better+Angels+of+Our+Nature+2011+AUDIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac045e115c5ef61ec50754f0d7ce6f746fa550d9","infoHashBuffer":{"type":"Buffer","data":[172,4,94,17,92,94,246,30,197,7,84,240,215,206,111,116,111,165,80,217]},"announce":[],"urlList":[]}}