{"title":"Medal.of.Honor.Anthology-R.G.Mechanics","uid":10699990,"size":26494703692,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ac55697961fcdd8a0231c54362abb8f5e4e62c8c&amp;dn=Medal.of.Honor.Anthology-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"Taker009","files":-1,"time":1407214751,"description":"Medal.of.Honor.Anthology-R.G.Mechanics\n\n\n\n\n\nMedal of Honor Allied Assault - Complete Edition\n\n\nGame information:\n\nMedal of Honor Allied Assault\n\nDilapidated buildings, bullets, watering all around like a summer\ndownpour, wounded soldiers, begging for help, the howling of\nbombers, grenade explosions, the roar of guns and the chatter\nof machine-gun bursts - in this incredibly atmospheric game\nyou immerse yourself in a very realistic world of the Second\nWorld War. Named dozens of gaming publications as &quot;Best fighter\nin 2002&quot;, Allied Assault gives you the ability to see through\nthe eyes of the Second World leytinanta Allied troops, as fate\ntook part in the most important battles of the war.\n\nMedal of Honor Allied Assault: Spearhead\n\nThis is the official addition to one of the most popular games\non the events of World War II - the game Medal of Honor: Allied\nAssault, as critics say, the quality of design, variety of tasks\nand emotional tension far exceeds even triumphant original.\nIn the game with the maximum historical accuracy of events\ndisplayed the final episodes of the war, and it ends with a\ngrand battle for Berlin.\n\nMedal of Honor Allied Assault: Breakthrough\n\nOfficial addition Medal of Honor Allied Assult Breakthrough open for you one\nstep of the Second World War - the theater of military operations in southern\nEurope and northern Africa. 11 single-player levels, 9 maps for multiplayer,\nnew weapons, and, of course, improvements in gameplay. Now you can drive a tank,\nindicate the purpose of a Union artillery defuse the minefields, and to test\na new type of collective competition Liberation.\n\n\nRepack Features:\n\nMedal of Honor Allied Assault\n\nGame Version - v1.11\nDo not cut / recoded\nIncludes crack text from ZoG v1.05\nIncludes v1.01 Crack sound from ZoG\nAbility to select a combination of text and voice\n\nMedal of Honor: Allied Assault Spearhead\n\nGame Version - v2.15\nDo not cut / recoded\nIncludes crack text from ZoG v1.05\nIncludes crack sound from v1.0 ZoG\nAbility to select a combination of text and voice\n\nMedal of Honor: Allied Assault Breakthrough\n\nVersion of the game - v2.40b\nDo not cut / recoded\nIncludes crack text from ZoG v1.05\nIncludes crack sound from v1.0 ZoG\nAbility to select a combination of text and voice\n\n\n\nMedal of Honor Pacific Assault\n\n\nGame information:\n\nThe game is dedicated to the Second World War, namely the fighting against\nthe Japanese fleet in the Pacific. Your character will be Tom Conlin,\nPrivate, U.S. Marine Corps. Action game begins with the bloody battle\nof Tarawa atoll, then you have to go back in time and step by\nstep through the entire Pacific campaign.\n\nGame Features:\n\nExclusive light machine gun as one of the shafts in the game.\nHolder of the regular version will not see it.\nWWII Timeline Presentation - historical facts and information\non which is built or that mission in the game.\nIn-Game Music with Commentary - the entire soundtrack MoHPA\nwith comments of its author, Eric Kreybera.\nMedal of Honor: Paths of Glory - interviews with veterans\nof fighting in the Pacific theater of operations during\nWorld War II.\nSilent Drill Platoon - demonstrations eponymous squad.\nThe Thought War - movie about the various promotional\ntricks that were used on both sides of the front.\nMaking of the Game - video about how to make a game.\nIntro Movies with Commentary - all the videos from\nthe game with a director's commentary Brady Bell.\nPop-up facts-Â«pop&quot; during the game interesting\nfacts. Very informative.\n\nRepack Features:\n\nMedal of Honor Pacific Assault\nVersion of the game - v1.2\nDo not cut / recoded\n\nMedal of Honor Airborne\n\n\nGame information:\n\nGame by your rules! Each task can be done in different ways!\nBe smarter and luckier enemy, because of the success depends\nnot only your life, but the whole operation!\nCount to three and pull the ring! Each mission begins with the\nlanding. During the flight, you can not just look at the sides,\nbut also to control a parachute!\nBest weapon of war! In your hands the most devastating firearm\nduring the Second World War. All pistols, submachine guns and\nrifles have a real live performance!\nShooting in the top ten! Gradually weapon skills improve.\nTrain and eventually become a real sniper!\nNastoschyaie actors play soldiers! Drawing a new generation\nwill maximize realism. Soldiers like real people and the world\naround us - on the documentary footage.\nBelieve what is happening is very easy!\n\nRepack Features:\n\nMedal of Honor Airborne\nVersion of the game - v1.3\nDo not cut / recoded\n\nMedal of Honor\n\n\nGame information:\n\nThese soldiers have no equal. They are - professionals - the\nbest of the best. How many of them - is not precisely known,\nbut hardly more than a few hundred. They report directly to\nthe command of U.S. forces. They are referred to only in the\nhottest point and assign tasks to successfully execute that\nbeyond the power of anyone else. They - the elite soldiers\nof Tier 1 Operators. Introduced in Medal of Honor single\nplayer campaign was developed in close cooperation with the\nveterans and current members of Tier 1 division. It is\nbased on real events, which told the participants. It is\nthanks to these people the authors Medal of Honor could\naccurately recreate the atmosphere of modern war. In the\nrole of elite soldier Tier 1, consisting of one division\nof the U.S. army the player will fight against the forces\nof &quot;Taliban&quot; and &quot;Al Qaeda&quot; in the harsh Afghan soil.\nMultiplayer mode Medal of Honor designed by world famous\nstudio DICE, which created the famous series Battlefield.\nIn these brutal battles, each player will have to fight\nfor survival, relying only on their own.\n\nRepack Features:\n\nMedal of Honor\nVersion of the game - v1.0.75.0\nDo not cut / recoded\nAdditions:\nLimited Edition\n\nMedal of Honor Warfighter\n\n\nGame information:\n\nMedal of Honor Warfighter - aggressive, tough, realistic game,\nin which you take on the role of a soldier of one of the elite\nunits of the U.S. Army. In developing the script participated\noperatives acting like special squad. Medal of Honor Warfighter\nreveals the truth about modern war and the fight against global\nterrorism.\nMedal of Honor Warfighter continues the tradition of which was\npublished in 2010 the game Medal of Honor, which is the first\nin the history of the series unfolds not in the days of World\nWar II, and in our days. Events new game takes place outside\nAfghanistan. Global counter-terrorist operation carried out\nin the real world &quot;hot spots&quot; of the planet, and in multiplayer\nbattles you have to fight with soldiers from different countries.\nIn Medal of Honor Warfighter tells of a U.S. Army soldier nicknamed\nPreacher. Returning home, the preacher finds that his marriage on\nthe verge of collapse. Hero tries to mend relations with his wife\nand family back, for which he fought and bled. But his plans to\nlive in peace will not come true. Country faces a new danger:\nthe terrorists manage to smuggle across the border is extremely\npowerful explosive - PETN. Preacher and his comrades should go\nstraight into the lair of the enemy and to do everything\nin their power to protect loved ones.\n\nRepack Features:\n\nMedal of Honor Warfighter\nVersion of the game - v1.0.0.3\nDo not cut / recoded\n\nAdditions:\n\nLimited Edition\nBritish SAS special forces unit\nGunner 1st Special Forces Operational &quot;Delta&quot; (USA)\nSet 3 Trijicon optics rifle HK416\nSniper rifle and U.S. Navy SEALs (US NAVY SEAL)\nA set of cards &quot;Hunting&quot;","torrent":{"xt":"urn:btih:ac55697961fcdd8a0231c54362abb8f5e4e62c8c","amp;dn":"Medal.of.Honor.Anthology-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac55697961fcdd8a0231c54362abb8f5e4e62c8c","infoHashBuffer":{"type":"Buffer","data":[172,85,105,121,97,252,221,138,2,49,197,67,98,171,184,245,228,230,44,140]},"announce":[],"urlList":[]}}