{"title":"Comma Sense: A Fun-damental Guide to Punctuation .epub","uid":9611203,"size":499717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac6d3f5a95cd5a76adbed9be658bbeab412f81f0&amp;dn=Comma+Sense%3A+A+Fun-damental+Guide+to+Punctuation+.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1392322607,"description":"Are you confounded by commas, addled by apostrophes, or queasy about quotation marks? Do you believe a bracket is just a support for a wall shelf, a dash is something you make for the bathroom, and a colon and semicolon are large and small intestines? If so, language humorists Richard Lederer and John Shore (with the sprightly aid of illustrator Jim McLean), have written the perfect book to help make your written words perfectly precise and punctuationally profound.\nDon't expect Comma Sense to be a dry, academic tome. On the contrary, the authors show how each mark of punctuation--no matter how seemingly arcane--can be effortlessly associated with a great American icon: the underrated yet powerful period with Seabiscuit; the jazzy semicolon with Duke Ellington; even the rebel apostrophe with famed outlaw Jesse James. But this book is way more than a flight of whimsy. When you've finished Comma Sense, you'll not only have mastered everything you need to know about punctuation through Lederer and Shore's simple, clear, and right-on-the-mark rules, you'll have had fun doing so. When you're done laughing and learning, you'll be a veritable punctuation whiz, ready to make your marks accurately, sensitively, and effectively.","torrent":{"xt":"urn:btih:ac6d3f5a95cd5a76adbed9be658bbeab412f81f0","amp;dn":"Comma+Sense%3A+A+Fun-damental+Guide+to+Punctuation+.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac6d3f5a95cd5a76adbed9be658bbeab412f81f0","infoHashBuffer":{"type":"Buffer","data":[172,109,63,90,149,205,90,118,173,190,217,190,101,139,190,171,65,47,129,240]},"announce":[],"urlList":[]}}