{"title":"Hirens Boot CD 15.0","uid":6816687,"size":519189647,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aca8fc78db3e23f31453ecf12d0b80d3d1f7f1f6&amp;dn=Hirens+Boot+CD+15.0+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"TheRekash2009","files":-1,"time":1321242339,"description":"Hirens Boot CD 15.0 All In One BootCd.\n\nThis CD Has All These Features :                           \n\n\n                        Antivirus Tools\n\nAvira AntiVir Personal (29-10-2011) Free anti-virus and anti-spyware on-demand scanner, detects and removes more than 50000 viruses and trojans.\n\nComboFix (29-10-2011) Designed to cleanup malware infections and restore settings modified by malware.\n\nDr.Web CureIt! Antivirus (29-10-2011) a free standalone anti-virus and anti-spyware on-demand scanner.\n\nGMER 1.0.15 Hidden services, hidden registry, hidden file scanner, Rootkit Detector and Remover.\n\nMalwarebytes Anti-Malware 1.51.1 (29-10-2011) anti-malware application that can thoroughly remove even the most advanced malware.\n\nRemove Fake Antivirus 1.80 a tool to remove virus/malware which disguises itself to be an antivirus and produces fake alert/warnings and urge you to purchase a useless copy of the fake antivirus.\n\nRootkitRevealer 1.7.1 Rootkit Revealer is an advanced patent-pending root kit detection utility.\n\nSpybot - Search &amp; Destroy 1.6.2 (29-10-2011) Application to scan for spyware, adware, hijackers and other malicious software.\nSuperAntispyware 5.0.1134 (29-10-2011) Remove Adware, Malware, Parasites, Rootkits, Spyware, Trojan, and Worms (a must have tool).\nTDSSKiller 2.4.17 To remove malware belonging to the family Rootkit.Win32.TDSS aka Tidserv, TDSServ and Alureon.\n\n                                 Backup Tools\n\nCloneDisk 1.9.6 All in one tool for MBR, Partition, Disk, VMWare Disk images vmdk/vmx/vhd, and much more.\n\nCOPYR.DMA Build013 A Tool for making copies of hard disks with bad sectors.\n\nCopyWipe 1.14 Copy old hard drive to a new hard drive by copying the entire contents of one drive to another, CopyWipe can also help prevent confidential or private data from being recovered, by securely wiping the contents of a drive.\n\nDiskImage 1.6 Creates and writes disk images files to hard and floppy disks.\n\nDriveImage XML 2.30 backup any drive/partition to an image file, even if the drive is currently in use, a very good freeware alternative to Ghost / Acronis\nDrive SnapShot 1.40 creates an exact Disk Image of your system into a file while windows is running.\n\nFastCopy 2.08 The Fastest Copy/Delete Software on Windows.\nG4L Ghost 4 Linux 0.34a a hard disk and partition imaging and cloning tool similar to Norton Ghost.\n\nGImageX 2.0.17 ImageX is used to backup/restore WIM images for Windows XP/Vista and Windows 7.\n\nImage For Dos 2.66 Quickly, easily, and reliably create a complete image backup of all the data located on your hard drive, backups made to CD/DVD/BD are bootable.\n\nImage For Windows 2.66 Backup and restore utility that creates a snapshot of a selected partition or volume, and saves it to disk, or burns it directly to most DVD+RW+R-R-RW or CD-R/RW drives.\n\nImgBurn 2.5.6.0 Lightweight CD/DVD/HD DVD/Blu-ray burning application, supports BIN, CUE, DI, DVD, GI, IMG, ISO, MDS, NRG and PDI, Ability to build DVD/HD/BD Video discs from a VIDEO_TS/HVDVD_TS/BDAV/BDMV folder, Unicode folder/file names (formerly DVD Decrypter).\n\nInfraRecorder 0.52 An Open source CD/DVD burning software, also create/burn .iso images.\n\nMacrium Reflect 4.2.3775 Create complete backups of your disk partitions, including operating system, installed programs and all your settings.\nODIN 0.3.4 Open Disk Imager in a Nutshell is similar to Drive Snapshot which supports backing up windows while you are using it.\n\nPartition Image - PartImage 0.6.9 supported filesystem includes Ext2, Ext3, Reiserfs, HFS, HPFS, JFS, Xfs, UFS, Fat16, Fat32 and NTFS.\n\nPartition Saving 3.90 A tool to backup/restore partitions (SavePart.exe).\nRegBak 1.0 a light-weight and simple utility to create backups of Windows registry files.\n\nRaw Copy 1.2 Useful tool to transfer the data directly from a faulty drive to another drive, built in data recovery function which will also attempt to recover data from bad sectors.\n\nShadowCopy 2.00 Copy all your files and entire system - even if they are locked by Windows.\n\nSelfImage 1.2.1.92 to create image files of any mounted or unmounted hard disk partition.\n\nSeagate DiscWizard 11.8326 Backup drive/partition to an image file, for Seagate owners (Powered by Acronis TrueImage)\n\nTeraCopy 2.12 TeraCopy is a compact program designed to copy and move files at the maximum possible speed, providing the user a lot of features includes pause, resume, auto shutdown, verify, error recovery and unicode support.\n\nWhitSoft File Splitter 4.5a a Small File Split / Join Tool.\n\nXXClone 0.58.0 The simple way to clone a Windows disk to another disk, it makes a self-bootable clone of Windows system disk.\n\nBIOS / CMOS Tools\n\nAward DMI Configuration Utility 2.43 DMI Configuration utility for modifying/viewing the MIDF contents.\n\n!BIOS 3.20 a powerfull utility for bios and cmos.\n\nBIOS Cracker 5.0 BIOS password remover (cmospwd).\n\nBIOS Utility 1.35.0 BIOS Informations, password, beep codes and more.\n\nCMOS 0.93 CMOS Save / Restore Tool.\n\nDISKMAN4 a powerful all in one utility.\n\nKill CMOS a tiny utility to wipe cmos.\n\nUniFlash 1.40 bios flash utility.\n\nBrowsers / File Managers\n\n7-Zip 9.22 File archiver with a high compression ratio Supports 7z, ARJ, BZIP2, CAB, CHM, CPIO, DEB, DMG, FAT, GZ, GZIP, HFS, IMA, IMG, ISO, LZH, LZMA, MBR, MSI, NSIS, NTFS, RAR, RPM, TAR, UDF, VHD, WIM, XAR, XZ, ZIP and Z formats.\nBulk Rename Utility 2.7.1.2 Rename multiple files, change timestamps and rename using EXIF data with the click of a button.\n\nDos Command Center 5.1 Classic dos-based file manager.\n\nDos Navigator 6.4.0 Dos File Manager, Norton Commander clone but has much more features.\n\nEasyUHA 1.1 GUI Tool to create and extract UHA Archives.\n\nEverything 1.21 Ultra fast file/folder search tool with ftp/http server.\n\nExplore2fs 1.08b GUI explorer tool for accessing linux ext2 and ext3 filesystems under windows.\n\nExt2Explore 2.2.71 To explore ext2/ext3/ext4 disk/partition, can also be used to view and copy disk and file system images.\n\nFile Maven 3.5 an advanced Dos file manager with high speed PC-to-PC file transfers via serial or parallel cable.\n\nFile Wizard 1.35 a file manager - colored files, drag and drop copy, move, delete etc.\n\nFastLynx 2.0 Dos file manager with Pc to Pc file transfer capability.\n\nHashMyFiles 1.72 Calculate MD5/SHA1/CRC32 hashes of your files.\n\nMini Windows Xp Portable Windows Xp that runs from CD/USB/Ram Drive to repair/recover dead windows operating system. It has LAN and WLAN (Wireless) Network includes 300 WiFi/Ethernet card drivers and can also be customized easily to add your own drivers in HBCD\\Drivers folder. Added some USB 3.0 and SATA/SCSI/SAS Storage drivers, Dynamic disk Spanned/Striped/Mirrored/RAID-5 Volume support, PDF Printer and VBS/WSH scripting support. Supported keyboard layouts are: United States, United Kingdom, US Dvorak, Arabic, Turkish Q, Turkish F, Swiss German, Swiss French, Swedish, Suomi Finnish, Spanish, Slovenian, Slovak, Russian, Portuguese, Polish, Norvegian Norske, Netherlands Dutch, Latin American, Italy, Icelandic, Hungarian, Hebrew, Germany, German Switzerland Luxembourg, Francais Cavier AZERTY, Denmark Daenish, Bulgarian Phonetic, Bulgarian, Brazil Portuguese, Brazil Extended Portuguese and Belgium.\n\nOpera Web Browser 11.01 One of the fastest, smallest and smartest full-featured web browser with an email client.\n\nSearchMyFiles 1.80 Alternative to 'Search For Files And Folders' module of Windows + Duplicates Search.\n\nTotal Commander 7.56a A file manager similar to the Windows Explorer features side-by-side file-browsing panes, built-in FTP, archive management, file search/compare/synchronize and more.\n\nVolkov Commander 4.99 Dos File Manager with LongFileName/ntfs support (Similar to Norton Commander).\n\nWinMerge 2.12.4.0 Differencing and merging tool which can compare both folders and files, presenting differences in a visual text format that is easy to understand and handle.\n\nCleaners\nAll Users Temp Cleaner 1.1 To clean all users temp folders, unwanted windows files from an offline installation.\n\nAND MANY MANY MORE --&gt; Jut Visit hiren.info/pages/bootcd  &lt;--For more information\n\n                Hiren's Bootcd 15.0 (537MB)\n &lt;a href=&quot;\nhttp://bayimg.com/DAkdkAadp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DAkdkAadp&lt;/a&gt;","torrent":{"xt":"urn:btih:aca8fc78db3e23f31453ecf12d0b80d3d1f7f1f6","amp;dn":"Hirens+Boot+CD+15.0+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca8fc78db3e23f31453ecf12d0b80d3d1f7f1f6","infoHashBuffer":{"type":"Buffer","data":[172,168,252,120,219,62,35,243,20,83,236,241,45,11,128,211,209,247,241,246]},"announce":[],"urlList":[]}}