{"title":"Life Keith Richards (autobiography)(epub)[rogercc]","uid":6293994,"size":2849451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acffd156f4d9e1a377abb0ed9bccbfc81306dea2&amp;dn=Life+Keith+Richards+%28autobiography%29%28epub%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"rogercc1","files":1,"time":1301932793,"description":"KEITH RICHARDS LIFE\n\nPublisher: Little, Brown and Company; \nAuthors: Keith Richards &amp; James Fox\n1st  Edition  October 26, 2010\nISBN-10: 031603438X \nFormat:| EPUB \nPages: 576 \n\nReluctant outlaw, rock 'n' roll's unparalleled hellraiser, and one of the greatest guitar gods of all time, Keith Richards has forged a life that most of us can only imagine--and often envy. And amazingly he's lived to tell about it. Now, at last, in his own words, the ultimate rock Icon gives us the definitive rock autobiography.\nIn Life, in his own raw, fierce voice, the man himself tells about life lived fast and hard in the creative hurricane--from his early days as a young boy growing up in a council estate, listening obsessively to Chuck Berry and Muddy Waters records, to taking the guitar to its absolute limit and joining forces with Mick Jagger to form The Rolling Stones.\nWith unflinching honesty, he reveals all the highs and lows of rock 'n' roll, from the meteoric rise to fame and the notorious drug busts to the women, drinking, and heroin addiction that made him infamous. The living legend chronicles how he created the revolutionary, high-octane riffs that defined &quot;Gimme Shelter&quot; and &quot;Honky Tonk Woman,&quot; his affair with the equally infamous Anita Pallenberg (the mother of three of his children), and the tragic death of Brian Jones. From falling in love with Patti Hansen to his tumultuous relationship with Mick, we follow Keef on the ultimate road trip we have all longed to know more about--of an unfettered, fearless, on-the-edge life lived to the fullest.\n\n\n","torrent":{"xt":"urn:btih:acffd156f4d9e1a377abb0ed9bccbfc81306dea2","amp;dn":"Life+Keith+Richards+%28autobiography%29%28epub%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acffd156f4d9e1a377abb0ed9bccbfc81306dea2","infoHashBuffer":{"type":"Buffer","data":[172,255,209,86,244,217,225,163,119,171,176,237,155,204,191,200,19,6,222,162]},"announce":[],"urlList":[]}}