{"title":"State-Sponsored Terrorism, Crimes, and Lies - Col. 35 (Coups)","uid":15417354,"size":212739479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad6e62975c89a972e968e6b515ad21d6e09acdfe&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Col.+35+%28Coups%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"moman73","files":35,"time":1469597078,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 35 (Coups and Interventions):\r\n\r\nEven though Turkey is an ally to the West and a member of NATO, the U.S. and other Western powers colluded with elements in the Turkish military in a failed coup to overthrow the elected government in Turkey and dispose of its president. \r\nThe emphasis of this upload is on the dark and bloody history of the imperial Western powers in orchestrating coups, regime change, and interventions all over the globe.\r\n\r\nWe have 35 titles here:\r\n\r\n-  Bellaigue - Patriot of Persia; Muhammad Mossadegh and a Tragic Anglo-American Coup (2012)\r\n\r\n-  Bravin - The Terror Courts; Rough Justice at Guantanamo Bay (2013)\r\n\r\n-  Chase &amp; Pezzullo - Zero Footprint; the True Story of a Private Military Contractor's Covert Assignments.. (2016)\r\n\r\n-  Chomsky - Interventions (2007)\r\n\r\n-  Chomsky - Rogue States; the Rule of Force in World Affairs, 2e (2015)\r\n\r\n-  Engdahl - The Lost Hegemon; Whom the Gods Would Destroy (2016)\r\n\r\n-  Gerard &amp; Kuklick - Death in the Congo; Murdering Patrice Lumumba (2015)\r\n\r\n-  Giroux - America's Addiction to Terrorism (2016)\r\n\r\n-  Gordon - American Nuremberg; the U.S. Officials Who Should Stand Trial for Post-9-11 War Crimes (2016)\r\n\r\n-  Griffin - 9-11 Ten Years Later; When State Crimes Against Democracy Succeed (2011)\r\n\r\n-  Hafetz (Ed.) - Obama's Guantanamo; Stories form an Enduring Prison (2016)\r\n\r\n-  Hayner - Unspeakable Truths; Confronting State Terror and Atrocity (2001)\r\n\r\n-  Hebditch &amp; Connor - How to Stage a Military Coup; From Planning to Execution (2005)\r\n\r\n-  HRW - No More Excuses; a Roadmap to Justice for CIA Torture (2015)\r\n\r\n-  Ismael &amp; Ismael - Iraq in the 21st Century; Regime Change and the Making of a Failed State (2015)\r\n\r\n-  Johnson - America's Secret Power; the CIA in a Democratic Society (1989)\r\n\r\n-  Karacan - Remembering the 1980 Turkish Military Coup d'État; Memory, Violence, and Trauma (2016)\r\n\r\n-  Kinzer - All the Shah's Men; an American Coup and the Roots of Middle East Terror (2003)\r\n\r\n-  Kinzer - Overthrow; America's Century of Regime Change from Hawaii to Iraq (2006)\r\n\r\n-  Luttwak - Coup D'État; a Practical Handbook, rev. ed. (2016)\r\n\r\n-  Petherick - The CIA in Iran; the 1963 Coup and the Origins of the US-Iran Divide (2006)\r\n\r\n-  Prados - President's Secret Wars; CIA and Pentagon Covert Operations since World War II (1986)\r\n\r\n-  Qureshi - Nixon, Kissinger and Allende; US Involvement in the 1973 Coup in Chile (2009)\r\n\r\n-  Ray et al (Eds.) - Dirty Work 2; the CIA in Africa (1980)\r\n\r\n-  Roosa - Pretext for Mass Murder; the September 30th Movement &amp; Suharto's Coup D'état in Indonesia (2006)\r\n\r\n-  Scahill - The Assassination Complex; Inside the Government's Secret Drone Warfare Program (2016)\r\n\r\n-  Schlesing &amp; Kinzer - Bitter Fruit; the Untold Story of the American Coup in Guatemala (1999)\r\n\r\n-  Solaun - U.S. Intervention and Regime Change in Nicaragua (2005)\r\n\r\n-  Streeter - Managing the Counterrevolution; The United States and Guatemala, 1954-1961 (2000)\r\n\r\n-  Sullivan - American Adventurism Abroad; 30 Invasions, Interventions, and Regime Change since World War II (2004)\r\n\r\n-  Talbott - Where America Went Wrong, and How to Regain Her Democratic Ideals (2004)\r\n\r\n-  Welch - Crimes of Power &amp; States of Impunity; the U.S. Response to Terror (2009)\r\n\r\n-  Westra - Faces of State Terrorism (2012)\r\n\r\n-  Wilford - America's Great Game; the CIA's Secret Arabists and the Shaping of the Modern Middle East (2013)\r\n\r\n-  Zeilig - Patrice Lumumba; Africa's Lost Leader (2008)","torrent":{"xt":"urn:btih:ad6e62975c89a972e968e6b515ad21d6e09acdfe","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Col.+35+%28Coups%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad6e62975c89a972e968e6b515ad21d6e09acdfe","infoHashBuffer":{"type":"Buffer","data":[173,110,98,151,92,137,169,114,233,104,230,181,21,173,33,214,224,154,205,254]},"announce":[],"urlList":[]}}