{"title":"Jacques Becker (1954) - Touchez pas au grisbi - Freakyflicks","uid":4095602,"size":734302086,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad71a5273219a7d2aebf0312fe39af8c6a2d1118&amp;dn=Jacques+Becker+%281954%29+-+Touchez+pas+au+grisbi+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clownmonkey","files":3,"time":1206300393,"description":"An IMdB user comment:\n\nLike his masterpiece, `Le trou&amp;#039;, this film embodies Becker&amp;#039;s distinctive vision of the world. We are given a portrait of a bond of love between two men--a kind of love which is beyond anything a man and a woman can know. But this is not Oscar Wilde&amp;#039;s `love which dare not speak its name&amp;#039;: there is no hint of homoerotic sexuality. Rather, this is the bond of the trenches and the workplace (presumably class and underworld trenches in the case of the protagonists), a theme which has a tremendous atavistic resonance in French culture and history insofar as it reflects a collective male experience extending from the Napoleonic Wars through the Paris Commune down through WWI--the kind of camaraderie for life which predisposed a man to sacrifice all that he holds dear for another man (another instance of this is in Jean Vermillon&amp;#039;s `Gueule d&amp;#039;amour&amp;#039;), and hinted at in a sentimental, nuanced way when Max breaks out the foie gras and a bottle of blanc after his buddy has made a costly bonehead move. Note also that incredible sigh of utter lassitude that `Max&amp;#039; (Jean Gabin) heaves as he sits through yet another girly show--or that look on his face as `Betty&amp;#039; asks him if he loves her (after he&amp;#039;s slept with her)--a look which tells us his every thought is on his pal, `Riton&amp;#039;. This is not to say that women are portrayed throughout in a disparaging light: &quot;Mme. Bouche&quot;, the owner of the restaurant and `Marinette&amp;#039;, the nightclub owner&amp;#039;s wife (a wonderfully subtle portrait of uxorial solicitude and anxiety) are both characters who reinforce and serve male solidarity. But there&amp;#039;s the suggestion that when the male/female bond involves sexuality, a guy can lose his head and forget about his mates.\n\nThis male/female divide appears to overshadow class divisions, which were to be at the heart of Becker&amp;#039;s `Le trou.&amp;#039; Still we can see Becker&amp;#039;s communist sympathies coming through in oblique ways. Max is the engaging, attractive character that he is because of his fierce devotion to others, his liberality of spirit (after he leaves a huge tip to the petit-bourgeois owner of the cafe` in the process of recycling leftover wine, the latter remarks, `We could use more customers like him&amp;#039;), the value he places on his pal&amp;#039;s life over the lout, the easy way he has with trusting and receiving the trust of others--all these things are non-commercial values and they suggest a world and way of life alternative to what AMERICA has in store for France. Note, for example, how the camera lingers on the road sign at the scene of the first shootout: `Autoroute a` l&amp;#039;ouest&amp;#039;, `Expressway to the west&amp;#039;. It&amp;#039;s the same road Max and his pals rush down and that takes them straight to the disaster with the loot. The promise of riches that America (`the West&amp;#039;) tantalizingly dangled before the French in the form of the Marshall Plan was not to be taken up without heavy costs. Pauvre Max: in the end he cannot cry at the loss of his buddy (though I cried for him): he cannot express his grief because he is now in the company of &quot;Betty&quot;, his American doll and source of support (fittingly played by a real-life Miss America of 1946).\n\nSure made me feel as though I should have spent more of my life in France.\n\n===\n\nMy rip.  External English subs included.\n\nTechnical specs:\n\n--- File Information ---                                                         \nFile Size (in bytes):                           734,191,616                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             42          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid              \nDuration (hh:mm:ss):                            01:36:49                \nFrame Count:                                    139268             \nFrame Width (pixels):                           512                  \nFrame Height (pixels):                          384                  \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.333                     \nFrames Per Second:                              23.96                    \nVideo Bitrate (kbps):                           917                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP              \n                                                                                \n--- Audio Information ---                                                           \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3                   \nAudio Codec Status (e.g. &quot;Codec Is Installed&quot;): Codec(s) are Installed            \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            85                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n\n=====\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039; ","torrent":{"xt":"urn:btih:ad71a5273219a7d2aebf0312fe39af8c6a2d1118","amp;dn":"Jacques+Becker+%281954%29+-+Touchez+pas+au+grisbi+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad71a5273219a7d2aebf0312fe39af8c6a2d1118","infoHashBuffer":{"type":"Buffer","data":[173,113,165,39,50,25,167,210,174,191,3,18,254,57,175,140,106,45,17,24]},"announce":[],"urlList":[]}}