{"title":"Turbo Tax (TurboTax) Premier 2011+ E-file(US version)","uid":7018763,"size":98315159,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad7327b17ef154bb7612f35720704e2be1e50819&amp;dn=Turbo+Tax+%28TurboTax%29+Premier+2011%2B+E-file%28US+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"alen129","files":20,"time":1328755603,"description":"Turbo Tax (TurboTax) Premier 2011+ E-file(US version)\n\nscanned with latest versions of listed security software to ensure there are NO Viruses or Malware inside:\nAVG ANTIVIRUS 2012\nSPYBOT-SEARCH &amp; DESTROY 1.6.2\nMALWAREBYTE ANTIMALWARE 1.60.1\n\n\nTurboTax Premier includes everything in Deluxe, plus additional features to help you get the most from your investments and rental properties.\n\n \nImport Your Investment Info - Save time by automatically importing participating investment info directly from your financial institution.\n\nGet Help Accurately Reporting Investment Sales - You'll be walked through reporting sales of stocks, bonds and mutual funds. TurboTax will automatically calculate capital gains/losses and keeps track of those that carry over to future tax returns.\n\nYour Cost Basis in Three Easy Steps - Find your accurate purchase price for stock sales, in three easy steps.\n\nGet Help with Employee Stock Plans - Get guidance in reporting sales. TurboTax automatically determines your correct basis for selling shares purchased at different times or different prices.\n\nMaximize Your IRA Savings - TurboTax will show you exactly how much you can save on this year's taxes by opening or contributing to an IRA.\n\nSee Your Best Rental Depreciation Method - Simplify reporting rental property depreciation. You'll be shown which depreciation method will get you the biggest tax deduction.\n\nMaximize Refinancing Deductions - You'll be guided through deducting points, appraisal fees, recording costs, and more so you don't miss a single chance to save.\n\nGet Help with New Rental Properties - Get step by step guidance in how to set up new rental properties.\n\nAlso includes everything in Deluxe:\n\n \nWe Do the Hard Work for You\nEasy Questions, Tailored to You - We ask questions in plain English and then put your answers on the right forms for you, including 1040EZ, 1040A, and 1040. TurboTax skips interview questions that don't apply to you, so you can finish your return faster.\n\nAutomatically Fill in of W-2 and 1099 Info - Get your W-2 and 1099 data directly from over 400,000 participating employers and financial institutions. TurboTax automatically places it in the right tax forms. A brief summary lets you review and edit downloaded information if necessary.\n\nTransfer Last Year's Tax Info - No retyping necessary. TurboTax fills in information from your previous year's return to help save time and increase accuracy. You'll be shown what you're importing and where it goes in your tax return.\n\nImport Your Financial Data - Import information directly from ItsDeductible, so you can skip the cut and paste this year.\n\nContinue at Your Own Pace - Save your progress. Do your taxes at your own pace, at any time of day.","torrent":{"xt":"urn:btih:ad7327b17ef154bb7612f35720704e2be1e50819","amp;dn":"Turbo+Tax+%28TurboTax%29+Premier+2011%2B+E-file%28US+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7327b17ef154bb7612f35720704e2be1e50819","infoHashBuffer":{"type":"Buffer","data":[173,115,39,177,126,241,84,187,118,18,243,87,32,112,78,43,225,229,8,25]},"announce":[],"urlList":[]}}