{"title":"Dr. Alimantado - [1977] Best Dressed Chicken In Town","uid":3939502,"size":63106028,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:adaa693355923a7e203a2ab819bbf265ece6fef8&amp;dn=Dr.+Alimantado+-+%5B1977%5D+Best+Dressed+Chicken+In+Town&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"relssieg","files":15,"time":1198042110,"description":"One-of-a-kind Jamaican DJ Dr. Alimantado found unexpected fame with U.K. punks after Johnny Rotten bestowed his blessings. The hoopla was certainly warranted based on the high quality of his mid-&amp;#039;70s sides, several of which are included on Best Dressed Chicken in Town. Handling production chores himself, Alimantado enlisted top reggae engineers and producers like Lee &quot;Scratch&quot; Perry, King Tubby, and Scientist to add their own alchemy to the mix. The dub-inflected tracks and Alimantado&amp;#039;s idiosyncratic musings prove a potent combination, especially on standouts like &quot;Poison Flower&quot; (a version of a Horace Andy vocal), the Rasta vengeance number &quot;I Killed the Barber,&quot; and the comically over-the-top title cut. Other highlights include the bubbly &quot;Unitone Skank,&quot; as well as the album&amp;#039;s two instrumentals: a predictably bizarre and brilliant Scratch mix, &quot;I Am the Greatest Says Muhammed Ali,&quot; and the Duke Reid homage &quot;Tribute to Duke&quot; (based on Slim Smith&amp;#039;s incredible rendition of the Billy Stewart soul gem &quot;Sitting in the Park&quot;). Completing this very enjoyable disc are sampled vocals by Gregory Isaacs and Jackie Edwards, the musical contributions of great Kingston studio outfits like the Aggrovators, and, finally, the tableau-like cover photo of Alimantado walking the sunny streets of downtown Kingston. Along with other unique dub and DJ titles like Mikey Dread&amp;#039;s African Anthem, Best Dressed Chicken in Town is a must for reggae enthusiasts. ~ Stephen Cook, All Music Guide","torrent":{"xt":"urn:btih:adaa693355923a7e203a2ab819bbf265ece6fef8","amp;dn":"Dr.+Alimantado+-+%5B1977%5D+Best+Dressed+Chicken+In+Town","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adaa693355923a7e203a2ab819bbf265ece6fef8","infoHashBuffer":{"type":"Buffer","data":[173,170,105,51,85,146,58,126,32,58,42,184,25,187,242,101,236,230,254,248]},"announce":[],"urlList":[]}}