{"title":"Apocalyptica - Cult (Special Edition) (2001), [LOSSY MP3 320 kbp","uid":4830259,"size":181638468,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ade7abcf305923cf8fb671e15987a34eb2cf89cb&amp;dn=Apocalyptica+-+Cult+%28Special+Edition%29+%282001%29%2C+%5BLOSSY+MP3+320+kbp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"year2012","files":18,"time":1239105400,"description":"Apocalyptica - Cult (Special Edition) (2001), [LOSSY MP3 320 kbps] Cello Metal [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Apocalyptica%20-%20Cult%20(Special%20Edition)%20(2001)&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nApocalyptica - Cult (Special Edition)\nby anno2036\n\n\nCover\n Visit this link: http://img256.Imageshack.us/img256/9078/cultspecialedition.jpg\n\nAlbum\nTitle: Cult (Special Edition)\nYear:  2001                                    \nGenre: Cello metal, Chamber music\nLabel: Mercury/Universal\n\nTracklist\nCD1\n1. Path\n2. Struggle\n3. Romance\n4. Pray!\n5. In Memoriam\n6. Hyperventilation\n7. Beyond Time\n8. Hope\n9. Kaamos\n10. Coma \n11. Hall of the Mountain King\n12. Until It Sleeps\n13. Fight Fire With Fire\n\nCD2\n1. Path Vol.2 (featuring Sandra Nasic)\n2. Hope Vol.2 (featuring Matthias Sayer)\n3. Harmageddon live in MÃƒÂ¼nchen, October 2000\n4. Nothing Else Matters (live in MÃƒÂ¼nchen, October 2000)\n5. Inquisition Symphony (live in MÃƒÂ¼nchen, October 2000)\n\nDescription\nCult ÃƒÂ¨ il terzo album degli Apocalyptica pubblicato nel 2000 con un'edizione speciale pubblicata successivamente nel 2001 contenente un secondo disco. Le canzoni Hope e Path hanno una seconda versione chiamata Hope vol. 2 e Path vol. 2 cantata rispettivamente da Matthias Sayer e Sandra Nasic. In queste due canzoni, gli Apocalyptica cominciano ad usare effetti elettronici di distorsione piÃƒÂ¹ frequentemente.\n\nChamber music\nÃƒÂ¨ una forma di musica classica, scritta per un piccolo gruppo di strumenti che tradizionalmente potrebbero essere ospitati in una camera di palazzo. La parola &quot;camera&quot; significa che la musica puÃƒÂ² essere effettuata in una piccola stanza, spesso in un salone privato con un'atmosfera intima. \n\nCello rock\nSottogenere della musica rock e heavy metal, caratterizzato da l'uso di violoncelli (violino e viola)  come strumenti primari, accanto o in sostituzione dei piÃƒÂ¹ tradizionali strumenti quali chitarre, basso elettrico e batteria.\n\nReview\nsi riferisce all'album Cult, uscito nel 2000 e contenente solo le tracce del cd1\nfonte:  Visit this link: http://www.debaser.it/recensionidb/ID_7960/Apocalyptica_Cult.htm\nGli Apocalyptica sono violoncellisti finlandesi di formazione classica (provenienti dall'Accademia Sibelius), noti per avere eseguito brani heavy-metal (principalmente dei Metallica, ma non solo) con strumenti classici. Un'idea bellissima, sviluppata ad accordature piÃƒÂ¹ basse dell'inferno, con le parti vocali affidate ad un violino, ed un'atmosfera tenebrosa come nessuna band con &quot;strumentazione rock&quot; ÃƒÂ¨ mai riuscita a ricreare. E, particolare degno di nota, senza far sentire l'esigenza di un batterista (che i nostri sfruttano solo dal vivo, oltre che in dischi come &quot;Apocalyptica&quot; e &quot;Reflections&quot;). I nostri non si &quot;limitano&quot; a coverizzare anche questa volta brani di Hetfield e Co. (relegati, non a caso, alla fine del disco: una devastante &quot;Fight Fire With Fire&quot; e &quot;Until it Sleeps&quot;), ma vogliono proporre altro, delle PROPRIE composizioni, confermando la loro attitudine di grandi musicisti, dotati di tecnica sublime, aggressivitÃƒÂ  e capacitÃƒÂ  di proporre arrangiamenti perfetti. Tuttavia, il risultato non si discosta apparentemente dai precedenti CD, risultando a tratti un po' &quot;pesante&quot;.\nPotremmo pensare ad una naturale evoluzione della musica classica, a dimostrazione di come esista, effettivamente, una linea di continuitÃƒÂ  tra il repertorio metal ed la musica classica. Al tempo stesso, si tratta di un lavoro indubbiamente sperimentale, che mentre conferma quanto giÃƒÂ  consolidato in precedenza, dimostra la classe degli Apocalyptica. La novitÃƒÂ  introdotta dal proporre buona parte di &quot;Master of Puppets&quot; in versione oserei dire &quot;Wagneriana&quot; (all'epoca mi fece gridare al miracolo) sembra qui essere naturalmente proseguita: permane il piacere di fare ascoltare brani sostanzialmente classico-gotici, profondamente oscuri, sofferti, anche al &quot;purista&quot; musicale piÃƒÂ¹ accanito. E non dimentichiamo che 10 brani su 13 sono composizioni originali!\nProbabilmente, l'unico modo per apprezzare &quot;Fight Fire With Fire&quot; senza amare il metal, e, con la scusa, gustare qualcosa di inedito. Nessuno, credo, non potrÃƒÂ  fare a meno di ammirare l'evocativa &quot;Romance&quot;, la struggente &quot;Path&quot;, la pesantissima &quot;Coma&quot; (fortunatamente, non ÃƒÂ¨ la cover dei Guns'n roses!) senza dimenticare &quot;Hope&quot;, lo speed-metal (!) di &quot;Hyperventilation&quot;, i sopracitati classici dei Metallica, e la spettacolare &quot;Hall of the Mountain King&quot;, che mette in bella mostra la scuola frequentata dai nostri. Manca la batteria magistrale di Dave Lombardo (presente nei successivi &quot;Apocalyptica&quot; e &quot;Reflections&quot;) e ciÃƒÂ² un po' dispiace: ma ciÃƒÂ² nulla toglie ad un'espressione artistica piÃƒÂ¹ che degna di nota, che richiede diversi ascolti per essere compresa, senza cÃƒÂ¨dere alla tentazione di cambiare CD dopo 10 minuti. Chi (come me) apprezza la musica classica senza essere un cultore del genere non potrÃƒÂ  che amare le sonoritÃƒÂ  di &quot;Cult&quot;, che perÃƒÂ² potrebbero spingere, in alcuni brani, a passare direttamente al pezzo successivo: il lavoro in certi momenti suona un po' monocorde, ma ÃƒÂ¨ questione di abitudine (e di apertura mentale). Non mi stancherÃƒÂ² mai di ripetere che musicisti quali Schulze facevano composizioni di 20 minuti su pochissime note, risultando noiosi e stantii solo all'ascoltatore piÃƒÂ¹ superficiale.\nDunque un lavoro da 5 stelle, comunque meritevole di attenzione e da valutare con cura\n\nBiography\nfonte:  Visit this link: http://it.wikipedia.org/wiki/Apocalyptica\nIl gruppo, formatosi ad Helsinki negli anni '90, ha cominciato facendo cover dei Metallica e dei Sepultura con strumenti classici. A partire dal secondo album (Inquisition symphony, 1998), gli Apocalyptica hanno proposto musica di loro composizione pur mantenendo le forti influenze heavy metal. Dall'album Reflections il gruppo ha trovato il suo genere, dedicandosi a sonoritÃƒÂ  piÃƒÂ¹ leggere ma senza perdere del tutto l' influenza metal delle origini.Occasionalmente suonano anche brani di musica classica, come Hall of the mountain king di Grieg contenuto nell'album Cult del 2000.\nLa formazione attuale ÃƒÂ¨ composta da tre musicisti, Eicca Toppinen, Paavo LÃƒÂ¶tjÃƒÂ¶nen e Perttu Kivilaakso, laureati all'Accademia Sibelius, il piÃƒÂ¹ prestigioso conservatorio finlandese. In passato hanno fatto parte del gruppo Antero Manninen (che ora suona nell'orchestra sinfonica di Lahti) e Max Lilja (ora membro della band finlandese Hevein).\nI violoncelli degli Apocalyptica sono accompagnati da una batteria durante i concerti e nelle registrazioni. Tra i batteristi che collaborano con loro si segnalano Mikko SirÃƒÂ©n dei Megaphone (che li accompagna dal vivo e nell'album Apocalyptica del 2005) e Dave Lombardo degli Slayer (ospite in Reflections e Apocalyptica). Hanno all'attivo anche varie collaborazioni con cantanti solisti o di altri gruppi, tra cui Sandra Nasic dei Guano Apes, Lauri YlÃƒÂ¶nen dei The Rasmus , Ville Valo degli HIM , Nina Hagen,Cristina Scabbia dei Lacuna Coil e Corey Taylor degli Slipknot/Stone Sour .\nIn Italia nel 2005 gli Apocalyptica hanno aperto il concerto dei tedeschi Rammstein e dal dicembre dello stesso anno il batterista Mikko SirÃƒÂ©n ÃƒÂ¨ membro ufficiale della band.\n\nFormat\nMP3 - 320 Kbps - 44 kHz\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:ade7abcf305923cf8fb671e15987a34eb2cf89cb","amp;dn":"Apocalyptica+-+Cult+%28Special+Edition%29+%282001%29%2C+%5BLOSSY+MP3+320+kbp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ade7abcf305923cf8fb671e15987a34eb2cf89cb","infoHashBuffer":{"type":"Buffer","data":[173,231,171,207,48,89,35,207,143,182,113,225,89,135,163,78,178,207,137,203]},"announce":[],"urlList":[]}}