{"title":"Counter-Strike Source - v1.1a - 09.17.2013 [WTF] - No Steam - Mu","uid":8934512,"size":2030966751,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:adf7050c7740bd237efbf727d268687e874d1bf4&amp;dn=Counter-Strike+Source+-+v1.1a+-+09.17.2013+%5BWTF%5D+-+No+Steam+-+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"nmorau","files":-1,"time":1379533128,"description":"Thank you for downloading the WTF release of Counter-Strike Source. This version is up to date as of 9/17/2013.\n\nThe release includes:\n* Working Favorites/History\n* Working Achievements\n* Built-In Non-Steam Server List\n* Clean release, no additional extras. As close to the retail game as possible.\n\nNOTE: If you used the WTF Release 1.0, simply install 1.1a on top of the 1.0 version and you should retain your settings. Please do not use 1.1b as it uses a different emulator entirely! \n\n----------------Frequently Asked Questions----------------\n\nQ: What is the difference between Counter-Strike Source x.xa and x.xb, eg., Counter-Strike 1.1a, Counter-Strike 1.1b?\nA: They use different emulation. 1.xa has more features, but requires disabling UAC and running as administrator to grant a static Steam ID. In addition, some anti-virus software may cause the cstrike.exe file to be a false positive. As a result, if you are uncomfortable, please use x.xb. Both versions will be actively maintained.\n\nQ: [Release 1.1a] I recieve the error &quot;This server requires that you be running Steam.&quot; How do I fix it?\nA: This usually means the emulator cannot generate a Steam ID. You need to disable UAC, restart, and run cstrike.exe (in the installation directory) as an administrator. \n\nQ: How do I change my name?\nA: Please consult the rev.ini file. Additional (detailed) instructions are provided by typing &quot;helpname&quot; in console when you first start the game.\n\nQ: How do I change my avatar?\nA: Additional (detailed) instructions are provided by typing &quot;helpavatar&quot; in console when you first start the game. For a detailed guide please visit WT-F.com\n\nQ: How do I change my game language?\nA: Please consult the rev.ini file. Additional (detailed) instructions are provided by typing &quot;helplanguage&quot; in console when you first start the game.\n\nQ: Where can I get updates?\nA: In order to provide the best reliability, we release new updates as a whole game. This makes it easier for new users to install and reduces the need for users to search for multiple patches. The changelog is posted on WT-F.com","torrent":{"xt":"urn:btih:adf7050c7740bd237efbf727d268687e874d1bf4","amp;dn":"Counter-Strike+Source+-+v1.1a+-+09.17.2013+%5BWTF%5D+-+No+Steam+-+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf7050c7740bd237efbf727d268687e874d1bf4","infoHashBuffer":{"type":"Buffer","data":[173,247,5,12,119,64,189,35,126,251,247,39,210,104,104,126,135,77,27,244]},"announce":[],"urlList":[]}}