{"title":"Hollywood and Hitler, 1933-1939 (Film and Culture Series)(pdf,ep","uid":11331161,"size":32694105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae1d7e6c9aa4859cfa425991954e1868a6244ae0&amp;dn=Hollywood+and+Hitler%2C+1933-1939+%28Film+and+Culture+Series%29%28pdf%2Cep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"zombie_rox","files":2,"time":1414680905,"description":"Hollywood and Hitler, 1933-1939 (Film and Culture Series)\n\nBetween 1933 and 1939, representations of the Nazis and the full meaning of Nazism came slowly to Hollywood, growing more ominous and distinct only as the decade wore on. Recapturing what ordinary Americans saw on the screen during the emerging Nazi threat, Thomas Doherty reclaims forgotten films, such as Hitler's Reign of Terror (1934), a pioneering anti-Nazi docudrama by Cornelius Vanderbilt, Jr.; I Was a Captive of Nazi Germany (1936), a sensational true tale of &quot;a Hollywood girl in Naziland!&quot;; and Professor Mamlock (1938), an anti-Nazi film made by German refugees living in the Soviet Union. Doherty also recounts how the disproportionately Jewish backgrounds of the executives of the studios and the workers on the payroll shaded reactions to what was never simply a business decision. As Europe hurtled toward war, a proxy battle waged in Hollywood over how to conduct business with the Nazis, how to cover Hitler and his victims in the newsreels, and whether to address or ignore Nazism in Hollywood feature films. Should Hollywood lie low, or stand tall and sound the alarm? Doherty's history features a cast of charismatic personalities: Carl Laemmle, the German Jewish founder of Universal Pictures, whose production of All Quiet on the Western Front (1930) enraged the nascent Nazi movement; Georg Gyssling, the Nazi consul in Los Angeles, who read the Hollywood trade press as avidly as any studio mogul; Vittorio Mussolini, son of the fascist dictator and aspiring motion picture impresario; Leni Riefenstahl, the Valkyrie goddess of the Third Reich who came to America to peddle distribution rights for Olympia (1938); screenwriters Donald Ogden Stewart and Dorothy Parker, founders of the Hollywood Anti-Nazi League; and Harry and Jack Warner of Warner Bros., who yoked anti-Nazism to patriotic Americanism and finally broke the embargo against anti-Nazi cinema with Confessions of a Nazi Spy (1939).\n\nReview\nWith a rich blend of art and politics, Doherty brings to light the story of how Hollywood handled Nazism during Hitler's reign. Recommended. Library Journal (starred review) 3/15/13 Hollywood and Hitler, 1933-1939 tracks the advance of fascism, and the movie industry's reaction on screen and in private... [A] fascinating work. -- Kate Muir The Times (London) 4/20/13 A lively study of Hollywood's relationship to Nazism. -- Emily Greenhouse Culture Desk blog, The New Yorker 5/21/13 Wide-ranging and brightly written. -- Dave Kehr The New York Times Book Review 5/26/13 A lively, detailed account and a worthy successor to his books Pre-Code Hollywood: Sex, Immorality, and Insurrection in American Cinema, 1930-1934 and Hollywood's Censor: Joseph I. Breen and the Production Code Administration. -- Philip Kemp Times Higher Education 5/16/13 A remarkable and stimulating account of an important part of movie history and American history. -- Rob Hardy The Dispatch 7/19/13 [Doherty's] books on American cinema from the 1930s to the 1950s are essential reading: Pre-Code Hollywood and Hollywood's Censor: Joseph I. Breen &amp; the Production Code Administration... No one has told this story in as comprehensive or convincing a fashion. As always, Doherty's work is well researched. -- Clayton Koppes Cineaste Fall 2013 A witty writer familiar with Hollywood history and manners, Doherty places the studios' craven behavior within a general account of the political culture of the movies in the thirties and forties. -- David Denby The New Yorker 9/16/13 [A] riveting read. -- Merve Emre The Millions 9/18/13 Mr. Doherty fully understands the studio system and how it juggled interference from its own internal agency, the Production Code Administration. -- Jeanine Basinger Wall Street Journal 9/18/13 Meticulously researched and captivating. -- Noah Isenberg Times Literary Supplement 10/25/13 Doherty masterfully describes how the movie industry, mostly headed by Jews, ultimately came together at a time when the nation needed unity... The book is crisply written, well documented. -- Burton Boxerman St. Louis Jewish Light 11/27/13 Doherty's well researched Hollywood and Hitler 1933-1939 throws fascinating new light on America and the rise of Nazism. -- Philip French The Observer 11/23/13 [A] wide-ranging, scrupulously researched and highly entertaining study. -- Philip French Sight and Sound 8/1/13 [A] judicious and comprehensive history of the period. -- Mark Horowitz Tablet 12/20/13 ... Doherty provides a more nuanced and accurate account of Hollywood's relationship with Hitler, and his book should be considered the authority on the subect... American Historical Review Vol 119, No 2 Hollywood and Hitler is an excellent addition to Doherty's impressive oeuvre, well worth reading for its important insights, strong narrative, and mastery of the period. -- David Welky Journal of American Studies Vol 48, No 2\nAbout the Author\nThomas Doherty is a professor of American studies at Brandeis University. His previous books include Pre-Code Hollywood: Sex, Immorality, and Insurrection in American Cinema, 1930--1934; Cold War, Cool Medium: Television, McCarthyism, and American Culture; and Hollywood's Censor: Joseph I. Breen and the Production Code Administration. He lives with his wife Sandra in Salem, Massachusetts. \n\nPublisher: Columbia University Press (23 April 2013)\nLanguage: English\nISBN-10: 0231163924\nISBN-13: 978-0231163927","torrent":{"xt":"urn:btih:ae1d7e6c9aa4859cfa425991954e1868a6244ae0","amp;dn":"Hollywood+and+Hitler%2C+1933-1939+%28Film+and+Culture+Series%29%28pdf%2Cep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae1d7e6c9aa4859cfa425991954e1868a6244ae0","infoHashBuffer":{"type":"Buffer","data":[174,29,126,108,154,164,133,156,250,66,89,145,149,78,24,104,166,36,74,224]},"announce":[],"urlList":[]}}