{"title":"according.to.jim.season.1","uid":4614926,"size":4035991552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af41e72a1e955582df9e69a4fa063d5711b9b12a&amp;dn=according.to.jim.season.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"RuckyDucky","files":22,"time":1230792151,"description":"Jim Belushi stars as Jim, the macho everyman, with a soft spot for his beautiful wife, Cheryl (Courtney Thorne-Smith), and their three precocious kids -- Ruby (Taylor Atelian), Gracie (Billi Bruno) and Kyle (Conner Rayburn). A success at his construction business and the family breadwinner, at home Jim seems to keep Cheryl in constant turmoil with his boyish bravado and ever-willful antics. But their underlying love for each other guarantees they are in this marriage for keeps. Cheryl, for her part, instinctively aims for the straight and narrow, but secretly enjoys it when Jim coaxes out her playful side. It's an odd-couple tug-of-war of happily-married opposites yet equals. This is a love story couched in a family comedy. \n\nAt the conclusion of last season, Cheryl's high-strung sister, Dana (Kimberly Williams-Paisley), a career woman who seemed destined to remain forever single, finally met and married a doctor and the man of her dreams (Mitch Rouse). Jim's brother-in-law and partner in the Ground Up design/building firm, Andy (Larry Joe Campbell), is Jim's foil but also his truest friend. Andy doggedly covers for his pal whenever Cheryl gets close to uncovering Jim's incessant schemes.","torrent":{"xt":"urn:btih:af41e72a1e955582df9e69a4fa063d5711b9b12a","amp;dn":"according.to.jim.season.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af41e72a1e955582df9e69a4fa063d5711b9b12a","infoHashBuffer":{"type":"Buffer","data":[175,65,231,42,30,149,85,130,223,158,105,164,250,6,61,87,17,185,177,42]},"announce":[],"urlList":[]}}