{"title":"The Basics of Hacking and Penetration Testing Ethical Hacking an","uid":6588682,"size":3896641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b01b46704af6911439fef32b6b8274e1712be783&amp;dn=The+Basics+of+Hacking+and+Penetration+Testing+Ethical+Hacking+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"cad40","files":-1,"time":1312730025,"description":"The Basics of Hacking and Penetration Testing serves as an introduction to the steps required to complete a penetration test or perform an ethical hack. You learn how to properly utilize and interpret the results of modern day hacking tools; which are required to complete a penetration test. Tool coverage will include, Backtrack Linux, Google, Whois, Nmap, Nessus, Metasploit, Netcat, Netbus, and more. A simple and clean explanation of how to utilize these tools will allow you to gain a solid understanding of each of the four phases and prepare them to take on more in-depth texts and topics. This book includes the use of a single example (pen test target) all the way through the book which allows you to clearly see how the tools and phases relate.\n\nEach chapter contains hands-on examples teach you how to interpret the results and utilize those results in later phases\nWritten by an author who has practical experience as a Penetration Tester and who has taught &quot;Introduction to Penetration Testing&quot; for 5 years\nUtilizes Backtrack Linux distribution and the &quot;core&quot; tools required to complete a penetration test\n","torrent":{"xt":"urn:btih:b01b46704af6911439fef32b6b8274e1712be783","amp;dn":"The+Basics+of+Hacking+and+Penetration+Testing+Ethical+Hacking+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b01b46704af6911439fef32b6b8274e1712be783","infoHashBuffer":{"type":"Buffer","data":[176,27,70,112,74,246,145,20,57,254,243,43,107,130,116,225,113,43,231,131]},"announce":[],"urlList":[]}}