{"title":"Atomic Alarm Clock v6.263 x86 Incl Crack -TE [TorDigger]","uid":11723532,"size":9687717,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b11b74c74e2d991181a880659362b0d1e8983963&amp;dn=Atomic+Alarm+Clock+v6.263+x86+Incl+Crack+-TE+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TorDigger","files":12,"time":1424962521,"description":"Atomic Alarm Clock\n\nAtomic Alarm Clock is an application that comes to replace the standard Windows clock. Offers users a bunch of extra utilities not yet available in Microsoft's operating system, such as an alarm clock, skins for Windows clock, an atomic-time synchronizer, hourly chimes and more.\n\nAlarm Clock\n\nWhen it comes to setting up an alarm, the software's options are both easy and flexible. The alarm can be triggered at a certain date and time, once every few hours, on a daily basis or on certain days and hours and so on.\n\nA flexible timetable is not all that Atomic Alarm Clock provides. In addition, it can play a sound of your choosing for a specified number of times, by hour count or until you dismiss the alarm window. It can also shut down your computer automatically or run a program of your choosing, with certain parameters.\n\nFurthermore, the software can wake the computer, in case it goes to standby or hibernate mode.\n\nWhen an alarm goes off, the program will display a notification on your desktop from where you can stop it or snooze it.\n\nThe program is fully customizable, so you can show date or not, show the day of the week, show seconds, use 12 hour format, show the system uptime, the percent of memory in use, time zones and much more.\n\nOver 30 skins are included in the distribution.\n\nYou can disable this feature.\n\nCalendar\n\nA completely skinnable desktop calendar. Over 10 skins are included in the distribution.\n\nTime Zones\n\n- View the time in different time zones.\n- time zones for alarm clock\n\nAtomic Clock\n\nYou will be able to synchronize the system time with different atomic clock servers.\nAll in all, Atomic Alarm Clock is a nice tool, it's one of the apps to be installed on every machine out there.\n\nSupported OS:\n\nWindows xp/vista/7/8\n\nHomepage: http://www.drive-software.com/atomicalarmclock.html\n\nInstallation Instructions: \n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Run application and register with any Information.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems","torrent":{"xt":"urn:btih:b11b74c74e2d991181a880659362b0d1e8983963","amp;dn":"Atomic+Alarm+Clock+v6.263+x86+Incl+Crack+-TE+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11b74c74e2d991181a880659362b0d1e8983963","infoHashBuffer":{"type":"Buffer","data":[177,27,116,199,78,45,153,17,129,168,128,101,147,98,176,209,232,152,57,99]},"announce":[],"urlList":[]}}