{"title":"Handbook of Obstetric Medicine, 5E Nelson-Piercy [PDF][StormRG]","uid":11836176,"size":32646742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b123805ee93baa993472e384addbc5585827fca9&amp;dn=Handbook+of+Obstetric+Medicine%2C+5E+Nelson-Piercy+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"0xmovva","files":2,"time":1429747546,"description":"TITLE/EDITION Handbook of Obstetric Medicine, Fifth Edition\nBy: Catherine Nelson-Piercy\nPaperback: 371 pages\nPublisher: CRC Press; 5 edition (April 8, 2015)\nLanguage: English\nISBN-10: 1482241927\nISBN-13: 978-1482241921\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nMedical professionals are often involved in the management of the pregnant patient without necessarily being experts on all the complications surrounding pregnancy. The Handbook of Obstetric Medicine addresses the most common and serious medical conditions encountered in pregnancy, including heart disease, thromboembolism, diabetes, skin problems, gastrointestinal disease, neurological problems, hormonal diseases, hypertension and pre-eclampsia, and more.\n\nFor each condition, the handbook includes a description of incidence, clinical features, pathogenesis, diagnosis, the effect of pregnancy, and management of the condition. The book also includes a detailed section focusing on the differential diagnosis of common symptoms including hypertension, chest pain, palpitations, breathlessness, headaches, dizziness, abdominal pain, and more.\n\nThe symptoms and differential diagnoses are presented in an easy-to-read tabular format and include a description of important clinical features and potential areas of investigation. For those clinicians understandably reluctant to prescribe drugs during pregnancy, a useful appendix includes a list of contraindicated drugs. In addition, to assist in the interpretation of laboratory tests, a second appendix lists normal laboratory values in pregnancy, broken down by trimester.\n\nThe handbook uses a pragmatic and easy-to-use design by including tables, bullets, and &quot;Points to remember&quot; boxes for ease of reference. It is an essential on-the-spot guide for obstetricians, physicians, general practitioners, and midwives in both practice and training","torrent":{"xt":"urn:btih:b123805ee93baa993472e384addbc5585827fca9","amp;dn":"Handbook+of+Obstetric+Medicine%2C+5E+Nelson-Piercy+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b123805ee93baa993472e384addbc5585827fca9","infoHashBuffer":{"type":"Buffer","data":[177,35,128,94,233,59,170,153,52,114,227,132,173,219,197,88,88,39,252,169]},"announce":[],"urlList":[]}}