{"title":"Linda Linda Linda (Japan movie, 2005)","uid":3546120,"size":1469038445,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1f14ff05341105141c218f2b72a1a71382fd9d5&amp;dn=Linda+Linda+Linda+%28Japan+movie%2C+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Pemu","files":6,"time":1161886422,"description":"With the school music festival just around the corner, three teenage girls decide to form a rock band in director Yamashita Nobuhiro\\&amp;#039;s highly entertaining film, Linda, Linda, Linda! But things don\\&amp;#039;t go quite as planned for the trio, thanks to the abrupt departure of their guitarist from the group. While the band\\&amp;#039;s bassist Nozomi (real-life musician Sekine Shiori) and its drummer Kyoko (Maeda Aki) are able to find a keyboard player named Kei (Kashii Yu) to fill in on guitar, they have a harder time finding someone to fill in as lead vocalist. Soon enough, the bandmates realize they have no choice but to ask a Korean exchange student named Song (Bae Du Na, from Sympathy for Mr. Vengeance) to sing lead for their makeshift band. However, there\\&amp;#039;s one little problem: Song can barely speak a word of Japanese, let alone sing it!\n\nThanks to a cassette tape of \\&quot;Linda Linda Linda,\\&quot; the 1980s era hit song by The Blue Hearts, the ragtag group of would-be musicians decides to cover the song, hoping to fine tune their performance in time for the school festival! Will they succeed?or will they hit a wrong note? Shot in an almost documentary style, Linda, Linda, Linda stands out from the pack of Japanese high school band movies, thanks in large part to the wonderful performance from Bae Du Na! Subdued and often quirky in his execution of the material, director Yamashita crafts a film that achieves a definite kind of harmony. Featuring a score by former Smashing Pumpkins guitarist James Iha, Linda, Linda, Linda is a film that music lovers are sure to enjoy! \n &lt;a href=&quot;\nhttp://www.subwaycinema.com/frames/nyaff06_linda.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subwaycinema.com/frames/nyaff06_linda.htm&lt;/a&gt;\n\nOfficial site: http://www.linda3.com/\n\nAfter seeing the film you can&amp;#039;t stop repeating the annoying &quot;linda linda linda!&quot; part!\nA special mention goes to &quot;Fustiar&quot; at Kloofy for his hardwork in providing eng subs!\n\n","torrent":{"xt":"urn:btih:b1f14ff05341105141c218f2b72a1a71382fd9d5","amp;dn":"Linda+Linda+Linda+%28Japan+movie%2C+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1f14ff05341105141c218f2b72a1a71382fd9d5","infoHashBuffer":{"type":"Buffer","data":[177,241,79,240,83,65,16,81,65,194,24,242,183,42,26,113,56,47,217,213]},"announce":[],"urlList":[]}}