{"title":"HandsOnHardcore - Paula Shy (Welcome To My Bedroom - From Cybers","uid":15820151,"size":260191202,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b25012bf1e341a5aa2b7171ee03cff97ee4327e5&amp;dn=HandsOnHardcore+-+Paula+Shy+%28Welcome+To+My+Bedroom+-+From+Cybers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"xxxlavalxxx","files":2,"time":1473751683,"description":"Paula Shy welcomes Lutro to her bedroom in todayâ™s episode of DDF Networkâ™s Hands on Hardcore. Our brand new top model from the Czech Republic is a phenomenal hot redhead with brown eyes and outstanding natural tits. While chatting online, her box gets wet and when Lutro enters her bedroom her dirty digital fantasies soon become straight forward hardcore fucking reality! Paula loves cybersex, but she also needs a hard cock between her thighs to keep her trimmed pussy satisfied. He grabs her boobs and plays with her hard nipples while his boner makes his pants explode! The stud fingers her hot twat before she returns the favor with a blowjob and some ball licking. He enjoys her sac sucking before she turns around and makes her pussy gape, so he can stick his middle finger deep into her wet box. Lubing up that cunny with his tongue is his second favorite moment of today. His favorite part is banging that young stunner on the bed. He penetrates her tight pussy with his thick dong and fucks her in standing sex position. The two enjoy some 69 adventure and his shaft disappears in Paulaâ™s deep throat. Then, she rides his cock like a cowgirl and wanks him off until he blows his cum on her pussy!\r\nTags: Cum on pussy, Fingering, Hardcore, High Heels, Lingerie, Ball licking, Blowjob\r\n \nhttp://imgdone.com/viewer.php?file=33249589464125768397.jpg\r\n \nhttp://imgdone.com/viewer.php?file=24096874218649748848.jpg","torrent":{"xt":"urn:btih:b25012bf1e341a5aa2b7171ee03cff97ee4327e5","amp;dn":"HandsOnHardcore+-+Paula+Shy+%28Welcome+To+My+Bedroom+-+From+Cybers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b25012bf1e341a5aa2b7171ee03cff97ee4327e5","infoHashBuffer":{"type":"Buffer","data":[178,80,18,191,30,52,26,90,162,183,23,30,224,60,255,151,238,67,39,229]},"announce":[],"urlList":[]}}