{"title":"Bryan Adams/Reckless[2CD][1984/2014][320KBPS][DE][RMSTD]","uid":11677196,"size":321208928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2596de8495ea8e793503c6e464d3c06208b14a3&amp;dn=Bryan+Adams%2FReckless%5B2CD%5D%5B1984%2F2014%5D%5B320KBPS%5D%5BDE%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LameDuck69","files":40,"time":1422920139,"description":"Bryan Adams - Reckless[2CD][1984/2014]DE][RMSTD]\n\n\n\nDisc 1: \n\n01. One Night Love Affair \n02. She's Only Happy When She's Dancin' \n03. Run To You \n04. Heaven \n05. Somebody \n06. Summer Of '69 \n07. Kids Wanna Rock \n08. It's Only Love \n09. Long Gone \n10. Ain't Gonna Cry \n11. Let Me Down Easy \n12. Teacher, Teacher \n13. The Boy's Night Out \n14. Draw The Line \n15. Play To Win \n16. Too Hot To Handle \n17. Reckless \n\n\nDisc 2: \n\n01. Remember - Live At Hammersmith Odeon/1985 \n02. The Only One - Live At Hammersmith Odeon/1985 \n03. It's Only Love - Live At Hammersmith Odeon/1985 \n04. Kids Wanna Rock - Live At Hammersmith Odeon/1985 \n05. Long Gone - Live At Hammersmith Odeon/1985 \n06. Cuts Like a Knife - Live At Hammersmith Odeon/1985 \n07. Lonely Night - Live At Hammersmith Odeon/1985 \n08. Tonight - Live At Hammersmith Odeon/1985 \n09. This Time - Live At Hammersmith Odeon/1985 \n10. The Best Is Yet To Come - Live At Hammersmith Odeon/1985 \n11. Heaven - Live At Hammersmith Odeon/1985 \n12. Run To You - Live At Hammersmith Odeon/1985 \n13. Somebody - Live At Hammersmith Odeon/1985 \n14. Straight From The Heart - Live At Hammersmith Odeon/1985 \n15. Summer of '69 - Live At Hammersmith Odeon/1985 \n\n--------------------------------------------------------\n\n**320 KBPS CBR\n**Cover Art\n-------------------------------------------------------------------------------\n\n Bryan Guy Adams, OC OBC (born 5 November 1959) is a Canadian singer, musician, producer, actor, social activist, and photographer. Adams has been one of the most successful figures of the world of rock music during last three decades. He's known for his strong husky vocals and energetic live performances, and he has sold more than 100 million records, making him one of the world's best-selling music artists and the best-selling Canadian rock artist of all time.\n\n Adams rose to fame in North America with his album Cuts Like a Knife and turned into a global star with his 1984 album Reckless. In 1991, he released his popular Waking Up the Neighbours album which included &quot;(Everything I Do) I Do It for You&quot;, one of the best-selling singles of all time.\n\n For his contributions to music, Adams has garnered many awards and nominations, including 20 Juno Awards among 56 nominations, 15 Grammy Award nominations including a win for Best Song Written Specifically for a Motion Picture or Television in 1992. He has also won MTV, ASCAP, American Music awards, two Ivor Novello Awards for song composition and has been nominated five times for Golden Globe Awards and three times for Academy Awards for his songwriting for films.\n\n Adams was awarded the Order of Canada and the Order of British Columbia for contributions to popular music and philanthropic work via his own foundation, which helps improve education for people around the world.\n\n Adams was inducted into the Hollywood Walk of Fame in March 2011 and Canada's Walk of Fame in 1998, and in April 2006 he was inducted into the Canadian Music Hall of Fame at Canada's Juno Awards. In 2008, Bryan was ranked 38 on the list of All-Time top artists by the Billboard Hot 100 50th Anniversary Charts. On 13 January 2010, he received the Allan Waters Humanitarian Award for his part in numerous charitable concerts and campaigns during his career, and on 1 May 2010 was given the Governor General's Performing Arts Award for his 30 years of contributions to the arts.\n-------------------------------------------------------------------------------\n Reckless is the fourth studio album by Canadian rock recording artist Bryan Adams. The album was co-produced by Adams and Bob Clearmountain, and it was one of Adams' most successful solo albums. Released on 5 November 1984 through A&amp;M Records, the album was a huge international hit, selling over 5 million units in the United States alone. It was the first Canadian album to sell more than one million units within Canada. The album peaked at number 1 on the Billboard 200 and reached high positions in the charts worldwide.[1] In total the album has sold more than 12 million copies worldwide.\n\n Six singles were released from the album: &quot;Run to You&quot;, &quot;Somebody&quot;, &quot;Heaven&quot;, &quot;Summer of '69&quot;, &quot;One Night Love Affair&quot;, and &quot;It's Only Love&quot;. All six singles made the top 15 on the US Billboard Hot 100, a feature that at the time had been accomplished previously only by Michael Jackson's Thriller and Bruce Springsteen's Born In The USA. The album was ranked No. 49 on Kerrang!s &quot;100 Greatest Heavy Metal Albums of All Time&quot;[2], and 99th Greatest Rock Album of All Time by Classic rock and was also named the #12 Greatest Canadian Album of All Time by Bob Mersereau in his book The Top 100 Canadian Albums. The album was recorded at Little Mountain Sound Studios, Vancouver, Canada. On 12 December 2009 the syndicated radio program In the Studio celebrated the 25th anniversary of the album.\n--------------------------------------------------------------------------------\n In April 2014, it was announced that a 30th Anniversary edition of the album, featuring previously unreleased material, was released on 10 November 2014 in both 4- and 2-disc editions. The Reckless 30th Anniversary Tour is also to take place in November 2014, consisting of eleven exclusive arena shows in the United Kingdom.\n-------------------------------------------------------------------------------\n \nPersonnel:\n\n Bryan Adams: lead vocals, guitars, piano, harmonica, hand claps\n Keith Scott: guitars, backing vocals\n Jim Vallance: percussion\n Dave Taylor: bass guitar\n Pat Steward: drums, backing vocals\n Tommy Mandel: keyboards\n Jody Perpick: backing vocals, background sounds\n Mickey Curry: drums\n Tina Turner: lead vocals on &quot;It's Only Love&quot;\n Steve Smith: drums on &quot;Heaven&quot;","torrent":{"xt":"urn:btih:b2596de8495ea8e793503c6e464d3c06208b14a3","amp;dn":"Bryan+Adams%2FReckless%5B2CD%5D%5B1984%2F2014%5D%5B320KBPS%5D%5BDE%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2596de8495ea8e793503c6e464d3c06208b14a3","infoHashBuffer":{"type":"Buffer","data":[178,89,109,232,73,94,168,231,147,80,60,110,70,77,60,6,32,139,20,163]},"announce":[],"urlList":[]}}