{"title":"Without Reservation (Christian Movie)","uid":4712446,"size":419437156,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b259daa1447d881bee7fd3408a1b3caa34d608e0&amp;dn=Without+Reservation+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"IndianChristian","files":2,"time":1234093321,"description":"Without Reservation (Christian Movie)\n\nIs your reservation in heaven confirmed? If you think you have plenty of time (to live on earth), this film will make you think again. \n\nThis movie is part of the Evangelism Trilogy released in 1992 by Mars Hill Productions. WITHOUT RESERVATION is the first of these three movies and is about six teenagers who leave a party and get in an automobile accident. This film packs a powerful punch and brings forth the reality that eternity is coming. \n\nSix teenagers leave the party. Four of them enter a new dimension, never to return. Victims of a fatal automobile accident, they find themselves suspended in time and space, somewhere between heaven and hell. Through a &quot;window&quot; in space, they are able to observe those they have left behind, and to preview their individual destinies. Stripped of all pretense, they each have a dramatically different response to their situation. The &quot;almost Christian&quot; is overcome by the realization of her folly. The &quot;practical agnostic&quot; is in bitter denial. And the &quot;silent Christian&quot; is confronted by his close friend, &quot;Why didn't you tell me while there was time?&quot; This sobering story concludes with an unexpected turn that powerfully communicates the hope we have in Christ. Without Reservation will move Christians to share their faith with a renewed sense of purpose, and will challenge others to seriously examine their personal relationship with Jesus Christ.\n\nLanguage: English\nSubtitles: None\nRuntime: 25 mins\nMy Rating: 10/10\nQuality: 9.0/10\n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nI have been asked many times, why am I doing this? Is not sharing like this illegal. I agree it is illegal. But spare a thought for the scores of people ending up in hell each day because they have either ignored as irrelevant or untrue the message of the Bible. Some have been nicely deceived by the great deceiver, the devil into believing in Atheism or religious pluralism. God wants everyone saved. That is why he gave his only son to die for our sins. Please do all you can to spread the good news. \n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n\n","torrent":{"xt":"urn:btih:b259daa1447d881bee7fd3408a1b3caa34d608e0","amp;dn":"Without+Reservation+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b259daa1447d881bee7fd3408a1b3caa34d608e0","infoHashBuffer":{"type":"Buffer","data":[178,89,218,161,68,125,136,27,238,127,211,64,138,27,60,170,52,214,8,224]},"announce":[],"urlList":[]}}