{"title":"The Project Rebellion Series by Mina Carter [epub/mobi]","uid":9505892,"size":2227749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2b9b46912d2f1916f4161eccecfc87bdc66f02e&amp;dn=The+Project+Rebellion+Series+by+Mina+Carter+%5Bepub%2Fmobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"7","files":-1,"time":1390317362,"description":"Perfect Mate\nMonsters do exist...and they?re the good guys.\nLillian Rosewood leads an ordinary, boring life working as the manager of a psychiatric hospital. The highlights of her day, other than her skinny hot chocolate, are the hunky guards who work in the secure section. Until a late-night emergency is wheeled in.\nCaptain Jack Harper is insane, drop-dead gorgeous...and just had his abdomen shredded. Despite the fact they're not an emergency room, Lillian can't turn him away and risk a death on her hands. Unable to get the handsome soldier out of her mind, Lillian sneaks into the restricted area to check on him. What she finds is beyond belief. Somehow Jack has managed to heal himself from a near-fatal wound in mere hours.\nWhen one of the doctors, Walker, attempts to rape her, things go from bad to worse. In the blink of an eye, Jack is loose and Walker is dead... and Lillian must accept a truth about her rescuer that will change her world forever. What if the patients aren't insane? What if their stories of secret government experiments and monsters are true?\nProduct Warnings\nContains blood, mayhem and nude werewolves operating heavy weaponry. Large amounts of sarcasm and smart-ass vampires may offend some readers. No civilian hospital staff were harmed in the making of this story.\n\nBlood Mate\nThe only thing they have in common? Really?sharp?teeth.\nMajor Antonia Fielding has one goal: to escape the clutches of the Project. With the blood-virus infecting her system, though, a body bag is likely her only way out. Until her boss lets slip that he may just have a cure for her?if she brings in an escaped Lycan.\nCan she trust him? Now there?s the million-dollar question. Then again, can she afford not to take that chance?\nDarce Foster was a Special Forces soldier, until the Project got hold of him. Now he?s a Lycan, a lab-created werewolf, this close to escaping his creators?until another of the Project?s experiments stops him in his tracks. Not because she has the power to hold him, but because he instantly recognizes the impossible. The vampiress is his mate.\nAllowing her to bring him in is his only choice?and possibly the last mistake of his life.\nEnemies or lovers, it doesn?t matter. When they discover that the Project is hiding yet more secrets, they must work together to bring it down...or die in the attempt.\n\n\nGenre: Paranormal Romance","torrent":{"xt":"urn:btih:b2b9b46912d2f1916f4161eccecfc87bdc66f02e","amp;dn":"The+Project+Rebellion+Series+by+Mina+Carter+%5Bepub%2Fmobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b9b46912d2f1916f4161eccecfc87bdc66f02e","infoHashBuffer":{"type":"Buffer","data":[178,185,180,105,18,210,241,145,111,65,97,236,206,207,200,123,220,102,240,46]},"announce":[],"urlList":[]}}