{"title":"The Complete Adventures of Captain Blood - Rafael Sabatini","uid":11740376,"size":758174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2d85d2deabd2974d88356527d61613ed6177b46&amp;dn=The+Complete+Adventures+of+Captain+Blood+-+Rafael+Sabatini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"amontoth","files":2,"time":1425768687,"description":"The Complete Adventures of Captin Blood - Rafael Sabatini\nOmnibus Edition\nAmontoth\n\nIncluding:\nCaptain Blood: His Odyssey\nThe Chronicles of Captain Blood (Aka Captain Blood Returns)\nThe Fortunes of Capatain Blood\n\n\nRafael Sabatini first introduced the character Captain Blood in a series of eight short stories in Premier Magazine as Tales of the Brethren of the Main, published from December 1920 to March 1921, and reprinted in Adventure Magazine from January to May 1921, with a novella &quot;Captain Blood's Dilemma&quot;, published in Premier Magazine in April 1921 (and Adventure Magazine in October 1921). The Odyssey-like story arc of these tales was then woven by Sabatini into a continuous narrative in novel form, published as Captain Blood: His Odyssey in 1922.\n\nCaptain Blood was an enormously popular work, but instead of continuing the series with sequels, Sabatini wrote fifteen more short stories set during Captain Blood's pirate career. Two of the tales in Captain Blood Returns (&quot;The War Indemnity&quot; and &quot;Blood Money&quot;) may be viewed as continuations of events that took place in the original novel, but all the stories are contained within the timeframe of Captain Blood.\n\nEight of these new stories were published in 1931 as Captain Blood Returns (retitled The Chronicles of Captain Blood in the British publication) along with two of the Tales of the Brethren of the Main that had not been incorporated into Captain Blood. A second collection, The Fortunes of Captain Blood was published in 1936, consisting of six new stories, and one final story was included in Sabatini's collection of short stories Turbulent Tales, published in 1946.\n\nCaptain Blood featured in at least 8 films, the most famous of which starred Errol Flynn, a comic book series and as a character in Alan Moore's comic book series The League of Extraordinary Gentlemen.\n\n--from wikipedia","torrent":{"xt":"urn:btih:b2d85d2deabd2974d88356527d61613ed6177b46","amp;dn":"The+Complete+Adventures+of+Captain+Blood+-+Rafael+Sabatini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d85d2deabd2974d88356527d61613ed6177b46","infoHashBuffer":{"type":"Buffer","data":[178,216,93,45,234,189,41,116,216,131,86,82,125,97,97,62,214,23,123,70]},"announce":[],"urlList":[]}}