{"title":"RealtimeBondage--Pushing Boundaries Part 2  London River High","uid":15756569,"size":3014725362,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b32c77f6bc3422ce8fc301fa143c369589a2f9a4&amp;dn=RealtimeBondage--Pushing+Boundaries+Part+2++London+River+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"merzedes","files":1,"time":1473062275,"description":"Pushing Boundaries Part 2 | London River\r\n\r\nSeptember 3, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBondage Betty Brutally Water Boarded \r\n \r\nIn the first part of London River's live video we did our best to make her understand her place as the submissive in our activities. It seemed like it worked at the time but now she's back to her old bossy self like nothing ever happened. Now we are going to have O.T. really put her in her place. By the end of today's portion, London River is going to feel completely helpless and like she's lost all control of her surroundings. But that's only because she has.\r\n\r\nWe have London set up her own scene by laying down padding on the section of the floor we'll be using. O.T. comes in and hobbles her hands with tape and ties them to her shoulders so it looks like she has chicken wings. He then proceeds to tape up his own hands so they don't get too damaged from the beating he is about to deliver. He lands punch after punch on London's torso and ass while she is helpless to do anything but squirm around the mat she set up. It's an incredible thing to watch someone who was once so scary look so powerless and small. A single tear leaks from her eye when O.T. knocks her across the face.\r\n\r\nIf that wasn't enough to break her, our next activity undoubtedly will be. London drills a narrow bench into the ground and lies on top of it, where she is then mummified in black gauze from her neck to her knees. O.T. then lays a black cloth over her face and starts to water board her mercilessly. This practice is used to crack some of the world's hardest individuals so it is no surprise when it does the trick on our London. Within minutes she is openly weeping. She sobs for mercy and for help but what she gets instead is the rest of her legs bound up and a cane striking harshly up and down her encased body. If we thought the water boarding made her cry, we had no idea the kind of effect this would have. \r\n\r\nScreens \nhttp://www.realtimebondage.com/live/bondage/trailer.php?y=2016&amp;p=09_03lriver13&amp;u=RealTimeBondage-London-River-Pushing-Boundaries-Part-2\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:b32c77f6bc3422ce8fc301fa143c369589a2f9a4","amp;dn":"RealtimeBondage--Pushing+Boundaries+Part+2++London+River+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b32c77f6bc3422ce8fc301fa143c369589a2f9a4","infoHashBuffer":{"type":"Buffer","data":[179,44,119,246,188,52,34,206,143,195,1,250,20,60,54,149,137,162,249,164]},"announce":[],"urlList":[]}}