{"title":"Joseph Heath - Economics Without Illusions [epub]","uid":9023173,"size":2391998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3313c60b7e43311b3696c14f2af51af73c7e550&amp;dn=Joseph+Heath+-+Economics+Without+Illusions+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"epub_888","files":-1,"time":1381314615,"description":"Economics Without Illusions: Debunking the Myths of Modern Capitalism\n\n&quot;Economics is haunted by more fallacies than any other study known to man.&quot;  -- Henry Hazlitt, Economics in One Lesson (1946)\n\nEvery day economic claims are used by the media or in conversation to support social and political positions. Those on the left tend to distrust economists, seeing them as friends of the right. There is something to this, since professional economists are almost all keen supporters of the free market. Yet while factions on the right naturally embrace economists, they also tend to overestimate the effect of their support on free-market policies. The result is widespread confusion. In fact, virtually all commonly held beliefs about economics--whether espoused by political activists, politicians, journalists or taxpayers--are just plain wrong.\n\nProfessor Joseph Heath wants to raise our economic literacy and empower us with new ideas. In Economics Without Illusions, he draws on everyday examples to skewer the six favourite economic fallacies of the right, followed by impaling the six favourite fallacies of the left. Heath leaves no sacred cows untipped as he breaks down complex arguments and shows how the world really works. The popularity of such books as Freakonomics and Predictably Irrational demonstrates that people want a better understanding of the financial forces that affect them.  Highly readable, cogently argued and certain to raise ire along all points of the socio-political spectrum, Economics Without Illusions offers readers the economic literacy they need to genuinely understand and critique the pros and cons of capitalism.\n\n\nAbout the Author\n\nJOSEPH HEATH is an associate professor at the University of Toronto, where he teaches in the Department of Philosophy and the School of Public Policy and Governance.   He is the author of three previousbooks: Nation of Rebels: Why Counterculture Became Consumer Culture (with Andrew Potter); Communicative Action and Rational Choice, which won the Canadian Philosophical Association Book Prize for 2003; and The Efficient Society, a Maclean's and Globe and Mail bestseller selected by the Globe as one of the best books of 2001. He writes a monthly column for the journal Policy Options and is a frequent contributor to The Montreal Gazette.","torrent":{"xt":"urn:btih:b3313c60b7e43311b3696c14f2af51af73c7e550","amp;dn":"Joseph+Heath+-+Economics+Without+Illusions+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3313c60b7e43311b3696c14f2af51af73c7e550","infoHashBuffer":{"type":"Buffer","data":[179,49,60,96,183,228,51,17,179,105,108,20,242,175,81,175,115,199,229,80]},"announce":[],"urlList":[]}}