{"title":"Clips4Sale - Sandra Torres (My Boy Is Trying To Breed With Me) H","uid":15078152,"size":299690395,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b383ce162dbe4921935343843ccffae8249f372d&amp;dn=Clips4Sale+-+Sandra+Torres+%28My+Boy+Is+Trying+To+Breed+With+Me%29+H&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"SudoSu","files":1,"time":1466849533,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/0GWRg \nhttp://imgkiss.com/image/0GhMs\r\n\r\nIt opens up with you looking at yourself in the mirror only wearing pantyhose and a sexy bra as you fix your hair. You think your son is out of the house but as your brush and bend down to pick up your dropped brush your son walks up behind you and gropes your ass. You gasp and quickly turn around to see its your son. He puts his arms around you and you are shocked to be dressed like this in front of your son and the fright is too much. You let out a moan and you faint in his arms. He takes time to admire your body and feels you up. He gets aroused and no longer sees you as his mom but a woman who he now has to breed with. He lays you on the floor and he enjoys your body and then rips open a hole in your pantyhose for easy access and has his way with you. He gets a little too excited a cums rather quick. He gets up and leaves to go clean himself and you begin to stir. You groggily get up and see your pantyhose ripped and your pussy full of cum. You walk off screen and suddenly you scream and are back in your sons arms and he is carrying your body to bed. &quot;Thanks for making this easy,&quot; he says as he admires your body in his arms and you softly moan but are . He lays u on the bed and has his way again once he is finished he leaves and the next thing that you know is that cum is dripping from your pussy. You see your son's seed coming out of you. The horror and sexual ecstasy of it all makes your body betray you as you drift back to sleep. You wake up and call your girlfriend to vent about what happened. You are drinking something as you tell your girlfriend, &quot;he's my son I cant just go to the cops&quot; you say. &quot;if i didn't fucking pass out I might have been able to snap him out of it. I just need to find a way to help him and hope that I don't get pregnant.&quot; Once you hang up you start to feel really tired and you realize there is something in your drink, its too late though as your eyes gently close and you're again. Your son comes back in and lays you down with you ass facing towards the camera. This time after feeling up your body he decides to enjoy your mouth violently giving himself a bj. The scene returns to a nice close up of you face with cum leaking from your open mouth. You're lying on your bed and you groggily wake up and you see you are now dressed in one of your sling bikinis. &quot;ewww&quot; you say from the cum in your mouth. &quot;WTF how did i get in this? My son is out of control&quot; you get up and try to be sneaky through the house looking for him. You go off screen again and we hear you yell and once again we see you in your sons arms completely and your at his mercy. He brings you back to bed and luckily the bikini make for easy access and he fucks you more once done he looks at you as he leaves and the camera gets one last nice shot of you sleeping body with cum dripping out.\r\n\r\nSail to another one at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:b383ce162dbe4921935343843ccffae8249f372d","amp;dn":"Clips4Sale+-+Sandra+Torres+%28My+Boy+Is+Trying+To+Breed+With+Me%29+H","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b383ce162dbe4921935343843ccffae8249f372d","infoHashBuffer":{"type":"Buffer","data":[179,131,206,22,45,190,73,33,147,83,67,132,60,207,250,232,36,159,55,45]},"announce":[],"urlList":[]}}