{"title":"Roxy Music - Roxy Music 320cbr (Big Papi)","uid":9485277,"size":111289637,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b44d72ced585fe5cd0e997cbc95de339151f2b53&amp;dn=Roxy+Music+-+Roxy+Music+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389877895,"description":"Source: CD Rip\n\n\n\nBy The Groove\n\n\nIn 1972, when groups like Led Zeppelin and the Rolling Stones were dominating the American charts and stadiums, another British rock band named Roxy Music released its debut album to an unsuspecting public. &quot;Roxy Music&quot; is the first of two albums to feature sound wizard Brian Eno, and it's quite a listening experience like no other. The album can best be described as art rock with a few ambient touches, with often brilliant results. Eno's electronic mastery, coupled with Bryan Ferry's piano and distinct voice, are well-backed by fellow musicians Andy Mackay, Phil Manganera, Paul Thompson, and Graham Simpson. &quot;Ladytron&quot; opens with a wash of eerie synths before it blasts into a full-blown rocker; &quot;Chance Meeting&quot; is a piano-flavored ballad perfectly set Ferry's pained vocals, and &quot;2 H.B.&quot; is as smooth as Italian silk. From track to track, &quot;Roxy Music&quot; boils over with class and sophistication, making them peerless in the arena of avant garde rock. Those whose first Roxy album was &quot;Avalon&quot; might be in for a shock when they pick this CD up. But when listened with an open mind, its rare riches will win you over. A classic ahead of its time.","torrent":{"xt":"urn:btih:b44d72ced585fe5cd0e997cbc95de339151f2b53","amp;dn":"Roxy+Music+-+Roxy+Music+320cbr+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44d72ced585fe5cd0e997cbc95de339151f2b53","infoHashBuffer":{"type":"Buffer","data":[180,77,114,206,213,133,254,92,208,233,151,203,201,93,227,57,21,31,43,83]},"announce":[],"urlList":[]}}