{"title":"With Napoleon's Guard in Russia: The Memoirs of Major Vionnet","uid":15789340,"size":2241422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4736a0de4417f2c04099fcd57e48026394f1d5b&amp;dn=With+Napoleon%27s+Guard+in+Russia%3A+The+Memoirs+of+Major+Vionnet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"marty14","files":1,"time":1473371536,"description":"With Napoleon's Guard in Russia: The Memoirs of Major Vionnet, 1812 - Louis Joseph Vionnet [epub]\r\n\r\nMajor Louis Joseph Vionnet’s memoirs of Napoleon’s disastrous 1812 campaign in Russia are readable, detailed, and full of personal anecdote and vivid glimpses into the life of the nineteenth-century soldier. His account concentrates in particular on the retreat from Moscow, but he was present at all the major actions and followed the entire course of the campaign from the opening moves in July 1812 to being chased through Prussia by bands of Cossacks in early 1813. He was present at the destruction of Smolensk, toured the battlefield of Borodino and witnessed the great fire in Moscow. Vionnet was a major in the Fusiliers-Grenadiers, a regiment of veterans in the Imperial Guard, and his account provides a wonderful insight into the élan, morale and cohesion of this elite fighting force. Jonathan North has translated Vionnet’s memoirs for the first time for this English edition. In addition to providing detailed explanatory notes, he quotes from the accounts left by five other soldiers from the same regiment, and these extracts allow the reader to follow the ups and downs of the unit as a whole. \r\n\r\nLouis Joseph Vionnet, Vicomte de Maringoné, was born in Longueville in 1769, the son of a peasant and a lace maker. He joined the artillery in 1793 and was promoted to captain in the line in 1794. He fought in Italy in 1796, in the line infantry in 1798 and the Guard grenadiers in 1806, and campaigned in Prussia, Poland and Spain. In 1809, he joined the Fusiliers of the Guard, fought again in Spain in 1811 and then, with the rank of major, he took part in the 1812 Russian campaign, which he survived. He retired in the 1830s and died in 1834","torrent":{"xt":"urn:btih:b4736a0de4417f2c04099fcd57e48026394f1d5b","amp;dn":"With+Napoleon%27s+Guard+in+Russia%3A+The+Memoirs+of+Major+Vionnet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4736a0de4417f2c04099fcd57e48026394f1d5b","infoHashBuffer":{"type":"Buffer","data":[180,115,106,13,228,65,127,44,4,9,159,205,87,228,128,38,57,79,29,91]},"announce":[],"urlList":[]}}