{"title":"Around India in 80 Trains - Monisha Rajesh","uid":11715269,"size":4819959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4f85bdf0eccf60130e0835515540fc22760160f&amp;dn=Around+India+in+80+Trains+-+Monisha+Rajesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1424541061,"description":"In 1991, Monisha's family uprooted from Sheffield to Madras in the hope of making India their home. Two years later, fed up with soap-eating rats, stolen human hearts and the creepy colonel across the road, they returned to England with a bitter taste in their mouths. \n\nTwenty years later, Monisha came back. Taking a page out of Jules Verne's classic tale, Around the World in 80 Days, she embarked on a 40,000km adventure around India in 80 trains. Travelling a distance equivalent to the circumference of the Earth, she lifted the veil on a country that had become a stranger to her.\n\nAs one of the largest civilian employers in the world, featuring luxury trains, toy trains, Mumbai's infamous commuter trains and even a hospital on wheels, Indian Railways had more than a few stories to tell. On the way, Monisha met a colourful cast of characters with epic stories of their own. But with a self-confessed militant atheist as her photographer, Monisha's personal journey around a country built on religion was not quite what she bargained for...\n\nAround India in 80 Trains is a story of adventure and drama infused with sparkling wit and humour","torrent":{"xt":"urn:btih:b4f85bdf0eccf60130e0835515540fc22760160f","amp;dn":"Around+India+in+80+Trains+-+Monisha+Rajesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f85bdf0eccf60130e0835515540fc22760160f","infoHashBuffer":{"type":"Buffer","data":[180,248,91,223,14,204,246,1,48,224,131,85,21,84,15,194,39,96,22,15]},"announce":[],"urlList":[]}}