{"title":"Thich Nhat Hanh - The Present Moment.zip","uid":5626132,"size":101117127,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b6041bcd1a2b421063f92d1d7e5f3074c6e0193c&amp;dn=Thich+Nhat+Hanh+-+The+Present+Moment.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZDaddy","files":-1,"time":1276487584,"description":"Thich Nhat Hanh - The Present Moment\n\nBuddhism teaches that the present moment contains the seeds of all things, including liberation from samsara (the world of suffering). In this live audio retreat with Thich Nhat Hanh, you experience first--hand the traditional Buddhist practices designed to touch the energy of mindfulness you carry within and help you open to the joy that is always present and waiting to enter our lives.\n\nAs a humble Buddhist monk in 1966, Thich Nhat Hanh was nominated for the Nobel Peace Prize by Martin Luther King, Jr. Since that time, he has developed a special way of teaching the dharma (essential Buddhist truths) in the West -- a way that addresses the spiritual challenges unique to our day, while honoring all faiths. The seeds of internal and external peace are already inside you, he teaches. You need only learn to contact and nurture them. This is the path to transcending fear and anger; this is the path to a more peaceful world.\n\nYou will learn a treasury of detailed meditations to help you walk, breathe, communicate -- even cope with traffic -- more deeply and consciously. The Present Moment is a rare opportunity to learn ancient Buddhist practices directly from a living master of the tradition -- practices that are life--changing today, just as they were thousands of years ago. Over seven hours of direct instruction from this living master of Buddhist meditation techniques.\n\nLearn More About:\n-----------------\n- The Heart Sutra.\n- Birth and death.\n- How to break the habit of forgetfulness and replace it with the real peace of   mindfulness.\n- Buddhist awareness practices to apply to driving your car, answering the phone, even eating and reading.\n- Principles of Buddhist psychology.\n\n\n***** Sharing is caring, please SEED! *****","torrent":{"xt":"urn:btih:b6041bcd1a2b421063f92d1d7e5f3074c6e0193c","amp;dn":"Thich+Nhat+Hanh+-+The+Present+Moment.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6041bcd1a2b421063f92d1d7e5f3074c6e0193c","infoHashBuffer":{"type":"Buffer","data":[182,4,27,205,26,43,66,16,99,249,45,29,126,95,48,116,198,224,25,60]},"announce":[],"urlList":[]}}