{"title":"Ki-duk Kim - Bi-mong aka Dream (2008)","uid":4623024,"size":1233675651,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b6943fe1747250f70a7294b224783da05479c673&amp;dn=Ki-duk+Kim+-+Bi-mong+aka+Dream+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1231105933,"description":"Ki-duk Kim - Bi-mong aka Dream (2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1165253/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1165253/&lt;/a&gt;\n\nLanguage\tKorean | Japanese\nSubtitles\tEnglish and Chinese sub/idx\n &lt;a href=&quot;\nhttp://img183.imageshack.us/img183/5658/bimongsd4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img183.imageshack.us/img183/5658/bimongsd4.jpg&lt;/a&gt;\n\n[QUOTE]Dream (or Bi-mong, as is the Korean title) is already Ki-duk's 15th film. It's also the 15th Ki-duk film I watched so obviously you can consider me a fan. Ki-duk is a director who's known to stay pretty close to what he does best, so even though the differences between Dream and his earlier films might not seem stellar, they do present a big deviation for Ki-duk standards. Yet in the end, Dream is still 100% Ki-duk and couldn't have been made by any other.\n\nCentral to Dream is the casting of Jo Odagiri, Japanese acting talent who's often considered to be Tadanobu Asano's professional twin (and rightfully so). Odagiri is known for his interesting choices in film and his foreign appeal. Even their looks seem to match from time to time. Odagiri plays a large part in Ki-duk's latest and marks Ki-duk's first big deviation. It's the first time a foreign film star takes the center stage in one of his films.\n\nProbably even bolder is the fact that Odagiri is allowed to speak Japanese throughout the whole of the film. There is no language barrier for the characters, which is a pretty rare choice to make. Even though it is never specified whether Odagiri plays a Japanese or Korean character, the way Japanese and Korean are mixed is very unnatural. Still, after a few minutes of getting used to it only works in favor of the film as Odagiri can focus on acting rather than struggle with a foreign language.\n\nKi-duk's second departure from his signature style is the amount of dialog featured in the film. Not exactly the first time he allows his characters to communicate verbally (cfr Time - Shi Gan), but it still feels very un-Ki-duk-like. On the other hand, it fits the film well and Ki-duk does a much better job of handling the dialog than he did with Time. And even though there might be more dialog to Ki-duk standards, there are still pretty long stretches were characters do little more than grunt and act, especially near the end of the film.\n\nApart from these two deviations, all crucial Ki-duk elements are still very much in place. There are the strong key performances, very troubled and somewhat enigmatic characters, a touch of magic and at the end there is hope, tragic as the events might have been. And in between all that there is enough confusion and symbolism to keep people who like to puzzle more than satisfied.\n\nVisually Ki-duk is aiming for a more outspoken visual style here. He's not completely succeeding but the key scenes are all well directed and from time to time there is some stellar imagery to admire. Still, there is room for improvement as some scenes still feel a bit bland compared to the others. Much better is the soundtrack, which is every bit as mystical as it is special. Though a little overdone in the dream segments, the singing near the end of the film really gives the film some extra chills and cuts right through the bone. No idea which language was used for the songs, but it fit the film wonderfully.\n\nApart from the strong leads, the big plus of Dream is it's exceptional concept. Rather than spoil it here - it is much nicer to find it out for yourself - I'll say that it is every bit as magical as Bin-Jip's finale. Ki-duk eases the viewer into the story and goes full out in the last half hour, turning the film around again to be all you'd expect from a Ki-duk film. Characters are hurting, reality is often as flaky as dreams can be and tragedy lies just around the corner.\n\nThe scene in the field near the river marks a shift to Ki-duk's usual trickery and from there on the film is elevated to a higher level. Odagiri is as strong as ever, his female companion acts on an equal level and the both of them really bring Ki-duk's Dream to life. If you get past the excessive dialog (for a Ki-duk film at least) and accept the quirky (but smart) mix of Korean and Japanese, Dream's another Ki-duk film rivaling the best of his previous work.\n\nSince Bin-Jip, only Shi Gan was a small disappointment. Apart from that one, Ki-duk seems to be on a roll with a string of near-masterpieces almost uncontested by any other director. That said, I think Ki-duk is still missing that final touch to make his films into true full-fledged masterpieces. Some more attention to the visual side and a little more attention to the integration of the soundtrack, but it seems he's getting there, slowly but surely. Odagiri's presence was a smart move, so was the strong and exceptional idea behind the film. One of Ki-duk's best, no doubt. [/QUOTE]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d3.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d4.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d5.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d5.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d6.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/d6.png&lt;/a&gt;\n\n---my rip------\n\nThere is a scene release (Dream.2008.DVDRip.XviD-BiFOS) of this movie, but with lower quality.\n\n\n~~~~~~ Bi-mong.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,229,897,728                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:34:40                \nFrame Count:....................................136161             \nFrame Width (pixels):...........................704                  \nFrame Height (pixels):..........................368                  \nAspect Ratio:...................................1.913                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1531                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.246&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2  \n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE' \n\nInsanity = downloading an aXXo rip then re-encoding as a DVD...","torrent":{"xt":"urn:btih:b6943fe1747250f70a7294b224783da05479c673","amp;dn":"Ki-duk+Kim+-+Bi-mong+aka+Dream+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6943fe1747250f70a7294b224783da05479c673","infoHashBuffer":{"type":"Buffer","data":[182,148,63,225,116,114,80,247,10,114,148,178,36,120,61,160,84,121,198,115]},"announce":[],"urlList":[]}}