{"title":"Nikon D7100 Digital Field Guide &amp; Nikon D7100 For Dummies  (","uid":8780295,"size":103623457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6c5f16ba41e0c6bcbd8bf3bf558bb500f4c55aa&amp;dn=Nikon+D7100+Digital+Field+Guide+%26amp%3B+Nikon+D7100+For+Dummies++%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"F1restorm","files":-1,"time":1375694923,"description":"1. D7100 Digital Field Guide/ J Dennis Thomas\nPublished: June 13, 2013\nPublisher: Wiley\nFormat: Retail Epub\n2. Nikon D7100 For Dummies/ Julie Adair King\nPublished: June 4, 2013\nPublisher: Wiley\nFormat: Retail Epub\n_________________________________________________________________________\n\n1. D7100 Digital Field Guide\nLet a photographer show you how to use your amazing Nikon D7100\nYour camera manual may provide a good overview of the Nikon D7100, but it was not written by a photographer. This full-color guide helps you understand each feature from the photographer's point of view. Along with explaining the settings, it shows you how to use them in specific situations. It's also packed with tips learned from actual field experience with the D7100. Take it along as you and your D7100 explore the world.\nSet up your D7100, learn to use exposure, metering, focus, and release modes, and work with picture controls\nUnderstand how to use each of 19 specific scene modes\nExplore different lenses and lens accessories, learn to manage exposure, and experiment with lighting\nWork with Live View, video, in-camera editing, and image management\n2. Nikon D7100 For Dummies\nA must-have, full-color guide to the Nikon D7100\nThe Nikon D7100 is an ideal camera for beginning photographers who may lack structured photography training but are still eager and determined to take great photos. And that's where this fun-and-friendly guide comes in handy! Packed with more than 300 full-color photos, this introductory guide begins by helping you get a feel for the camera, get comfortable shooting in auto mode, managing playback options, and handle basic troubleshooting strategies. Veteran author Julie Adair King walks you through the D7100's features and encourages you to take creative control so that you can start capturing stunning pictures immediately.\nPacks in more than 300 full-color photos that exemplify the basic photo skills needed to get great shots\nShares a wealth of information from one of the most popular digital photography authors\nWalks you through adjusting manual settings to get better results from exposure, lighting, focus, and color\nContains an entire chapter on video mode\nExplains how to send images to a computer for organizing, editing, and sharing\nNikon D7100 For Dummies helps you get a grasp on your camera's controls so you can start taking memorable photos today!","torrent":{"xt":"urn:btih:b6c5f16ba41e0c6bcbd8bf3bf558bb500f4c55aa","amp;dn":"Nikon+D7100+Digital+Field+Guide+%26amp%3B+Nikon+D7100+For+Dummies++%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6c5f16ba41e0c6bcbd8bf3bf558bb500f4c55aa","infoHashBuffer":{"type":"Buffer","data":[182,197,241,107,164,30,12,107,203,216,191,59,245,88,187,80,15,76,85,170]},"announce":[],"urlList":[]}}