{"title":"No Church in the Wild - Kanye West &amp; Jay Z","uid":8642766,"size":11000690,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b73c79215476a0b9d309d4267656dc6dd028c928&amp;dn=No+Church+in+the+Wild+-+Kanye+West+%26amp%3B+Jay+Z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Lesean13","files":1,"time":1372910487,"description":"&quot;No Church in the Wild&quot; is a song by American hip hop artists Kanye West and Jay-Z from their first collaborative album Watch the Throne (2011). It is the first track on the album and features vocals from Frank Ocean and The-Dream, although the latter is uncredited for his contribution to the song. The song explores themes of religion and decadence. The track received highly positive reviews from music critics, who praised Ocean's vocal hooks, the depth of the verses, the cinematic production and the song's power as an opening track.\nThe track was released as the seventh and final single from Watch the Throne. The song peaked at number 72 on the US Billboard Hot 100 and entered the top 40 on both the US Billboard Hot Rap Songs and Hot R&amp;B/Hip-Hop Songs charts. The song received a music video directed by Romain Gavras released on May 29, 2012. The video does not feature any of the performers featured on the song and instead features anarchic riot footage and large street fights. The video received positive reviews from critics who praised the visuals of the video and the unique aesthetic presented in the video.\nJay-Z and West performed the song as part of the setlist of their Watch the Throne Tour and Ocean performed his portion of the song on several different occasions during his November 2011 tour through North America and Europe. &quot;No Church in the Wild&quot; was featured in the theatrical trailers for the action films Safe House and Gangster Squad, as well as the 2013 film adaptation of The Great Gatsby. The song itself has debuted at #18 on the US Billboard YouTube 100 music video chart in July 2012. The song received a nomination for Best Rap/Sung Collaboration and Best Short Form Music Video at the 55th Grammy Awards to be held in February 2013. It later won in the category of Best Rap/Sung Collaboration, marking this Jay-Z's sixth win in the category","torrent":{"xt":"urn:btih:b73c79215476a0b9d309d4267656dc6dd028c928","amp;dn":"No+Church+in+the+Wild+-+Kanye+West+%26amp%3B+Jay+Z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b73c79215476a0b9d309d4267656dc6dd028c928","infoHashBuffer":{"type":"Buffer","data":[183,60,121,33,84,118,160,185,211,9,212,38,118,86,220,109,208,40,201,40]},"announce":[],"urlList":[]}}