{"title":"Pounder's Marine Diesel Engines and Gas Turbines, 9th Edition","uid":5135385,"size":19707975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b764e0953ccfce0aee84262562ec320159e92b39&amp;dn=Pounder%5C%27s+Marine+Diesel+Engines+and+Gas+Turbines%2C+9th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1256434792,"description":"ht tp://i34.tiny pic.com/2whf421.jpg\n\nPounder's Marine Diesel Engines and Gas Turbines, Ninth Edition\nPublisher: Butterworth | Pages: 912 | 2009-10-22 | ISBN 0750689846 | PDF \n\nSince its first appearance in 1950, Pounder's Marine Diesel Engines has served seagoing engineers, students of the Certificates of Competency examinations and the marine engineering industry throughout the world. Each new edition has noted the changes in engine design and the influence of new technology and economic needs on the marine diesel engine.\nNow in its ninth edition, Pounder's retains the directness of approach and attention to essential detail that characterized its predecessors. There are new chapters on monitoring control and HiMSEN engines as well as information on developments in electronic-controlled fuel injection. It is fully updated to cover new legislation including that on emissions and provides details on enhancing overall efficiency and cutting CO2 emissions.\nAfter experience as a seagoing engineer with the British India Steam Navigation Company, Doug Woodyard held editorial positions with the Institution of Mechanical Engineers and the Institute of Marine Engineers. He subsequently edited The Motor Ship journal for eight years before becoming a freelance editor specializing in shipping, shipbuilding and marine engineering. He is currently technical editor of Marine Propulsion and Auxiliary Machinery, a contributing editor to Speed at Sea, Shipping World and Shipbuilder and a technical press consultant to Rolls-Royce Commercial Marine.\n\n* Helps engineers to understand the latest changes to marine diesel engineers\n* Careful organization of the new edition enables readers to access the information they require\n* Brand new chapters focus on monitoring control systems and HiMSEN engines.\n* Over 270 high quality, clearly labeled illustrations and figures to aid understanding and help engineers quickly identify what they need to know.","torrent":{"xt":"urn:btih:b764e0953ccfce0aee84262562ec320159e92b39","amp;dn":"Pounder%5C%27s+Marine+Diesel+Engines+and+Gas+Turbines%2C+9th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b764e0953ccfce0aee84262562ec320159e92b39","infoHashBuffer":{"type":"Buffer","data":[183,100,224,149,60,207,206,10,238,132,38,37,98,236,50,1,89,233,43,57]},"announce":[],"urlList":[]}}