{"title":"Operation Paperclip by Annie Jacobsen","uid":9625350,"size":5742099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7b823e309356ffe7381ea9e7416ba32314c9e52&amp;dn=Operation+Paperclip+by+Annie+Jacobsen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"PirateBook","files":1,"time":1392582031,"description":"\nThe explosive story of America's secret post-WWII science programs, from the author of the New York Times bestseller Area 51\nIn the chaos following World War II, the U.S. government faced many difficult decisions, including what to do with the Third Reich's scientific minds. These were the brains behind the Nazis' once-indomitable war machine. So began Operation Paperclip, a decades-long, covert project to bring Hitler's scientists and their families to the United States.\n\nMany of these men were accused of war crimes, and others had stood trial at Nuremberg; one was convicted of mass murder and slavery. They were also directly responsible for major advances in rocketry, medical treatments, and the U.S. space program. Was Operation Paperclip a moral outrage, or did it help America win the Cold War?\n\nDrawing on exclusive interviews with dozens of Paperclip family members, colleagues, and interrogators, and with access to German archival documents (including previously unseen papers made available by direct descendants of the Third Reich's ranking members), files obtained through the Freedom of Information Act, and dossiers discovered in government archives and at Harvard University, Annie Jacobsen follows more than a dozen German scientists through their postwar lives and into a startling, complex, nefarious, and jealously guarded government secret of the twentieth century.\n\nIn this definitive, controversial look at one of America's most strategic, and disturbing, government programs, Jacobsen shows just how dark government can get in the name of national security.\n\nGenre: Non Fiction , History","torrent":{"xt":"urn:btih:b7b823e309356ffe7381ea9e7416ba32314c9e52","amp;dn":"Operation+Paperclip+by+Annie+Jacobsen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b823e309356ffe7381ea9e7416ba32314c9e52","infoHashBuffer":{"type":"Buffer","data":[183,184,35,227,9,53,111,254,115,129,234,158,116,22,186,50,49,76,158,82]},"announce":[],"urlList":[]}}