{"title":"China Under Mao: A revolution derailed (2015) pdf","uid":11804692,"size":2564237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7be333cbb7893465fef51fe880a0f3674f187be&amp;dn=China+Under+Mao%3A+A+revolution+derailed+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1428531061,"description":"China s Communist Party seized power in 1949 after a long period of guerrilla insurgency followed by full-scale war, but the Chinese revolution was just beginning. China Under Mao &quot;narrates the rise and fall of the Maoist revolutionary state from 1949 to 1976 an epoch of startling accomplishments and disastrous failures, steered by many forces but dominated above all by Mao Zedong. Mao s China, Andrew Walder argues, was defined by two distinctive institutions established during the first decade of Communist Party rule: a Party apparatus that exercised firm (sometimes harsh) discipline over its members and cadres; and a socialist economy modeled after the Soviet Union. Although a large national bureaucracy had oversight of this authoritarian system, Mao intervened strongly at every turn. The doctrines and political organization that produced Mao s greatest achievements victory in the civil war, the creation of China s first unified modern state, a historic transformation of urban and rural life also generated his worst failures: the industrial depression and rural famine of the Great Leap Forward and the violent destruction and stagnation of the Cultural Revolution. Misdiagnosing China s problems as capitalist restoration and prescribing continuing class struggle against imaginary enemies as the solution, Mao ruined much of what he had built and created no viable alternative. At the time of his death, he left China backward and deeply divided.&quot;","torrent":{"xt":"urn:btih:b7be333cbb7893465fef51fe880a0f3674f187be","amp;dn":"China+Under+Mao%3A+A+revolution+derailed+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7be333cbb7893465fef51fe880a0f3674f187be","infoHashBuffer":{"type":"Buffer","data":[183,190,51,60,187,120,147,70,95,239,81,254,136,10,15,54,116,241,135,190]},"announce":[],"urlList":[]}}