{"title":"Crocodile Shoes - BBC TV - Series One - (1994)(Jimmy Nail)TV VHS","uid":4398433,"size":4508097444,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b836cf2ba091b206c5895aa3a747342331be4d9e&amp;dn=Crocodile+Shoes+-+BBC+TV+-+Series+One+-+%281994%29%28Jimmy+Nail%29TV+VHS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"seanprince","files":30,"time":1221549886,"description":"IMDB Rating = 6.9\n\nLink to IMDB HERE\n\n\nReview From IMDB\n\nJimmy Nail is superb as a Geordie lathe operator cum song writer who tries for the big time. Pathos and dry humour (a Nail trademark)abound in a colourful and varied story which successfully mixes action, romance, mystery and music. The music, performed and mostly written by Nail, who also wrote the series, is excellent. It makes the story all the more believable - the soundtrack album really did make a singing star out of Jimmy Nail. North American viewers may find the Newcastle accents hard to follow.\n\n\nPlease note This is not my rip I got this elsewhere We must thank the original uploader = &quot;pgarbutt &quot; for making this series available i have looked at it and it is what it says its a TV VHS RIP so the quality is not like a dvd rip but it is still very watchable. Once again thanks to the original ripper.\n\n\nOriginal ripper notes\n\n\n\n\nCrocodile Shoes - Series 1\n==========================\n\n&quot;Wine, beer and spirits all the time. Though I have you, still she's always on my mind...&quot;\n\n7 Episodes.\n\n1. The Tape\nJed gets a surprise from his sister. While Adrian gets a surpise in the mail and starts making plans.\n\n2. The Pitch\nAdrian shows Jed the big city.\n\n3. The Deal\nTrue colours shine thru. As Adrian gets the wheels rolling &amp; Jed gets a make-over. Warning this episode contains nudity!!\n\n4. The Trip\nSpecial Appearance by: Amy Madigan and Burt Young.\nJed goes to the US, gets in trouble, then gets a hand with his music. While Adrian gets thrown a line.\n\n5. The Truth\nJed makes a sudden visit home and uncovers some revealing facts. But there could be a light at the end of the tunnel. Warning this episode contains nudity!!\n\n6. The Call\nSpecial Appearance by: Amy Madigan and Burt Young.\nNever mixing business with pleasure, Jed gets a lesson from a legend. Hightailing it home he finds Adrian paying for his pleasures.\n\n7. The End\nWill Jed make it? Will Adrian break it? The finale of Crocodile Shoes!!\n\n\nTransferred from original VHS TV recordings off BBC1.\n\nPAL system format.\n\nStereo 48KHz.\n\nArchived 09-13 September 2007.\n\n640x480 resolution.\n\n4x3 aspect ratio.\n\n\nNotes\n=====\n\nEpisode 3 has a small drop-out during Adrian's &quot;chat&quot; with Alex Kingston (of e.r. fame)\nEpisode 7 cuts at approximately 1 minute or so from the end, but it doesn't spoil at all...you'll see ;o)\n\nFile format is of .DIVX format, but you can rename to .AVI if you prefer...still works fine if you do!\n\n\nTransfer History\n================\n\nVHS &gt; JVC S-VIDEO Recorder &gt; UMAX 8400 DVD Recorder &gt; DVD +R &gt; IFOEDIT 0.971 &gt; TMPGEnc DVD Author 1.6 &gt; TMPGEnc DVD Author 3 &gt; DIVX (600MB)\n\nAnything higher rate than that and I don't think you'll spot the difference - 600MB per episode is just right anyways for approx 50 minutes of video, so the whole series fits onto a DVD-R quite easily. IFO Edit was used to clean the VOBs and produce workable IFOs so that they'd go into TMPEGEnc. I had to use v1.6 of TMPEG, as v2.0 refused to load the cleaned VOBs - I don't know why and I have got the latest version too!\n\nUPDATE: Before I got a hold of TMPG3, I'd authored to DVD format using 1.6..didn't try direct to AVI using TMPG3...future releases (Crocdile Shoes 2, Spender etc) will be direct. Using Clone DVD Mobile produced out-of-sync audio AVIs!\n\nIf anyone has the sell-thru VHS of the series, I'll gladly transfer those instead!\n\nPlease keep this NFO with the episodes so that people know how they were made and who done the work.\n\nJust remember - if this comes out on official DVD then buy it.\nThese DivX files are for archival purposes until that time, OK?!\nENJOY THIS RARELY-SEEN SERIES!\n\n\n\n\nI Have Also Included The Original Sound Track From This Series\n\n\n\n\nJimmy Nail - Crocodile Shoes - OST (1994)[EAC-MP3@320KBPS]\n\nTrack list\n\nJimmy Nail - Crocodile Shoes\n\n01. Crocodile Shoes 04:18\n02. Calling Out Your Name 03:35\n03. Cowboy Dreams 03:14\n04. Once Upon A Time 02:58\n05. Only One Heart 03:48\n06. Bitter And Twisted 03:39\n07. Love Will Find Someone For You 03:08\n08. Angel 03:07\n09. Between A Woman And A Man 03:52\n10. Don't Wanna Go Home 04:20\n11. Dragons 03:46\n\nBiography by John Bush\n\nVocalist Jimmy Nail first came to prominence in England as an actor during the early '80s, in the highly successful BBC-TV series Auf Wiedersehen Pet. His next TV work, Spender, was a labor of love; he wrote and produced the series, starring as undercover detective Freddie Spender as well. He won several awards for the show, which also launched a best-selling novel. More awards were forthcoming for his series Crocodile Shoes, in which he played a third-rate country singer. Nail began recording in the mid-'80s, and first gained an American contract with the 1992 album Growing Up in Public. His 1995 LP Crocodile Shoes -- based on the TV series -- went triple-platinum in Great Britain (and spawned a best-selling follow-up one year later). In 1996, Jimmy Nail earned his most popular role, that of tango singer AgustÃƒÆ’Ã‚Â­n Magaldi in Madonna's feature-film version of Evita.\n\nReview From Amazon.co.uk\n\nLike the very nose on his face, Jimmy Nail is a man going in two directions. Despite being one of Britain's most in-demand actors, he's always cited singing as his true vocation. In 1994, Nail was afforded the luxury of not having to choose when he was landed the lead in a TV drama about a jobbing singer-songwriter. Crocodile Shoes was a project very close to Nail's heart. Despite a cluster of hits under his belt, this was Nail's major songwriting debut. One might infer from songs like &quot;Once Upon A Time&quot; and &quot;Bitter And Twisted&quot; that Nail is happiest in the pub rock idiom. Perhaps though, he was writing for the part. Either way, the standard of his compositions is predictably dwarfed by three submissions from Paddy MacAloon, including the single &quot;Cowboy Dreams&quot;. Lest we forget, the Prefab Sprout frontman cut his teeth on the Tyneside pub circuit. &quot;Love Will Find Someone For You&quot; and &quot;Dragons&quot; strike a balance between sentimentality and poetry that Nail would do well to mind.\n\nEnjoy.","torrent":{"xt":"urn:btih:b836cf2ba091b206c5895aa3a747342331be4d9e","amp;dn":"Crocodile+Shoes+-+BBC+TV+-+Series+One+-+%281994%29%28Jimmy+Nail%29TV+VHS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b836cf2ba091b206c5895aa3a747342331be4d9e","infoHashBuffer":{"type":"Buffer","data":[184,54,207,43,160,145,178,6,197,137,90,163,167,71,52,35,49,190,77,158]},"announce":[],"urlList":[]}}