{"title":"The Ghost of a Saber Tooth Tiger - Midnight Sun [2014][FLAC]","uid":10553587,"size":354170182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b96fd423d662bb9568a9ab4c8fbbfdbfb8f684be&amp;dn=The+Ghost+of+a+Saber+Tooth+Tiger+-+Midnight+Sun+%5B2014%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":-1,"time":1405364553,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Chimera Music #CHIM 18CD\nCountry:USA\nYear: April 29, 2014\nGenre: Neo-Psychedelia,rock\nFormat: CD, Album,\n\n[b]\n\n1.\tToo Deep\n2.\tXanadu\n3.\tAnimals\n4.\tJohannesburg\n5.\tMidnight Sun\n6.\tLast Call\n7.\tDevil You Know\n8.\tGolden Earrings\n9.\tGreat Expectations\n10.\tPoor Paul Getty\n11.\tDon't Look Back Orpheus\n12.\tMoth to a Flame\n\n\n\nWhether they're exploring gentle, Brazilian-influenced harmonies, drifting folk, or psychedelic pop, it's clear that Sean Lennon and Charlotte Kemp Muhl, better known as the Ghost of a Saber Tooth Tiger, are on a journey of creative exploration. On Midnight Sun, the pair follow their artistic muse into the realm of fuzzy psych rock. While their journey into this territory started on Le Carotte Bleue, an album that felt similar to some of Lennon's past work, Midnight Sun feels like a different animal altogether. With its eclectic instrumentation and crunchy production (mixed by the master himself, Dave Fridmann), Lennon and Muhl create a musical landscape where seemingly anything can happen. Unfettered by their past, the GOASTT are free to chase their sweet melodies wherever they might go. This gives the album a carefree demeanor that invites listeners to forget about the past and get lost in its musical expanses, allowing them to step through the looking glass and simply drift along. Although the album certainly has the unmistakable influence of Lennon's father, it feels more like the unrestrained work of Tame Impala and the Flaming Lips, showing the fantastic potential of a small group working on the infinite canvas that is the modern studio to create a unique vision. Even though Midnight Sun feels like a creative milestone for the band, it's clear that it's just another step in Lennon and Muhl's creative evolution, and while fans might miss it when it's gone, it's exciting to think about what these two might be seeing on the horizon.","torrent":{"xt":"urn:btih:b96fd423d662bb9568a9ab4c8fbbfdbfb8f684be","amp;dn":"The+Ghost+of+a+Saber+Tooth+Tiger+-+Midnight+Sun+%5B2014%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b96fd423d662bb9568a9ab4c8fbbfdbfb8f684be","infoHashBuffer":{"type":"Buffer","data":[185,111,212,35,214,98,187,149,104,169,171,76,143,187,253,191,184,246,132,190]},"announce":[],"urlList":[]}}