{"title":"Children Of The Corn BoxSet 1-9 [480p.DVDRip.H264] BINGO","uid":9797719,"size":9668306442,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b97fffc055812e2cded0f5af4a814f7596741bc9&amp;dn=Children+Of+The+Corn+BoxSet+1-9+%5B480p.DVDRip.H264%5D+BINGO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":7,"uploader":".BONE.","files":23,"time":1395340165,"description":"Release Title: Children.Of.The.Corn.BoxSet.1-9[480p.DVDRip.H264](BINGOWINGZ-UKB-RG)\nRelease Dates: 1984/92/95/96/98/99-2001/2009/2011\nGenre: Horror | Thriller\n\n\nChildren of the Corn [1984]\nCode:\nwww.imdb.com/title/tt0087050/  (88 mins)\nA young couple is trapped in a remote town where a dangerous\nreligious cult of children believe everyone over the age of 18\nmust be killed.\n\n\nChildren of the Corn II - The Final Sacrifice [1992]\nCode:\nwww.imdb.com/title/tt0106557/ (89 mins) AR 1.66:1 ?\nA journalist and his son travel to Nebraska to investigate the\nmysterious town of Gaitlin where, unbeknownst to them, a\nmurderous cult of children are waiting\nin the corn fields.\n\n\nChildren of the Corn III - Urban Harvest [1995]\nCode:\nwww.imdb.com/title/tt0109415/ (88 mins)\nTwo brothers, formerly of the murderous children's cult of\nGatlin Nebraska, are taken to Chicago by an unwitting couple.\n\n\nChildren of the Corn IV - The Gathering [1996]\nCode:\nwww.imdb.com/title/tt0115885/  (81 mins)\nAll the kids in a town over night become feverish and have\nconvulsions. The next day they start to become evil, change\ntheir names for those of kids killed long ago, and then start\nkilling any adult in their path, in vicious and mysterious forms.\nA young woman who has just returned to town tries to find\nout what is happening, while trying to protect her transformed\nyoung sister. However, the kids are starting to revive\ntheir leader...\n\n\nChildren of the Corn V - Fields of Terror [1998]\nCode:\nwww.imdb.com/title/tt0150111  (82 mins)\nSix college students take a wrong turn and find themselves lost in\na strangely deserted rural town... only to discover that this\ndeceptively quiet place hides a murderous cult of children controlled\nby evil forces! Yet even as bodies begin cropping up all around\nthem, the young friends decide to stay and rescue the children...\nor Die Trying!\n\n\nChildren of the Corn 666 - Isaac's Return [1999]\nCode:\nwww.imdb.com/title/tt0177625/  (81 mins)\nHannah goes back to her hometown (Gatlin) to find out who her mother\nis, but on the way she picks up a strange man who fore-shadows her life\nwith a passage from the bible. When she gets there she wakes up Isaac\nfrom a coma he has been in for 19 years. Isaac is awake\nand wants to fulfill the final prophecy!\n\n\nChildren of the Corn - Revelation [2001]\nCode:\nwww.imdb.com/title/tt0279730/  (81 mins)\nWhen a girl named Jamie repeatedly tries to contact her grandmother to\nno avail, she investigates by going to her apartment in Omaha Nebraska\n..only to find that it's been condemned and overtaken by possesed\nchildren! As she digs deeper, she discovers a dark secret about her\ngrandmother and awakens a dark, demonic force that wants Jamie dead\nand will stop at nothing.\n\n\nChildren of the Corn [2009]\nCode:\nwww.imdb.com/title/tt1290135/  (92 mins)\nAn unhappy married couple encounter a cult of murderous children who\nworship an entity called He Who Walks Behind the Rows while traveling.\n\n\nChildren of the Corn - Genesis [2011]\nCode:\nwww.imdb.com/title/tt1745672/  (80 mins)\nTIM and ALLIE seek shelter in a remote desert compound after becoming\nlost and stranded. A strange Manson-like character, PREACHER (Drago),\nreluctantly allows them inside with strict orders to be gone by morning\nand not wander &quot;where you are not invited.&quot; At first, Preacher and his\nmail-order wife OKSANA (Nedeljakova) deny the faint screams and cries\nthat emanate from one of the crumbling outbuildings. When Allie sneaks\noutside to investigate, she discovers that she and Tim have\nstumbled onto a bizarre cult worshiping an entity that may -- or may not\n-- dwell inside a haunted little boy.\n\nE: 1-7 DVD-R *THC* / DVD9/cropsy/BitHQ &lt; Cheers\nVideo: MP4/H264/852*480/460/360/504/23/25/29fps\nAudio: AAC/2ch/128Kbps\nEng Subs Included: NO\nSample Included: Yes\nFile Size: (1GB x9 / 9GB)","torrent":{"xt":"urn:btih:b97fffc055812e2cded0f5af4a814f7596741bc9","amp;dn":"Children+Of+The+Corn+BoxSet+1-9+%5B480p.DVDRip.H264%5D+BINGO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b97fffc055812e2cded0f5af4a814f7596741bc9","infoHashBuffer":{"type":"Buffer","data":[185,127,255,192,85,129,46,44,222,208,245,175,74,129,79,117,150,116,27,201]},"announce":[],"urlList":[]}}