{"title":"IBM SPSS STATISTICS v19.0.1 [thethingy]","uid":6056886,"size":499881998,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9e1c6b2b38fc9af4097c35b045583becb09973c&amp;dn=IBM+SPSS+STATISTICS+v19.0.1+%5Bthethingy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"thethingy","files":-1,"time":1292943939,"description":"IBM - SPSS Statistics v19.0.1 Multilingual.\n\nIBM SPSS Statistics is a comprehensive, easy-to-use set of predictive analytic tools for business users, analysts and statistical programmers. For more than 40 years, organizations of all types have relied on IBM SPSS Statistics to increase revenue, outmanoeuvre competitors, conduct research and make better decisions.\n\nIBM SPSS Statistics offers a broad range of statistical and analytical capabilities that organizations require. Its an easy-to-use, comprehensive software solution that:\n\nAddresses the entire analytical process from planning and data preparation to analysis, reporting and deployment\n\nProvides tailored functionality and custom interfaces for different skill levels and functional responsibilities of business users, analysts and statisticians\n\nIncludes flexible deployment options from stand-alone desktop to enterprise-strength server versions\n\nProvides faster performance and more accurate results, compared to non-statistical, spreadsheet-type software\n\nWorks with all common data types, external programming languages, operating systems and file types\n\nOffers a broad range of specialized techniques to speed productivity and increase effectiveness\n\n","torrent":{"xt":"urn:btih:b9e1c6b2b38fc9af4097c35b045583becb09973c","amp;dn":"IBM+SPSS+STATISTICS+v19.0.1+%5Bthethingy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e1c6b2b38fc9af4097c35b045583becb09973c","infoHashBuffer":{"type":"Buffer","data":[185,225,198,178,179,143,201,175,64,151,195,91,4,85,131,190,203,9,151,60]},"announce":[],"urlList":[]}}