{"title":"Mirror's Edge [NTSC], XBOX360","uid":6329461,"size":5108740549,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ba3a7394de5be10c130dbfd5451cee6fd93ff557&amp;dn=Mirror%5C%27s+Edge+%5BNTSC%5D%2C+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Big_dude","files":-1,"time":1303227175,"description":"Mirror's Edge for XBox 360                                        Rel. 11/12/2008\n\n\nDVD9 NTSC-USA \nWave 2\nEnglish\nStealth Patched, No AP2.5\n\n\n\nDiscs:            1\nImage:            .DVD/ISO\nGenre.:           Action\nRating:           TEEN\nRequirements:     Modded or Flashed Drive (iXtreme or LT+)\n\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: Your xbox360 console must be Modded or drive flashed with Ixtreme\n      to play any copy. It isn't recommended to play any game copy online \n      unless your using LT+. Even then you still run the risk of getting \n      banned so just be aware of that.\n\n\n\nGame Description:\n\nMirror's Edge is a first-person action game set in a dystopian society ruled by a totalitarian regime that exercises a high amount of surveillance on citizens. The city has a clean look, with bright cold tone visuals that are mainly white with hints of orange. Players control Faith, a female runner who transfers information by moving over the roofs of the city as all other forms of communication are monitored. She grew up alone in the streets when her mother died during the November Riots and her father deserted her shortly after. She was taught as a little girl by a man called Mercury, who caught her breaking in and was impressed with her skills. Hunted down by a government agents, she needs to find a way to free her sister.\n\nBased on the principles of parkour, the focus is on the freedom of movement. Although the game path is largely linear, the controls are largely context-sensitive and she needs to string up moves to build up a fluid flow of movement, by running up walls, sliding below fences, or by jumping, vaulting or climbing, using pipes, ramps or using objects as zip-lines. The emphasis on movement is enhanced through the camera, which spins, or bobs up and down according to the speed, and the prominent visibility of her arms, legs and torso. The game is also largely HUDless. When Faith is hurt, the city's colours desaturate. To assist the player in this fast-paced movement, the game applies Runner Vision where environmental pieces are highlighted when they occur to Faith as possible escape routes. In complex situations, Reaction Time, a form of bullet time, can be applied to slow down the pace without losing momentum.\n\nEven though Faith generally needs to run from agents who chase her on foot or from helicopters, she can attack them using melee combat, or disarm agents to grab and wield their weapons. The game takes place both outside, and inside buildings and there are ten chapters in total. The story is furthered through animated films between the missions, not using the game engine. Next to the main story mode, there is a time attack mode with portions of levels and the fastest times are shown as red runners who act as ghosts. While playing, hidden messenger bags can be collected to unlock extras.\n\n\n\nOnly use DVD Decrypter or Imgburn to burn with respected media.\n\n\nIf using DVD Decrypter make sure Layer Break (For DL Media) is at 1913760 user specified\noption. As DVD Decrypter doesn't recognize .DVD files.\n\n\nIf your new to the Xbox360 scene do some research online.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:ba3a7394de5be10c130dbfd5451cee6fd93ff557","amp;dn":"Mirror%5C%27s+Edge+%5BNTSC%5D%2C+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba3a7394de5be10c130dbfd5451cee6fd93ff557","infoHashBuffer":{"type":"Buffer","data":[186,58,115,148,222,91,225,12,19,13,191,213,69,28,238,111,217,63,245,87]},"announce":[],"urlList":[]}}