{"title":"Empire Building - Orientalism and Victorian Architecture (Art Eb","uid":10495034,"size":8285271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bad1a17a8cfffabc364b9e319a4552f2a6c1e71d&amp;dn=Empire+Building+-+Orientalism+and+Victorian+Architecture+%28Art+Eb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1404602044,"description":"Empire Building: Orientalism and Victorian Architecture by Mark Crinson\nEnglish | 1996 | ISBN: 0415139406 , 0415139414 | 304 pages | PDF | 7,9 MB\n\nThe colonial architecture of the nineteenth century has much to tell us of the history of colonialism and cultural exchange. Yet, these buildings can be read in many ways. Do they stand as witnesses to the rapacity and self-delusion of empire? Are they monuments to a world of lost glory and forgotten convictions? \n\nDo they reveal battles won by indigenous cultures and styles? Or do they simply represent an architectural style made absurdly incongruous in relocation?\nEmpire Building is a study of how and why Western architecture was exported to the Middle East and how Islamic and Byzantine architectural ideas and styles impacted on the West.\nThe book explores how far racial theory and political and religious agendas guided British architects (and how such ideas were resisted when applied), and how Eastern ideas came to influence the West, through writers such as Ruskin and buildings such as the Crystal Palace.\nBeautifully written and lavishly illustrated, Empire Building takes the reader on an extraordinary postcolonial journey, backwards and forwards, into the heart and to the edge of empire.","torrent":{"xt":"urn:btih:bad1a17a8cfffabc364b9e319a4552f2a6c1e71d","amp;dn":"Empire+Building+-+Orientalism+and+Victorian+Architecture+%28Art+Eb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bad1a17a8cfffabc364b9e319a4552f2a6c1e71d","infoHashBuffer":{"type":"Buffer","data":[186,209,161,122,140,255,250,188,54,75,158,49,154,69,82,242,166,193,231,29]},"announce":[],"urlList":[]}}