{"title":"My.Kitchen.Rules.s06e18.WS.PDTV.x264.BF1.mkv","uid":11733559,"size":641232234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb22b14c3a215663bd6120b98ce5c7d503d3ad55&amp;dn=My.Kitchen.Rules.s06e18.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"bigfish5","files":1,"time":1425475160,"description":"My Kitchen Rules Australia Series 6 Episode 18\n\nTwo teams have been sent packing from the competition already and now a curveball could throw them all off their game. Hosted by Pete Evans and Manu Feildel.\nWho will be eliminated from Colin's Secret Round?\n\nKatie and Nikki New South Wales\nI don't think we've really been anywhere in public without getting hit on.\nBlonde bombshells Katie and Nikki might not look like your average butchers, but these pretty girls can get down and dirty.\n&quot;People are like, 'Wow, you're the hottest butcher I've ever seen.' Having this face in a butchers shop doesn't really add up,&quot; admits Nikki. &quot;But my first job was when I was six years old was unknotting pig intestine for sausages.&quot;\nAs the daughter of a butcher, she's handled her fair share of meat. &quot;I like it because it's different jobs every day. And people always come up and give you recipe ideas or you get to tell them what you've cooked. Everyone is so interested in food when you're talking to them.&quot;\nShe gets annoyed sometimes because people don't think the pretty model behind the counter knows what she's talking about. &quot;One lady said, 'You look too glamorous to know what to do.' It's like whatever.&quot;\nTo her surprise, Nikki, 20, found a similar soul in uni mate Katie, 21, who also works in a butcher's shop.\n&quot;My dad plays golf with the owner,&quot; she confesses. &quot;So he gave me the number one day when I was looking for an extra job. But I didn't call for two weeks because I was like, 'I don't want to work in a butchers.'&quot;\nBut since starting, she's enjoyed the social side of the job. And learning new flavour combinations as well.\n&quot;Because we're a butchers that serve a lot of shove it in the oven meals, so like a Moroccan lamb leg that's all marinated, so just learning all the flavours is mostly what I've gotten out of it.&quot;\nNeither girl is ever short of attention from the male species, which is why they both also work as promo girls while studying business administration and psychology at Uni.\n&quot;We get a lot of attention, a lot,&quot; says Nikki. &quot;I don't think I've really been anywhere in public without getting hit on.&quot;\n&quot;We're pretty sexy,&quot; says Katie. &quot;I'm pretty; she's sexy.&quot;\nWhile the girls didn't necessarily click at first, once they realised how many similarities they had they became firm friends.\nSays boot camp loving Katie: &quot;The parts of personality that either me or her are missing, the other one fills. I'm pretty decisive, I know what I want to do.&quot;\nAdds Nikki quickly: &quot;And I'm the most indecisive person you'll ever meet.&quot;\nBut she knows her way around a kitchen having been cooking for her large Croatian family since she was 12 years old.\n&quot;I grew up in a Croatian family so it's a lot of cooking and everything is centred around food. Every big holiday you'd have to help out cooking for 50 people.&quot;\nNikki specializes in Croatian favourites such as stuffed cabbage leaves, stuffed capsicums and skinless sausages. But also has numerous requests for her chicken schnitzels and sweet and sour pork and is the self-proclaimed BBQ Queen.\nKatie's kitchen experience is mostly cooking for herself, but she loves to experiment with flavours and is a whiz when it comes to knife skills.\n&quot;Nikki has more experience in the kitchen which is probably why I do most of the prep,&quot; she admits.\nThe main difference between these guys and the rest of the competition is how they divide the work in the kitchen","torrent":{"xt":"urn:btih:bb22b14c3a215663bd6120b98ce5c7d503d3ad55","amp;dn":"My.Kitchen.Rules.s06e18.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb22b14c3a215663bd6120b98ce5c7d503d3ad55","infoHashBuffer":{"type":"Buffer","data":[187,34,177,76,58,33,86,99,189,97,32,185,140,229,199,213,3,211,173,85]},"announce":[],"urlList":[]}}