{"title":"1632 - Ring of Fire series Eric Flint, collection of 7 audiobook","uid":6591197,"size":4834311953,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bb748da0296dcbd5010f267005697b918e25eebf&amp;dn=1632+-+Ring+of+Fire+series+Eric+Flint%2C+collection+of+7+audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"badbob999","files":-1,"time":1312832578,"description":"All audiobooks originate from torrents downloaded fromThis is just a combined torrent for all the hard to find 1632-series audiobook torrents out there. I will seed this on and of for at least a year or untill itÃ‚Â´s future is secured, be patient, sooner or later you will reach 100%. Hope all you old and new fans enjoy. \n/mickevaganza\n\nPS. If you got any audiobook in the series that is not included in this collection,please leave a link in the comments field and I or someone else will create a new torrent with it included aswell DS.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/1632_series&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/1632_series&lt;/a&gt;\n\n1632 - Ring of Fire - Eric Flint\n1633 - Ring of Fire - Eric Flint, David Weber\n1634 - The Baltic War -David Weber, Eric Flint\n1634 - The Bavarian Crisis - Eric Flint, Virginia DeMarce\n1634 - The Galileo Affair - Andrew Dennis, Eric Flint\n1634 - The Ram Rebellion - Virginia DeMarce &amp; Eric Flint\n1635 - The Cannon Law - Andrew Dennis, Eric Flint\n\nThe 1632 series, also known as the 1632-verse or Ring of Fire series, is an alternate history book series and sub-series created, primarily co-written, and coordinated by Eric Flint and published by Baen Books. The series is set in 17th century Europe in which the small fictional town of Grantville, West Virginia, in the year 2000 was sent to the past in central Germany in the year 1631, during the Thirty Years\\\\\\' War.\n\nThe plot situation allows pragmatic American union-oriented political thought to grind against the authoritarian religion-driven societies of an unconsolidated Germany barely out of the Middle Ages. Flint explores examples of suffering due to the petty politics of self-aggrandizement and self-interest on the one hand, and the irreconcilable differences of the schism in Christianity such as the Protestant Reformation and the Counter-Reformation on the other. Despite the fact that the shift puts Grantville in May 1631 initially, because of the ongoing war and the primitive transportation networks of the day Grantville\\\\\\'s arrival has something of a delayed impact, so the bulk of the book\\\\\\'s action takes place in 1632, hence the name.\nBy late in 1632, the New United States-led coalition of the Confederated Principalities of Europe had become the arsenal and financier (through Jewish connections of real historical interest) for Swedish King Gustavus Adolphus. This leads the scheming Cardinal Richelieu, who\\\\\\'d been previously financing him to spite and weaken the Habsburgs, to turn on the Swedes. Various books from up-time Grantville, especially history books, had found avid readers amongst Europe\\\\\\'s ruling elites, changing the plans and strategies of major players of the time.\n\n","torrent":{"xt":"urn:btih:bb748da0296dcbd5010f267005697b918e25eebf","amp;dn":"1632+-+Ring+of+Fire+series+Eric+Flint%2C+collection+of+7+audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb748da0296dcbd5010f267005697b918e25eebf","infoHashBuffer":{"type":"Buffer","data":[187,116,141,160,41,109,203,213,1,15,38,112,5,105,123,145,142,37,238,191]},"announce":[],"urlList":[]}}