{"title":"Soap TV Series - Comedy 1977-81 Season 1","uid":4409581,"size":4580564920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bba61d961f1fc07e261b74e57eb41a83dabb50a3&amp;dn=Soap+TV+Series+-+Comedy+1977-81+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"rambam1776","files":28,"time":1222148926,"description":"Soap was one of the funniest shows to hit TV after the Mary Tyler Moore revolution of the early 1970s changed it from the crap and schlock of the pioneer era. Seen as controversial in its time, Soap featured bizarre plot twists, campy farce, and even an alien abduction. I will be upping each season individually, and the parameters below should be fairly representative of each episode. There were no extras or subtitles on the original discs.\n\n\nAVI File Details\n========================================\nName.........: Soap - 101.avi\nFilesize.....: 174 MB (or 178,928 KB or 183,222,272 bytes)\nRuntime......: 00:24:34 (44,176 fr)\nVideo Codec..: XviD\nVideo Bitrate: 882 kb/s\nAudio Codec..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 103 kb/s (51/ch, stereo) VBR LAME3.97\nFrame Size...: 512x384 (1.33:1) [=4:3] \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075584/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075584/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Soap_(TV_series)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Soap_(TV_series)&lt;/a&gt;\n\n\n\nSoap is an American sitcom that originally ran on ABC from 1977 to 1981.\n\nThe show was a weekly half-hour long primetime comedy and its format was similar to that of a daytime soap opera. It aired for four seasons and 85 episodes, some episodes of which were one hour long. (The hour-long episodes were later split in two, yielding 93 half-hour episodes for syndication.) The show was created, written, and produced by Susan Harris. The final four episodes of the series aired as one-hours during the original run on ABC. Each returning season was preceded by a 90-minute retrospective of the previous season. Two of these retrospectives were made available on VHS in 1994. [1]\n\nAll episodes are currently available on region 1 DVD in 4 separate box sets. In the past, the series has rerun on local syndicated channels as well as on cable on Comedy Central and TV Land.\n\nPlot\nSoap is set in the fictional town of Dunns River, Connecticut, and each episode begins with a shot of two women chatting over lunch as announcer Rod Roddy intones, &quot;This is the story of two sisters: Jessica Tate and Mary Campbell&quot;.\n\nIn the very first opening sequence, the announcer says that the Tates live in a neighborhood known as &quot;rich&quot;. The wealthy Tate family employs a sarcastic butler, Benson DuBois (referred to only as &quot;Benson&quot; on this series), played by Robert Guillaume, who is perhaps the only &quot;normal&quot; character on the series. In a long-running gag, Benson looks up lugubriously whenever the doorbell rings and, as everyone stares expectantly at him, he remarks, &quot;You want me to get that...?&quot; In 1979, Guillaume&amp;#039;s character was spun off into his own series, Benson. In Soap the name DuBois is never mentioned, and there are several suggestions that Benson is his surname.\n\nJessica and her husband, Chester, are hardly models of fidelity, as their various love affairs result in several family mishaps, including the murder of Mary&amp;#039;s stepson, Peter Campbell (Robert Urich). Even though everyone tells Jessica about Chester&amp;#039;s affairs, she does not believe them until she sees his philandering with her own two eyes: while out to lunch with Mary, Jessica spots Chester necking with his secretary. Heartbroken, she sobs in her sister&amp;#039;s arms. While Soap was a sitcom at its core, the show at times features this kind of dramatic scene that is sensitively handled and very moving. On later occasions, it becomes clear Jess has always known on some level about Chester&amp;#039;s affairs but never allowed herself to process the information.\n\nMary&amp;#039;s family, the Campbells, are more middle-class, and as the series begins, her son Danny Dallas, a product of her first marriage to Johnny Dallas, is a junior gangster-in-training. Danny is told to kill his stepfather, Burt Campbell, Mary&amp;#039;s current husband, who, Danny is told, murdered his father Johnny. It is later revealed that Danny&amp;#039;s father was killed by Burt in self-defense. Danny refuses to kill Burt and goes on the run from the Mob in a variety of disguises. This eventually ends when Elaine Lefkowitz (played by Dinah Manoff), the spoiled daughter of the Mob Boss (played by Sorrell Booke) , falls in love with Danny and stops her father, who then tells Danny he will have to marry Elaine or he will kill him. In the fourth season, it is revealed that Chester is, in fact, Danny&amp;#039;s true father, the product of a secret affair between him and Mary before his marriage to Jessica.\n\nThe first season ends with Jessica convicted of the murder of Peter Campbell. The announcer concludes the season by announcing that Jessica is innocent, and that one of five characters - Burt, Chester, Jodie, Benson or Corinne - killed Peter Campbell. The interest over this cliffhanger precursored interest over the &quot;Who shot J.R.?&quot; cliffhanger on Dallas. Chester later confesses to Peter&amp;#039;s murder and is sent to prison.\n\n\nMajor plots of later seasons\n\nOther plot lines include Jessica&amp;#039;s adopted daughter Corinne courting Father Tim Flotsky, with the two eventually marrying and having a child who is possessed by the Devil; Chester being imprisoned for Peter&amp;#039;s murder, escaping with his prison roommate Dutch, and coming down with amnesia after a failed operation; Jessica&amp;#039;s other daughter, Eunice, sleeping with a married congressman, and then falling in love with Dutch; Mary&amp;#039;s stepson Chuck, a ventriloquist whose hostilities are expressed through his alter ego, a quick-witted dummy named Bob; Jessica&amp;#039;s love affairs with several men, including Peter Campbell, a private investigator hired to find the missing presumed-dead Chester, her psychiatrist, and a Latin American revolutionary known as &quot;El Puerco&quot; (his friends just call him &quot;El&quot;); Billy Tate&amp;#039;s confinement by a cult called the &quot;Sunnies&quot; (a parody of Sun Myung Moon&amp;#039;s Unification Movement, called the &quot;Moonies&quot; by its critics), and then his affair with his school teacher who becomes unhinged; Danny and his romantic trials with the daughter of a mobster, a black woman, a prostitute, and Chester&amp;#039;s second wife, Annie; and Burt&amp;#039;s confinement to a mental institution, his abduction by aliens while being replaced with an oversexed alien look-a-like on Earth, and getting blackmailed by the Mob after becoming sheriff of their small town.\n\nAt the beginning of each episode, off-camera announcer Rod Roddy gives a brief description of the convoluted storyline and remarks, &quot;Confused? You won&amp;#039;t be, after this episode of...Soap&quot;. At the end of each episode, he asks a series of life-or-death questions in a deliberately deadpan style -- &quot;Will Jessica discover Chester&amp;#039;s affair...? Will Benson discover Chester&amp;#039;s affair? Will Benson care?&quot; and concludes each episode with the trademark line, &quot;These questions - and many others - will be answered in the next episode of Soap.&quot;\n\nThe series ended abruptly on April 20, 1981; the final episode contains several cliffhangers that are never resolved. These involve a suicidal Chester preparing to kill Danny and Chester&amp;#039;s second wife after catching them in bed, Burt preparing to walk into an ambush set up by his political enemies, and Jessica about to be executed by a communist firing squad.\n\nHowever, a 1983 episode of Benson mentions Jessica&amp;#039;s disappearance, noting the Tate family is seeking to have her declared legally dead. In this episode, Jessica appears as an apparition whom only Benson can see or hear, revealing to Benson that she is not dead, but in a coma somewhere in South America. The other two cliffhangers are not referenced, leaving it to the viewers&amp;#039; imagination as to what might have happened.\n\n\n Opening title sequence\n\nInitially, the opening sequence was a lunch scene between Mary and Jessica. Announcer Rod Roddy would describe the basic premise of the series. &quot;This is a story about two sisters, Jessica Tate and Mary Campbell. These are the Tates. And these are the Campbells, and this is SOAP&quot;. After that, the series consisted of two different title sequences during the first two seasons, with the leading cast members assembled together in a tableau. In the first one, a fight slowly breaks out between the cast members. The second involves wooden beams and plaster from overhead, suddenly and without warning, crashing to the floor, but the cast remains still, apparently unfazed by what would be likely seen by others as catastrophic. In the later seasons, the sequences changed to just a fighting one as cast members left or were added.\n\nMain Characters: \n\nKatherine Helmond - Jessica Tate - The sister of Mary Campbell and one of the two main focus characters of the show. She is married to Chester Tate but divorces him in the later episodes. \n\nRobert Mandan - Chester Tate - A wealthy stock broker and Jessica&amp;#039;s philandering husband. \n\nJimmy Baio - Billy Tate - The youngest child and only son of Jessica and Chester. He later has an affair with his very young teacher. \n\nDiana Canova - Corinne Tate Flotsky - Jessica and Chester&amp;#039;s daughter. It is later revealed that she is adopted and is really the daughter of Jessica&amp;#039;s long lost brother Randolph Gatling and family maid Ingrid Svenson. She later gives birth to a baby named Timmy who turns out to be demon possessed, and leaves home to raise her child after the demon is exorcised. \n\nSal Viscuso - Father Timothy Flotsky - A former Catholic priest who leaves the priesthood to marry Corinne Tate. \n\nRobert Guillaume - Benson DuBois - The Tates&amp;#039; wisecracking butler in the early seasons. He was later given his own spin-off, Benson. \n\nRoscoe Lee Browne - Saunders - Benson&amp;#039;s replacement as the Tates&amp;#039; butler. Similar attitude. \n\nJennifer Salt - Eunice Tate-Leitner - Jessica and Chester&amp;#039;s daughter. A spoiled social climber, she eventually begins a romance with Dutch Leitner. \n\nDonnelly Rhodes - Dutch Leitner - an escaped convict who hides out at the Tates&amp;#039; after helping Chester break out of prison. He eventually marries \nChester&amp;#039;s daughter Eunice. \n\nArthur Peterson, Jr. - The Major - The father of Jessica Tate and Mary Campbell. The major suffers from senility and believes he is in the midst of fighting World War II. \n\nCathryn Damon - Mary Campbell - The sister of Jessica Tate and one of the two main focus characters of the show. At the start of the series she is married to her second husband Burt Campbell. It is revealed her first husband, Johnny Dallas, had been a mobster who was killed by Burt. Eventually, she has a baby with &quot;alien&quot; Burt, and by the series&amp;#039; end has slowly become an alcoholic, as no one else sees the baby manifesting alien-esque qualities, such as being able to fly. \n\nRichard Mulligan - Burt Campbell and X-23 (Alien Burt) - Burt is the second husband of Mary Campbell. Burt is a contractor who later becomes sheriff. In Season one and two Burt suffers from mental illness and believes he can make himself invisible. He is also at one point abducted by aliens and replaced with a Burt lookalike. X-23 is the alien duplicate of Burt sent to Earth when Burt is abducted. \n\nJay Johnson - Chuck and Bob Campbell - Chuck is Burt Campbell&amp;#039;s son by his first marriage. A ventriloquist, he is always accompanied by Bob, his dummy and alter ego and the pair are always referred to as &quot;Chuck and Bob&quot;. \n\nRobert Urich - Peter Campbell - Burt Campbell&amp;#039;s tennis pro son by his first marriage. His murder in season one leads to the first season cliffhanger. \n\nTed Wass - Danny Dallas - Mary Campbell&amp;#039;s somewhat dimwitted son. It is widely assumed that he is the son of Mary&amp;#039;s first husband Johnny Dallas but in later episodes it is revealed that his real father is Chester Tate. He later becomes Burt&amp;#039;s deputy sheriff. \n\nBilly Crystal - Jodie Dallas - The son of Mary Campbell and first husband Johnny Dallas. An openly gay man, he later fathers a daughter when a female friend seduces him. Much of his storyline involves getting his daughter back from the mother. The series ends with him believing himself to be an old Jewish man due to a failed hypnotherapy session. \n\nDinah Manoff - Elaine Lefkowitz-Dallas - The daughter of a Jewish mob boss. A spoiled and demanding woman, her father forces Danny to marry her so that he can get rid of her. She is eventually killed by hit men. \n\nRecurring Characters\n\nHarold Gould - Barney Gerber \nJohn Byner - Detective Donahue \nBob Seagren - Dennis Phillips \nInga Swenson - Ingrid Svenson (Corinne&amp;#039;s real mother) \nEugene Roche - E. Ronald Mallu, Esq. \nMichael Durrell - F. Peter Haversham \nRichard Libertini - The Godfather \nGordon Jump - Chief of Police Tinkler (Routinely misidentifies himself as Piece of Chalief Tinkler) \nEdward Winter - Congressman Walter McCallum \nCharles Lane - Judge Anthony Petrillo \nKathryn Reynolds - Claire \nCaroline McWilliams - Sally \nLynne Moody - Polly Dawson \nMarla Pennington - Leslie Walker \nCandice Azzara - Millie \nJesse Welles - Gwen \nSorrell Booke - Charles Lefkowitz (Elaine&amp;#039;s father) \nAllan Miller - Dr. Alan Posner \nGregory Sierra - El Puerco (translation: The Pig) \nHoward Hesseman - Mr. Franklin \nRandee Heller - Alice \nPeggy Pope - Mrs. Lurleen David \nJoe Mantegna - Juan One \nRebecca Balding - Carol David \nNancy Dolman - Annie Selig Tate \nBarbara Rhoades - Maggie Chandler \nRae Allen - Judge Betty Small \nJudith Marie-Bergan - Marilyn MCallum (Walter&amp;#039;s wife) \nGranville Van Dusen - Dr. Hill \nJack Gilford - Saul \nDoris Roberts - Flo Flotsky \nNita Talbot - Mrs. Fine \nByron Webster - Dr. Medlow \nNotable one-off characters\n\nWilliam Daniels - Heinrich Himmel \n\n Controversy\nThe show was controversial for its time, dealing openly with the topics of homosexuality, marital infidelity, impotence, interracial marriage, and gay parenting.\n\nSoap was among the earliest American primetime series to include a regular gay character (Jodie Dallas, played by Billy Crystal). Soap is commonly cited as the first series to do this, but it was preceded by at least three other such shows: 1972&amp;#039;s The Corner Bar, 1975&amp;#039;s Hot L Baltimore, and 1976&amp;#039;s The Nancy Walker Show. The confusion may result from the fact that none of those shows achieved the ratings success of Soap.\n\nMuch of Soap&amp;#039;s controversy preceded its September 1977 premiere. In June of that year, a review of the show&amp;#039;s pilot by Harry F. Waters stated:\n\n&quot;SOAP&quot; promises to be the most controversial network series of the coming season, a show so saturated with sex that it could replace violence as the PTA&amp;#039;s Video Enemy No. 1.&quot; [1] \nThe review went on to pan the show, while also mischaracterizing some of its basic plot elements and offering exaggerated reports of its sexual content.\n\nA number of organizations then mobilized against Soap, including the Christian Life Commission of the Southern Baptist Convention, the International Union of Gay Athletes, and the National Gay Task Force. Also mobilized were the National Council of Churches, the United Church of Christ, the United Methodist Church, and the National Council of Catholic Bishops, although they asked the members of their 138,000 collective churches to watch the show first, and then inform ABC of their feelings about it. Nonetheless, the network reportedly received 32,000 letters of complaint before the show&amp;#039;s premiere, and eight out of 195 ABC affiliates refused to air the show.\n\n\n Reception\nOn Tuesday, 13 September 1977, Soap premiered to an audience of 19 million homes (39% of the national audience). Executives at ABC described initial public reaction as &quot;mild,&quot; even though Vlasic Foods pulled their sponsorship of the program shortly after the episode aired.\n\nHarry F. Waters&amp;#039; 1977 review proved prescient during the following year, when the National PTA declared Soap one of &quot;ten worst&quot; shows in television.\n\n \nCast of Soap- Season 1 Soap was a parody of daytime soap operas presented in a primetime sitcom. Like soap operas, the show&amp;#039;s story was presented in a serial fashion and included melodramatic plot elements such as amnesia, alien abduction, demonic possession, murder, and kidnapping.\n\nThe cast included former soap opera actors. Robert Mandan (as Chester Tate) previously appeared on Search for Tomorrow as a leading man for Mary Stuart, and Donnelly Rhodes (as Dutch Leitner) had played the first husband of Katherine Chancellor on The Young and the Restless.\n\n","torrent":{"xt":"urn:btih:bba61d961f1fc07e261b74e57eb41a83dabb50a3","amp;dn":"Soap+TV+Series+-+Comedy+1977-81+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba61d961f1fc07e261b74e57eb41a83dabb50a3","infoHashBuffer":{"type":"Buffer","data":[187,166,29,150,31,31,192,126,38,27,116,229,126,180,26,131,218,187,80,163]},"announce":[],"urlList":[]}}