{"title":"Ubuntu-12.04-desktop-i386.iso","uid":7218806,"size":735358976,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:bbb6db69965af769f664b6636e7914f8735141b3&amp;dn=Ubuntu-12.04-desktop-i386.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"suryamukhi","files":1,"time":1335461632,"description":"Ubuntu-12.04-desktop-i386.iso\nReleased 26.04.2012\n\nFast, secure and stylishly simple, \nthe Ubuntu operating system is used by 20 million people worldwide every day.\n\nThe Ubuntu team is very pleased to announce the release of Ubuntu 12.04 LTS \n(Long-Term Support) for Desktop, Server, Cloud, and Core products.\n\nCodenamed &quot;Precise Pangolin&quot;, 12.04 continues Ubuntu's proud tradition \nof integrating the latest and greatest open source technologies into a\nhigh-quality, easy-to-use Linux distribution.  The team has been hard \nat work through this cycle, introducing a few new features and improving \nquality control.\n\nTo be a bit more precise about what we're releasing today...\nThere are 54 product images and 2 cloud images being shipped with \nthis 12.04 LTS release,  with translations available in 41 languages.  \nThe Ubuntu project's 12.04 archive currently has 39,226 binary packages \nin it, built from 19,179 source packages, so lots of good starting points \nfor your imagination!   \n\nFor PC users, Ubuntu 12.04 supports laptops, desktops, and netbooks  \nwith a unified look and feel based on an updated version of the desktop \nshell called &quot;Unity&quot;, which introduces &quot;Head-Up Display&quot; search capabilities.  \nFinding and installing software using the Ubuntu Software Centre is \nnow easier thanks to improvements in speed, search and usability. \n\nUbuntu Server 12.04 has made it much easier to provision, deploy, \nhost, manage, and orchestrate enterprise data centre infrastructure\nservices with the introduction of new technologies such as &quot;Metal as\na Service&quot; (MAAS), the Juju Charm Store, and the latest OpenStack version, \ncodenamed Essex.  These technologies further position Ubuntu Server \nas the best OS for scale-out computing.  ","torrent":{"xt":"urn:btih:bbb6db69965af769f664b6636e7914f8735141b3","amp;dn":"Ubuntu-12.04-desktop-i386.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbb6db69965af769f664b6636e7914f8735141b3","infoHashBuffer":{"type":"Buffer","data":[187,182,219,105,150,90,247,105,246,100,182,99,110,121,20,248,115,81,65,179]},"announce":[],"urlList":[]}}