{"title":"Richard Wagner - On Music and Drama: Prose Works","uid":10867544,"size":6248826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbd72a85a527b39cced8ace9c482b2c3bb9cf279&amp;dn=Richard+Wagner+-+On+Music+and+Drama%3A+Prose+Works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1408929751,"description":"\n* Wagner on Music and Drama: A Compendium of Richard Wagner's Prose Works (Da Capo, 1988).  Edited with an Introduction by Albert Goldman and Evert Sprinchorn; translated by H. Ashton Ellis.  447 pp. -- PDF\n\n\nRichard Wagner (1813-1883) -- composer, conductor, dramaturge, court composer, revolutionary fugitive, adored husband, vicious enemy, and national icon -- impressed his mark so deeply on Western music that more than a century later argument still rages about whether his imprint is a scar or a monument.  Wagner was one of the first composers to recognize the importance of establishing a public persona to advance his work.  He wrote extensively on a wide range of topics to prepare his audiences for his music, especially his operas.  A potent polemicist, he paid as much attention to his reputation as to his genius, and took previous time from composition to write essays and books, including his autobiography.\n\nThis collection provides contemporary readers with ample evidence of the silk and thistles of Wagner's ideas.  It includes numerous short works on myth, Mozart, opera, folk art, politics, Christian hypocrisy, the politics of Germany, his notorious essays &quot;Jews in Music&quot; and &quot;The Necessity of Revolution,&quot; generous selections from his artistic manifesto, &quot;The Artwork of the Future&quot;, autobiographical sketches, and letters to friends about the intent and performance of his works.  Much revered and abused, Wagner here speaks for himself.  As with his music his prose demands a hearing.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:bbd72a85a527b39cced8ace9c482b2c3bb9cf279","amp;dn":"Richard+Wagner+-+On+Music+and+Drama%3A+Prose+Works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbd72a85a527b39cced8ace9c482b2c3bb9cf279","infoHashBuffer":{"type":"Buffer","data":[187,215,42,133,165,39,179,156,206,216,172,233,196,130,178,195,187,156,242,121]},"announce":[],"urlList":[]}}