{"title":"Office Obsession (Babes) [Split Scenes] -=NEW LEAKED MARCH 2015=","uid":11752909,"size":1908744141,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bcaeb9a41a6881d30b6a7fcd317dc3ba3a90b36e&amp;dn=Office+Obsession+%28Babes%29+%5BSplit+Scenes%5D+-%3DNEW+LEAKED+MARCH+2015%3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"H4ckuos","files":5,"time":1426267811,"description":"Office Obsession (Babes) [Split Scenes] -=NEW LEAKED MARCH 2015=-\n\nCast\n\nBrooklyn Chase\nMaddy O'Reilly\nJanice Griffith\nValentina Nappi\nAlexis Brill\n\nYou'd think getting drenched by rain on the way into the office would have set Valentina Nappi too flustered to do her work. But instead walking in with her white blouse soaked through put her in the mood to get right down to business with her boss. Normally oblivious to her short skirts and the cleavage that shows off her sumptuous breasts, Tony gave his sexy secretary all the attention he had as Valentina seduced and teased him with glimpses at her body. Once they connected with a passionate kiss, Valentina dropped to her knees and sucked Tony's cock. Then she straddled him and rode him, her big luscious ass bouncing on his lap as she took what she wanted.\n\nNothing fires up Janic Griffith's desire like the thrill of the unknown, and the mystery of a casual hook-up. At the end of their Halloween party, only two people were left, Janice and the masked man who had caught her eye all night long. Feeding on the sexual energy of the forbidden fruit, Janice dove down on Tyler's cock, and took her time enjoying as much of his cock in her mouth as she could fit. Tyler repaid the favor, going downtown to explore the lips of her pussy and circling her clit with light, sensitive strokes of his tongue. Then he slipped his whole shaft into her, and thrust as deep as he could go into her before pulling out and shooting his cum on her crotch.\n\nMaddy's boss may be handsome and sharp as a tack, but he's so shy and reserved. She's tried everything to entice him and tease him with peeks at her stockings and bod, but so far he hasn't taken the bait. If Maddy wants to pierce the icy cool of her Mr. White's reserve, she's going to need to hike up her skirt and waggle her plump butt, or go a step further and dip one of her breasts in his mouth. Finally, Mr. White jumped on the chance to bed his secretary, and his cock stood stiffly at attention. Lying across her boss's desk, Maddy wrapped her mouth around his cock, sucking it tip to tail while she tugged the shaft. Fulfilling a fantasy she had from day one on the job, Maddy got on all fours while Chad thrust into her from behind, pulling him deeper and deeper into her. Switching things up, Maddy sat on Chad's lap, and rode his dick until her hips bucked with the blissful feeling of orgasm.\n\nDay after day, Ryan and Brooklyn send each other flirtatious glances across the office. They make jokes to cut the sexual tension, but they both know that it's only a matter of time before one of them gives in to temptation. One day, Brooklyn can't take it anymore and hikes up her skirt, revealing her lacy lingerie and perky soft butt. It's all the invitation Ryan needs, and he feasts on her gorgeous big tits and dripping wet pussy. Brooklyn sucks his throbbing hard cock, sucking and stroking until she's ready to take him deep in her perfect pink pussy. She cums again and again as waves of erotic extacy overcome her, and then Ryan unloads his seed all over her big round tits.\n\nAs much as he normally tries to suppress the pangs of lust he feels for his co-worker Alexis Brill, today Viktor couldn't ignore the throbbing hard-on she was giving him. It didn't help matters that Alexis was doing everything she could to seduce him, running a finger over her lips and giving him a good long look up her skirt as she sashayed around the office. When she finally grabbed him by the neck-tie and pulled him in for a long, deep kiss, it was the culmination of weeks of stifled erotic desire. Viktor's passion swelled as he bent Alexis over the desk and buried his face between her legs from behind, licking hungrily at her pussy. Then Alexis lay back on the desk and hiked up her skirt to take his thick manhood, as they finally indulged in the hot sex they'd waited so long to enjoy.\n\n &lt;a href=&quot;\nhttp://xxxhost.info/img-550310e911408.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-550310e911408.html&lt;/a&gt;","torrent":{"xt":"urn:btih:bcaeb9a41a6881d30b6a7fcd317dc3ba3a90b36e","amp;dn":"Office+Obsession+%28Babes%29+%5BSplit+Scenes%5D+-%3DNEW+LEAKED+MARCH+2015%3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcaeb9a41a6881d30b6a7fcd317dc3ba3a90b36e","infoHashBuffer":{"type":"Buffer","data":[188,174,185,164,26,104,129,211,11,106,127,205,49,125,195,186,58,144,179,110]},"announce":[],"urlList":[]}}