{"title":"On the Historicity of Jesus: Why We Might Have Reason for Doubt","uid":10896528,"size":14658568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcc84423c7705f6841d443fea44915094841e227&amp;dn=On+the+Historicity+of+Jesus%3A+Why+We+Might+Have+Reason+for+Doubt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mdusanjay","files":1,"time":1409159034,"description":"On the Historicity of Jesus: Why We Might Have Reason for Doubt by Richard Carrier\n\nEnglish | 2014 | ISBN: 1909697494 , 1909697354 | 712 pages | PDF | 14 MB\n\nThe assumption that Jesus existed as a historical person has occasionally been questioned in the course of the last hundred years or so, but any doubts that have been raised have usually been put to rest in favor of imagining a blend of the historical, the mythical and the theological in the surviving records of Jesus.\n\nCarrier re-examines the whole question and finds compelling reasons to suspect the more daring assumption is correct. He lays out extensive research on the evidence for Jesus and the origins of Christianity and poses the key questions that must now be answered if the historicity of Jesus is to survive as a dominant paradigm. Carrier contrasts the most credible reconstruction of a historical Jesus with the most credible theory of Christian origins if a historical Jesus did not exist. Such a theory would posit that the Jesus figure was originally conceived of as a celestial being known only through private revelations and hidden messages in scripture; then stories placing this being in earth history were crafted to communicate the claims of the gospel allegorically; such stories eventually came to be believed or promoted in the struggle for control of the Christian churches that survived the tribulations of the first century.\n","torrent":{"xt":"urn:btih:bcc84423c7705f6841d443fea44915094841e227","amp;dn":"On+the+Historicity+of+Jesus%3A+Why+We+Might+Have+Reason+for+Doubt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcc84423c7705f6841d443fea44915094841e227","infoHashBuffer":{"type":"Buffer","data":[188,200,68,35,199,112,95,104,65,212,67,254,164,73,21,9,72,65,226,39]},"announce":[],"urlList":[]}}