{"title":"The Book Of Eli Soundtrack","uid":5336348,"size":195481906,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcca9556664d0d17077771ae6c69033a23173907&amp;dn=The+Book+Of+Eli+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MrRodent","files":-1,"time":1265329722,"description":"The Book of Eli Soundtrack done by Atticus Ross\n\nI also included the video with visuals by Rupert Sanders, whose work you may have seen somewhat recently in the form of those gritty live-action Halo 3 ODST commercials. \n\n\nThe Book of Eli Original Motion Picture Soundtrack features an original score by composer/musician/producer Atticus Ross, marking his third collaboration with the Hughes Brothers and his first feature film score. Ross' music is a unique hybrid score of electronic and organic elements; writing with his wife (Claudia Sarne) and brother (Leopold Ross), the basic tracks were recorded at his studio in Los Angeles before departing to London where it was finished in Abbey Road Studios with a full 80 piece orchestra.\n\nRoss' other film credits include co-writing and producing Go All the Way (Into the Twilight), the Perry Ferrell single for the hit film, Twilight, the score for the Allen Hughes vignette for the film New York, I Love You, as well as the music to the Hughes Brothers TV show 'Touching Evil'. Ross has also incorporated his musical style into collaborations and productions of such major artists as NIN (the albums With Teeth, Year Zero, The Slip, and the Grammy-nominated Ghosts), Jane's Addiction, and Korn.\n\nThis is my first torrent if there is any problems let me know.","torrent":{"xt":"urn:btih:bcca9556664d0d17077771ae6c69033a23173907","amp;dn":"The+Book+Of+Eli+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcca9556664d0d17077771ae6c69033a23173907","infoHashBuffer":{"type":"Buffer","data":[188,202,149,86,102,77,13,23,7,119,113,174,108,105,3,58,35,23,57,7]},"announce":[],"urlList":[]}}