{"title":"Iron &amp; Wine - Archive Series Volume No. 1 [2015] [EAC/FLAC]","uid":11716525,"size":235587597,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcd95d88010d0523d81e41ab883e4cb3a372c2fa&amp;dn=Iron+%26amp%3B+Wine+-+Archive+Series+Volume+No.+1+%5B2015%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":20,"time":1424605229,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: Black Cricket Recording #CD 26132\nCountry: USA\nYear: February 24, 2015\nGenre: americana\nFormat:CD\n\n1) Slow Black River\n2) The Wind Is Low\n3) Eden\n4) Two Hungry Blackbirds\n5) Freckled Girl\n6) Judgement\n7) Sing Song Bird\n8) Beyond the Fence\n9) Quarters In Pocket\n10) Loretta\n11) Everyone's Summer of 95\n12) Minor Piano Keys\n13) Your Sly Smile\n14) Halfway to Richmond\n15) Wade Across the Water\n16) Postcard\n\nAs Iron &amp; Wine, songwriter Samuel Beam became an icon of rustic indie folk, his soft-spoken songs full of still, wistful country imagery and lovelorn emotions always tuneful enough to sit well beside the various mild-mannered indie rock bands that became his contemporaries as he spanned over a decade of recording and touring. The roots of Iron &amp; Wine began when Beam was attending film school in the late '90s, quietly recording acoustic demos of his beautifully mumbly songs on a borrowed four-track. These demos circulated and eventually the best of the tracks were assembled as Iron &amp; Wine's 2002 Sub Pop Records debut, The Creek Drank the Cradle. The project's overnight success would lead to an accelerated development for Beam, his muse quickly shifting to more professionally recorded albums and changes in style over the years toward electric folk-rock and even forays into traditional African and Mexican arrangements as backdrops for his songs. There remained a special magic to those early recordings, however, the ones that sounded almost secretive or absolutely convinced they'd never be heard by anyone aside from the person creating them. Archive Series, Vol. 1 reaches back to the lo-fi recordings from the late '90s and early aughts that resulted in that gorgeously hushed debut, sharing 16 previously unreleased tracks from the same era. While sometimes a little light on relatable stories or characters, Beam's songs always succeed in perfectly capturing a vibe, and the outtakes and sketches of Archive Series, Vol. 1 fall in line with the vaguely pastoral feel of the earliest albums. &quot;Everyone's Summer of '95&quot; is a standout, Beam's multi-tracked vocal harmonies and gently fingerpicked acoustic guitar conjuring up sentiments of faceless nostalgia and thoughts of lost friendships. Elements of nature, pained love, and longing touch almost every song from a distance, from the loping banjo flourishes of &quot;Slow Black River&quot; to the campfire folk progression of &quot;Quarters in a Pocket.&quot; Some of the references to antiquated themes of country life may come off a little precious to the uninitiated, but anyone who was spoken to by the low-lit intimacy of The Creek Drank the Cradle should seek out Archive Series, Vol. 1 as a perfect companion piece to that album and as deeper look into what must have been an incredibly inspired and productive time for the young songwriter","torrent":{"xt":"urn:btih:bcd95d88010d0523d81e41ab883e4cb3a372c2fa","amp;dn":"Iron+%26amp%3B+Wine+-+Archive+Series+Volume+No.+1+%5B2015%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd95d88010d0523d81e41ab883e4cb3a372c2fa","infoHashBuffer":{"type":"Buffer","data":[188,217,93,136,1,13,5,35,216,30,65,171,136,62,76,179,163,114,194,250]},"announce":[],"urlList":[]}}