{"title":"The Paul Butterfield Blues Band [320] 1987 Elektra 7294-2","uid":9568094,"size":92631501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd3838dd8af5ef6349bcaf9e476036b0b390cb71&amp;dn=The+Paul+Butterfield+Blues+Band+%5B320%5D+1987+Elektra+7294-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1391559646,"description":"The Paul Butterfield Blues Band [320](Big Papi) 1987 Elektra 7294-2\n\nSource: CD + Fresh Cover Art Scan\n\n\n\nBy Gavin B.\n\nIn the early Sixties, the prevailing wisdom was that the blues was a music based on the shared experience of African Americans and that any attempt by a &quot;Caucasian&quot; to play the blues would..er, uh...pale in comparison to the authentic renditions of the blues by African Americans. In 1965, Paul Butterfield broke that color barrier, not by successfuly &quot;imitating&quot; black blues musicians, but by developing his own signature playing and singing style that demanded that audiences and critics accept Butterfield on his own terms. Butterfield's passion and intensity transcended any formulamatic notions of authenticity simply because of Butterfield's refusal to be evaluated as an imitator. His playing and singing were so uniquely stylized and original that when Butterfield played &quot;Look Over Yonder's Wall&quot; nobody used the Elmore James original as a litmus test of authenticity. I've heard enough bad imatators of B.B.King, both black and white, to know that racial authenticy is not a very reliable benchmark to evaluate good blues. Mediocrity is color blind, as is brilliance and any argument to the contrary is simply, as they say, academic.\n\nButterfield's band was bi-racial with rythym section consisting of Howlin' Wolf Band veterans Jerome Arnold on bass and the mighty Sam Lay on drums. Elvin Bishop, a University of Chicago student from Oklahoma learned guitar under the tutelage of another Howlin' Wolf veteran, Smokey Smothers. From 1963 until 1965 Bishop and Butterfield played together at Little John's a smokey blues joint on Chicago's northside. Near the time of this recording, Mark Naftalin was added to the band. Naftalin, a former University of Chicago student, played understated but tasty solos on Hammond organ. Naftalin was a nuanced jazz player having received a year of formal training at Mannes College of Music, where he was recruited by Butterfield for the band.\n\nMany of the tracks from this album were originally recorded without Michael Bloomfield's guitar, but Butterfield reluctantly added Bloomfield, an out of work session player under contract to Columbia Records, at the urging of Paul Rothschild, the brilliant producer at the budding Elektra record label. Bloomfield was a young guitar savant whose signture guitar style contained elements of Albert King's tension, release and sustained feedback; Wes Montgomery's cascading flurries of jazz notes; Elmore James' electrifying bottle neck; and even unconvential modalities like atonal Indian ragas and swaying samba rythyms. The diffence of the in the master tapes with and without Bloomfield is startling. The addition of Bloomfield's explosive guitar playing appears to have ignited the entire band\n\nOn the opening cut, &quot;Born In Chicago&quot; Butterfield wastes no time in dispelling the white blues efficacy argument with his take no prisoners approach to blues shouting. The hard edged lyrics to Nick Gravenites's song,&quot;...I was born in Chicago in 1941, and my father told me, son you had better get a gun&quot;, seemed to be issuing a challenge to the Doubting Thomases with staid intellectual theories of black authenticity. Butterfield's haromica playing is so uniquely sculpted that comparisons to either Little Walter or Sonny Boy Williamson are futile. The approach of the Butterfield Blues Band raises the ante to new sonic levels. The decibel level is so high and the playing is so intense that it appears that the band can generate enough electricity to light up the Chicago skyline. Butterfield and his guitarist Bloomfield appear to be circling each other like caged lions in the crossfire between the harmonica and guitar solos. Elvin Bishop's rippling and bracing guitar solos are almost an afterthought because Butterfield and Bloomfield remained locked in a tense struggle for sonic domination of the band that rages like a prarie fire until the last note of the final song, &quot;Look Over Yonder's Wall.&quot;\n\nSuch was the legendary mutual ambivalence between Paul Butterfield and Michael Bloomfield...the twin towers of the Butterfield Blues Band. Both men were so endowed with rare musical talent that only an act of serendipity placed them on the same stage together. They were linked forever by this hellaciously good band, but each seemed to be saying to the other the equivalent of, &quot;This band ain't big enough for the both of us.&quot; It was this brinksmanship between Butter and Bloom that often pushed the band into uncharted territory.\n\nI saw this edition of the Butterfield Band twice in concert and their approach to both jazz and blues was so intense that they appeared to be tearing a hole in the fabric of the cosmos itself, armed with the sword of Damocles. The brilliance of Paul Rothchild's production was that he captured this raw intensity and seamless playing skill on vinyl. One can take a snapshot of the eye of a hurricane, but few photos capture the fury of storm, itself. Rothchild seemed to have bottled a raging force of nature, using some form of trickery at the studio mixing console. Bloomfield was partially responsible because he was the rare musician could play on a both a concert stage, or the clinical setting of a studio booth with the same pulse stopping immediacy.\n\nFor better or for worse, Butterfield's first album was an early statement of a generation of musicians who were unwilling to accept the arbitrary limits of conventional wisdom. It was 1965; and the musical revolution that about to change everyone's lives so dramatically was just budding forth. As the Sixties unfolded a hundreds of self-styled musicians bloomed into musical maturity and like Butterfield and Bloomfield, they challenged conventional wisdom and often their creativity crossed the divide between the sacred and the profane, but we are all better people for it.\n\n\n---------------------------------------------------------------------\nPaul Butterfield Blues Band, The - The Paul Butterfield Blues Band\n---------------------------------------------------------------------\n\nArtist...............: Paul Butterfield Blues Band, The\nAlbum................: The Paul Butterfield Blues Band\nGenre................: Blues\nSource...............: CD\nYear.................: 1965\n\nMP3 320cbr\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Paul Butterfield Blues Band, The - Born in Chicago [03:06]\n2. Paul Butterfield - Shake Your Moneymaker [02:26]\n3. Paul Butterfield - Blues With A Feeling [04:21]\n4. Paul Butterfield Blues Band, The - Thank You Mr. Poobah [04:05]\n5. Paul Butterfield - I Got My Mojo Working [03:32]\n6. Paul Butterfield Blues Band, The - Mellow Down Easy [02:48]\n7. Paul Butterfield - Screamin' [04:34]\n8. Paul Butterfield Blues Band, The - Our Love Is Drifting [03:32]\n9. Paul Butterfield - Mystery Train [02:34]\n10. Paul Butterfield Blues Band, The - Last Night [04:16]\n11. Paul Butterfield - Look Over Yonders Wall [02:24]\n\nPlaying Time.........: 37:42\nTotal Size...........: 88.25 MB","torrent":{"xt":"urn:btih:bd3838dd8af5ef6349bcaf9e476036b0b390cb71","amp;dn":"The+Paul+Butterfield+Blues+Band+%5B320%5D+1987+Elektra+7294-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3838dd8af5ef6349bcaf9e476036b0b390cb71","infoHashBuffer":{"type":"Buffer","data":[189,56,56,221,138,245,239,99,73,188,175,158,71,96,54,176,179,144,203,113]},"announce":[],"urlList":[]}}