{"title":"Super Smash Bros. Brawl (WII)","uid":14492099,"size":7960788992,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:bd50473be0e3f2fba96d17b33bce227c8e770ff7&amp;dn=Super+Smash+Bros.+Brawl+%28WII%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"annuaireweb","files":1,"time":1462112001,"description":"Plateforme : Wii\r\nLangue : Multi avec Français\r\nRégion : PAL\r\n\r\nDans le petit monde des jeux de baston festifs, il y a plus que jamais Smash Bros. et les autres, ce nouvel épisode sur Wii en apporte une nouvelle fois la preuve. Brawl représente la quintessence de la baston à quatre, un vrai concentré de fun accessible à tous, grâce à sa prise en main instantanée et sa technique irréprochable, mais tout aussi élitiste dès que l'on cherche à maîtriser ses innombrables finesses. Jouant délibérément la carte de la surenchère, cette version renferme un contenu complètement démesuré, doublé d'une anthologie tout à la gloire de Nintendo. On peut toujours lui reprocher une trop grande similitude avec Smash Bros. Melee, voire une tendance au recyclage des vieilles arènes et des anciens personnages. On peut aussi s'indigner des limites criantes du mode en ligne, de l'absence d'autres combattants surprise, ou des fonctionnalités Wiimote laissées au vestiaire, qu'elles aient eu ou non leur place ici. Mais quand on se retrouve devant un jeu d'une richesse aussi désarmante, quand le moindre détail, même le plus anodin, semble avoir fait l'objet d'une attention quasi maniaque, comme s'il fallait épater le joueur à chaque instant, on ne peut que s'incliner","torrent":{"xt":"urn:btih:bd50473be0e3f2fba96d17b33bce227c8e770ff7","amp;dn":"Super+Smash+Bros.+Brawl+%28WII%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd50473be0e3f2fba96d17b33bce227c8e770ff7","infoHashBuffer":{"type":"Buffer","data":[189,80,71,59,224,227,242,251,169,109,23,179,59,206,34,124,142,119,15,247]},"announce":[],"urlList":[]}}