{"title":"Paul McCartney and Wings - Wings Greatest (Unissued DCC CD)","uid":6305493,"size":398314649,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bda54c11693fa6e9ae3b432fd700788e1e95a5fe&amp;dn=Paul+McCartney+and+Wings+-+Wings+Greatest+%28Unissued+DCC+CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Doing_It_4_The_Lulz","files":17,"time":1302313265,"description":"Paul McCartney and Wings - Wings Greatest (Unissued DCC CD)\n\nThis is one of the unreleased DCC titles that Steve Hoffman mastered, and that Steve took to selling CD-R's on his website of during a &quot;forum fundraiser&quot;. Most of them sold between $250-500... \n\nSee my other torrents for his Wings &quot;Wild Life&quot; and George Harrison &quot;All Things Must Pass&quot;.\n\nFrom the notes that I recieved with this release (much thanks to the individual who supplied them to me):\nThis was passed on to me by a disgruntled Steve Hoffman associate. \n\nThis is the actual CDR version that Hoffman illegally sold on his vanity website to an unsuspecting sucker.\n\nIt may be worthless soon, since McCartney is properly remastering his back catalogue, but I thought it deserved to be liberated in it's own right.\n\nThe tracklisting includes several bonus tracks that Hoffman hoped to include in order to &quot;flesh out&quot; the disc.\n\nFrom Steve's blurb on his site (now since scrubbed):\nNew SH Forum Fundraiser-Unreleased DCC Gold CD solo Beatles' masterings, etc. by S.H.\n\nI've been holding on to these since the demise of DCC and really there is no point to me keeping them any longer. I'm more concerned at this point with raising money for the continued upgrading of these Forums. We are growing like crazy! I will give these out as gifts to the most generous contributors.\n\nThese discs are the only copies of my work of the below mentioned albums, cloned to CD-R from the old crumbling PCM 1630 master tapes (since destroyed). So this is ALL that remains of these projects. The paper files have been destroyed along with any and all artwork mock-ups, etc. I saved these &quot;OK'd&quot; test discs basically for nostalgia sake but perhaps they need a home where someone will play them and enjoy them since I never do (too depressing at what &quot;might have been&quot;).\n\nHowever, I revisited a bunch of these today after many years and I'm still very happy with the way they turned out. So it's bittersweet for me. I figured now would be a good time to place them in a good home while I am in the &quot;clearing out the old life&quot; mood.\n\n--------------------------------------------\n\nPAUL McCARTNEY &amp; WINGS - &quot;Wings Greatest&quot;, unissued DCC Gold Disc, mastered by SH from the original analog master tapes. COMPILED FROM THE INDIVIDUAL MASTER MIXES, NOT A GREATEST HITS COPY TAPE!!!!!\n\nContains:\n\nAnother Day/Silly Love Songs/Live And Let Die/Junior's Farm/With A Little Luck/Band On The Run/Uncle Albert-Admiral Halsey/Hi, Hi, Hi/Let 'Em In/My Love/Jet/Mull Of Kintyre and ONE BONUS TRACK NOT ON THE COMMERCIAL CD: HELEN WHEELS","torrent":{"xt":"urn:btih:bda54c11693fa6e9ae3b432fd700788e1e95a5fe","amp;dn":"Paul+McCartney+and+Wings+-+Wings+Greatest+%28Unissued+DCC+CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda54c11693fa6e9ae3b432fd700788e1e95a5fe","infoHashBuffer":{"type":"Buffer","data":[189,165,76,17,105,63,166,233,174,59,67,47,215,0,120,142,30,149,165,254]},"announce":[],"urlList":[]}}