{"title":"Healing Cancer from Inside Out - by Mike Anderson (2008)","uid":6472410,"size":732475022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:beaf65fa0ad1ffa47bd80839c4bef4559df86bd3&amp;dn=Healing+Cancer+from+Inside+Out+-+by+Mike+Anderson+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"naba888","files":2,"time":1308188389,"description":"Healing Cancer from Inside Out - by Mike Anderson (2008)\n\n&quot;His message is dynamite!&quot; T. Colin Campbell, Ph.D. The China Study --author. This is an update to the 1st Edition which includes subtitles in Spanish, German, French, Portuguese and English (for the deaf). The DVD is divided into two parts. Part 1, Curing Cancer, deals with the failings of conventional cancer treatments and shows how conventional medicine wildly - and deceptively - exaggerates the benefits of treatments, while minimizing the risks. It will provide you with the information you need to accurately assess the risks and benefits of any treatment and speak intelligently to your doctor about such treatments. There is also a section on the 'Cancer Industry' which explains the history behind cancer treatments, the suppression of alternative treatments and why chemotherapy, radiation and surgery are the only treatments available to mainstream medicine. Part 2, Healing Cancer, shows how cancer can be successfully healed with dietary treatments and natural supplementation. It explains common misconceptions about cancer, shows how diets designed to fight cancer are more successful than conventional treatments, discusses startling cancer research findings with T. Colin Campbell (The China Study) and has interviews with people who have reversed cancers using diet. It also discusses supplementation and why attitude is important in reversing not only cancer, but any disease.\n\nFiles: .avi, Xvid (Perian), 512 x 384, Millions, MPEG Layer 3, Stereo, 48.000 kHz, 790.13 kbits/s, 02:07:30.12\n\ntags: cancer, oncology, healing, health, tumor, treatment, alternative, diet, medical, FDA, AMA, conspiracy","torrent":{"xt":"urn:btih:beaf65fa0ad1ffa47bd80839c4bef4559df86bd3","amp;dn":"Healing+Cancer+from+Inside+Out+-+by+Mike+Anderson+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beaf65fa0ad1ffa47bd80839c4bef4559df86bd3","infoHashBuffer":{"type":"Buffer","data":[190,175,101,250,10,209,255,164,123,216,8,57,196,190,244,85,157,248,107,211]},"announce":[],"urlList":[]}}