{"title":"Henry Rollins - Get in the Van","uid":11673906,"size":20900000,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:beee618d672bf632dc67fa773e956f59e7134791&amp;dn=Henry+Rollins+-+Get+in+the+Van&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Odin53","files":3,"time":1422767202,"description":"The 2nd Edition of 'Get in the Van' by Henry Rollins!  \n\nIn honor of the return of The Pirate Bay!\n\n\nFrom\n\n&quot;As a member of the seminal punk band Black Flag, Henry Rollins kept detailed tour diaries that form the basis of Get in the Van . Rollins's observations range from the wry to the raucous in this blistering account of a six-year career with the band - a time marked by crazed fans, vicious cops, near-starvation, substance abuse, and mind numbing all-night drives. Rollins decided to revise this edition by adding a wealth of new photographs, a new foreword, and an afterword to include some &quot;where-are-they-now&quot; information on the people featured in the book. This new edition includes 40 previously unpublished black-and-white photographs from Rollins's private collection and show flyers by artist Raymond Pettibon. Called &quot;a soul-frying experience not to be undertaken by lightweights&quot; by Wired magazine, Get in the Van perfectly embodies what one critic called the &quot;secular gospel&quot; of one of punk and post-punk's most respected and controversial figures.&quot;\n\nOriginally published in 1994, this second edition from 2009 includes many more photos and additional artwork.  Probably best viewed on a tablet or a computer rather than an ePaper device.\n\n\n.mobi and .epub formats - no DRM\n\n\nIf you enjoy the download then you are encouraged to spring for the hardcover. \n\nRejoice and Seed!","torrent":{"xt":"urn:btih:beee618d672bf632dc67fa773e956f59e7134791","amp;dn":"Henry+Rollins+-+Get+in+the+Van","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beee618d672bf632dc67fa773e956f59e7134791","infoHashBuffer":{"type":"Buffer","data":[190,238,97,141,103,43,246,50,220,103,250,119,62,149,111,89,231,19,71,145]},"announce":[],"urlList":[]}}