{"title":"Terry Eagleton - Culture and the Death of God (2014)","uid":11208659,"size":3663899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bef8585889938b965fdf0446c024a6bac27d161e&amp;dn=Terry+Eagleton+-+Culture+and+the+Death+of+God+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1413250029,"description":"\n* Terry Eagleton - CULTURE AND THE DEATH OF GOD (Yale UP, 2014).  248 pp. -- PDF + ePUB\n\n\nHow to live in a supposedly faithless world threatened by religious fundamentalism? Terry Eagleton, formidable thinker and renowned cultural critic, investigates in this thought-provoking book the contradictions, difficulties, and significance of the modern search for a replacement for God. Engaging with a phenomenally wide range of ideas, issues, and thinkers from the Enlightenment to today, Eagleton discusses the state of religion before and after 9/11, the ironies surrounding Western capitalism's part in spawning not only secularism but also fundamentalism, and the unsatisfactory surrogates for the Almighty invented in the post-Enlightenment era.\n \nThe author reflects on the unique capacities of religion, the possibilities of culture and art as modern paths to salvation, the so-called war on terror's impact on atheism, and a host of other topics of concern to those who envision a future in which just and compassionate communities thrive.  Lucid, stylish, and entertaining in his usual manner, Eagleton presents a brilliant survey of modern thought that also serves as a timely, urgently needed intervention into our perilous political present.\n\n\nReviews\n\n&quot;A tour-de-force survey of the changing relation of culture and religion.&quot; -- Publishers Weekly\n\n&quot;Eagleton deftly explores the shifting relationships among reason, religion, culture, myth, art, tragedy and the modern sensibility of the absurd, all expressed with a dry wit and provocative epigrams.&quot; -- Kirkus Reviews\n\n&quot;Eagleton produces an account of the continuing power of religion that is rich and compelling.  Open this book at random, and you will find on a single page more thought-stirring argument than can be gleaned from a dozen ponderous treatises on philosophy of sociology.  Most of the critical turning points in modern thought are examined illuminatingly.&quot; -- John Gray, New Statesman\n\n&quot;Wide-ranging and intellectually impassioned.&quot; -- Sarah Bakewell, The Financial Times\n\n\nFor more works by Terry Eagleton, see also:\n\n* LITERARY AND CULTURAL CRITICISM (19 books) - http://thepiratebay.se/torrent/9036245/  \n\n* HOW TO READ A POEM - http://thepiratebay.se/torrent/9131282/  \n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:bef8585889938b965fdf0446c024a6bac27d161e","amp;dn":"Terry+Eagleton+-+Culture+and+the+Death+of+God+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef8585889938b965fdf0446c024a6bac27d161e","infoHashBuffer":{"type":"Buffer","data":[190,248,88,88,137,147,139,150,95,223,4,70,192,36,166,186,194,125,22,30]},"announce":[],"urlList":[]}}