{"title":"Cream - Live Cream I+II 1970-72(2015) Official[24-192].","uid":11807415,"size":3762914056,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bef945cacdb61628c38b6377d187e94ddcabcd2d&amp;dn=Cream+-+Live+Cream+I%2BII+1970-72%282015%29+Official%5B24-192%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"sidmal","files":17,"time":1428640698,"description":"Cream - Live Cream, Volume I (1970/2015)\n FLAC (tracks) 24-bit/192 kHz | Time - 41:58 minutes | 1,92 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Live Cream is a live compilation album by Cream, originally released in 1970. It was recorded at shows in San Francisco and New York City, as well as in studio. The album was well-received, peaking at #15 on the Billboard 200. Rolling Stone called Live Cream &quot;an excellent album ... well-recorded, controlled, and tense; the timing of the band can capture the listener with an excitement that has nothing to do with nostalgia&quot; (Rolling Stone, 1970).\n\n\n Cream was a band born to the stage, a fact that the band and their record label realized the public fully understood by the number one U.S. chart placement for Wheels of Fire, with its entire live disc, and the number two chart peak for Goodbye, the posthumous release that was dominated by concert recordings. And in response to those success, we got Live Cream, Vol. 1 (originally known simply as Live Cream) in the spring of 1970, nearly 18 months after the trio's breakup. This could well be their most consistently brilliant album for sheer musicianship, though it is also a peculiar one on a couple of counts, some of which probably prevented it from reaching quite as wide an audience as it might have otherwise. Released in April 1970 and derived from tapes made at three May 1968 California shows, all of the live tracks here consist of songs originally featured on the group's least ambitious and most rudimentary album, Fresh Cream, dating from 1966 -- and as it happens, there's not a hit represented among the five songs, a fact that probably made this release seem more appealing to hardcore fans than to casual and curious listeners (who didn't know what they were missing). The performances here show how far the group had come in the nearly two years since laying down the studio originals -- take side one of the original LP, where they stretch out their playing, as well as boost it to new levels of intensity, on &quot;N.S.U.&quot; and &quot;Sleepy Time Time,&quot; so that the renditions here are the definitive ones, and by themselves should have made this album an essential acquisition back in 1970. But that brings us to the original side two and the 15-minute rendition of &quot;Sweet Wine,&quot; an excursion by all three players that is worth the quarter-hour time commitment of the listener. The live portion of the album ends with their searing, rollicking high energy rendition of Muddy Waters' &quot;Rollin' and Tumblin'.&quot; And then, for reasons not clear -- except perhaps simply that it was there, in the vaults, and seemed like a valuable piece of property, which it was (and what else were they going to do with it?) -- the producers close Live Cream with a studio cut, &quot;Lawdy Mama,&quot; an Eric Clapton-inspired take on a traditional tune that subsequently evolved into the hit &quot;Strange Brew&quot; during what became the Disraeli Gears sessions. It's not a match for everything we've heard, but in the spring of 1970 no one was exactly complaining over being handed a previously unissued studio track by the Cream, as a bonus to the concert performances here. As it turned out, there were more live tracks from some of these same shows to draw on in future releases and reissues, which would include a couple of the group's hits; but Live Cream offers the overall highest quality, both in terms of clarity and fidelity, and the performances, which, in addition to the essential great playing (better in some ways than what was heard on some of the much-vaunted live tracks from Wheels of Fire), include excellent vocalizing by Clapton and Jack Bruce. Not that vocalizing looms that large here -- the live tracks are all given extended jazz-based treatment, and the dialog among the three musicians as the jams develop is fascinating. Foreground and background seem to dissolve as all three musicians take charge, using the full range of their instruments. And where Bruce goes with his bass, especially on &quot;Sweet Wine,&quot; is every bit as rewarding as the places that Clapton's guitar takes us; and Ginger Baker's playing is a trip all its own. Performances like this single-handedly raised the stakes of musicianship in rock.  \n\n\nTracklist:\n\n 01 - N.S.U.\n 02 - Sleepy Time Time\n 03 - Sweet Wine\n 04 - Rollin' And Tumblin'\n 05 - Lawdy Mama\n\nRecording Dates:\n May 1967 at Atlantic Studios, New York City.\n 7 March 1968 at Fillmore West, San Francisco, California.\n 9 and 10 March 1968 at Winterland, San Francisco, California.\n\nCream - Live Cream, Volume II (1972/2015)\n FLAC (tracks) 24-bit/192 kHz | Time - 41:15 minutes | 1,76 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Live Cream Volume II is a compilation disc comprised of various live performances by the English rock band Cream between the dates of March 9th and October 4th, 1968. The six track recording includes &quot;Sunshine of Your Love&quot;, &quot;Steppin' Out&quot; and &quot;White Room&quot;.\n\n\n An oft-overlooked curio, Live Cream, Vol. 2 appeared at a very odd time, with very little warning, almost two years after its predecessor -- and at virtually the same time as the related (though not overlapping) History of Eric Clapton. And both showed up, not coincidentally, at a point when Clapton, unbeknownst to most of the public, was sidelined with a crippling heroin addiction -- this album helped keep him in the public eye, as a singer as well as a guitarist. On its face, Live Cream, Vol. 2 is a more ambitious album that its predecessor, offering more songs and including concert versions of two of the group's AM radio hits (as opposed to the album tracks that comprised the repertory on Live Cream, Vol. 1). And it is just about essential listening for anyone who wants to understand what Cream was about, which was live performance. Utilizing -- for the time -- state of the art mobile recording equipment, it was a significant achievement at the time in capturing the genuine sound of a high-wattage power trio on-stage, playing away at full volume; and the overall sonic excellence here must surely be credited to engineers Tom Dowd and Bill Halverson. The feeling that you are in the front row is very much in evidence, and this is largely due to their ability to capture the band's live fury with clarity and intimacy, down to every nuance of Ginger Baker's playing. As for the performances, this record does capture the band at their peak, though perhaps not at the very best moments of that peak -- the group made their reputation as a live act with epic, lengthy jams that verged on jazz, but the repertory represented here (as opposed to that on Live Cream, Vol. 1) is more focused on their pop/rock efforts, such as &quot;White Room,&quot; &quot;Sunshine of Your Love,&quot; &quot;Tales of Brave Ulysses,&quot; etc., which don't lend themselves as easily (or at all) to opening out in extended jams, in the manner of, say, &quot;N.S.U.&quot; or &quot;Sweet Wine,&quot; or the legendary &quot;Spoonful&quot;; additionally, numbers such as &quot;Sunshine of Your Love&quot; and, in particular, &quot;White Room,&quot; require more vocal dexterity than Clapton and bassist/singer Jack Bruce could muster in this kind of concert setting -- their singing, especially on &quot;White Room&quot; comes close to breaking down (&quot;Sunshine of Your Love&quot; fares better), whereas their playing holds together, almost better than perfect at times. &quot;Deserted Cities of the Heart&quot; -- which opens the album -- comes off exceptionally well as a concert piece, the bass and guitar actually combining to overcome the absences of swooping cellos, acoustic guitars, and other accompanying instruments from the studio rendition. And there is one priceless example of Cream in a full-tilt jam, on the 13-plus-minute closing cut, &quot;Steppin' Out&quot; -- the band's sheer energy overcomes what minor deficiencies there are in the overall sound quality. And coupled with the compact, four- to five-minute versions of &quot;Deserted Cities of the Heart&quot; and &quot;Tales of Brave Ulysses,&quot; among others, the album is a vital, intense, and enjoyable listen that is ultimately rewarding.  \n\n\nTracklist:\n\n 01 - Deserted Cities Of The Heart\n 02 - White Room\n 03 - Politician\n 04 - Tales Of Brave Ulysses\n 05 - Sunshine Of Your Love\n 06 - Steppin' Out\n\n Recorded March 9 &amp; 10, 1968 at Winterland in San Francisco, CA\n and October 4, 1968 at Oakland Coliseum Arena in Oakland, CA.\n\nMusicians:\n Eric Clapton - vocals, guitar\n Jack Bruce - vocals, bass, harmonica\n Ginger Baker - drums","torrent":{"xt":"urn:btih:bef945cacdb61628c38b6377d187e94ddcabcd2d","amp;dn":"Cream+-+Live+Cream+I%2BII+1970-72%282015%29+Official%5B24-192%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef945cacdb61628c38b6377d187e94ddcabcd2d","infoHashBuffer":{"type":"Buffer","data":[190,249,69,202,205,182,22,40,195,139,99,119,209,135,233,77,220,171,205,45]},"announce":[],"urlList":[]}}