{"title":"The World Beyond Your Head (2015) epub","uid":11810988,"size":502408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf73ec63c505323ef4f3243b83d3d7c6babf430a&amp;dn=The+World+Beyond+Your+Head+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1428785660,"description":"The World Beyond Your Head: On Becoming an Individual in an Age of Distraction\n\nA groundbreaking new book from the bestselling author of Shop Class as Soulcraft\n\n In his bestselling book Shop Class as Soulcraft, Matthew B. Crawford explored the ethical and practical importance of manual competence, as expressed through mastery of our physical environment. In his brilliant follow-up, The World Beyond Your Head, Crawford investigates the challenge of mastering one's own mind.\n\n We often complain about our fractured mental lives and feel beset by outside forces that destroy our focus and disrupt our peace of mind. Any defense against this, Crawford argues, requires that we reckon with the way attention sculpts the self.\n\n Crawford investigates the intense focus of ice hockey players and short-order chefs, the quasi-autistic behavior of gambling addicts, the familiar hassles of daily life, and the deep, slow craft of building pipe organs. He shows that our current crisis of attention is only superficially the result of digital technology, and becomes more comprehensible when understood as the coming to fruition of certain assumptions at the root of Western culture that are profoundly at odds with human nature.\n\n The World Beyond Your Head makes sense of an astonishing array of common experience, from the frustrations of airport security to the rise of the hipster. With implications for the way we raise our children, the design of public spaces, and democracy itself, this is a book of urgent relevance to contemporary life","torrent":{"xt":"urn:btih:bf73ec63c505323ef4f3243b83d3d7c6babf430a","amp;dn":"The+World+Beyond+Your+Head+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf73ec63c505323ef4f3243b83d3d7c6babf430a","infoHashBuffer":{"type":"Buffer","data":[191,115,236,99,197,5,50,62,244,243,36,59,131,211,215,198,186,191,67,10]},"announce":[],"urlList":[]}}