{"title":"Steven Mithen - The Prehistory of the Mind. A Search for the Ori","uid":10348250,"size":31075418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfa2e032080765fe118454ad4d0807914af35247&amp;dn=Steven+Mithen+-+The+Prehistory+of+the+Mind.+A+Search+for+the+Ori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Anette14","files":-1,"time":1402636786,"description":"Description\nProduct Details\nBook Title: The Prehistory of the Mind: A Search for the Origins of Art, Religion and Science\t\nBook Author: Steven Mithen\nPaperback: 480 pages\nPublisher: Phoenix (an Imprint of The Orion Publishing Group Ltd ) (May 4, 1998)\nLanguage: English\nISBN-10: 075380204X\nISBN-13: 978-0753802045\n\n===================================================================================\nBook Description\nPublication Date: May 4, 1998 | ISBN-10: 075380204X | ISBN-13: 978-0753802045\nThis study applies the insights of archaeology to some of the most fundamental and contentious issues in human evolution. Since the 1980s a modular concept of the mind has been put forward which likens the mind to a Swiss Army knife with its collection of specialist blades and tools - the mind is seen as a collection of specialized &quot;intelligences&quot; or modules, each suited for a specific purpose. The study seeks to answer the questions raised by this new theory such as &quot;How many modules are there and how do they connect?&quot;, &quot;How can one account for human creativity and imagination?&quot; and &quot;How could such a mind have evolved?&quot;. It argues that only archaeology can provide the long-term perspective necessary to understand the origins of the modern mind. It shows how the world of our ancestors has shaped the modern mind and offers a challenging explanation of what it means to be human.\n\n===================================================================================\nEditorial Reviews\nReview\nTry an experiment: take a passenger along on a brief car trip--a jaunt to the supermarket, say. Have a nice conversation while you're driving, and take a scenic route. Now, the next day, try to reconstruct the details of both the conversation and the trip. Chances are, unless something unusual happened along the way, that your memory of both will be indistinct, for we tend to forget the mundane--an example of what the cognitive scientist Daniel Dennett calls &quot;rolling consciousness with swift memory loss.&quot;\nSteven Mithen, an archaeologist with an interest in psychology, believes that just such a consciousness obtained among early humans when they went foraging for food or made tools. The evolution of higher, more memory-laden consciousness, he continues, occurred only as a result of a cognitive trick that doubtless involved some trial and error. The trick, simply put, was to guess what the social behavior of some member of one's social group might be in a given circumstance--to step outside one's own mind, in other words, and enter another's. This guesswork underlies the famed cave paintings of Altamira, an attempt to predict the behavior of migratory animals. It underlies as well another experiment: the development of agriculture, with the requisite predicting of how plants and animals might behave under a wide range of conditions.\nMithen's reconstruction of the ancestral human mind, laid out in a clear and accessible narrative, is a fine intellectual adventure. --Gregory McNamee\n\nFrom Library Journal\nMithen (archaeology, Univ. of Reading) here speculates on the origin of the human mind. Viewing the past six million years as a four-act drama performed with shadowy lighting and insufficient props, Mithen suggests that the precursor of our modern mind was characterized by a general intelligence supplemented by specialized modules for social intelligence, natural history, and technology. Once these formerly independent modules began to communicate with one another, art, religion, and agriculture became possible. Mithen skillfully integrates the ideas of evolutionary psychologists with archaeological evidence and studies on primate behavior to create a plausible, albeit speculative, theory of mental evolution. For academic and special collections.?Laurie Bartolini, Legislative Research, Springfield, Ill.\n\n===================================================================================\nReviews\nA dramatic reconstruction of how the modern human mind has evolved. . . . He writes with clarity and verve. -- Nature\n\nA rewarding and intellectually exciting read. -- American Antiquity\n\nMithen's achievement . . . is to bring together the many specific discoveries of cognitive archaeology into a systematic account. . . . His book begins to explain how we evolved as a species whose members can think about such things. -- New York Review of Books\n\n===================================================================================\nAbout the Author\nSteven Mithen is Professor of Early Prehistory and Head of the School of Human and Environmental Sciences at the University of Reading.\n===================================================================================","torrent":{"xt":"urn:btih:bfa2e032080765fe118454ad4d0807914af35247","amp;dn":"Steven+Mithen+-+The+Prehistory+of+the+Mind.+A+Search+for+the+Ori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa2e032080765fe118454ad4d0807914af35247","infoHashBuffer":{"type":"Buffer","data":[191,162,224,50,8,7,101,254,17,132,84,173,77,8,7,145,74,243,82,71]},"announce":[],"urlList":[]}}