{"title":"Wild Rooster-Little Angel-2009","uid":5018909,"size":55036846,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bfb2cfab035b721d0fc6a3d0c3ad6a3cceea9f1a&amp;dn=Wild+Rooster-Little+Angel-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1248363531,"description":" &lt;a href=&quot;http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.btzip.com&lt;/a&gt; Your doorway to the Scene\n\n\nThe Team with [RAR-Free] Releases.\n\n\n(((((((((((((= Enjoy RAR Free releases =))))))))))))))))))))\n\n...................................NFO:....................................\n\n\n\n\n\n\nWild Rooster is paving the road to become the best known Teddy Boy rockabilly band in Europe. They recorded two great albums just last year (Riot &amp; Rockabilly Inferno) and recently did a tour of Germany and Holland. I met up with the band in De Kroeg in Geldrop (Netherlands) where they did a gig last month. A rough looking gang, but the friendliest guys in the world, all of 'em. While doing a couple of gigs in Germany a few nights in a row, Steve lost most if not all of his voice, he was definitly not very pleased with that, but the boys still got the house rocking! The show must go on! \nAfter the gig, Steve took me to his car in front of the cafe and played some tracks of their new CD &quot;Little Angel&quot;, which was about to be released at that time. I was impressed by the great stomping sound, of course I've always been a fan of Steve and his bands Crossfire, Snakebite and Wild Rooster. He had a nice surprise for me as well... the band recorded one of my favourite songs &quot;Gunning for the Dog&quot; and dedicated it to me! Thanks guys!!\nWell, we write six weeks later and the new CD is spinning fast in my vintage CD player (even though not from the 50's, a 20 year old Philips player can be called vintage now, LOL). The album hits of rough and rocking with a tribute to UK rock 'n' roll legend Wild Bob Burgos with &quot;Rockabilly Queen&quot;, you just gotta love this sound. The pounding drums and bass will surely get you feet moving and your knees shaking. &quot;Bring It Back&quot; is the first of 10 (!!) songs out of 14 that was written by Stefan 'Steve' JÃƒÂ¤germyr, and Kim's guitar will scorch the hairs on the back of your neck. Joe Turner's &quot;Flip, Flip and Fly&quot; sounds wild, hot and rocking, played Crazy Cavan style and &quot;Cry Cry Cry&quot; is not a Johnny Cash cover, but a Steve Riot original.\nThe selfpenned title song &quot;Litte Angel&quot; also has the stomping crazy rhythm from the forefathers of Teddy Boy rockabilly, Crazy Cavan &amp; The Rhythm Rockers. &quot;Devil's Right Hand&quot; is western kind of song in the style of legend Johnny Cash and it has great guitar and a great story. &quot;You Ain't Nothing But Fine&quot; was a Rockin' Sidney original, I believe from 1961, but I have always liked the song best by The Fabulous Thunderbirds, with the fantastic Kim Wilson on harmonica. The song got the Wild Rooster make-over and it will rock you hard.\nNext on the menu is &quot;Gunning For The Dog&quot;, a Matchbox original from the time when Bob Burgos was still hitting the drums hard for this famous this U.K. band. The liner notes mention that the song is dedicated to me, and I'm really honoured guys! Good job.\nThe following is a load of Steve Riot penned songs, I'm not gonna review each and everyone individually, because you know already what I think of Steve's songwriting. They are all great rocking songs about the civil war (Ghost Of Robert E. Lee), horror ands suspence (Jeepers Creepers), street rumble (Night Rebels) and tattoos 'n' rockers (Ray's Tattoo, Wild Rockin' Ted). The closer of the album is a rockabilly song titled &quot;A Cat In A Hot Rod&quot; with guest female vocalist Johanna Eriksson. Great voice!\nWhat more can I say? If you dig Teddy Boy music. Wild Rooster is one of the leading bands in Europe nowadays. Check out this new CD, but most of all, check 'em out on the road and enjoy their wild stage show!\nTracklisting:\nRockabilly Queen / Bring It Back / Flip, Flop And Fly / Cry Cry Cry / Little Angel / Devils Right Hand / You Ain't Nothing But Fine / Gunning For The Dog / Ghost Of Robert E. Lee / Jeepers Creepers / Night Rebels / Ray's Tattoo / Wild Rockin' Ted / A Cat In A Hot Rod\nWild Rooster are:\nStefan 'Steve Riot' JÃƒÂ¤germyr - Lead Vocals, Rhythm Guitar\nKim Amberg - Lead Guitar\nDavid Sundqvist - Drums\nLars Wermlund - Bass\n","torrent":{"xt":"urn:btih:bfb2cfab035b721d0fc6a3d0c3ad6a3cceea9f1a","amp;dn":"Wild+Rooster-Little+Angel-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb2cfab035b721d0fc6a3d0c3ad6a3cceea9f1a","infoHashBuffer":{"type":"Buffer","data":[191,178,207,171,3,91,114,29,15,198,163,208,195,173,106,60,206,234,159,26]},"announce":[],"urlList":[]}}