{"title":"Legacy of Kain - Soul Reaver 2 [Ntsc], Ps2","uid":5428097,"size":3186651452,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:bffc1358055f836c7446141697cc90ed3fb44ac2&amp;dn=Legacy+of+Kain+-+Soul+Reaver+2+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big_dude","files":-1,"time":1268318593,"description":"Legacy of Kain - Soul Reaver 2 for the Ps2                          Rel. 10/31/2001\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n           &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n           &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n          &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n          &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nFollowing the events in Legacy of Kain: Soul Reaver, Raziel discovers a way back through time and encounters one of the Circle of the Nine, Mobius the timestreamer. Mobius urges Raziel to continue his quest for revenge and destroy the vampiric Kain. Raziel reluctantly agrees and heads off to discover the knowledge and weapons that will allow him to achieve his goal.\n\nSoul Reaver 2 is a 3rd person adventure game, like the first game. The player controls the game from behind Raziel's shoulder, moving him in any direction, climbing, attacking, swimming, jumping and using specific abilities. Raziel can grip onto the sides of ledges, climb walls and his torn wings allow him to glide gently downwards. \n\nRaziel can shift through the &quot;material&quot; world into the &quot;spectral&quot; realm at will... but must find specific locations in order to shift back. The two realms mirror one another, with distortions which give access to new areas and platforms. Existing in the material world drains Raziel's life energy at a constant rate. \n\nRaziel must restore energy by consuming the souls of defeated enemies. Raziel no longer gains abilities from absorbing great souls and instead must imbue his Soul Reaver weapon by activating certain elemental temples. Once activated, various\n&quot;elemental fonts&quot; can be used to charge the Soul Reaver to specific attributes. Raziel can arm himself with a variety of other weapons including daggers, swords, axes, spears as well as the Soul Reaver and bare-handed claws.\n\nUnlike the previous game, Soul Reaver 2 is linear and follows specific paths through different areas. Raziel cannot return to certain areas once he has left them behind. Soul Reaver 2 features a variety of different puzzles, often involving blocks or manipulation of different devices. \n\nOne common theme is &quot;light puzzles&quot; where Raziel must reflect light, using mirrored objects, so that they touch switches or objects which require activation.\n\n\nFeatures:\n\n* Acquire new and improved physical abilities, and relics to interact with the \n  environment and unlock the dark secrets of Nosgoth.\n\n* Encounter a variety of new enemies including vampire hunters, vampires, Sarafan\n  warrior-priests, spectral spirits, and extra-dimensional demons.\n\n* Immerse yourself in a gothic realm of highly detailed architecture and \n  environments supported by an intriguing storyline, in-game cinematic event, and\n  compelling voice-over.\n\n* Shift real-time between the spectral and material realms to access previously\n  unattainable areas.\n\n* Devour the lost souls of your enemies to recover and maintain your strength.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf using DVD+R booktype to DVD-ROM.\n(Only if your mod-chip or ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:bffc1358055f836c7446141697cc90ed3fb44ac2","amp;dn":"Legacy+of+Kain+-+Soul+Reaver+2+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bffc1358055f836c7446141697cc90ed3fb44ac2","infoHashBuffer":{"type":"Buffer","data":[191,252,19,88,5,95,131,108,116,70,20,22,151,204,144,237,63,180,74,194]},"announce":[],"urlList":[]}}