{"title":"The Art of Suicide (Art Ebook).pdf","uid":9387779,"size":10026949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c014ea8c5b6bbd4fff610d5974f96311c56be8a1&amp;dn=The+Art+of+Suicide+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"STBGD","files":-1,"time":1387827128,"description":"The Art of Suicide (Picturing History) By Ron Brown\n2004 | 240 Pages | ISBN: 1861891059 | PDF | 10 MB\n\nThe Art of Suicide is a history of the visual representation of suicide from the ancient world to its decriminalization in the 20th century. After looking at instances of voluntary death in ancient Greece, Ron Brown discusses the contrast between the extraordinary absence of such events in early Christianity and the proliferation of images of biblical suicides in the late medieval era. He emphasizes how differing attitudes to suicide in the early modern world slowly merged, and pays particular attention to the one-time chasm between so-called heroic suicide and self-destruction as a &quot;crying crime&quot;.\nBrown tracks the changes surrounding the perception of suicide into the pivotal Romantic era, with its notions of the &quot;man of feeling&quot;, ready to hurl himself into the abyss over a woman or an unfinishable poem. After the First World War, the meaning of death and attitudes towards suicide changed radically, and in time this led to its decriminalization. The 20th century in fact witnessed a growing ambivalence towards suicidal acts, which today are widely regarded either as expressions of a death-wish or as cries for help. Brown concludes with Warhol's picture of Marilyn Monroe and the videos taken by the notorious Dr Kevorkian.","torrent":{"xt":"urn:btih:c014ea8c5b6bbd4fff610d5974f96311c56be8a1","amp;dn":"The+Art+of+Suicide+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c014ea8c5b6bbd4fff610d5974f96311c56be8a1","infoHashBuffer":{"type":"Buffer","data":[192,20,234,140,91,107,189,79,255,97,13,89,116,249,99,17,197,107,232,161]},"announce":[],"urlList":[]}}