{"title":"Oxford Handbook of Clinical and Laboratory Investigation, 3E [Ep","uid":11375984,"size":5077439,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c016bad9b184f29d5a4e8faeed89994fa5c8c545&amp;dn=Oxford+Handbook+of+Clinical+and+Laboratory+Investigation%2C+3E+%5BEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"0xmovva","files":3,"time":1415146498,"description":"TITLE/EDITION Oxford Handbook of Clinical and Laboratory Investigation (Oxford Medical Handbooks)\nAuthor: Drew Provan\nPaperback: 920 pages\nPublisher: OUP Oxford; 3 edition (15 July 2010)\nLanguage: English\nISBN-10: 0199233713\nISBN-13: 978-0199233717\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nModern medicine is highly complex and investigations are a key part of the diagnostic process. With major advances in technology there are thousands of clinical and laboratory tests available. This book provides a patient-oriented approach to investigation. The first chapter describes key symptoms and signs along with tests that may be of value in reaching a diagnosis. The remainder of the book is specialty-centred and provides a comprehensive review of all available tests within a given subject. The aim is of the book is to provide a more rational method of investigation and prevent over-investigation which is expensive for the hospital and unpleasant for the patient. It emphasises which tests are of value, when tests are not likely to be helpful, along with pitfalls in the interpretation of results. This new editoon has been updated throughout to incorporate current investigations and management of disease. Chapters on rheumatology, radiology, and renal medicine have been extensively revised. With contributions from active clinicians who are engaged in medical practice, the book will be of value to senior medical students facing finals examinations, and junior doctors who are responsible for ordering tests on their patients","torrent":{"xt":"urn:btih:c016bad9b184f29d5a4e8faeed89994fa5c8c545","amp;dn":"Oxford+Handbook+of+Clinical+and+Laboratory+Investigation%2C+3E+%5BEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c016bad9b184f29d5a4e8faeed89994fa5c8c545","infoHashBuffer":{"type":"Buffer","data":[192,22,186,217,177,132,242,157,90,78,143,174,237,137,153,79,165,200,197,69]},"announce":[],"urlList":[]}}