{"title":"Neil Gaiman - Smoke and Mirrors - Short Fictions and Illusions -","uid":4728520,"size":300582236,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c07371db9f31c42622e6f3ce2a961c4a240b0a42&amp;dn=Neil+Gaiman+-+Smoke+and+Mirrors+-+Short+Fictions+and+Illusions+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"RamJamSam","files":9,"time":1234882687,"description":"Neil Gaiman - Smoke and Mirrors - Short Fictions and Illusions - Unb\nRead by:  Kathryn Beyers\nRuntime:  10 Hours 25 Minutes\n\n\n\n\nImaginative twists on old legends and frightening glimpses into the impossible combine to form this impressive collection of 30 stories and poems by the author of Neverwhere and co-creator of The Sandman graphic novels. Each entry skirts the edges of a puncture in reality through which something dark and mysterious peeks. Then it moves on and the apparition is hidden away again, but not forgotten. The narratives follow a dream logic: The angel Raguel, the Vengeance of the Lord, can bum a cigarette off a youth in L.A. and tell him the truth behind Lucifer's fall (&quot;Murder Mysteries&quot;), and nonchalant assassins can be found in the Yellow Pages under pest control (&quot;We Can Get Them for You Wholesale&quot;). The bizarre and disturbing essence of the stories is highlighted by their background of absolute normalcy. Their prose is simple yet evocative, and Gaiman's characters are textured with well-defined personalities. Because the characters treat the unreal as ordinary, the eeriness of what unfolds has all the more impact. In &quot;Chivalry,&quot; a woman finds the Holy Grail in a secondhand shop, and Galahad must trade something for it that will look just as good on her mantle. Demons take over London in &quot;Cold Colors,&quot; because the devil has learned how to network and God can't get &quot;saintware&quot; up and running. The intriguing world behind these pages is indeed smoke and mirrors, just a step or a word or a story away from our own. \n\n\n\n\n\nGooD SeeDinG!\n\n","torrent":{"xt":"urn:btih:c07371db9f31c42622e6f3ce2a961c4a240b0a42","amp;dn":"Neil+Gaiman+-+Smoke+and+Mirrors+-+Short+Fictions+and+Illusions+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07371db9f31c42622e6f3ce2a961c4a240b0a42","infoHashBuffer":{"type":"Buffer","data":[192,115,113,219,159,49,196,38,34,230,243,206,42,150,28,74,36,11,10,66]},"announce":[],"urlList":[]}}