{"title":"The Greenwood Library of World Folktales Vol.4 - Thomas A. Green","uid":11189650,"size":4869636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0c995ddea7065b088c1753cdcf1346f3090e409&amp;dn=The+Greenwood+Library+of+World+Folktales+Vol.4+-+Thomas+A.+Green&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1412973547,"description":"From the Amazon to the Arctic, the world is teeming with diverse cultures. There's no better way for students to explore the world's cultural diversity than through its folktales.\n\nPresenting tales from the foundations of the world's traditions, literature, daily life, and popular culture, The Greenwood Library of World Folktales: Stories from the Great Collections gathers together a vast array of folktales and arranges them according to region or cultural group, thus allowing students to quickly and conveniently learn about the tales of particular cultures. Some of these stories have been told for centuries, while others have emerged only in recent times. The four-volume set includes introductory essays in addition to explanatory headnotes, and provides bibliographies on particular regions as well as a selected, general bibliography. The most comprehensive work of its kind, this set gives students and general readers a guided tour of the world's folktales.\n\nEach volume of the set is devoted to a particular broad geographic region:\n\nVolume 1: Africa, The Middle East, Australia and Oceania\n\nVolume 2: Asia\n\nVolume 3: Europe\n\nVolume 4: North and South America\n\nAccessible, informative, and entertaining, this book will help literature students learn how to analyze texts and understand the traditions at the heart of many of the world's literary masterpieces. It will also help social studies students learn about the world's cultures and respect ethnic diversity.","torrent":{"xt":"urn:btih:c0c995ddea7065b088c1753cdcf1346f3090e409","amp;dn":"The+Greenwood+Library+of+World+Folktales+Vol.4+-+Thomas+A.+Green","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c995ddea7065b088c1753cdcf1346f3090e409","infoHashBuffer":{"type":"Buffer","data":[192,201,149,221,234,112,101,176,136,193,117,60,220,241,52,111,48,144,228,9]},"announce":[],"urlList":[]}}