{"title":"Information Security Handbook Vol 5 &amp; 6, Sixth Edition [Epub","uid":8798522,"size":26750605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0ca3a507005115503f691ec92155d12a3494709&amp;dn=Information+Security+Handbook+Vol+5+%26amp%3B+6%2C+Sixth+Edition+%5BEpub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"F1restorm","files":-1,"time":1376094436,"description":"Information Security Handbook Vols 5 &amp; 6\nEditors: Micki Krause Nozaki and Harold F. Tipton\nPublisher: CRC Press\nFormat: Epub\n_______________________________________________________________________\n\nVolume 5 reflects the latest issues in information security and the CISSPÂ® Common Body of Knowledge (CBKÂ®).\nThis edition updates the benchmark Volume 1 with a wealth of new information to help IS professionals address the challenges created by complex technologies and escalating threats to information security. Topics covered include chapters related to access control, physical security, cryptography, application security, operations security, and business continuity and disaster recovery planning.\nThe updated edition of this bestselling reference provides cutting-edge reporting on mobile device security, adaptive threat defense, Web 2.0, virtualization, data leakage, governance, and compliance. \n\n\nVolume 6: Reporting on the latest developments in information security and recent changes to the (ISC)2Â® CISSP Common Body of Knowledge (CBKÂ®), this volume features new information on advanced persistent threats, HIPAA requirements, social networks, virtualization, and SOA. Its comprehensive coverage touches on all the key areas IT security professionals need to know, including:\nAccess Control: Technologies and administration including the requirements of current laws\nTelecommunications and Network Security: Addressing the Internet, intranet, and extranet\nInformation Security and Risk Management: Organizational culture, preparing for a security audit, and the risks of social media\nApplication Security: Ever-present malware threats and building security into the development process\nSecurity Architecture and Design: Principles of design including zones of trust\nCryptography: Elliptic curve cryptosystems, format-preserving encryption\nOperations Security: Event analysis\nBusiness Continuity and Disaster Recovery Planning: Business continuity in the cloud\nLegal, Regulations, Compliance, and Investigation: Persistent threats and incident response in the virtual realm\nPhysical Security: Essential aspects of physical security\nThe ubiquitous nature of computers and networks will always provide the opportunity and means to do harm. This edition updates its popular predecessors with the information you need to address the vulnerabilities created by recent innovations such as cloud computing, mobile banking, digital wallets, and near-field communications.\n","torrent":{"xt":"urn:btih:c0ca3a507005115503f691ec92155d12a3494709","amp;dn":"Information+Security+Handbook+Vol+5+%26amp%3B+6%2C+Sixth+Edition+%5BEpub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ca3a507005115503f691ec92155d12a3494709","infoHashBuffer":{"type":"Buffer","data":[192,202,58,80,112,5,17,85,3,246,145,236,146,21,93,18,163,73,71,9]},"announce":[],"urlList":[]}}