{"title":"J.D.Salinger - Il Giovane Holden [Pdf - ITA] [TntVillage]","uid":5221718,"size":1063898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0e474f9302540365c2d96325526f8660bbbd906&amp;dn=J.D.Salinger+-+Il+Giovane+Holden+%5BPdf+-+ITA%5D+%5BTntVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":1,"time":1260962601,"description":"J.D.Salinger - Il Giovane Holden\n\n - Other informations - \n\nAuthor: J.D.Salinger\nTitolo italiano: Il giovane Holden\nYears: 1951\nCasa editrice: Einaudi per l'Italia\nFormat:: pdf\n\n - Plot - \n\nHolden Caulfield ÃƒÂ¨ un adolescente molto sensibile e irrequieto, figlio di una famiglia benestante di New York che, nonostante una certa predilezione per la letteratura, frequenta con scarsi risultati il prestigioso college di Pencey in Pennsylvania al quale i suoi genitori lo hYears iscritto dopo alcuni insuccessi maturati in altre scuole del paese.\n\nHolden ÃƒÂ¨ assai legato al fratello maggiore, sceneggiatore di successo a Hollywood ed al ricordo di un altro fratello, di pochi anni piÃƒÂ¹ piccolo, scomparso da poco per leucemia.\n\nAlla vigilia delle vacanze di Natale Holden viene espulso dal college per scarso rendimento e decide di abbandonare anzitempo l'istituto che lo ospita. All'insaputa degli insegnanti e degli stessi genitori, che ignorano ancora il provvedimento disciplinare al quale ÃƒÂ¨ stato sottoposto, Holden si reca nella sua cittÃƒÂ  con l'intento di trascorrervi cinque giorni in assoluta autonomia e indipendenza.\n\nGiunto in piena notte a New York il ragazzo prende alloggio in una camera a buon mercato di un decadente albergo del centro, visita dei locali notturni, dissimulando con scarso successo la sua etÃƒÂ  per ordinare alcolici, ascolta musica Jazz e si intrattiene con alcune ragazze molto piÃƒÂ¹ grandi di lui ma non particolarmente attraenti. Al suo rientro in albergo Holden cerca la sua prima esperienza sessuale tra le braccia di una prostituta ma la sua indecisione gli costerÃƒÂ  cara e sarÃƒÂ  costretto a subire le richieste minacciose del portiere dell'albergo, protettore della ragazza\n\nIl giorno seguente, caratterizzato da una sempre maggiore irrequietezza e da solitarie riflessioni al quale nessuno sembra poter prestare ascolto, Holden, abbandonata la stanza d'albergo, si pone alla ricerca di alcune persone che hYears rappresentato in passato legami piÃƒÂ¹ o meno importanti e con le quali il ragazzo cerca semplicemente di ristabilire un contatto. Da principio Holden contatta Sally, una sua coetanea, ex compagna di classe, carina ma forse eccessivamente sofisticata. La ragazza, incuriosita dalla telefonata di Holden si reca all'appuntamento per trascorrere con il ragazzo alcune ore spensierate ma delle parole maldestramente pronunciate dal giovane, che tradiscono forse una certa delusione provata nei suoi confronti, la offendono profondamente al punto da scappare via precipitosamente, abbandonando il ragazzo alla sua solitudine. Holden si trattine quindi qualche ora in un bar con Carl, una vecchia superficiale conoscenza di alcuni anni piÃƒÂ¹ grande di lui dalla quale perÃƒÂ² non riceve nÃƒÂ© gratificazione nÃƒÂ© particolari dimostrazioni di amicizia.\n\nUbriaco, quando fuori ÃƒÂ¨ giÃƒÂ  notte fonda, Holden decide di far visita a Phoebe, la sua sorella minore verso la quale nutre un particolare affetto. Giunto nei pressi dell'appartamento vi si intrufola ingannando il portiere dello stabile e approfittando della assenza dei genitori, riesce a svegliare Phoebe. Grazie alla complicitÃƒÂ  che Holden condivide da sempre con la bambina, il ragazzo si lascia andare ad una serie di sincere confessioni. Dalla piccola riceve perÃƒÂ² in egual misura affettuosa comprensione e richiami severi al suo comportamento, per le conseguenze inevitabili che la notizia della sua fuga provocherÃƒÂ  l'indomani.\n\nIn mancanza di un luogo dove trascorrere la notte Holden chiede aiuto ad un suo vecchio professore, amico di famiglia. Il professore Antolini lo accoglie volentieri nell'appartamento dove abita con la moglie e nonostante l'ora tarda si intrattiene a lungo con il ragazzo ascoltando con attenzione le sue confidenze.\n\nGiunto il momento di addormentarsi, mentre giace semicosciente nel letto predisposto dalla signora Antolini per l'ospite, il ragazzo viene imporvvisamente risvegliato e infastidito da un gesto apparentemente innocente con il quale il professore accarezza la sua testa. Holden, in preda ad una reazione impaurita ma composta ed educata, decide di rivestirsi velocemente ed abbandonare con un pretesto la casa.\n\nNell'atrio della stazione centrale, dove, in assenza di alternative migliori ha deciso di trascorrere quello che resta della notte, il ragazzo prende una importante decisione: abbandonerÃƒÂ  definitivamente la scuola e New York per recarsi all'ovest in cerca di lavoro, per costruire una casa in montagna e creare una famiglia.\n\nPrima di partire perÃƒÂ², Holden non puÃƒÂ² fare a meno di congedarsi da sua sorella Phoebe alla quale, in un appuntamento davanti ad un museo della cittÃƒÂ , svela tutti i suoi progetti.\n\nLa reazione affettuosa quanto inaspettata della bambina provoca nel ragazzo un forte turbamento. Holden decide di procrastinare il momento della partenza e si abbandona, con la sorella, ad un semplice divertimento infantile quando insieme decidono di andare allo zoo per trascorrervi qualche ora.\n\nGrazie al forte ma severo richiamo affettivo rappresentato dalla giovane sorella, Holden tornerÃƒÂ  sulle sue decisioni e accetterÃƒÂ  di sottoporsi ad un breve periodo di cura in una struttura psichiatrica, al termine del quale, con ogni probabilitÃƒÂ  tornerÃƒÂ  a riprendere gli studi.\n\n\n - NOTE - \n\nUn classico della letteratura. IMPERDIBILE per chi ancora non l'abbia letto.\n\n\nOrario di seed e banda disponibile: 8.00-22/24.00\n\n\n","torrent":{"xt":"urn:btih:c0e474f9302540365c2d96325526f8660bbbd906","amp;dn":"J.D.Salinger+-+Il+Giovane+Holden+%5BPdf+-+ITA%5D+%5BTntVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e474f9302540365c2d96325526f8660bbbd906","infoHashBuffer":{"type":"Buffer","data":[192,228,116,249,48,37,64,54,92,45,150,50,85,38,248,102,11,187,217,6]},"announce":[],"urlList":[]}}