{"title":"Berry &amp; Kohn's Operating Room Technique, 12E [PDF][StormRG]","uid":11746568,"size":40709659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c13fd95de4595791aa8095a04b6b7972ea4b7091&amp;dn=Berry+%26amp%3B+Kohn%27s+Operating+Room+Technique%2C+12E+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":2,"time":1426050459,"description":"TITLE/EDITION Berry &amp; Kohn's Operating Room Technique, 12e\nBy: Nancymarie Phillips RN PhD RNFA CNOR\nSeries: Operating Room Technique\nHardcover: 1056 pages\nPublisher: Mosby; 12 edition (March 14, 2012)\nLanguage: English\nISBN-10: 0323073581\nISBN-13: 978-0323073585\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nBerry &amp; Kohn's Operating Room Technique has been the text of choice for understanding basic surgical principles and techniques for more than 50 years. Highly readable, accurate, and comprehensive, it covers the &quot;nuts and bolts&quot; of surgical techniques in a format that makes it easy to effectively apply basic principles to clinical practice. Expert author Nancymarie Phillips emphasizes the importance of teamwork throughout, with practical strategies and examples of how cooperation among perioperative caregivers contributes to positive patient care outcomes.\n\nDetailed coverage presents the fundamentals of perioperative nursing and surgical technology roles.\nA strong focus on the physiological, psychological, and spiritual considerations of perioperative patients gives you the knowledge you need to plan and implement comprehensive, individualized care.\nDiscussions of perioperative patient care for both inpatient and ambulatory procedures highlights key considerations for each setting, as well as for individual surgical procedures.\nIn-depth discussions of patients with special needs related to age or health status helps you learn to develop of a plan of care tailored to the unique care parameters of all patients.\nHelpful features such as chapter outlines with page numbers, chapter objectives, and key terms and definitions help you quickly find important information and focus your study time.\nNEW! Over 50 new and revised illustrations reflect the latest perioperative procedures, techniques, and equipment.\nUpdated content ensures you have the latest information on key topics, including:\nComputerized documentation\n&quot;Never Events&quot; and reimbursement\nCredentialing and certification\nBioterrorism and prion contamination\nSurgical hand hygiene, gowning, and gloving\nWound healing and hemostasis\nSurgical instrumentation\nNEW! References throughout the text highlight the importance of evidence-based practice.\nExpanded coverage in the Administration of Perioperative Patient Care Services chapter features managerial approaches to TeamSTEPPS and SCIP, as well as magnet status.\nUpdated physical plant information offers the latest 2011 updates concerning air-flow and room size according to AAMI standards","torrent":{"xt":"urn:btih:c13fd95de4595791aa8095a04b6b7972ea4b7091","amp;dn":"Berry+%26amp%3B+Kohn%27s+Operating+Room+Technique%2C+12E+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c13fd95de4595791aa8095a04b6b7972ea4b7091","infoHashBuffer":{"type":"Buffer","data":[193,63,217,93,228,89,87,145,170,128,149,160,75,107,121,114,234,75,112,145]},"announce":[],"urlList":[]}}