{"title":"My Age of Anxiety : Fear... (2014) Scott Stossel (multi)","uid":9497738,"size":5626137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c148f37752947242248cbd027f9bd3e35e02bd2e&amp;dn=My+Age+of+Anxiety+%3A+Fear...+%282014%29+Scott+Stossel+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"7","files":-1,"time":1390153319,"description":"My Age of Anxiety: Fear, Hope, Dread, and the Search for Peace of Mind\nby Scott Stossel\n\n\nFormat: mobi/epub/azw3\nLength: 416 pages\nGenre: Non-Fiction/Biography/Mental Health\nDate: 7 January 2014\n\nA riveting, revelatory, and moving account of the author's struggles with anxiety, and of the history of efforts by scientists, philosophers, and writers to understand the condition.\n\nAs recently as thirty-five years ago, anxiety did not exist as a diagnostic category. Today, it is the most common form of officially classified mental illness. Scott Stossel gracefully guides us across the terrain of an affliction that is pervasive yet too often misunderstood.\n\nDrawing on his own long-standing battle with anxiety, Stossel presents an astonishing history, at once intimate and authoritative, of the efforts to understand the condition from medical, cultural, philosophical, and experiential perspectives. He ranges from the earliest medical reports of Galen and Hippocrates, through later observations by Robert Burton and Soren Kierkegaard, to the investigations by great nineteenth-century scientists, such as Charles Darwin, William James, and Sigmund Freud, as they began to explore its sources and causes, to the latest research by neuroscientists and geneticists.\n\nStossel reports on famous individuals who struggled with anxiety, as well as on the afflicted generations of his own family. His portrait of anxiety reveals not only the emotion's myriad manifestations and the anguish anxiety produces but also the countless psychotherapies, medications, and other (often outlandish) treatments that have been developed to counteract it.\n\nAuthor:\n\nScott Stossel is the editor of The Atlantic and the author of Sarge: The Life and Times of Sargent Shriver. His articles and essays have appeared in The Atlantic, The New Yorker, The New Republic, The New York Times, The Wall Street Journal, and many other publications. He lives with his family in Washington, D.C. ","torrent":{"xt":"urn:btih:c148f37752947242248cbd027f9bd3e35e02bd2e","amp;dn":"My+Age+of+Anxiety+%3A+Fear...+%282014%29+Scott+Stossel+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c148f37752947242248cbd027f9bd3e35e02bd2e","infoHashBuffer":{"type":"Buffer","data":[193,72,243,119,82,148,114,66,36,140,189,2,127,155,211,227,94,2,189,46]},"announce":[],"urlList":[]}}