{"title":"The Replacements - 1987 - Pleased to Meet Me  [EAC - FLAC]","uid":4821275,"size":212241258,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c1846d2cb9c6d322a2dd7f040d0da9483a816fea&amp;dn=The+Replacements+-+1987+-+Pleased+to+Meet+Me++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bludStain","files":-1,"time":1238773173,"description":"The Replacements - 1987 - Pleased to Meet Me  [EAC - FLAC]\n\nTracks\n01 - I.O.U.   Westerberg   2:57\n02 - Alex Chilton   Mars, Stinson, Westerberg   3:12\n03 - I Don't Know   Mars, Stinson, Westerberg   3:19\n04 - Nightclub Jitters   Westerberg   2:44\n05 - The Ledge   Westerberg   4:04\n06 - Never Mind   Westerberg   2:47\n07 - Valentine   Mars, Stinson, Westerberg   3:31\n08 - Shooting Dirty Pool   Mars, Stinson, Westerberg   2:20\n09 - Red Red Wine   Westerberg   2:59\n10 - Skyway   Westerberg   2:04\n11 - Can't Hardly Wait   Westerberg   3:02\n\n\nReview\tby Stephen Thomas Erlewine\n\nAll things considered, Tim was an easy transition to the majors for the Replacements, at least as far as the making of the album goes: things went wrong after the release, as the band botched big showcases like its Saturday Night Live spot, leading up to the dismissal of Bob Stinson at the conclusion of the Tim tour. The dust hadn't settled when the 'Mats headed down to Memphis to record Pleased to Meet Me with producer Jim Dickinson at Ardent Studios -- or to phrase it in Alex Chilton-speak, to record with Big Star's 3rd producer at the studio where all three Big Star albums were made. All this fanboy worship perhaps naturally led to a full-blown mash note to Paul Westerberg's idol, who also turned up to play a couple of licks on a finally finished &quot;Can't Hardly Wait,&quot; which initially was attempted with Chilton as a producer before Tim, but Pleased to Meet Me didn't resemble either the crystalline pop of #1 Record or the narcissistic black hole of 3rd. Dickinson gave the Replacements a full-blooded, muscular production, cranking up guitars, hauling out an upright bass for Tommy Stinson, and bringing in horns -- even strings -- to flesh out Westerberg's songs. This was the Replacements as professionals and, ever the contrarians, they strained against it -- albeit only sporadically and underneath the surface -- with Westerberg's outsider stance calcifying into the invigorating bitterness of &quot;I.O.U.&quot; and &quot;I Don't Know.&quot; These two proto-slacker anti-anthems -- quite the inverse of the call to arms of &quot;Bastards of Young&quot; and &quot;Left of the Dial&quot; -- are the only times the group's self-sabotage surfaces here, as the bandmembers pretty much give themselves over to Dickinson's studio savvy, leading to the ominous pulse of &quot;The Ledge&quot; and the brilliant, shining power pop of &quot;Never Mind,&quot; &quot;Alex Chilton,&quot; and &quot;Valentine,&quot; along with such left-field twists as the mock jazz of &quot;Nightclub Jitters.&quot;\n\nThis kind of colorful, almost cinematic production -- even the greasy rocker &quot;Shooting Dirty Pool&quot; is enhanced by the sound of breaking glass -- was unheard of on a Replacements record and it all came to a head on &quot;Can't Hardly Wait,&quot; which was glossed over with swelling strings and the Memphis Horns. All these fancy accoutrements would seem like the antithesis of the Replacements' spirit, but Dickinson's grand production merely blows the 'Mats up to epic scale, leaving their essence intact: Westerberg even gets a lovely fragile acoustic moment in &quot;Skyway&quot; and there are down-and-dirty rockers like &quot;Shooting Dirty Pool&quot; and &quot;Red Red Wine&quot; that feel like throwaways, but are necessary to the spirit of the record. The Replacements never sounded better with a bigger production than they did on Pleased to Meet Me, so it's hard not to see it as the one that got away, the record that should have been the breakthrough, especially in the year when fellow American underground rockers R.E.M. leaped into the Top Ten (but, it's also true that &quot;The Ledge&quot; may not have been the best single choice, as songs about suicides don't often provide entry into the Top 40). Then again, the Replacements don't make sense as a success story, so the failure of the gleaming, glistening Pleased to Meet Me winds up making its polish kind of heart-rending. As it turns out, this was the last time they could still shoot for the stars and seem like their scrappy selves and, in many ways, it was the last true Replacements album. ","torrent":{"xt":"urn:btih:c1846d2cb9c6d322a2dd7f040d0da9483a816fea","amp;dn":"The+Replacements+-+1987+-+Pleased+to+Meet+Me++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1846d2cb9c6d322a2dd7f040d0da9483a816fea","infoHashBuffer":{"type":"Buffer","data":[193,132,109,44,185,198,211,34,162,221,127,4,13,13,169,72,58,129,111,234]},"announce":[],"urlList":[]}}