{"title":"The White Stripes - Studio Album Discography 1999-2007 [FLAC]","uid":8794011,"size":8814760317,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c19c66f579f12172631ed9029184b11eed0d0bf7&amp;dn=The+White+Stripes+-+Studio+Album+Discography+1999-2007+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":6,"uploader":"rudown78","files":228,"time":1376026195,"description":"The White Stripes - Studio Album Discography 1997-2007 [FLAC]\n\n\nThe White Stripes formed on Bastille Day in 1997, aiming to create simple, vigorous rock &amp; roll with little more than Meg White's percussion and Jack White's guitar-and-vocal attack. Meg's drumming was deliberate and straightforward, while Jack's formidable guitar skills paid homage to garage rock, blues, and punk. A former drummer for the Detroit-based country outfit Goober &amp; the Peas, he also displayed an affinity for American folk music, and the White Stripes took strength in the varied interests of its two members. Moreover, the group bolstered its sound with a controversial backstory (although the bandmates claimed to be siblings, they were actually a married couple until 2000) and a unique color scheme, which saw their clothing and cover art adhering to a red-and-white peppermint candy motif.\n\nAlthough the band emerged from Detroit's burgeoning rock scene, the White Stripes quickly gained a national following after touring alongside Pavement and Sleater-Kinney. Such performances helped support the duo's self-titled debut album, released in 1999 and dedicated to blues icon Son House. A sophomore effort followed closely behind, as the self-recorded De Stijl appeared in June 2000. However, it was the band's third release -- 2001's White Blood Cells -- that established the White Stripes as forerunners of the garage rock revival. Recorded in Memphis by renowned producer Doug Easley, White Blood Cells was a critical smash, launching the band into the same circle as the Strokes and the Hives. the White Stripes appeared on Late Night with David Lettterman and the MTV Movie Awards program; meanwhile, their music was profiled in such publications as Time, The New Yorker, and Entertainment Weekly.\n\nFaced with a swell in popularity, the musicians made the tough decision to jump to a major label. White Blood Cells was accordingly reissued by V2 Records in January 2002, and the previous two records followed suit in June. the White Stripes' profile continued to build as the music video for &quot;Fell in Love with a Girl&quot; -- a clever piece of Lego-animation directed by Michel Gondry -- was nominated for four MTV Video Awards, including Breakthrough Video, Best Special Effects in a Video, and Best Video of the Year, the latter of which pitted the band against the likes of Eminem and *NSYNC. While many garage rock revivalists struggled to maintain popularity as the decade progressed, the White Stripes proved to be an enduring presence, with 2003's Elephant receiving unanimous critical acclaim (and platinum sales in several countries) upon its release.\n\nthe White Stripes returned in 2005 with Get Behind Me Satan, a dizzyingly diverse album that spanned disco-metal and light, marimba-driven pop. In keeping with the band's feverish pace, the album had been written and recorded in two weeks that spring. The Stripes supported its release with a tour, during which they covered Tegan and Sara's &quot;Walking with a Ghost&quot; and released the song as a single at the end of 2005. That same year, Jack White and his new wife, model/singer Karen Elson, moved to Nashville, TN. White also formed the Raconteurs with Brendan Benson and the Greenhornes' Jack Lawrence and Patrick Keeler, and spent much of 2006 touring in support of the group's debut album, Broken Boy Soldiers.\n\nJack White continued to juggle his responsibilities as he performed with several bands, produced albums for other artists, and made forays into cinema. the White Stripes remained a vital commercial and critical presence, however, and the Grammy-winning Icky Thump appeared in 2007. Recorded in three weeks at Nashville's Blackbird Studio, the album included the first-ever Stripes songs with bagpipes and mariachi horns. After issuing another album with the Raconteurs, Jack White added yet another band to his plate as he joined the Dead Weather, a female-fronted group that released its debut album in 2009. That same year, he also appeared in the guitar-themed movie It Might Get Loud, and produced an album for Elson. That year also saw the theatrical release of Under Great White Northern Lights, the White Stripes' first concert film. Directed by Emmett Malloy, the film documented the band's 2007 Canadian tour and premiered at the 2009 Toronto Film Festival. The DVD of the film and a companion album of the same name were issued in 2010. \n\n\nStudio Albums:\n\n1. The White Stripes (1999)\n2. De Stijl (2000)\n3. White Blood Cells (2001)\n4. Elephant (2003)\n5. Get Behind Me Satan (2005)\n6. Icky Thump (2007)\n\nExtras:\n\n1. Walking With a Ghost [EP] (2005)\n2. Under Great White Northern Lights [DVD/CD] (2010)\n\n\nFull album artwork, audiochecker logs and rip logs are included. Enjoy!!!!!!!\n","torrent":{"xt":"urn:btih:c19c66f579f12172631ed9029184b11eed0d0bf7","amp;dn":"The+White+Stripes+-+Studio+Album+Discography+1999-2007+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19c66f579f12172631ed9029184b11eed0d0bf7","infoHashBuffer":{"type":"Buffer","data":[193,156,102,245,121,241,33,114,99,30,217,2,145,132,177,30,237,13,11,247]},"announce":[],"urlList":[]}}