{"title":"California - Edan Lepucki (Retail - New Release)","uid":10516206,"size":1255210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c27626d5e35ed79abaf3ab5b1ad3fabb0c28dbed&amp;dn=California+-+Edan+Lepucki+%28Retail+-+New+Release%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"TheRose88","files":4,"time":1404914626,"description":"California - Edan Lepucki - Retail - New Release (AZW3, epub)\n\n &quot;In her arresting debut novel, Edan Lepucki conjures a lush, intricate, deeply disturbing vision of the future, then masterfully exploits its dramatic possibilities.&quot; The world Cal and Frida have always known is gone, and they've left the crumbling city of Los Angeles far behind them. They now live in a shack in the wilderness, working side-by-side to make their days tolerable in the face of hardship and isolation. Mourning a past they can't reclaim, they seek solace in each other. But the tentative existence they've built for themselves is thrown into doubt when Frida finds out she's pregnant.\n\n Terrified of the unknown and unsure of their ability to raise a child alone, Cal and Frida set out for the nearest settlement, a guarded and paranoid community with dark secrets. These people can offer them security, but Cal and Frida soon realize this community poses dangers of its own. In this unfamiliar world, where everything and everyone can be perceived as a threat, the couple must quickly decide whom to trust.\n\n A gripping and provocative debut novel by a stunning new talent, California imagines a frighteningly realistic near future, in which clashes between mankind's dark nature and deep-seated resilience force us to question how far we will go to protect the ones we love.\n","torrent":{"xt":"urn:btih:c27626d5e35ed79abaf3ab5b1ad3fabb0c28dbed","amp;dn":"California+-+Edan+Lepucki+%28Retail+-+New+Release%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c27626d5e35ed79abaf3ab5b1ad3fabb0c28dbed","infoHashBuffer":{"type":"Buffer","data":[194,118,38,213,227,94,215,154,186,243,171,91,26,211,250,187,12,40,219,237]},"announce":[],"urlList":[]}}