{"title":"A Brilliant Darkness: The Life and Disappearance of Majorana","uid":15796119,"size":2498426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c29cfddc6aec011fba883435ee92f0cf85addf2d&amp;dn=A+Brilliant+Darkness%3A+The+Life+and+Disappearance+of+Majorana&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"marty14","files":1,"time":1473459626,"description":"A Brilliant Darkness: The Extraordinary Life and Disappearance of Ettore Majorana, the Troubled Genius of the Nuclear Age - João Magueijo [epub]\r\n\r\nNo twentieth-century scientist deserved the Nobel Prize more than the Italian physicist Ettore Majorana. So argues Magueijo, who nonetheless admits that the Nobel selection committee faced an insuperable obstacle in considering Majorana: only the living are eligible for the prize, and after March 26, 1938, no one knew whether Majorana was alive or dead. For on that date, one day after he had inexplicably handed a cache of his papers to a baffled student, the gifted theorist boarded a ship in Palermo — and vanished!\r\n\r\nUnraveling the mysteries left in the wake of that departing ship, Magueijo delves deep into the subatomic theories developed by the enigmatic genius, theories so advanced that they dazzled Majorana’s mentor, Enrico Fermi, and have continued to mesmerize scientists ever since. For the benefit of nonspecialists, Magueijo explains these scientific theories in mercifully simple terms. But what simple terms can illuminate a tortured and unstable personality, vulnerable to bouts of depression and prone to antisocial reclusiveness? The complexities of that personality resist assimilation into any of the standard explanations — suicide, kidnapping, flight, monastic retreat — for Majorana’s disappearance. But astounded readers will thank Magueijo for his daring venture into the science and the psyche of a perplexing figure","torrent":{"xt":"urn:btih:c29cfddc6aec011fba883435ee92f0cf85addf2d","amp;dn":"A+Brilliant+Darkness%3A+The+Life+and+Disappearance+of+Majorana","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29cfddc6aec011fba883435ee92f0cf85addf2d","infoHashBuffer":{"type":"Buffer","data":[194,156,253,220,106,236,1,31,186,136,52,53,238,146,240,207,133,173,223,45]},"announce":[],"urlList":[]}}