{"title":"The Alliance: Managing Talent in the Networked Age - Audiobook","uid":10517553,"size":91053927,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c2a8b1a3985df3de212782e6bed0e0ce92e38968&amp;dn=The+Alliance%3A+Managing+Talent+in+the+Networked+Age+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404926853,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Alliance: Managing Talent in the Networked Age\n\nWritten by: Reid Hoffman, Ben Casnocha, Chris Yeh\nNarrated by: Ben Casnocha, Chris Yeh\nLength: 3 hrs and 9 mins\nFormat: Unabridged\nRelease Date:07-08-14\nProgram Type: Audiobook\n\nIntroducing the new, realistic loyalty pact between employer and employee.\n\nThe employer-employee relationship is broken, and managers face a seemingly impossible dilemma: the old model of guaranteed long-term employment no longer works in a business environment defined by continuous change, but neither does a system in which every employee acts like a free agent.\n\nThe solution? Stop thinking of employees as either family or free agents. Think of them instead as allies.\n\nAs a manager you want your employees to help transform the company for the future. And your employees want the firm to help transform their careers. But this win-win scenario will only happen if both sides trust each other enough to commit to mutual investment and mutual benefit. Sadly, trust in the business world is hovering at an all-time low.\n\nWe can rebuild that lost trust with straight talk that recognizes the realities of the modern economy. So paradoxically, the alliance begins with managers acknowledging that great employees might leave the company, and with employees being honest about their own career aspirations.\n\nBy putting this new alliance at the heart of your talent-management strategy, you'll not only bring back trust, you'll be able to recruit and retain the entrepreneurial individuals you need to adapt to a fast-changing world.\n\nThese individuals - flexible, creative, and with a bias toward action - thrive when they're on a specific &quot;tour of duty&quot;, when they have a mission that's mutually beneficial to employee and company that can be completed in a realistic period of time.\n\nCoauthored by the founder of LinkedIn, this bold but practical guide for managers and executives will give you the tools you need to recruit, manage, and retain the kind of employees who will make your company thrive in today's world of constant innovation and fast-paced change.","torrent":{"xt":"urn:btih:c2a8b1a3985df3de212782e6bed0e0ce92e38968","amp;dn":"The+Alliance%3A+Managing+Talent+in+the+Networked+Age+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a8b1a3985df3de212782e6bed0e0ce92e38968","infoHashBuffer":{"type":"Buffer","data":[194,168,177,163,152,93,243,222,33,39,130,230,190,208,224,206,146,227,137,104]},"announce":[],"urlList":[]}}