{"title":"Goethe - The Sufferings of Young Werther (2012)","uid":8870454,"size":267715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c30da2064f961aaaf11868ed12ce715068eb6965&amp;dn=Goethe+-+The+Sufferings+of+Young+Werther+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1378049168,"description":"Johann Wolfgang von Goethe - The Sufferings of Young Werther (W. W. Norton &amp; Co., 2012).  Translated by Stanley Corngold.\n\nISBN: 9780393343571 | 160 pages | EPUB\n\n\nA masterpiece of European imagination, The Sufferings of Young Werther is the classic Sturm und Drang tale of youthful angst and tragedy. The acclaimed translator Stanley Corngold brings new passion and precision to Goethe's timeless novel of obsessive love and madness in this magnificent new translation. \n\nGoethe's themes of unrequited love, the pain of rejection, deepening despair, and their tragic consequences are as relevant today as when the novel was first published in 1774. His hugely influential novel informed the writing of, among others, Franz Kafka and Thomas Mann.\n\nIn translating The Sufferings of Young Werther, Corngold follows the German text closely, never knowingly using a word that was not current in English at the time the novel was written and yet maintaining a modern grace and flair. The result is an eagerly awaited translation that speaks to our time through the astonishing liveliness of Goethe's language -- as well through the translator's own.\n\n\nReviews\n\n&quot;Stanley Corngold's translation is a triumph. This is a glorious achievement, a Werther for the ages.&quot; -- Christopher Prendergast\n\n&quot;Corngold's translation is earthy and precise, with language belonging to a young man who is capable of both elation and despair. If the prose sometimes sounds hyperbolic, so does Werther, who is by turns silly, melancholy, and somber.&quot; -- Rachel Shteir, The New Republic\n\n&quot;A highly readable, sensitive, and lively Werther. Corngold is both faithful to the German and true to the demands of a modern English text.&quot; -- Jeremy Adler, Times Literary Supplement\n\n&quot;Corngold's new translation is of the very highest quality, punctiliously faithful to Goethe's German and sensitive to gradations of style in this extraordinary, trail-blazing first novel.&quot; -- J. M. Coetzee, New York Review of Books\n","torrent":{"xt":"urn:btih:c30da2064f961aaaf11868ed12ce715068eb6965","amp;dn":"Goethe+-+The+Sufferings+of+Young+Werther+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c30da2064f961aaaf11868ed12ce715068eb6965","infoHashBuffer":{"type":"Buffer","data":[195,13,162,6,79,150,26,170,241,24,104,237,18,206,113,80,104,235,105,101]},"announce":[],"urlList":[]}}