{"title":"Graphene Oxide - Fundamentals and Applications","uid":15975122,"size":17945076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3148b148f303ba48f826b69ac36aed2290c33ff&amp;dn=Graphene+Oxide+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1475819870,"description":"Graphene Oxide - Fundamentals and Applications - Ayrat M. Dimiev, Siegfried Eigler (Wiley, 2017).pdf\r\n\r\nDue to its unique properties, graphene oxide has become one of the most studied materials of the last decade and a great variety of applications have been reported in areas such as sensors, catalysis and biomedical applications.\r\n\r\nThis comprehensive volume systematically describes the fundamental aspects and applications of graphene oxide. The book is designed as an introduction to the topic, so each chapter begins with a discussion on fundamental concepts, then proceeds to review and summarize recent advances in the field. Divided into two parts, the first part covers fundamental aspects of graphene oxide and includes chapters on formation and chemical structure, characterization methods, reduction methods, rheology and optical properties of graphene oxide solutions. Part Two covers numerous graphene oxide applications including field effect transistors, transparent conductive films, sensors, energy harvesting and storage, membranes, composite materials, catalysis and biomedical applications. In each case the differences and advantages of graphene oxide over its non-oxidised counterpart are discussed. The book concludes with a chapter on the challenges of industrial-scale graphene oxide production.\r\n\r\nGraphene Oxide: Fundamentals and Applications is a valuable reference for academic researchers, and industry scientists interested in graphene oxide, graphene and other carbon materials","torrent":{"xt":"urn:btih:c3148b148f303ba48f826b69ac36aed2290c33ff","amp;dn":"Graphene+Oxide+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3148b148f303ba48f826b69ac36aed2290c33ff","infoHashBuffer":{"type":"Buffer","data":[195,20,139,20,143,48,59,164,143,130,107,105,172,54,174,210,41,12,51,255]},"announce":[],"urlList":[]}}