{"title":"David C. Cassidy - A Short History of Physics in the American Ce","uid":10111942,"size":1324176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c44bc940f5a284e0a0a67cd3fe15fcc47b6e3af3&amp;dn=David+C.+Cassidy+-+A+Short+History+of+Physics+in+the+American+Ce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Anette14","files":-1,"time":1399528079,"description":"Description\nProduct Details\nBook Title: A Short History of Physics in the American Century (New Histories of Science, Technology, and Medicine)\t\nBook Author: David C. Cassidy\nSeries: New Histories of Science, Technology, and Medicine (Book 23)\nHardcover: 224 pages\nPublisher: Harvard University Press (November 23, 2011)\nLanguage: English\nISBN-10: 0674049365\nISBN-13: 978-0674049369\n\n===================================================================================\nBook Description\nRelease date: November 23, 2011 | ISBN-10: 0674049365 | ISBN-13: 978-0674049369\nAs the twentieth century drew to a close, computers, the Internet, and nanotechnology were central to modern American life. Yet the advances in physics underlying these applications are poorly understood and widely underappreciated by U.S. citizens today. In this concise overview, David C. Cassidy sharpens our perspective on modern physics by viewing this foundational science through the lens of America's engagement with the political events of a tumultuous century.\nAmerican physics first stirred in the 1890s-around the time x-rays and radioactivity were discovered in Germany-with the founding of graduate schools on the German model. Yet American research lagged behind the great European laboratories until highly effective domestic policies, together with the exodus of physicists from fascist countries, brought the nation into the first ranks of world research in the 1930s. The creation of the atomic bomb and radar during World War II ensured lavish government support for particle physics, along with computation, solid-state physics, and military communication. These advances facilitated space exploration and led to the global expansion of the Internet.\nWell into the 1960s, physicists bolstered the United States' international status, and the nation repaid the favor through massive outlays of federal, military, and philanthropic funding. But gradually America relinquished its postwar commitment to scientific leadership, and the nation found itself struggling to maintain a competitive edge in science education and research. Today, American physicists, relying primarily on industrial funding, must compete with smaller, scrappier nations intent on writing their own brief history of physics in the twenty-first century.\n\n===================================================================================\nReviews\nDavid Cassidy tells a big story in a short book written for anyone interested in the place of science in American society. American physics began to stir at the end of the 19th century and rose to world hegemony by the beginning of World War II. The creation of the atomic bomb, the Cold War, and the consequent lavish support for physics meant that American dominance endured until the last decades of the 20th century. Cassidy stresses the perennial opposition between pure and applied physics, the gigantizing of science dependent on the federal purse, the transition from powerful science administrators to functionaries, globalization, and the relative marginalization of women. His conclusion on the rise of solid-state physics, computing, and the Internet brings this dramatic story to a dramatic close. (J. L. Heilbron, author of Galileo)\n\nThe real history of America in the twentieth century was shaped by the obscure struggles of physicists: from the electrification of the nation, to the nuclear standoff of the Cold War, to the information revolution, the lives of Americans have been affected in fundamental ways by the achievements of the physics community. Cassidy tells this essential story with brevity and style, filling a major gap in modern historiography. (Spencer Weart, AIP Center for History of Physics)\n\nThis is a must read for physics students and indeed anyone who wants to understand the development of the American physics enterprise and the interlocking roles of universities, private laboratories, and the federal government. (A. Spero Choice 2012-04-01)\n\nA Short History of Physics in the American Century by David Cassidy presents a brisk but excellent institutional and political history of the discipline, ornamented by lucid descriptions of physics concepts and discoveries...[It] deserves a wide audience, including physicists curious about their discipline's prominent role in modern U.S. history...A snappy and enjoyable read. (Benjamin Wilson Physics Today 2012-05-01)\n\n===================================================================================\nAbout the Author\nDavid C. Cassidy is Professor of Natural Sciences at Hofstra University.\n===================================================================================","torrent":{"xt":"urn:btih:c44bc940f5a284e0a0a67cd3fe15fcc47b6e3af3","amp;dn":"David+C.+Cassidy+-+A+Short+History+of+Physics+in+the+American+Ce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44bc940f5a284e0a0a67cd3fe15fcc47b6e3af3","infoHashBuffer":{"type":"Buffer","data":[196,75,201,64,245,162,132,224,160,166,124,211,254,21,252,196,123,110,58,243]},"announce":[],"urlList":[]}}