{"title":"Exo-Vaticana - Tom Horn","uid":10333158,"size":7858151,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4a98ce5f7fa1042bc39cbf8c87ed8d0c5ac23df&amp;dn=Exo-Vaticana+-+Tom+Horn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"starxteel","files":2,"time":1402436897,"description":"Following the release of their 2012 best-seller, Petrus Romanus: The Final Pope Is Here illustrated to the authors that modern civilization is more than casually interested not only in the final pope, but in the connection between Rome and their secret work on extraterrestrial intelligence, astrobiology, and the intriguing preparations they are making for the arrival of an alien &quot;savior.&quot; Thus, the new investigation began and quickly resulted in findings far more disturbing than the authors expected to find.\nIn Exo-Vaticana: Petrus Romanus, PROJECT LUCIFER, and the Vatican's Astonishing Exo-Theological Plan for the Arrival of an Alien Savior, internationally acclaimed investigative authors Thomas Horn and Cris Putnam break the greatest story of our time and expose the elitists and intellectuals who are planning to assimilate mankind under a coming &quot;savior,&quot; one whom the prophet Daniel foresaw as &quot;an alien god.&quot;\n\nAbout the author:\nTom Horn is an internationally recognized lecturer, radio host and best selling author of several books including his newest books, Petrus Romanus: The Final Pope Is Here, Forbidden Gates and Apollyon Rising 2012. He is a well-known columnist whose articles have been referred to by writers of the L. A. Times Syndicate, MSNBC, Christianity Today, New Man Magazine, World Net Daily, News Max, White House Correspondents and dozens of newsmagazines and press agencies around the globe. He has been interviewed by US Congressmen and Senators on his findings as well as featured repeatedly in major media including top-ten talk shows, America's Morning News for The Washington Times, The 700 Club, The Harvest Show, Coast to Coast AM, Prophecy in the News, and the Southwest Radio Church to name a few. Thomas received the highest degree honorary doctorate bestowed in 2007 from legendary professor Dr. I.D.E. Thomas for his research into ancient history, and has been endorsed by such national leaders as Dr. James Kennedy.","torrent":{"xt":"urn:btih:c4a98ce5f7fa1042bc39cbf8c87ed8d0c5ac23df","amp;dn":"Exo-Vaticana+-+Tom+Horn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4a98ce5f7fa1042bc39cbf8c87ed8d0c5ac23df","infoHashBuffer":{"type":"Buffer","data":[196,169,140,229,247,250,16,66,188,57,203,248,200,126,216,208,197,172,35,223]},"announce":[],"urlList":[]}}