{"title":"[ REALITY KINGS ] MONEY TALKS - Kelly Paige, Adrian Maya, Avalon","uid":15284546,"size":565060469,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c4b9e04f23a4ec7efb2384b68f37751a0c36f747&amp;dn=%5B+REALITY+KINGS+%5D+MONEY+TALKS+-+Kelly+Paige%2C+Adrian+Maya%2C+Avalon&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"TechLatina","files":1,"time":1468366050,"description":"[ REALITY KINGS ] MONEY TALKS - Kelly Paige, Adrian Maya, Avalon Heart | Sweet Hole | 07.12.2016 - NEW JULY 12th,2016 | SD MP4\r\n\r\n\r\n\r\n\r\nDESCRIPTION\r\n\r\n\r\nWe had an ice cream truck last week and took full advantage looking around for hot girls. We wanted to see who would strip their tops off and let us give them some whip cream bikinis. We also had the idea of getting a hottie to eat a donut off a guys cock. We of course hit up the beach looking for some babes. It took a while and a lot of rejections before we landed two smoking hotties with perfect tits that where all about the whip cream bikinis. We also found one blondie that went for the dick donut. She got so into it, we managed to get her to suck his cock for more cash. Then we moved the party over to a clothing store that Adrian and Tony took over. They where on the hunt for some hotties and found one that was looking for a dress. She was very shy at first but of course once the money came out and we explained the show, she was more receptive. We started slow, just getting her top off to see her amazing breasts. She was too hot so we just dropped a bunch of cash to see if she was down to get nasty and boy did she. You can not miss this hottie taking turns with Adrian on Tonys cock. They sucked and fucked their way to a hot creamy load all over their pretty faces. HOT!!!","torrent":{"xt":"urn:btih:c4b9e04f23a4ec7efb2384b68f37751a0c36f747","amp;dn":"%5B+REALITY+KINGS+%5D+MONEY+TALKS+-+Kelly+Paige%2C+Adrian+Maya%2C+Avalon","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b9e04f23a4ec7efb2384b68f37751a0c36f747","infoHashBuffer":{"type":"Buffer","data":[196,185,224,79,35,164,236,126,251,35,132,182,143,55,117,26,12,54,247,71]},"announce":[],"urlList":[]}}