{"title":"Alan Sokal and Jean Bricmont - Intellectual Impostures (2003)","uid":8337024,"size":428269,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4e75fce19e9b8f4b978516da091db4646257fd0&amp;dn=Alan+Sokal+and+Jean+Bricmont+-+Intellectual+Impostures+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1365009287,"description":"Alan Sokal and Jean Bricmont - Intellectual Impostures (Profile Books, 2003).\n\nISBN: 9781847657824 | 304 pages | ePub\n\nWhen Intellectual Impostures was published in France, it sent shock waves through the Left Bank establishment. When it was published in Britain, it provoked impassioned debate. Sokal and Bricmont examine the canon of French postmodernists -- Lacan, Kristeva, Baudrillard, Irigaray, Latour, Virilio, Deleuze and Guattari -- and systematically expose their abuse of science. This edition contains a new preface analysing the reactions to the book and answering some of the attacks.\n\nThis book grew out of the famous hoax in which Sokal published a parody article -- &quot;Trangressing The Boundaries: Toward a Transformative Hermeneutics of Quantum Gravity&quot; -- in the American postmodern journal &quot;Social Text&quot;. The article was filled with non sequiturs and nonsensical quotations about math and physics by prominent French and American intellectuals, yet it was published unaltered. Sokal then revealed that it was a deliberate parody, to the great consternation of the editors.\n\nAppendix A of the present volume contains the full text of Sokal's &quot;Trangressing The Boundaries&quot;; Appendix B consists of comments on the parody; and Appendix C serves as an afterword on the hilarious incident.\n\nReviews\n\n&quot;A delicious revelation that even the perpetrators of postmodern philosophy often have no idea what they're saying.&quot; -- The Observer\n\n&quot;The exposure of ignorance, pomposity and pseudo-science in this book are truly breathtaking.&quot; -- Sunday Telegraph\n\n&quot;A forensic examination of sackloads of ordure from the postmodern stable.&quot; -- Financial Times\n\n&quot;The merde hits the fan.&quot; -- Evening Standard\n\n&quot;A splendid book.&quot; -- Richard Dawkins, Nature\n","torrent":{"xt":"urn:btih:c4e75fce19e9b8f4b978516da091db4646257fd0","amp;dn":"Alan+Sokal+and+Jean+Bricmont+-+Intellectual+Impostures+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e75fce19e9b8f4b978516da091db4646257fd0","infoHashBuffer":{"type":"Buffer","data":[196,231,95,206,25,233,184,244,185,120,81,109,160,145,219,70,70,37,127,208]},"announce":[],"urlList":[]}}