{"title":"Object Oriented Design and Patterns 2nd Edition Cay Horstmann","uid":15562229,"size":8288507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5283218ba9c991a89f5410d2e0fd05d83fde143&amp;dn=Object+Oriented+Design+and+Patterns+2nd+Edition+Cay+Horstmann&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":1,"time":1471149231,"description":"An object-oriented design text that’s student oriented too! \r\nNow updated to reflect the innovations of Java 5.0, Cay Horstmann’s Object-Oriented Design &amp; Patterns, 2nd Edition continues to offer a student-oriented guide to object-oriented design.\r\n\r\nDrawing from his extensive experience as a programmer and teacher, Horstmann helps you appreciate the value of object-oriented design principles, and gives you a context for applying these principles and techniques in your own designs. Throughout the text, outstanding pedagogy, carefully developed exercises and examples, and a strong emphasis on problem solving make object-oriented design principles accessible to readers with limited programming experience.\r\n\r\nCay Horstmann’s Object-Oriented Design &amp; Patterns, 2nd Edition:\r\n•Integrates the use of Java 5.0 constructs throughout, including generics and the java.util.concurrent library.\r\n•Presents high-interest examples, including ones from the Java 5.0 library and user-interface programming.\r\n•Uses concepts such as interfaces, inner classes, reflection, and multithreading to introduce advanced Java language concepts.\r\n•Encourages you to master topics in object-oriented design, user-interface programming, and practical software development techniques.\r\n•Illustrates design patterns and their application using the Swing user interface toolkit and the Java collections library.\r\n•Introduces programming tools such as BlueJ, javadoc, and JUnit.\r\n•Provides a crash course in Java for readers who know C++","torrent":{"xt":"urn:btih:c5283218ba9c991a89f5410d2e0fd05d83fde143","amp;dn":"Object+Oriented+Design+and+Patterns+2nd+Edition+Cay+Horstmann","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5283218ba9c991a89f5410d2e0fd05d83fde143","infoHashBuffer":{"type":"Buffer","data":[197,40,50,24,186,156,153,26,137,245,65,13,46,15,208,93,131,253,225,67]},"announce":[],"urlList":[]}}