{"title":"OpenCL in Action  {BBS}","uid":7454674,"size":17691507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c56ce56e2e1384f2249b11c502e17bd9f666324b&amp;dn=OpenCL+in+Action++%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1342632383,"description":"ummary\n\nOpenCL in Action is a thorough, hands-on presentation of OpenCL, with an eye toward showing developers how to build high-performance applications of their own. It begins by presenting the core concepts behind OpenCL, including vector computing, parallel programming, and multi-threaded operations, and then guides you step-by-step from simple data structures to complex functions.\nAbout the Technology\n\nWhatever system you have, it probably has more raw processing power than you're using. OpenCL is a high-performance programming language that maximizes computational power by executing on CPUs, graphics processors, and other number-crunching devices. It's perfect for speed-sensitive tasks like vector computing, matrix operations, and graphics acceleration.\nAbout this Book\n\nOpenCL in Action blends the theory of parallel computing with the practical reality of building high-performance applications using OpenCL. It first guides you through the fundamental data structures in an intuitive manner. Then, it explains techniques for high-speed sorting, image processing, matrix operations, and fast Fourier transform. The book concludes with a deep look at the all-important subject of graphics acceleration. Numerous challenging examples give you different ways to experiment with working code.\n\nA background in C or C++ is helpful, but no prior exposure to OpenCL is needed.\n\nPurchase includes free PDF, ePub, and Kindle eBooks downloadable at manning.com.\nWhat's Inside\n\n    * Learn OpenCL step by step\n    * Tons of annotated code\n    * Tested algorithms for maximum performance\n\n\n\n\n# Paperback: 456 pages\n# Publisher: Manning Publications (November 17, 2011)\n# Language: English\n# ISBN-10: 1617290173\n# ISBN-13: 978-1617290176","torrent":{"xt":"urn:btih:c56ce56e2e1384f2249b11c502e17bd9f666324b","amp;dn":"OpenCL+in+Action++%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c56ce56e2e1384f2249b11c502e17bd9f666324b","infoHashBuffer":{"type":"Buffer","data":[197,108,229,110,46,19,132,242,36,155,17,197,2,225,123,217,246,102,50,75]},"announce":[],"urlList":[]}}