{"title":"HandsOnHardcore - Rose Valerie (Deep Cleaning - He Crams His Thi","uid":15890417,"size":330234592,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c5767dba3c8a2291f86caad4877015957d9c136f&amp;dn=HandsOnHardcore+-+Rose+Valerie+%28Deep+Cleaning+-+He+Crams+His+Thi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"xxxlavalxxx","files":2,"time":1474725658,"description":"Kai Taylor has been hired by Rose Valerie to do some deep cleaning in her office. He vacuums the floor and notices that hot chickâ™s long legs on the office desk. The redhead from France feels quite attracted to this young handsome man and opens her blouse a bit. When Kai sees her stunning pussy right in front of his face while down on his knees, he starts licking her tasty twat right away! The hot babeâ™s tight and curvy ass feels nice and Rose can already feel his boner growing in his pants. She takes out his hard-on and starts sucking his dick and licking his balls before he plays with her clit. Time to enter the milfâ™s tight twat! He fucks her trimmed cunny from behind and slides his meat in and out that amazing wet box before the two shift onto the carpet floor. He crams his thick rod up her tight ass and starts banging that incredibly hot chick in her asshole! Rose feels his dong deep inside her butt and enjoys a pussy and ass gape before riding his massive hammer in reverse cowgirl style. The brown-eyed beauty with enhanced tits canâ™t wait to cum! Finally, Kai blow his jizz between her butt cheeks and lets her suck some drops of sperm off his helmet!\r\nTags: Anal, Hardcore, High Heels, Ball licking, Glasses, Office, Panties, Secretary, Cum in Ass, Blowjob\r\n \nhttp://imgdone.com/viewer.php?file=50570571646818017565.jpg\r\n \nhttp://imgdone.com/viewer.php?file=82406063650171261357.jpg","torrent":{"xt":"urn:btih:c5767dba3c8a2291f86caad4877015957d9c136f","amp;dn":"HandsOnHardcore+-+Rose+Valerie+%28Deep+Cleaning+-+He+Crams+His+Thi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5767dba3c8a2291f86caad4877015957d9c136f","infoHashBuffer":{"type":"Buffer","data":[197,118,125,186,60,138,34,145,248,108,170,212,135,112,21,149,125,156,19,111]},"announce":[],"urlList":[]}}