{"title":"ROUTE 66 Maps + Navigation - ARMANI","uid":7925581,"size":19248380,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c59a9ff83c3920d6fa5a40b557be5a80a988a8da&amp;dn=ROUTE+66+Maps+%2B+Navigation+-+ARMANI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"ARMANI","files":-1,"time":1355532858,"description":"\nGPS-based mapping and navigation app with Follow Meâ„¢ augmented reality navigation.\n\n***New Panoramic Car Kit - now available on http://store.66.com. Specially designed for your smartphone. Just â‚¬ 19.99.***\n\n\n===============\nFREE MAP VIEWER\n===============\n\n+ Instant access to over 100 maps\n+ Browse maps, search, calculate and simulate routes: it is all free!\n+ The latest, up-to-date maps from top-rated map suppliers like TomTom, AutoNavi, Sensis\n+ Free map updates\n+ Works both with server based maps and maps stored on your phone\n+ Download maps directly to your phone, no computer needed\n+ Smart caching of map data: never download a map segment twice\n+ High resolution 3D content in hundreds of cities around the world\n+ Tap any point on the map and start route calculation straight away\n+ Automatic switch between day and night colours, choose custom map colours\n+ Access Wikipedia and local weather reports directly from the map\n+ Powerful map 3D rendering with full hardware acceleration\n+ Multi-touch map browsing: smooth and easy\n+ Maps optimised for high resolution displays and tablets\n+ Directly call a Point of interest or visit its website\n+ Share your favourite locations with friends\n\n\n===========================\nPREMIUM NAVIGATION FEATURES\n===========================\n\n\n+ Turn-by-turn voice guided navigation with uncluttered visual guidance\n+ 2D, 3D and Augmented Reality navigation\n+ Drive or walk: always the best route\n+ Choose between Fastest route and Shortest route\n+ Add waypoints to your route at any time\n+ Plan your trip ahead, your routes are automatically saved\n+ Navigation shortcuts: easy access to key functions during your trip\n+ Adjust the navigation display to your own preferences\n+ Lane Guidance\n+ Adjustable speed warnings\n+ Real Time Traffic information with dynamic route recalculation (in-app purchase)\n+ Speed camera warnings with automatic database updates (in-app purchase)\n+ Compass enhanced pedestrian navigator: map always pointing in the right direction\n+ Fully interactive maps, even during navigation\n+ Voice guidance available in 59 different languages and dialects\n+ Voice guidance continues when app is in background\n+ Try all premium features like Navigation, Traffic information and Speed cameras for FREE before you buy a licence\n\n\n================\nSEARCH WITH EASE\n================\n\n\n+ Unique ROUTE 66 free text search: search any address, post code or point of interest\n+ Free text search works even with partial or incomplete search requests\n+ Turn a location into a personal Favourite with one tap\n+ Full Search History\n+ Address search lets you also find intersections\n+ Search along route: find a nearby gas station or parking spot at your destination\n+ Find any address stored in your Contact database\n+ Search worldwide without having to download maps first!\n\n\n==================\nWORLDWIDE COVERAGE\n==================\n\n\nMaps and navigation supported in these countries:\n+ Africa: Egypt, Lesotho, Morocco, Nigeria, South Africa, Swaziland\n+ Asia: Bahrain, Brunei, China, Hong Kong, Indonesia, Kuwait, Macau, Malaysia, Oman, Philippines, Qatar, Saudi Arabia, Singapore, Taiwan, Thailand, United Arab Emirates\n+ Oceania: Australia, New Zealand\n+ Americas: Argentina, Brazil, Canada, Chile, Guadeloupe, Martinique, Mexico, Puerto Rico, United States, Uruguay, Virgin Islands (United States)\n+ Europe: Albania, Andorra, Austria, Belarus, Belgium, Bosnia-Herzegovina, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Gibraltar, Greece, Hungary, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Macedonia, Malta, Moldova, Monaco, Montenegro, Netherlands, Norway, Poland, Portugal, Romania, Russia, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, United Kingdom, Vatican\n\n\n\nMaps only (no turn-by-turn navigation) in these countries:\n+ Africa: Angola, Benin, Botswana, Burkina Faso, Cameroon, Congo, Democratic Republic of the Congo, Gabon, Ghana, Kenya, Malawi, Mali, Mauritania, Mauritius, Mayotte, Mozambique, Namibia, Niger, Reunion, Tanzania, Togo, Uganda, Western Sahara, Zambia, Zimbabwe\n\n\n==================\nGoogle Play Store:\n==================\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.route66.maps5&amp;feature=search_result#?t=W251bGwsMSwxLDEsImNvbS5yb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.route66.maps5&amp;feature=search_result#?t=W251bGwsMSwxLDEsImNvbS5yb&lt;/a&gt;  3V0ZTY2Lm1hcHM1Il0.\n\n\n1.Close WiFi\n2.Install first Route66-1400.apk and don't open choose done\n3.Install second Route66-SignFile.apk and don't open choose done\n4.Start WiFi\n5.Start Route 66\n6.Download it's starting.\n7.It's working.\n\n\n--------\nÄ°ncluded:\n--------\n\n1- Route66-1400.apk\n2- Route66-SignFile.apk\n","torrent":{"xt":"urn:btih:c59a9ff83c3920d6fa5a40b557be5a80a988a8da","amp;dn":"ROUTE+66+Maps+%2B+Navigation+-+ARMANI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59a9ff83c3920d6fa5a40b557be5a80a988a8da","infoHashBuffer":{"type":"Buffer","data":[197,154,159,248,60,57,32,214,250,90,64,181,87,190,90,128,169,136,168,218]},"announce":[],"urlList":[]}}