{"title":"Prison Architect - Alpha 19 - PC","uid":9837383,"size":113315876,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5c7e5142cf718710967cbf2bf5ec7fb970de582&amp;dn=Prison+Architect+-+Alpha+19+-+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"sharpshot94549","files":-1,"time":1395935916,"description":"Prison Architect Alpha 19\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\nPrison Architect 19 changelog follows:\n\n= Financial system improvements\nCashflow is now visible from the very start, without needing an Accountant to unlock it\nCashflow is now paid hourly, instead of at midnight as before\nThe starting bank balance has been increased from $10,000 to $30,000\nThe daily federal grant has been increased from $1,500 to $2,000\nYou now receive more daily money for the max security prisoners\nCash Bonus : Days without Incident \nYou now receive a bonus to your cashflow based on the number of days without incident. The bonus accumulates at a rate of $1,000 per day without incident. So after 1 day you get a $1,000 bonus, but after 2 days you get a $2,000 bonus The maximum daily bonus is $10,000 for 10 days straight without incident. The amount received resets immediately to zero after a death, serious injury, or escape.\nCorporation Taxes \nYou must now pay tax - 30% of all profits, directly out of your daily cashflow. Once you have a profitable prison you can use your accountant to reduce this to 15% You can also unlock an offshore tax haven for a whopping $50,000, that reduces your Corporation Taxes to 1%. (This is only recommended for prisons with massive daily profits)\nBank Loans \nYou can now borrow lump sums of money from the bank, and pay interest on the amount borrowed. Interest payments are made hourly, and each successful payment increases your credit rating. As your credit rating increases, so does the amount you can borrow, up to a max of $100,000\nPrison Share Scheme \nYou can choose to sell shares in your prison to private investors and venture capitalists. They will pay you 10% of the current prison value, in exchange for 10% ownership of your prison. You can sell up to 50% of your prison this way, and you can buy back at any time (although the price may have gone up) However if you've sold 30% of your prison to investors, you will only receive 70% of the price when you come to sell the entire prison\n= Game rebalancing\nThe prison 'temperature' now increases quite a bit slower, taking much longer to reach dangerous levels\nThe temperature falls much quicker once the causes of frustration have been resolved\nA prisoner's &quot;time served&quot; now counts up much more slowly, meaning they will spend longer in your jail before release. Previously one year sentence = 36 game hours (1.5 days) Now one year sentence = 120 game hours (5 days)\nThe Workshop Safety Induction can now be taught to 10 prisoners at once (up from 5 previously), and prisoners can use a workshop saw OR a workshop press whilst learning\n- New room/zone : Exports\nFinished items are taken from the workshop to the new exports zone. Workmen will do the hauling.\nIf the exports zone is 'secure' then your prisoners will also do the hauling.\nItems in the Exports zone will be loaded onto passing delivery trucks and taken away.\nYou will be paid as they leave the prison site. \nNOTE: Logs will be auto-sold if there are no workshop Saws on site. \nNOTE: Wood will be auto-sold if there are no carpenters tables, or no qualified carpenters on site\n- SDL 2.0\nThe game is now using SDL 2.0 for windowing, mouse/keyboard input, and sound. (Previously SDL 1.2)\nThis should help with hardware compatibility and reliability\nAlso provides better support for high dpi displays, joypads, tablets etc\n- High DPI mode\nHigh DPI mode is now supported on certain displays - eg the Macbook Pro Retina display. Enable it from the Graphics menu. This will make the game look significantly sharper on high DPI displays. (Eg Retina Mac previously ran the game at 1280x800 - now runs at 2560x1600 on a 13&quot; screen!)\n= Improvements and Fixes\nGreatly improved the display of Jobs in the deployment screen\nYou must now keep your Administrators employed if you wish to continue using the facilities they have unlocked\nPrisoners with 'Qualifications' gained from reform programs will now strongly prefer to work in jobs that use those qualifications This fixes a problem where all your qualified workshop prisoners went off to do the cleaning\nTazers are no longer flagged as 'Metal', so wont set off metal detectors\nTrees will no longer leave a stump if they are felled indoors, eg after building new foundations over forest\nThe Emergency Services toolbar now shows tooltips for each service type, including the cost of callout\nThe Rooms toolbar now highlights rooms you are likely to want to build, due to grants/objectives\nThe Bureaucracy screen has been laid out in a new arrangement to make room for all the new unlocks\nThe Lawyer has been removed from the game, as he currently serves no purpose. He may return at a later date.\nNew graphics for the Teacher\nFixed : The reform program 'Scheduler' now ensures there will be a teacher available when picking a time slot. This fixes a bug with the foreman being expected to teach multiple workshop induction classes at once.\nNOTE: You may need to manually click &quot;Reschedule&quot; if your prison has this problem after loading\nFixed : Prisoners working as janitors would stand around in the cleaning cupboard doing nothing, unless you had at least one janitor hired (or if you had very few janitors in a large jail)\nFixed : Cutting down a tree near a wall square will no longer demolish that wall square\nFixed : Experience will no longer tick up on dead prisoners\nFixed : You can no longer place rooms over lakes\nFixed : Stolen contraband would still be counted if the prisoner responsible had left the jail. This counted towards the overall 'Supply' level, but could never be found by searching.","torrent":{"xt":"urn:btih:c5c7e5142cf718710967cbf2bf5ec7fb970de582","amp;dn":"Prison+Architect+-+Alpha+19+-+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c7e5142cf718710967cbf2bf5ec7fb970de582","infoHashBuffer":{"type":"Buffer","data":[197,199,229,20,44,247,24,113,9,103,203,242,191,94,199,251,151,13,229,130]},"announce":[],"urlList":[]}}