{"title":"The Quantum Age- Brian Clegg [Epub &amp; PDF] [StormRG]","uid":10710527,"size":2275299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5d051ea50cef27aa7c2755ed944bff93fc3942e&amp;dn=The+Quantum+Age-+Brian+Clegg+%5BEpub+%26amp%3B+PDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"krystine","files":-1,"time":1407348457,"description":"The Quantum Age: How the Physics of the Very Small has Transformed Our Lives\nAuthor: Brian Clegg\nPublished: 2014\nPublisher: Icon Books Ltd\nISBN: 9781848316645\nFormat: Retail Epub and PDF\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nPDF-Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nThe stone age, the iron age, the steam and electrical ages all saw the reach of humankind transformed by new technology. Now we are living in the quantum age, a revolution in everyday life led by our understanding of the very, very small.\n\n\nToday, technologies based on quantum physics account for 30 per cent of US GDP, and yet quantum particles such as atoms, electrons and photons remain enigmatic, acting totally unlike the objects we experience directly. Weird quantum behaviour is also essential to nature. From the mechanism of the Sun to quantum biology in our eyesight, photosynthesis in plants and the ability of birds to navigate, quantum effects are key.\n\n\nQuantum physics lies at the heart of every electronic device, every smartphone and laser, and now quantum superconductors have moved out of the lab to make levitating trains and MRI scanners possible, while soon superfast, ultra-secure quantum computers may be a reality.\n\n\nAcclaimed popular science author Brian Clegg brings his trademark clarity and enthusiasm to a book that will give the world around you a new sense of wonder.","torrent":{"xt":"urn:btih:c5d051ea50cef27aa7c2755ed944bff93fc3942e","amp;dn":"The+Quantum+Age-+Brian+Clegg+%5BEpub+%26amp%3B+PDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d051ea50cef27aa7c2755ed944bff93fc3942e","infoHashBuffer":{"type":"Buffer","data":[197,208,81,234,80,206,242,122,167,194,117,94,217,68,191,249,63,195,148,46]},"announce":[],"urlList":[]}}