{"title":"C# in Depth [3rd Edition] - John Skeet","uid":9279635,"size":20411645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c62002c2fc8c834ec9ddd4f6482a96ecf1ec8f76&amp;dn=C%23+in+Depth+%5B3rd+Edition%5D+-+John+Skeet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Mohammad_AT","files":2,"time":1385915932,"description":"About the Author\n\nJon Skeet is a Senior Software Engineer at Google, and a highly visible participant of newsgroups, user groups, international conferences, and the Stack Overflow Q&amp;A site. Jon spends much of his day coding in Java, but his heart belongs to C#.\n\nSummary\n\nC# in Depth, Third Edition updates the best-selling second edition to cover the new features of C# 5, including the challenges of writing maintainable asynchronous code. It preserves the uniquely insightful look into the tricky areas and dusty corners of C# that only expert Jon Skeet can provide.\n\nAbout this Book\n\nIf you're a .NET developer, you'll use C# whether you're building an advanced enterprise application or just slamming out a quick app. In C# 5, you can do amazing things with generics, lambda expressions, dynamic typing, LINQ, iterator blocks, and other features. But first you have to learn it in depth.\n\nC# in Depth, Third Edition has been thoroughly revised to cover the new features of C# 5, including the subtleties of writing maintainable asynchronous code. You'll see the power of C# in action, learning how to work with high-value features that you'll be glad to have in your toolkit. And you'll learn to avoid hidden pitfalls of C# programming with the help of crystal clear explanations of &quot;behind the scenes&quot; issues.","torrent":{"xt":"urn:btih:c62002c2fc8c834ec9ddd4f6482a96ecf1ec8f76","amp;dn":"C%23+in+Depth+%5B3rd+Edition%5D+-+John+Skeet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62002c2fc8c834ec9ddd4f6482a96ecf1ec8f76","infoHashBuffer":{"type":"Buffer","data":[198,32,2,194,252,140,131,78,201,221,212,246,72,42,150,236,241,236,143,118]},"announce":[],"urlList":[]}}