{"title":"Encyclopedia of Finance","uid":10087003,"size":12126393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c74c2f4802197be1e84d565e129a065f2c5368c5&amp;dn=Encyclopedia+of+Finance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1399122131,"description":"ABOUT THIS BOOK\n- Most comprehensive and up-to-date resource in the field, integrating the most current terminology, research, theory, and practical applications\n- Comprised of over 1000 individual definitions and chapters\n- Serves as an essential resource for academics, educators, and students\nThe Encyclopedia of Finance, Second Edition, comprised of over 1000 individual definitions and chapters, is the most comprehensive and up-to-date resource in the field, integrating the most current terminology, research, theory, and practical applications. Showcasing contributions from an international array of experts, the revised edition of this major reference work is unparalleled in the breadth and depth of its coverage. Part I provides readers with a basic framework for getting up to speed quickly, and has been updated to include over 200 new terms and essays. Part II features 24 new chapters and offers a more in-depth look at the topic through key developments and findings. Part III has also been expanded through the addition of four new appendices. From &quot;asset pricing models&quot; to &quot;risk management,&quot; the Encyclopedia of Finance, Second Edition, serves as an essential resource for academics, educators, and students.\n\nAUTHORS &amp; EDITORS\nProfessor Cheng-Few Lee is a Distinguished Professor of Finance at Rutgers Business School and was chairperson of the Department of Finance from 1988-1995. He has maintained academic and consulting ties in Taiwan, Hong Kong, China and the United States for the past three decades. In the winter 2005 issue of the Journal of Finance Literature, Professor Lee was ranked as the most published finance professor worldwide during 1953-2008.\n\nProfessor Alice C. Lee is an Assistant Professor of Finance at San Francisco State University. She has a diverse background, which includes engineering, sales, and management consulting. Her primary areas of teaching and research are corporate finance and financial institutions.","torrent":{"xt":"urn:btih:c74c2f4802197be1e84d565e129a065f2c5368c5","amp;dn":"Encyclopedia+of+Finance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c74c2f4802197be1e84d565e129a065f2c5368c5","infoHashBuffer":{"type":"Buffer","data":[199,76,47,72,2,25,123,225,232,77,86,94,18,154,6,95,44,83,104,197]},"announce":[],"urlList":[]}}