{"title":"Ice.Station.Zebra.1968.1080p.BluRay.x264.EAC3-SARTRE","uid":15644737,"size":3942391010,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c76a89d7dc5569258bd5c86f15e273401aa8cbca&amp;dn=Ice.Station.Zebra.1968.1080p.BluRay.x264.EAC3-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"sartre7","files":5,"time":1472043976,"description":"A top-secret Soviet spy satellite -- using stolen Western technology -- malfunctions and then goes into a descent that lands it near an isolated Arctic research encampment called Ice Station Zebra, belonging to the British, which starts sending out distress signals before falling silent. The atomic submarine Tigerfish, commanded by Cmdr. James Ferraday (Rock Hudson), is dispatched with orders to get to Ice Station Zebra carrying three passengers, a Englishman going by the name of David Jones (Patrick McGoohan), a Soviet turncoat named Boris Vaslov (Ernest Borgnine), and an American Marine officer, Captain Anders (Jim Brown), who is supposed to command the Marine unit assigned to the mission. \r\n\r\nJones is problem enough, as he is in command of the mission and he prefers to withhold as much information as it's possible to do from Ferraday, even at the risk of the Tigerfish's safety. Add to that the fact that Anders is suspicious of Vaslov, and Vaslov seems much too inquisitive and is telling even less of what he knows about the mission, and Ferraday has his hands full trying to get these men to the polar ice -- 600 miles of dangerous travel -- in just two days. When an attempt to break through the ice -- coupled with some timely sabotage -- kills one man and nearly destroys the boat, the men surrounding these contending parties start to understand just how high the stakes are for everyone. \r\n\r\nIt turns out that the Soviets want what was aboard that satellite as much as the West does; indeed, both sides are frantic to get it, and, just as much, to keep the other side from getting it -- and they're prepared to take it by brute force. Once Ferraday and his men arrive at Zebra, they find a disaster and still more mystery, with most of the men dead and the object that Mr. Jones is supposed to secure nowhere in evidence, and he and his two fellow men of mystery suddenly showing their killing instincts quite freely. And with the storm clearing from the Soviet side first, their planes and their paratroops are closing in on Ferraday, and his relative handful of men.\r\n\r\n\r\n\r\n\r\nSTARS.........: Rock Hudson, Ernest Borgnine, Patrick McGoohan\r\nDIRECTOR......: John Sturges\r\nWRITERS.......: Douglas Heyes\r\nGENRE.........: Adventure | Drama | Thriller\r\nIMDB RATING...: 6.6/10  6,852 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0063121\r\nRUNTIME.......: 2h 29mn\r\nSIZE..........: 3.65GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x872\r\nASPECT RATIO..: 2.20:1\r\nBITRATE.......: 3000 Kbps (3-pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English E-AC3 5.1 512kbps\r\nSUBTITLES.....: ENG\r\nCHAPTERS......: Yes\r\nSOURCE........: Full Blu Ray\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-08-23","torrent":{"xt":"urn:btih:c76a89d7dc5569258bd5c86f15e273401aa8cbca","amp;dn":"Ice.Station.Zebra.1968.1080p.BluRay.x264.EAC3-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c76a89d7dc5569258bd5c86f15e273401aa8cbca","infoHashBuffer":{"type":"Buffer","data":[199,106,137,215,220,85,105,37,139,213,200,111,21,226,115,64,26,168,203,202]},"announce":[],"urlList":[]}}