{"title":"Lady en de vagebond 1 (NL en Eng)(TinkerBell) TBS","uid":6153326,"size":4208832854,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c79071ee66e236b3689dfb457a838b2d8443c397&amp;dn=Lady+en+de+vagebond+1+%28NL+en+Eng%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1296948903,"description":"\n\n\nLady en de Vagebond - Lady and the Tramp       \n  \n \nNederlands:\n\nLady is een prachtige lieve cockerspaniÃƒÂ«l. Ze woont in een schitterend mooi huis. Hoewel ze een hondenmand heeft, gaat haar voorkeur uit naar een plekje op het bed van haar baasjes. 's \n\nOchtends wekt ze hen met een ferme lik, ze haalt de krant en ze ontbijten samen. 's Avonds, als haar baasje thuiskomt, rent ze hem tegenoet en wordt ze lekker geknuffeld en aangehaald. Ze \n\nheeft het perfect naar haar zin. Echt een dame wordt Lady als ze een halsband met een medaille omkrijgt. Het betekent dat ze trouw is en heel wat betekent. Al haar vriendjes, zoals de \n\nbeminnelijke terriÃƒÂ«r Jock en de speurhond Snuffel, bewonderen haar. Op een dag gebeurt er iets raars. Niets kan Lady meer goed doen in huis. Het lijkt wel of niemand haar meer aardig vindt. \n\nZou ze iets fouts gedaan hebben? Het duurt een hele tijd voor ze weet waarom haar baasjes Jim en Lieverd zo zenuwachtig zijn en geen aandacht meer voor haar hebben. Er is een babytje op \n\nkomst! Het is een jongen en in april wordt hij geboren. Wanneer Jim en Lieverd niet lang daarna op reis gaan, past tante Saar op de baby. Zij neemt haar twee Siamese katten Si en Am mee. \n\nWat een krengen zijn dat. Zij vinden zichzelf heel mooi. Ze zijn vooral goed in het uithalen van kattenkwaad. Lady wordt er gek van. En wat doet tante Saar? Zij neemt Lady mee naar de \n\neerste de beste dierenwinkel om haar een muilkorf aan te meten. Niet gewend aan zo'n barbaarse behandeling neemt Lady de benen... Ver van het mooie huis waar Lady is opgegroeid leeft \n\nVagebond. Hij mag dan wel een straathond zijn, maar zijn trots pakken ze hem niet af. Hij kan vechten als de beste, maakt plezier, woont op het spoorwegterrein en geniet van zijn vrijheid. \n\nZijn eten scharrelt hij zo links en rechts bij elkaar. Hij vindt het best zo. Dan wordt hij plotseling opgeschrikt door een hels kabaal. Een prachtige cockerspaniÃƒÂ«l met een muilkorf om, \n\nwordt achterna gezeten door een bende straathonden. Hier moet hij ingrijpen. Liefdevol toont Vagebond aan Lady zijn favoriete plekjes en de plaatsen waar hij zijn eten bijeen scharrelt. \n\nDeze bijzondere avond viert hij met een bezoek aan het Italiaanse restaurant van Tony, die na het zien van Lady direct in de gaten heeft dat dit een hele speciale avond is. De tafel wordt \n\nmooi gedekt, de kaarsjes gaan op tafel en een feestelijke maaltijd van spaghetti met gehaktballetjes wordt tevoorschijn getoverd. En terwijl Tony met een Italiaans accent het romantische \n\nlied &quot;Bella Notte&quot; zingt, weten Vagebond en Lady dat ze voor eeuwig bijelkaar horen. Maar de nacht eindigt minder romantisch.....\n\n\n\nEngels:\n\nLady, a golden cocker spaniel, meets up with a mongrel dog who calls himself the Tramp. He is obviously from the wrong side of town, but happenings at Lady's home make her decide to travel \n\nwith him for a while. This turns out to be a bad move, as no dog is above the law. \n\n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nAudio         : Nederlands en Engels\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Animatie/Familiefilm/Kinderfilm\n \n\n \n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0048280/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0048280/&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1593&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1593&lt;/a&gt;\n\n\nAangeboden door TinkerBell @ TBS\n","torrent":{"xt":"urn:btih:c79071ee66e236b3689dfb457a838b2d8443c397","amp;dn":"Lady+en+de+vagebond+1+%28NL+en+Eng%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c79071ee66e236b3689dfb457a838b2d8443c397","infoHashBuffer":{"type":"Buffer","data":[199,144,113,238,102,226,54,179,104,157,251,69,122,131,139,45,132,67,195,151]},"announce":[],"urlList":[]}}