{"title":"German Orgy Party **NEW 2014** WEB-DL MP4-RARBG","uid":11290590,"size":911010036,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c7a0dab1d33cf19edcdfc8e94e9c8b183b6330d6&amp;dn=German+Orgy+Party+%2A%2ANEW+2014%2A%2A+WEB-DL+MP4-RARBG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"TKTh3K1ng","files":2,"time":1414282362,"description":"[b]German Orgy Party\nThird World Media / Year: 2014[/b]\n\n[b]Video language:[/b] English \n\n[b]SCREENSHOTS :[/b]\n\n[b]Synopsis:[/b]\nIn Germany construction crews know how to work hard and they also know how to party hard too. These guys are pretty tough, in fact they're so tough they even cook their wiener schnitzels with blow torches. They're sucking down some brews on the worksite, when Baron Von Hardcock pays a visit with a small herum of his local whores. The Baron's looking sharp and he has some wild plans in store for a crazy German Orgy Party. He takes an older blonde MILF into a stairwell and makes her drop to her knees and suck on his big dick. The other 4 girls acquaint themselves with the rest of the work crew who waste little time getting things going. Tops start dropping as knees start hitting the deck, as the boys sausages get sucked on. A little pussy gets eaten and a couple ladies grab for more than 1 cock at a time, before the real fun begins. One lady's pussy foams and discharges its German j uices as every hole in the room gets plugged. These Germans aren't shy about sharing things and this group's cocks, asses and pussies are no exception. Cocks make their way in one hole before finding a separate ass or mouth to invade. The guys take turns at every open orifice and spread their DNA throughout the entire site. One girl sucks and gags on a dirty Deutsch dick while another licks a hairy kraut's butt crease clean. Every Deutsch dong heads a little southward as they attack every anus on site. Loads start to fly and scatter about, littering the faces of every whore in the room. Crazy German sex toys, devised from drills, sawzalls and other commercial grade equipment start to twist, spin and pound pussies and shit holes too. Massive excitement ensues, as one girl's ass twists inside out, exposing her huge hemorrhoids as her pussy starts to gush and overflow with squirt. There is something from everyone at Baron Vo n Hardcock's parties, and today is no exception as a few more DPs lead to another group of facial and oral wads busted as every available cum in the room is pooled together on a plate. Now the true sharing begins, as the Bavarian cum platter is passed around and cream is swapped and shared amongst all the ladies. The girls gobble up every last drop off messy German goo globs.&quot;","torrent":{"xt":"urn:btih:c7a0dab1d33cf19edcdfc8e94e9c8b183b6330d6","amp;dn":"German+Orgy+Party+%2A%2ANEW+2014%2A%2A+WEB-DL+MP4-RARBG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a0dab1d33cf19edcdfc8e94e9c8b183b6330d6","infoHashBuffer":{"type":"Buffer","data":[199,160,218,177,211,60,241,158,220,223,200,233,78,156,139,24,59,99,48,214]},"announce":[],"urlList":[]}}