{"title":"Sed_and_Awk_Second_Edition.pdf","uid":7930021,"size":2354334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7ee8a37ad7fc0fabbb353169d38fc9f07aaef2f&amp;dn=Sed_and_Awk_Second_Edition.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"hulkslimg","files":1,"time":1355694200,"description":"Title: sed &amp; awk, 2nd Edition \n\nBy: Dale Dougherty, Arnold Robbins \n\nPrint: March 1997 \n\nEbook: November 2010 \n\nPages: 434\n\nsed &amp; awk describes two text processing programs that are mainstays of the UNIX programmer's toolbox.\n\nsed is a &quot;stream editor&quot; for editing streams of text that might be too large to edit as a single file, or that might be generated on the fly as part of a larger data processing step. The most common operation done with sed is substitution, replacing one block of text with another.\n\nawk is a complete programming language. Unlike many conventional languages, awk is &quot;data driven&quot; -- you specify what kind of data you are interested in and the operations to be performed when that data is found. awk does many things for you, including automatically opening and closing data files, reading records, breaking the records up into fields, and counting the records. While awk provides the features of most conventional programming languages, it also includes some unconventional features, such as extended regular expression matching and associative arrays. sed &amp; awk describes both programs in detail and includes a chapter of example sed and awk scripts.\n\nThis edition covers features of sed and awk that are mandated by the POSIX standard. This most notably affects awk, where POSIX standardized a new variable, CONVFMT, and new functions, toupper() and tolower(). The CONVFMT variable specifies the conversion format to use when converting numbers to strings (awk used to use OFMT for this purpose). The toupper() and tolower() functions each take a (presumably mixed case) string argument and return a new version of the string with all letters translated to the corresponding case.\n\nIn addition, this edition covers GNU sed, newly available since the first edition. It also updates the first edition coverage of Bell Labs nawk and GNU awk (gawk), covers mawk, an additional freely available implementation of awk, and briefly discusses three commercial versions of awk, MKS awk, Thompson Automation awk (tawk), and Videosoft (VSAwk).","torrent":{"xt":"urn:btih:c7ee8a37ad7fc0fabbb353169d38fc9f07aaef2f","amp;dn":"Sed_and_Awk_Second_Edition.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ee8a37ad7fc0fabbb353169d38fc9f07aaef2f","infoHashBuffer":{"type":"Buffer","data":[199,238,138,55,173,127,192,250,187,179,83,22,157,56,252,159,7,170,239,47]},"announce":[],"urlList":[]}}