{"title":"Paradise Road (1997) DVDRip XviD English.avi","uid":6550170,"size":734242816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c800bc80c6ab9a29fb6c4b7d9f28f091a98b59cd&amp;dn=Paradise+Road+%281997%29+DVDRip+XviD+English.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"carabina","files":1,"time":1311051852,"description":"IMBD \nSummary:\nFact-based recounting of a group of women who are imprisoned on the island of Sumatra by the Japanese during World War II and \n\nused music as a relief to their misery.\nThe group of women from different countries and social levels are prisoners in a Japanese concentration camp, where one of them, Adrienne, who is a graduate of the Royal Academy of Music, organizes a vocal band in spite of their guards resistance. \n\nAllmovie Summary:\n\nsynopsis Based on the testimony of survivors, this historical drama recounts the WWII heroism of female prisoners of war. (Glenn Close) stars as Adrienne Partiger, a society doyenne who flees Singapore with other expatriate women, mostly the wives of servicemen, when Japanese forces invade in 1942. When their gunboat is sunk in an air attack, the survivors wash ashore on Japanese-held Sumatra. The women are interned in a grim POW camp where punishments for even minor infractions are extreme. With the help of a missionary (Pauline Collins), Partiger corrals the women, including a tough American (Julianna Margulies), an Australian nurse (Cate Blanchett) and a young wife (Jennifer Ehle) into a musical group. Since singing is not allowed, the a cappella chorus dubs itself &quot;a vocal orchestra&quot; and is tolerated -- if barely -- by their Japanese captors. Though living conditions are squalid, food is scarce, and a thin sliver of soap inspires a shower brawl, the music keeps spirits uplifted and a Jewish-German doctor (Frances McDormand) provides some medical aid. Writer-director Bruce Beresford interviewed real-life participants in similar POW musical groups. Some provided, from memory, sheet music of the pieces they performed, which were used in the film.\n\n\nCast overview : \n Glenn Close ...  Adrienne Pargiter \n Frances McDormand ...  Dr. Verstak \n Pauline Collins ...  Daisy 'Margaret' Drummond \n Cate Blanchett ...  Susan Macarthy \n Jennifer Ehle ...  Rosemary Leighton-Jones \n Julianna Margulies ...  Topsy Merritt \n Wendy Hughes ...  Mrs. Dickson \n Johanna ter Steege ...  Sister Wilhelminia (as Johanna Ter Steege) \n Elizabeth Spriggs ...  Mrs. Roberts   \n\nSize: 734 GB\nVideo Bitrate 727 kbps\n\nRuntime:122 min\nYear: 1997\nDirector: Bruce Beresfeld\n\n0x0055 MPEG-1 Layer 3\n118kbps 2ch VBR 48000Hz\n","torrent":{"xt":"urn:btih:c800bc80c6ab9a29fb6c4b7d9f28f091a98b59cd","amp;dn":"Paradise+Road+%281997%29+DVDRip+XviD+English.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c800bc80c6ab9a29fb6c4b7d9f28f091a98b59cd","infoHashBuffer":{"type":"Buffer","data":[200,0,188,128,198,171,154,41,251,108,75,125,159,40,240,145,169,139,89,205]},"announce":[],"urlList":[]}}