{"title":"Dream On - Aerosmith","uid":8649178,"size":8893346,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c84fd2f9672edfe2f5932899ab7c9998830cdd0d&amp;dn=Dream+On+-+Aerosmith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Lesean13","files":1,"time":1373059598,"description":"&quot;Dream On&quot; is a power ballad by Aerosmith from their 1973 debut album, Aerosmith. Written by lead singer Steven Tyler, this song became their first major hit and classic rock radio staple. Released in June 1973, it peaked at number 59 nationally but hit big in the band's native Boston, where it was the number 1 single of the year on the less commercial top 40 station, WBZ-FM, number 5 for the year on highly rated Top 40 WRKO-AM and number 16 on heritage Top 40 WMEX-AM. The chorus of the song was famously sampled in the 2003 song Sing for the Moment by rapper Eminem. It is also associated with the Boston Red Sox baseball organization and Warner Bros. Entertainment and its divisions (Cartoon Network, DC Comics, Hanna-Barbera and Looney Tunes).\nThe album version of &quot;Dream On&quot; (4:28, as opposed to the 3:25 1973 45rpm edit), was re-issued early in 1976, debuting at number 81 On January 10th, breaking into the Top 40 on February 14th and peaking at number 6 on the Billboard Hot 100 national chart, April 10th. Columbia chose to service Top 40 radio stations with a re-issue of the 3:25 edited version, thus, many 1976 Pop Radio listeners were exposed to the group's first Top 10 effort through the 45 edit.\n&quot;Dream On&quot; was first played live in Mansfield, Connecticut at the Shaboo Inn. In a 2011 interview, Steven Tyler reminisced about his father, a Juilliard-trained musician. He recalled lying beneath his dad's piano as a three-year-old listening to him play classical music. &quot;That's where I got that Dream On chordage,&quot; he said.\nSteven Tyler says that this was the only song on the band's first album where he used his &quot;real&quot; voice. He was insecure about how his voice sounded on tape, so for the other songs, he tried to sing a bit lower and sound more like soul artists, such as James Brown. The song is also famous for its building climax to showcase Tyler's trademark screams.","torrent":{"xt":"urn:btih:c84fd2f9672edfe2f5932899ab7c9998830cdd0d","amp;dn":"Dream+On+-+Aerosmith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84fd2f9672edfe2f5932899ab7c9998830cdd0d","infoHashBuffer":{"type":"Buffer","data":[200,79,210,249,103,46,223,226,245,147,40,153,171,124,153,152,131,12,221,13]},"announce":[],"urlList":[]}}