{"title":"JAMES INGRAM DISCOGRAPHY","uid":7763503,"size":482749468,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c8652b1a820b85aefccdb69ada3fb6c0c1bd9af0&amp;dn=JAMES+INGRAM+DISCOGRAPHY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SAMSON4X","files":141,"time":1351302204,"description":"James Ingram (born February 16, 1952) is an African American singer, record producer, and instrumentalist. He is a two-time Grammy Award-winner and a two-time Academy Award nominee for Best Original Song. Since beginning his career in 1973, Ingram has charted eight U.S. Top 40 hits on the Billboard Hot 100 from the early 1980s until the early 1990s, as well charting with thirteen top 40 hits on the R&amp;B singles chart. He has also amassed two number-one singles on the Hot 100: &quot;Baby, Come to Me&quot; which top the US pop chart in 1983 (a duet with R&amp;B singer Patti Austin) and &quot;I Don't Have the Heart&quot;, which became his second No. 1 in 1990. Ingram co-written &quot;The Day I Fall In Love&quot; (from the motion picture Beethoven's 2nd) and &quot;Look What Love Has Done&quot; (from the motion picture Junior) which has earned him nominations for Best Original Song from the Oscars, Golden Globe and Grammy Awards in 1994 and 1995.\n\nJames Ingram has had quite a music history working with the like of Quincy Jones, Patti Austin, Ray Charles, Natalie Cole, Nancy Wilson, Michael McDonald, Anita Baker to name a few. With such a great voice one would imagine he would have a massive record collection, but alas the VILE MUSIC INDUSTRY wished to capitalize off of him to the point of nearly destroying him so he exited, but still performs on occasions.\n\nHere is a upload of all of James Ingrams albums, I hope you all enjoy\n\nAlbum Portfolio:\n\nJames Ingram - 1983 It's Your Night\nJames Ingram - 1986 It Never Felt So Good\nJames Ingram - 1989 It's Real\nJames Ingram - 1991 The Power Of Great Music\nJames Ingram - 1993 always You\nJames Ingram - Forever More","torrent":{"xt":"urn:btih:c8652b1a820b85aefccdb69ada3fb6c0c1bd9af0","amp;dn":"JAMES+INGRAM+DISCOGRAPHY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8652b1a820b85aefccdb69ada3fb6c0c1bd9af0","infoHashBuffer":{"type":"Buffer","data":[200,101,43,26,130,11,133,174,252,205,182,154,218,63,182,192,193,189,154,240]},"announce":[],"urlList":[]}}