{"title":"Pere Ubu - Lady from Shanghai (2013) [FLAC]","uid":8060768,"size":347463316,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c86f66c97b8eaec28f8038025eee5f8edc1eb7cb&amp;dn=Pere+Ubu+-+Lady+from+Shanghai+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"politux","files":-1,"time":1359060934,"description":"\n  Pere Ubu - Lady from Shanghai (2013) [FLAC]\n\n  Released: 2013\n  Duration: 51:00\n  Genre: Pop/Rock \n  Style: Alternative, Experimental, Post-Punk\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n  \n  01 Thanks\n  02 Free White\n  03 Feuksley Ma'am, the Hearing\n  04 Mandy\n  05 Nothing Happened and Then\n  06 Musicians Are Scum\n  07 Another One (Oh Maybellene)\n  08 The Road Trip of Bipasha Ahmed\n  09 Lampshade Man\n  10 414 Seconds\n  11 Carpenter the Sun\n\n  Thirty-five years after releasing The Modern Dance, Pere Ubu delivered Lady from Shanghai, an album that bandleader David Thomas described as &quot;dance music, fixed.&quot; That's a pretty bold declaration, and almost as attention-getting as the band naming its 2006 album Why I Hate Women (after a fictional novel). Dance music may or may not need fixing, but for a band as dedicated to questioning authority and assumptions as Pere Ubu, even the mindlessness of a hip-shaking beat could become the enemy. While most of Lady from Shanghai's controversy resides in its concept, the results find the band subverting the notion of danceable music in clever ways. \n\n  &quot;Thanks&quot; starts the album by chewing up the melody of Anita Ward's disco classic &quot;Ring My Bell&quot; and spitting it out as &quot;go to hell&quot; as tinny programmed drums make the track as stiff and wintry as possible. The band uses a colder-sounding palette here than it did on Why I Hate Women, but like that album and most of Pere Ubu's work since their early-2000s reboot, Lady from Shanghai finds them looking to their history as much as pushing their legacy forward. \n\nTheir previous album, 2009's Long Live Pere Ubu!, featured songs from their adaptation of Ubu Roi, the 19th century surrealist play by Alfred Jarry that inspired the band's name and outlook. This album doesn't skimp on surrealism either; &quot;And Then Nothing Happened&quot; pairs a snippet of guitar pop with an extended passage of the band's best impersonation of alarm bells. Perhaps perversely, Pere Ubu succeed more when they use dance beats for their own purposes than they do when they try to thwart that power. &quot;Mandy&quot; is the pinnacle of Lady from Shanghai's uneasy listening, where lurid synths, a relentless rhythm, and a clarinet suggest something sinister is happening as Thomas listens to a &quot;crazy jukebox.&quot; On tracks such as this, &quot;Musicians Are Scum&quot; (which nods to the Chambers Brothers' &quot;Time Has Come Today&quot; on its choruses), and the circular nightmare of &quot;414 Seconds,&quot; where Thomas repeatedly wonders &quot;What part of the dream is true/What part of the truth is a dream?,&quot; Pere Ubu provide just enough storytelling dots for listeners to connect them into darkly captivating tales. \n\n  As with Why I Hate Women, Lady from Shanghai also has its share of rambling tracks; aside from the noir-ish &quot;The Road Trip of Bipasha Ahmed,&quot; the collages of murky electronics and fractured rhythms on &quot;The Carpenter Sun&quot; and &quot;Feuksley Ma'am, the Hearing&quot; remain more interesting in theory than in practice. Nevertheless, Lady from Shanghai intrigues more often than not, and shows that Pere Ubu can tap into paranoia, loathing, and the downright weird with nearly as much ease and eloquence as they did almost four decades before.","torrent":{"xt":"urn:btih:c86f66c97b8eaec28f8038025eee5f8edc1eb7cb","amp;dn":"Pere+Ubu+-+Lady+from+Shanghai+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c86f66c97b8eaec28f8038025eee5f8edc1eb7cb","infoHashBuffer":{"type":"Buffer","data":[200,111,102,201,123,142,174,194,143,128,56,2,94,238,95,142,220,30,183,203]},"announce":[],"urlList":[]}}