{"title":"Do Over (2002) VCD - Complete Series","uid":11445435,"size":3417474368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c87cbb892b6769c96762d0a633bf172dde238cd8&amp;dn=Do+Over+%282002%29+VCD+-+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"RainOne","files":-1,"time":1415844691,"description":"The series begins showing an adult Joel Larsen as a single, depressed salesman disappointed with how his life has turned out. Joel missed a lot of opportunities, his once-popular sister is now a drug-addict, his idealistic best friend sold out, and his mother ran off and left his father an unhealthy, bitter man. However, a freak accident sends Joel back to 1981 as a 14-year old. He wakes up in his teenage body, but with all his adult memories from 2002 intact. He eventually accepts this new reality, although he tells no one except his best friend. Blessed with adult wisdom, though hampered by adolescent urges, Joel sets out to right the wrongs that will befall him and his family.\n\nJoel is forced to readjust to the culture of the early 1980s, to junior high, and the tribulations of adolescence. He is forced to relive certain moments of his life, but is always determined to improve the outcome. A running gag in the show is Joel's creative mother coming up with a &quot;new&quot; invention (fanny pack, Lunchables, post-its, etc.) which is usually ridiculed by the father, who instead wants to invest in items such as asbestos tile, Betamax cassettes, or electric typewriters. Some episodes show Joel using his knowledge of the future for personal gain: investing in Intel stock, palming off 1990s song hits as his own, befriending a future billionaire, etc. However, the situations never work out according to plan and Joel usually ends up realizing he needs to use this opportunity to help himself, his family and friends take different paths. The final episode of the series shows Joel convincing his father to invest in one of his mother's inventions, which to Joel's surprise is the one invention that doesn't exist in the future. It ends with Joel and his family toasting the future","torrent":{"xt":"urn:btih:c87cbb892b6769c96762d0a633bf172dde238cd8","amp;dn":"Do+Over+%282002%29+VCD+-+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c87cbb892b6769c96762d0a633bf172dde238cd8","infoHashBuffer":{"type":"Buffer","data":[200,124,187,137,43,103,105,201,103,98,208,166,51,191,23,45,222,35,140,216]},"announce":[],"urlList":[]}}