{"title":"Mastery - Robert Greene (organized audio)","uid":9470960,"size":1396072016,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c89286b3bdfcf83d44ae2e259b8684db574e96d5&amp;dn=Mastery+-+Robert+Greene+%28organized+audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"ps2779","files":-1,"time":1389567895,"description":"The 48 Laws Of Power - Robert Greene\n=========================================================================================\n\nAudiobook:\n\nTitle:     Mastery - Robert Greene\nAuthor:    Robert Greene\nYear:      2012\nPublisher: Penguin Audio\nRead by:   Fred Sanders\nBitrate:   192kbps\nSource:    Audible\nFormat:    MP3\nLanguage:  English\nLength:    16 hours and 9 minutes\nTracks:    94\n\n\n=========================================================================================\n\nI edited the CD files with audio-editing software, and following along with the book, I broke apart the audio file to correlate to the chapters of the book.  In addition, each audio file has the proper track number (in relation to all the tracks), and proper title and chapter information.  \n\nThis makes it MUCH easier to enjoy while listening on a smart phone or other mp3 player, go back and re-listen, or keep track of where you left off.  I figured if I'm going to go through the trouble of properly organizing the files, I may as well share it with the world.  I also included the eBook to follow along with.\n\nNOTE: I had trouble including the accompanying ebook files in the Audio Books category, so I created another torrent file (with similar name).\n\nEnjoy!\n\n=========================================================================================\n\nDESCRIPTION:\n\nThe eagerly anticipated new book from the author of the best-selling The 48 Laws of Power\nWhat did Charles Darwin, middling schoolboy and underachieving second son, do to become one of the earliest and greatest naturalists the world has known? What were the similar choices made by Mozart and by Caesar Rodriguez, the U.S. Air Force's last ace fighter pilot? In Mastery, Robert Greene's fifth book, he mines the biographies of great historical figures for clues about gaining control over our own lives and destinies. Picking up where The 48 Laws of Power left off, Greene culls years of research and original interviews to blend historical anecdote and psychological insight, distilling the universal ingredients of the world's masters.\nTemple Grandin, Martha Graham, Henry Ford, Buckminster Fuller - all have lessons to offer about how the love for doing one thing exceptionally well can lead to mastery. Yet the secret, Greene maintains, is already in our heads. Debunking long-held cultural myths, he demonstrates just how we, as humans, are hardwired for achievement and supremacy. Fans of Greene's earlier work and Malcolm Gladwell's Outliers will eagerly devour this canny and erudite explanation of just what it takes to be great. \n\n=========================================================================================\n\n","torrent":{"xt":"urn:btih:c89286b3bdfcf83d44ae2e259b8684db574e96d5","amp;dn":"Mastery+-+Robert+Greene+%28organized+audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89286b3bdfcf83d44ae2e259b8684db574e96d5","infoHashBuffer":{"type":"Buffer","data":[200,146,134,179,189,252,248,61,68,174,46,37,155,134,132,219,87,78,150,213]},"announce":[],"urlList":[]}}