{"title":"AIAA biggest collection ever!","uid":7265171,"size":459086877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8ad17290fc675cbd97b25da67fff5cfc0236057&amp;dn=AIAA+biggest+collection+ever%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"metheo","files":25,"time":1336860154,"description":"The torrent contains the following books:\n\nAerothermodynamics of Aircraft Engine Components - Gordon C. Oates\n\nAerothermodynamics of Gas Turbine and Rocket Propulsion - Gordon C. Oates\n\nAircraft Design (A Conceptual Approach) - Daniel P. Raymer\n\nAircraft Engine Design - Jack D. Mattingly, William H. Heiser, David T. Pratt\n\nAircraft Landing Gear Design (Principles and Practices) - Norman S. Currey\n\nAircraft Propulsion Systems Technology and Design - Gordon C. Oates\n\nAnalytical Mechanics of Space Systems - Hanspeter Schaub, John L. Junkins\n\nApplied Mathematics in Integrated Navigation Systems - Robert M. Rogers\n\nAvanced Dynamics - Shuh Jing (Benjamin) Ying\n\nBasic MATLAB, Simulink, and Stateflow - Richard Colgren\n\nComposite Materials for Aircraft Structures - Alan Baker, Stuart Dutton, Donald Kelly\n\nDynamics Control and Flying Qualities of VSTOL Aircraft - James A. Franklin\n\nElements Of Propulsion (Gas Turbines and Rockets) - Jack D. Mattingly, Hans Von Ohain\n\nElements of Spacecraft Design - Charles D. Brown\n\nFlight Testing of Fixed Wing Aircraft - Ralph D. Kimberlin\n\nHypersonic Aerothermodynamics - John J. Bertin\n\nHypersonic Airbreathing Propulsion - William H. Heiser, David T. Pratt\n\nIntroduction to Aeronautics (A Design Perspective) - Steven A. Brandt, Randall J. \nStiles\n\nMissile Aerodynamics - Jack N. Nielsen\n\nModeling and Simulation of Aerospace Vehicle Dynamics - Peter H. Zipfel\n\nOrbital Mechanics - Vladimir A. Chobotov\n\nPerformance Stability Dynamics and Control of Airplanes - Bandu N. Pamadi\n\nSpace Vehicle Design - Michael D. Griffin, James R. French\n\nTactical Missile Design - Eugene L. Fleeman\n\nThe Fundamentals of Aircraft Combat Survivability Analysis and Design - Robert E. \nBall\n\nThe collection is far from complete. But it remains the biggest I've come across so far. In case any of you have other books in this series not included in this torrent, please let me know the download link, so that I can update the torrent as well. ","torrent":{"xt":"urn:btih:c8ad17290fc675cbd97b25da67fff5cfc0236057","amp;dn":"AIAA+biggest+collection+ever%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ad17290fc675cbd97b25da67fff5cfc0236057","infoHashBuffer":{"type":"Buffer","data":[200,173,23,41,15,198,117,203,217,123,37,218,103,255,245,207,192,35,96,87]},"announce":[],"urlList":[]}}