{"title":"The Secret [Full Audiobook Unabridged]","uid":4312329,"size":128221141,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c8c3bc59a86d7110ecf2fa68e38718eef389a0c6&amp;dn=The+Secret+%5BFull+Audiobook+Unabridged%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"carlosp51","files":95,"time":1216877821,"description":"The Secret [Full Audiobook Unabridged]\n\nDescription\nAudio Length: 4 hours and 25 min.\nVersion: Unabridged\n\nIt has been passed down through the ages, highly coveted, hidden, lost, stolen, and bought for vast sums of money. Fragments of this Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. It has been understood by some of the most prominent people in history: Plato, Galileo, Beethoven, Edison, Carnegie, and Einstein, along with other renowned inventors, theologians, scientists, and great thinkers.\nFor the first time, all the pieces of the Secret come together in an incredible revelation that will be life transforming for all who experience it.\n\nIn this audiobook you will discover the Secret, and you will learn how to have, do, or be anything you want. You will learn how to use the Secret in every area of your life. You will hear from modern-day teachers - men and women who have used the Secret to achieve health, prosperity, relationships, and happiness. They share their incredible stories of using the Secret to eradicate disease, acquire massive wealth, overcome obstacles, and achieve what many would regard as impossible. Through them, you will begin to understand the hidden, untapped power that is within you, and the true magnificence that awaits you.\n\nExcellent quality rip.","torrent":{"xt":"urn:btih:c8c3bc59a86d7110ecf2fa68e38718eef389a0c6","amp;dn":"The+Secret+%5BFull+Audiobook+Unabridged%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c3bc59a86d7110ecf2fa68e38718eef389a0c6","infoHashBuffer":{"type":"Buffer","data":[200,195,188,89,168,109,113,16,236,242,250,104,227,135,24,238,243,137,160,198]},"announce":[],"urlList":[]}}