{"title":"Stephen R. Covey-The 8th Habit From Effectiveness to Greatnes","uid":14090093,"size":7892155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c925a7499c5ab553787cfe9baca3b5c90390592a&amp;dn=Stephen+R.+Covey-The+8th+Habit+From+Effectiveness+to+Greatnes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":1,"time":1459293032,"description":"In the more than fifteen years since its publication, the classic The 7 Habits of Highly Effective People has become an international phenomenon with over fifteen million copies sold. Tens of millions of people in business, government, schools, and families, and, most important, as individuals have dramatically improved their lives and organisations by applying the principles of Stephen R. Covey's classic book.\r\nThe world, though, is a vastly changed place. The challenges and complexity we all face in our relationships, families, professional lives, and communities are of an entirely new order of magnitude. Being effective as individuals and organisations is no longer merely an option Â— survival in today's world requires it. But in order to thrive, innovate, excel, and lead in what Covey calls the Â”New Knowledge Worker AgeÂ“, we must build on and move beyond effectiveness. The call of this new era in human history is for greatness; it's for fulfillment, passionate execution, and significant contribution.\r\nAccessing the higher levels of human genius and motivation in today's new reality requires a sea change in thinking: a new mind-set, a new skill-set, a new tool-set Â— in short, a whole new habit. The crucial challenge of our world today is this: to find our voice and inspire others to find theirs. It is what Covey calls the 8th Habit.\r\nSo many people feel frustrated, discouraged, unappreciated, and undervalued Â— with little or no sense of voice or unique contribution. The 8th Habit is the answer to the soul's yearning for greatness, the organisation's imperative for significance and superior results, and humanity's search for its Â”voiceÂ“. Profound, compelling, and stunningly timely, this groundbreaking new book of next-level thinking gives a clear way to finally tap the limitless value-creation promise of the Â”Knowledge Worker AgeÂ“. The 8th Habit shows how to solve such common dilemmas asÂž\r\nÂ•People want peace of mind and good relationships, but also want to keep their lifestyle and habits. Â•Relationships are built on trust, but most people think more in terms of Â”meÂ“ Â my wants, my needs, my rights. Â•Management wants more for less; employees want more of Â”what's in it for meÂ“ for less time and effort. Â•Businesses are run by the economic rules of the marketplace; organisations are run by the cultural rules of the workplace. Â•Society operates by its dominant social values, but must live with the consequences of the inviolable operation of natural laws and principles.\r\nCovey's new book will transform the way we think about ourselves and our purpose in life, about our organisations, and about humankind. Just as The 7 Habits of Highly Effective People helped us focus on effectiveness, The 8th Habit shows us the way to greatness","torrent":{"xt":"urn:btih:c925a7499c5ab553787cfe9baca3b5c90390592a","amp;dn":"Stephen+R.+Covey-The+8th+Habit+From+Effectiveness+to+Greatnes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c925a7499c5ab553787cfe9baca3b5c90390592a","infoHashBuffer":{"type":"Buffer","data":[201,37,167,73,156,90,181,83,120,124,254,155,172,163,181,201,3,144,89,42]},"announce":[],"urlList":[]}}