{"title":"Albert Hourani - A History of the Arab Peoples (2005)","uid":8670695,"size":1651371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c963e2753bae99f469031815890db42aef20550b&amp;dn=Albert+Hourani+-+A+History+of+the+Arab+Peoples+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1373490652,"description":"Albert Hourani (updated by Malise Ruthven) - A History of the Arab Peoples (Faber &amp; Faber, 2005).\n\nISBN: 9780571226641 | 592 pages | EPUB\n\n\nA History of the Arab Peoples was an international bestseller on its first publication in 1991 and remains a work of profound and lasting importance.\n\nAlbert Hourani (1915-1993) tells the definitive history of the Arab peoples from the seventh century, when the new religion of Islam began to spread from the Arabian peninsula westwards, to the present day. The book covers not only political history, but also culture, society, economy and thought. It is a masterly distillation of a lifetime of scholarship and a unique insight into a perpetually troubled region.\n\nThis 2005 edition, updated by noted scholar Malise Ruthven, includes the on-going crisis in Iraq, the civil war in Algeria and the aftermath of September 11th.\n\n\nReviews\n\n&quot;This book by one of the most distinguished scholars of the Arab world and the Middle East is a splendid achievement that can be read with profit by rank beginners and jaded specialists. It is, moreover, written with the grace and wisdom that those who know Mr. Hourani's works have come to expect. . . This is history in the grand style.&quot; -- L. Carl Brown, New York Times Book Review\n\n&quot;There is something deeply reassuring and even redemptive about this very fine book. . . It is difficult to overestimate the importance of this book for this time. Here at last is a genuinely readable, genuinely responsive history of the Arabs. . .[Hourani] completely controls the best in modern as well as traditional Western scholarship and often lets the Arabs, their poets, historians, sages and ordinary people speak along with, rather than against, that learning.&quot; -- Edward W. Said, Los Angeles Times Book Review\n\n&quot;[An] elegantly written study. . . [Hourani] delivers a grand story in a deceptively quiet and gentle tone of voice; a vision of the great journey of the Arab peoples.&quot; -- Robert Irwin, Times Literary Supplement\n\n&quot;Mr. Hourani is one of the few scholars capable of writing a worthwhile history of the Arabs from the rise of Islam until the present day in under 600 pages. His treatment is inevitably broad-brush, but never superficial. He covers not only political history but culture, society, economy, and thought; and this distillation of a lifetime's scholarship is the book's greatest virtue.&quot; -- Economist\n\n&quot;This is a brilliant book, perhaps a landmark. It radiates the penetrating light of Albert Hourani's massive erudition upon what he calls the 'deeply disturbed societies' of the Arab world. . . Hourani is able to explain, concisely, matters of surpassing difficulty which must be understood in order to make sense of contemporary events. . . [A] rich and often gripping book.&quot; -- Thomas W. Lippman, Washington Post Book World\n","torrent":{"xt":"urn:btih:c963e2753bae99f469031815890db42aef20550b","amp;dn":"Albert+Hourani+-+A+History+of+the+Arab+Peoples+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c963e2753bae99f469031815890db42aef20550b","infoHashBuffer":{"type":"Buffer","data":[201,99,226,117,59,174,153,244,105,3,24,21,137,13,180,42,239,32,85,11]},"announce":[],"urlList":[]}}