{"title":"Unconditional Love (2012) (UK) Gay Interest","uid":9449822,"size":977352628,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9718cf481f3c15555f8d5b37b2822b6841cfe5f&amp;dn=Unconditional+Love+%282012%29+%28UK%29+Gay+Interest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":4,"time":1389158560,"description":"\t&quot;Unconditional Love&quot;, aka &quot;Unconditional&quot;, presents the intense story of a severely repressed homosexual attempting to create his fantasy woman from an inexperienced, virgin, teenage boy.  Seventeen year old Owen meets the slightly older Liam and becomes dazzled by his attention, fast car, money, and large personality.  After an evening drinking and fearful of being rejected by his new friend, Owen allows Liam to dress and make him up as a woman.  Liam then convinces Owen to go out on the town as the newly created &quot;Kristen&quot;.  \n\tAfterwards, Owen attempts to distance himself from Liam, but Liam's threat to disappear for good and his own immaturity cause Owen to reconsider.  From this point forward, Liam's fantasy becomes the driving force in their relationship.  As the fantasy persists, it grows and becomes fragile.  It threatens to crush both of them as Liam spirals closer and closer to homicidal rage because the fantasy fails to transcend to reality, and as Owen struggles to come to terms with burgeoning sexuality and personality before he loses everything.\n\tI have not been so engaged by a psycho-drama in a very long time.  I am amazed at the quality of this gay-themed film as most suffer from the dreaded &quot;writer as director&quot; or a miniscule budget that mandates starving artists.  This film exceeded every expectation I had.  Every actor hit every mark, every scene moved the action forward, and the whole exceeded the sum of its parts.  Harry McEntire as &quot;Owen&quot; and Christian Cooke as &quot;Liam&quot; gave performances way beyond their years and carried the film beautifully.  I can't wait to see them in the future.  Definitely worth going out of your way to see this film.\n\n","torrent":{"xt":"urn:btih:c9718cf481f3c15555f8d5b37b2822b6841cfe5f","amp;dn":"Unconditional+Love+%282012%29+%28UK%29+Gay+Interest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9718cf481f3c15555f8d5b37b2822b6841cfe5f","infoHashBuffer":{"type":"Buffer","data":[201,113,140,244,129,243,193,85,85,248,213,179,123,40,34,182,132,28,254,95]},"announce":[],"urlList":[]}}