{"title":"[ExploitedCollegeGirls] Anastasia (02.05.2015)","uid":11683313,"size":659114789,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ca37bb4f70cd6d3e0553f51c956d88f7b12b7356&amp;dn=%5BExploitedCollegeGirls%5D+Anastasia+%2802.05.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"chkm8te","files":1,"time":1423197383,"description":"[ExploitedCollegeGirls] Anastasia (02.05.2015)\n\nBetween her taut teenage body, cute blue eyes, perfect C cups and curvy little handful of ass what could be wrong with 19 year old Anastasia? Nothing, really. That is if you ignore her old lady hair and freshman-like blowjob skills, of course. From the start of this update Ana seems shy and slightly nervous, but it doesn't stop her from performing. She's very comfortable with her sexuality and totally comfortable in front of the camera and it shows.\nAs usual, we start off in the bathroom where, after Jay lifts her skirt for a peek, Ana confesses that she never wears panties. While applying her make up she admits that while she's had some experience, she hasn't had any really good sex and finds it hard to orgasm. Fortunately for her (and you) Jay's an expert at tough cases and Ana is a problem that seems worth solving.\nAfter getting Anastasia naked and posed, Jay goes to work using a few tricks from his well worn copy of 'Fingerbanging for Dummies' and in no time Ana is panting and shuddering to a huge full body orgasm. As a thank you to Jay she gets to the floor to suck his cock and, well that happens. Jay doesn't seem especially impressed but Ana enjoyed herself and is ready to get fucked. As soon as Jay starts, she seems to realize that every other guy she's banged had no idea what he was doing because she completely loses herself in the sex and before long is orgasming a second time.\nAfter making sure Anastasia is completely satisfied, Jay has her get to her knees for the big finish. Sometimes 'big' might be hyperbolic, but today's money shot definitely has a few more zeros than normal. Jay covers Ana's face, tits and legs in jizz while aiming for her open, waiting mouth. What a good girl.\nNow yes, a mean guy could say that Anastasia is at best a solid 7. But this girl is a trip to Toni and Guy away from being very cute. And with those tits and that ass? If she spends a few hours going back over old Ex Co Gi updates to learn some beej technique she could have a very promising career in porn or, you know, make some dude very happy.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8a37gfqm23lm6ctxzic3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8a37gfqm23lm6ctxzic3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5zl7okoo1tspacuqwexx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5zl7okoo1tspacuqwexx.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ca37bb4f70cd6d3e0553f51c956d88f7b12b7356","amp;dn":"%5BExploitedCollegeGirls%5D+Anastasia+%2802.05.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca37bb4f70cd6d3e0553f51c956d88f7b12b7356","infoHashBuffer":{"type":"Buffer","data":[202,55,187,79,112,205,109,62,5,83,245,28,149,109,136,247,177,43,115,86]},"announce":[],"urlList":[]}}