{"title":"Faan se Trein 2013 DVDrip Afrikaans","uid":9997411,"size":1508078682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ca6088229031bf2caa344529012421d1984f285e&amp;dn=Faan+se+Trein+2013+DVDrip+Afrikaans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":6,"uploader":"raaiwie","files":2,"time":1397936745,"description":"Faan (Willie Esterhuizen) lives in a small Karoo town with his father, and his housekeeper, Truia (Anel Alexander). He's a little slow and a little confused a lot of the time, but for the most part he's harmless, except when he's being teased by the local school boys, which seems to be happening more and more frequently. During the last teasing episode Faan accidentally runs into the Doctor's (Deon Lotz) wife, Beatrice (Nicola Hanekom), a woman who was raised in Pretoria, but now lives in this one horse town because of a secret she and her husband have to hide. This confrontation between Faan and Beatrice causes Faan to become very interested in Beatrice, especially when her blouse rips during the encounter. Beatrice has no interest in even knowing this individual exists, until she discovers that he, along with his father, own some antiques that were passed down from father to son for years, including a very valuable violin, so starts her plan to get her hands on the goods, manipulating the simple minded fellow to do her will.","torrent":{"xt":"urn:btih:ca6088229031bf2caa344529012421d1984f285e","amp;dn":"Faan+se+Trein+2013+DVDrip+Afrikaans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6088229031bf2caa344529012421d1984f285e","infoHashBuffer":{"type":"Buffer","data":[202,96,136,34,144,49,191,44,170,52,69,41,1,36,33,209,152,79,40,94]},"announce":[],"urlList":[]}}