{"title":"Gladys Knight &amp; The Pips-The Definitive Collection-2009","uid":4680417,"size":93546795,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca6babbed49294b7ddda612ee44fbe74f1adc52e&amp;dn=Gladys+Knight+%26+The+Pips-The+Definitive+Collection-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1233052691,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nGladys Knight &amp; the Pips were an R&amp;B/soul musical act from Atlanta, Georgia, active from 1953 to 1989. The group was best known for their string of hit singles from 1967 to 1975, including &quot;I Heard It Through the Grapevine&quot; (1967) and &quot;Midnight Train to Georgia&quot; (1973). The longest-lived incarnation of the act featured Gladys Knight on lead vocals, with The Pips, who included her brother Merald &quot;Bubba&quot; Knight and their cousins Edward Patten and William Guest, as backup singers.\nAt the age of seven in 1952, Gladys Knight won Ted Mack's Original Amateur Hour television show contest. The following year, she, her brother Bubba, sister Brenda, and their cousins William and Eleanor Guest started a singing group called &quot;The Pips&quot; (named after another cousin, James &quot;Pip&quot; Woods). The Pips began to perform and tour, eventually replacing Brenda Knight and Eleanor Guest with cousins Langston George and Edward Patten in 1959.\nThe Pips scored their first hit in 1961 with &quot;Every Beat of My Heart&quot;, a cover of a Hank Ballard &amp; The Midnighters song. The group had recorded the song for a friend in Atlanta, who promptly sold the master to Vee-Jay Records and cut the group out of the record's profits. The Pips recorded a second version of &quot;Every Beat&quot; with Bobby Robinson as the producer, and the song became a #1 R&amp;B and #6 pop hit. Shortly afterwards, Langston George left the group, and the remaining members continued as a quartet, now billed as Gladys Knight &amp; the Pips. Typically, most of the act's recordings featured Knight's contralto on lead vocals and the three male members of the group, usually referred to as &quot;The Pips&quot; by themselves, providing characteristic background vocals.\nAfter a second Vee-Jay hit, &quot;Letter Full of Tears&quot;, in 1962, Knight quit the group to start a family with husband James Newman, giving birth to James Gaston Newman III in August of that year. Her second child Kenya Maria Newman was born in November the following year. The Pips toured on their own for two years, until Knight returned to the act in 1964 in order to support her two children.\nThe group developed a reputation for exciting and polished live performances that enabled them to work even without the benefit of best-selling records. Choreographer Cholly Atkins designed &quot;fast-stepping&quot; dance routines that became a signature of the Pips' stage presentation.\nGladys Knight &amp; the Pips' Motown long-playing debut, Everybody Needs Love (1967), which includes their hit single &quot;I Heard It Through the Grapevine&quot;. \nIn spite of another hit with 1964's &quot;Giving Up&quot; (later covered by Donny Hathaway), Knight and the Pips did not achieve widespread success until 1966, after signing to Motown. While at Motown in 1968, Gladys Knight was the first person to suggest that Berry Gordy sign an up-and-coming act from Gary, Indiana called The Jackson 5.\nThe group's third Motown single was the Top 40 hit &quot;Everybody Needs Love&quot;, released in 1967. Another 1967 single, &quot;I Heard It Through the Grapevine&quot;, provided a career-making breakthrough. &quot;Grapevine&quot; became a #2 pop hit on the Billboard Hot 100 and a #1 R&amp;B hit for six weeks. The record sold 2.5 million copies, and at the time was Motown's best-selling single ever [1]. Producer Norman Whitfield recorded four versions of the song with various artists for potential single release; Knight and the Pips' version was the only one that Motown chief Berry Gordy did not veto. In late 1968, &quot;Grapevine&quot; would become an even bigger hit for Marvin Gaye, whose version, recorded before Knight's but released a year afterwards at Whitfield's insistence, became a #1 pop hit for seven weeks.\nFurther hits for the group included &quot;The Nitty Gritty&quot; (1968), &quot;Friendship Train&quot; (1969), one of Norman Whitfield and Barrett Strong's &quot;psychedelic soul&quot; songs, the #1 R&amp;B &quot;If I Were Your Woman&quot; (1970, later covered by Stephanie Mills, Shanice and Alicia Keys), and &quot;I Don't Want To Do Wrong&quot; (1971). Their biggest Motown hit was 1972's #1 R&amp;B/#2 pop hit &quot;Neither One of Us (Wants to Be the First to Say Goodbye)&quot;, which won the 1973 Grammy Award for Best Pop Vocal Performance By A Duo, Group Or Chorus.\n&quot;Neither One of Us&quot; also happened to be one of their last Motown hits, as Knight and the Pips departed Motown for Buddah Records in 1973. While at Motown, Knight &amp; the Pips recorded for Soul Records, a label Motown used for acts that recorded material with more of an R&amp;B flavor than a pop flavor. On the A&amp;E Network television program Biography, Knight stated that she and the Pips were regarded as a second-string act, and that &quot;Diana [Ross] &amp; the Supremes, The Temptations, and Marvin Gaye were given all the hits, while we took the leftovers.&quot; In Knight's autobiography Between Each Line of Pain and Glory: My Life Story, she stated that Diana Ross had the group removed from being The Supremes' opening act on a 1968 tour for, according to Knight, being too good.\nMany of Gladys Knight and the Pips' hits in the mid-1970s were written by country songwriter Jim Weatherly. Knight and the Pips charted with five of Weatherly's songs in 1973 and 1974: &quot;Midnight Train to Georgia,&quot; &quot;Neither One of Us,&quot; &quot;Where Peaceful Waters Flow,&quot; &quot;The Best Thing That Ever Happened to Me,&quot; and &quot;Between Her Goodbye and My Hello.&quot; Weatherly had several hits of his own, the biggest of which was &quot;The Need to Be&quot; in 1974, and also wrote country hits for Ray Price, Glen Campbell and Bryan White among others.\n\n","torrent":{"xt":"urn:btih:ca6babbed49294b7ddda612ee44fbe74f1adc52e","amp;dn":"Gladys+Knight+%26+The+Pips-The+Definitive+Collection-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6babbed49294b7ddda612ee44fbe74f1adc52e","infoHashBuffer":{"type":"Buffer","data":[202,107,171,190,212,146,148,183,221,218,97,46,228,79,190,116,241,173,197,46]},"announce":[],"urlList":[]}}