{"title":"OPEN MIND with Bill Jenkins - Rare MP3 Collection - for Coast to","uid":4216847,"size":875637758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca9473ddf6587d07fd6163cca4827f2a9d6b3b6d&amp;dn=OPEN+MIND+with+Bill+Jenkins+-+Rare+MP3+Collection+-+for+Coast+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"eastern876","files":223,"time":1212392940,"description":"KABC &quot;OPEN MIND&quot; WITH BILL JENKINS\nRARE MP3 AUDIO LIBRARY\n\nIn the 1980s, radio station KABC carried the ground-breaking radio program &quot;OPEN MIND&quot; with host Bill Jenkins.   The subject matter covered included UFOs, alternative energy, spirituality, ancient religions, and more.   Bill Jenkins later went on to host the classic film &quot;THE NAKED TRUTH&quot; with Jordan Maxwell, upon which the current internet hit &quot;ZEITGEIST&quot; is based.\n\nThe &quot;Open Mind&quot; radio programs have not been heard in many years ... until now.   We recently came into possession of a large collection of cassette tape recordings which had been made by a loyal listener, and had them digitized into MP3s.  This is a priceless collection of otherwise unattainable radio programs.   It is being freely shared here in an effort to make sure it is not lost to  history.\n\nAnyone who listens to Coast to Coast AM with George Noory and Art Bell, Jeff Rense, Red Ice Creations, the Freeman Perspective, or other similar programs will derive many hours of enjoyment from this extremely rare library of audio recordings.\n\nPLEASE help me to SHARE IT by leaving your BitTorrent program open and CONTINUING TO SEED after your download is complete!   I can&amp;#039;t do it all by myself. \n\nThis collection includes the following recordings:\n\nAndrija Puharich, M.D. - ELF Problem - 1 of 4\t\t\t\nAndrija Puharich, M.D. - ELF Problem - 2 of 4\t\t\t\nAndrija Puharich, M.D. - ELF Problem - 3 of 4\t\t\t\nAndrija Puharich, M.D. - ELF Problem - 4 of 4\t\t\t\nBill Jenkins - Past Life Therapy - 1 of 2\t\t\t\nBill Jenkins - Past Life Therapy - 2 of 2\t\t\t\nBill Moore - Roswell Crash, Phila Experiment - 1 of 4\t\t\t\nBill Moore - Roswell Crash, Phila Experiment - 2 of 4\t\t\t\nBill Moore - Roswell Crash, Phila Experiment - 3 of 4\t\t\t\nBill Moore - Roswell Crash, Phila Experiment - 4 of 4\t\t\t\nBill Moore - UFO Report - 1 of 2\t\t\t\nBill Moore - UFO Report - 2 of 2\t\t\t\nBill Spaulding - UFO Groundwatch - 1 of 2\t\t\t\nBill Spaulding - UFO Groundwatch - 2 of 2\t\t\t\nBob Goldka - Nicola Tesla - 1 of 2\t\t\t\nBob Goldka - Nicola Tesla - 2 of 2\t\t\t\nCarey Williams - Reincarnation - 1 of 4\t\t\t\nCarey Williams - Reincarnation - 2 of 4\t\t\t\nCarey Williams - Reincarnation - 3 of 4\t\t\t\nCarey Williams - Reincarnation - 4 of 4\t\t\t\nDale Walker - Crystal Skulls and Pictures Inside - 1 of 4\t\t\t\nDale Walker - Crystal Skulls and Pictures Inside - 2 of 4\t\t\t\nDale Walker - Crystal Skulls and Pictures Inside - 3 of 4\t\t\t\nDale Walker - Crystal Skulls and Pictures Inside - 4 of 4\t\t\t\nDianne Morrisey - Near Death Studies - 1 of 4\t\t\t\nDianne Morrisey - Near Death Studies - 2 of 4\t\t\t\nDianne Morrisey - Near Death Studies - 3 of 4\t\t\t\nDianne Morrisey - Near Death Studies - 4 of 4\t\t\t\nDianne Morrisey - OBEs, NDEs - 1 of 2\t\t\t\nDianne Morrisey - OBEs, NDEs - 2 of 2\t\t\t\nDr. Arthur Bernard - Dreams - 1 of 4\t\t\t\nDr. Arthur Bernard - Dreams - 2 of 4\t\t\t\nDr. Arthur Bernard - Dreams - 3 of 4\t\t\t\nDr. Arthur Bernard - Dreams - 4 of 4\t\t\t\nDr. Caragula - Thru the Curtain - Special Abilities of People - 1 of 2\t\t\nDr. Caragula - Thru the Curtain - Special Abilities of People - 2 of 2\t\t\nDr. George Meek - Voices from the Other Side - 1 of 2\t\t\t\nDr. George Meek - Voices from the Other Side - 2 of 2\t\nDr. Larry Boron - New Physics 1983 - 1 of 2\t\t\t\nDr. Larry Boron - New Physics 1983 - 2 of 2\t\nDr. Larry Boron - New Physics 1984 - 1 of 2\t\t\t\nDr. Larry Boron - New Physics 1984 - 2 of 2\t\t\t\nDr. Larry Boron, Grace Cronie - New Physics, Hypnotic Regression - 1 of 2\t\nDr. Larry Boron, Grace Cronie - New Physics, Hypnotic Regression - 2 of 2\nDr. Marcel Vogel - Crystal Healing, Mind Power - 1 of 4\t\t\t\nDr. Marcel Vogel - Crystal Healing, Mind Power - 2 of 4\t\t\t\nDr. Marcel Vogel - Crystal Healing, Mind Power - 3 of 4\t\t\t\nDr. Marcel Vogel - Crystal Healing, Mind Power - 4 of 4\t\t\t\nDr. Patrick Flanagan, Lee Holloway - Astrology, Energized Water, Air - 1 of 4\t\nDr. Patrick Flanagan, Lee Holloway - Astrology, Energized Water, Air - 2 of 4\t\nDr. Patrick Flanagan, Lee Holloway - Astrology, Energized Water, Air - 3 of 4\t\nDr. Patrick Flanagan, Lee Holloway - Astrology, Energized Water, Air - 4 of 4\t\nDr. Patrick Flannigan - Pyramid Power, Neurophone - 1 of 4\t\t\t\nDr. Patrick Flannigan - Pyramid Power, Neurophone - 2 of 4\t\t\t\nDr. Patrick Flannigan - Pyramid Power, Neurophone - 3 of 4\t\t\t\nDr. Patrick Flannigan - Pyramid Power, Neurophone - 4 of 4\t\t\t\nDr. Philip Berg - Kabala, Hidden Message in Scripture - 1 of 4\t\t\t\nDr. Philip Berg - Kabala, Hidden Message in Scripture - 2 of 4\t\t\t\nDr. Philip Berg - Kabala, Hidden Message in Scripture - 3 of 4\t\t\t\nDr. Philip Berg - Kabala, Hidden Message in Scripture - 4 of 4\t\t\t\nDr. Robert Beck - ELF Mind Control - 1 of 3\t\t\t\nDr. Robert Beck - ELF Mind Control - 2 of 3\t\t\t\nDr. Robert Beck - ELF Mind Control - 3 of 3\t\t\t\nDr. Robert Beck - Psychotronics - 1 of 4\t\t\t\nDr. Robert Beck - Psychotronics - 2 of 4\t\t\t\nDr. Robert Beck - Psychotronics - 3 of 4\t\t\t\nDr. Robert Beck - Psychotronics - 4 of 4\t\t\t\nDr. Russel Targ, Charles Tart - The Mind Race, Psychic Research - 1 of 4\t\nDr. Russel Targ, Charles Tart - The Mind Race, Psychic Research - 2 of 4\t\nDr. Russel Targ, Charles Tart - The Mind Race, Psychic Research - 3 of 4\t\nDr. Russel Targ, Charles Tart - The Mind Race, Psychic Research - 4 of 4\t\nDrs. Lee and Vivian Gladden - Threshold of Immortality - 1 of 4\t\t\t\nDrs. Lee and Vivian Gladden - Threshold of Immortality - 2 of 4\t\t\t\nDrs. Lee and Vivian Gladden - Threshold of Immortality - 3 of 4\t\t\t\nDrs. Lee and Vivian Gladden - Threshold of Immortality - 4 of 4\t\t\t\nDrs. Lee, Vivian Gladden - Heirs of the Gods - 1 of 4\t\t\t\nDrs. Lee, Vivian Gladden - Heirs of the Gods - 2 of 4\t\t\t\nDrs. Lee, Vivian Gladden - Heirs of the Gods - 3 of 4\t\t\t\nDrs. Lee, Vivian Gladden - Heirs of the Gods - 4 of 4\t\t\t\nDrs. Lee, Vivian Gladden - Linguistic Archaeology of Bible - 1 of 4\t\nDrs. Lee, Vivian Gladden - Linguistic Archaeology of Bible - 2 of 4\nDrs. Lee, Vivian Gladden - Linguistic Archaeology of Bible - 3 of 4\t\t\nDrs. Lee, Vivian Gladden - Linguistic Archaeology of Bible - 4 of 4\t\t\nDrs. Russ Targ, Judith Orloff - Remote Viewing - 1 of 4\t\t\t\nDrs. Russ Targ, Judith Orloff - Remote Viewing - 2 of 4\t\t\t\nDrs. Russ Targ, Judith Orloff - Remote Viewing - 3 of 4\t\t\t\nDrs. Russ Targ, Judith Orloff - Remote Viewing - 4 of 4\t\t\t\nDrs. Valerie Hunt, Bob Beck - Aura and Electronic Healing - 1 of 3\t\t\nDrs. Valerie Hunt, Bob Beck - Aura and Electronic Healing - 2 of 3\t\t\nDrs. Valerie Hunt, Bob Beck - Aura and Electronic Healing - 3 of 3\t\t\nEdwin Slade - Alien UFOs - 1 of 4\t\t\t\nEdwin Slade - Alien UFOs - 2 of 4\t\t\t\nEdwin Slade - Alien UFOs - 3 of 4\t\t\t\nEdwin Slade - Alien UFOs - 4 of 4\t\t\t\nEdwin Slade - History of UFOs - 1 of 2\t\t\t\nEdwin Slade - History of UFOs - 2 of 2\t\t\t\nEdwin Slade - The UFO Message - 1 of 4\t\t\t\nEdwin Slade - The UFO Message - 2 of 4\t\t\t\nEdwin Slade - The UFO Message - 3 of 4\t\t\t\nEdwin Slade - The UFO Message - 4 of 4\t\t\t\nELF Problem_ALBW\t\t\t\nFred Steckling - Alien Bases on the Moon 1982 - 1 of 2\t\t\t\nFred Steckling - Alien Bases on the Moon 1982 - 2 of 2\t\t\t\nFred Steckling - Alien Bases on the Moon 1983 - 1 of 2\t\t\t\nFred Steckling - Alien Bases on the Moon 1983 - 2 of 2\t\t\t\nGeorge Green, Jason Rand, Deforrest Kelly - UFO Update - 1 of 4\t\t\t\nGeorge Green, Jason Rand, Deforrest Kelly - UFO Update - 2 of 4\t\t\t\nGeorge Green, Jason Rand, Deforrest Kelly - UFO Update - 3 of 4\t\t\t\nGeorge Green, Jason Rand, Deforrest Kelly - UFO Update - 4 of 4\t\t\t\nGeorge Green, Wendelle Stevens - UFOs - 1 of 4\t\t\t\nGeorge Green, Wendelle Stevens - UFOs - 2 of 4\t\t\t\nGeorge Green, Wendelle Stevens - UFOs - 3 of 4\t\t\t\nGeorge Green, Wendelle Stevens - UFOs - 4 of 4\t\t\t\nGreta Woodrew - Aliens, Star Foundation - 1 of 4\t\t\t\nGreta Woodrew - Aliens, Star Foundation - 2 of 4\t\t\t\nGreta Woodrew - Aliens, Star Foundation - 3 of 4\t\t\t\nGreta Woodrew - Aliens, Star Foundation - 4 of 4\t\t\t\nGreta Woodrew - Thunder on a Clear Day - 1 of 4\t\t\t\nGreta Woodrew - Thunder on a Clear Day - 2 of 4\t\t\t\nGreta Woodrew - Thunder on a Clear Day - 3 of 4\t\t\t\nGreta Woodrew - Thunder on a Clear Day - 4 of 4\t\t\t\nJerry Gross - Astral Projection - 1 of 3\t\t\t\nJerry Gross - Astral Projection - 2 of 3\t\t\t\nJerry Gross - Astral Projection - 3 of 3\t\t\t\nJerry Gross - Astral Travel - 1 of 2\t\t\t\nJerry Gross - Astral Travel - 2 of 2\t\t\t\nJerry Gross - Astral Travel, OBEs - 1 of 4\t\t\t\nJerry Gross - Astral Travel, OBEs - 2 of 4\t\t\t\nJerry Gross - Astral Travel, OBEs - 3 of 4\t\t\t\nJerry Gross - Astral Travel, OBEs - 4 of 4\t\t\t\nJoe Newman - Free Energy Machine - 1 of 4\t\t\t\nJoe Newman - Free Energy Machine - 2 of 4\t\t\t\nJoe Newman - Free Energy Machine - 3 of 4\t\t\t\nJoe Newman - Free Energy Machine - 4 of 4\t\t\t\nJohn Bedini, Tom Bearden - Free Energy for All - 1 of 4\t\t\t\nJohn Bedini, Tom Bearden - Free Energy for All - 2 of 4\t\t\t\nJohn Bedini, Tom Bearden - Free Energy for All - 3 of 4\t\t\t\nJohn Bedini, Tom Bearden - Free Energy for All - 4 of 4\t\t\t\nJohn Bedini, Tom Bearden - Weather War, Free Energy Device Duplicated - 1 of 4\nJohn Bedini, Tom Bearden - Weather War, Free Energy Device Duplicated - 2 of 4\nJohn Bedini, Tom Bearden - Weather War, Free Energy Device Duplicated - 3 of 4\nJohn Bedini, Tom Bearden - Weather War, Free Energy Device Duplicated - 4 of 4\nJohn Bedini, Tom Bearden, Robert Beck, Steve Werth - Free and Negative Energy - 1 of 4\t\t\t\nJohn Bedini, Tom Bearden, Robert Beck, Steve Werth - Free and Negative Energy - 2 of 4\t\t\t\nJohn Bedini, Tom Bearden, Robert Beck, Steve Werth - Free and Negative Energy - 3 of 4\t\t\t\nJohn Bedini, Tom Bearden, Robert Beck, Steve Werth - Free and Negative Energy - 4 of 4\t\t\t\nJohn de Herrera - UFOs - 1 of 4\t\t\t\nJohn de Herrera - UFOs - 2 of 4\t\t\t\nJohn de Herrera - UFOs - 3 of 4\t\t\t\nJohn de Herrera - UFOs - 4 of 4\t\t\t\nLarry Faucett - UFO Coverup Clear Intent - 1 of 4\t\t\t\nLarry Faucett - UFO Coverup Clear Intent - 2 of 4\t\t\t\nLarry Faucett - UFO Coverup Clear Intent - 3 of 4\t\t\t\nLarry Faucett - UFO Coverup Clear Intent - 4 of 4\t\t\t\nLee Elders - Billy Meier UFO Case - 1 of 4\t\t\t\nLee Elders - Billy Meier UFO Case - 2 of 4\t\t\t\nLee Elders - Billy Meier UFO Case - 3 of 4\t\t\t\nLee Elders - Billy Meier UFO Case - 4 of 4\t\t\t\nLeonard Stringfield - Crashed UFOs - 1 of 5\t\t\t\nLeonard Stringfield - Crashed UFOs - 2 of 5\t\t\t\nLeonard Stringfield - Crashed UFOs - 3 of 5\t\t\t\nLeonard Stringfield - Crashed UFOs - 4 of 5\t\t\t\nLeonard Stringfield - Crashed UFOs - 5 of 5\t\t\t\nLeonard Stringfield - Crashed UFOs Again - 1 of 2\t\t\t\nLeonard Stringfield - Crashed UFOs Again - 2 of 2\t\t\t\nLiz McAdams, Ray Bayles - Parapsychology - 1 of 4\t\t\t\nLiz McAdams, Ray Bayles - Parapsychology - 2 of 4\t\t\t\nLiz McAdams, Ray Bayles - Parapsychology - 3 of 4\t\t\t\nLiz McAdams, Ray Bayles - Parapsychology - 4 of 4\t\t\t\nMarcel Vogel - Crystals, New Age Healing - 1 of 4\t\t\t\nMarcel Vogel - Crystals, New Age Healing - 2 of 4\t\t\t\nMarcel Vogel - Crystals, New Age Healing - 3 of 4\t\t\t\nMarcel Vogel - Crystals, New Age Healing - 4 of 4\t\t\t\nMaster Ho - Crystals - 1 of 4\t\t\t\nMaster Ho - Crystals - 2 of 4\t\t\t\nMaster Ho - Crystals - 3 of 4\t\t\t\nMaster Ho - Crystals - 4 of 4\t\t\t\nNick Nosoreno - Mitchell-Hedges Crystal Skull Shows Past Events - 1 of 4\t\nNick Nosoreno - Mitchell-Hedges Crystal Skull Shows Past Events - 2 of 4\t\nNick Nosoreno - Mitchell-Hedges Crystal Skull Shows Past Events - 3 of 4\t\nNick Nosoreno - Mitchell-Hedges Crystal Skull Shows Past Events - 4 of 4\t\nNick Nosoreno, Swift Deer - Crystal Skull, Star People - 1 of 4\t\t\t\nNick Nosoreno, Swift Deer - Crystal Skull, Star People - 2 of 4\t\t\t\nNick Nosoreno, Swift Deer - Crystal Skull, Star People - 3 of 4\t\t\t\nNick Nosoreno, Swift Deer - Crystal Skull, Star People - 4 of 4\t\t\t\nOpen Forum - ELF Waves - 1 of 2\t\t\t\nOpen Forum - ELF Waves - 2 of 2\t\t\t\nPeter Hurkos - Master Psychic - 1 of 4\t\t\t\nPeter Hurkos - Master Psychic - 2 of 4\t\t\t\nPeter Hurkos - Master Psychic - 3 of 4\t\t\t\nPeter Hurkos - Master Psychic - 4 of 4\t\t\t\nPeter Manors, M.D. - Healing With Light, Sound - 1 of 4\t\t\t\nPeter Manors, M.D. - Healing With Light, Sound - 2 of 4\t\t\t\nPeter Manors, M.D. - Healing With Light, Sound - 3 of 4\t\t\t\nPeter Manors, M.D. - Healing With Light, Sound - 4 of 4\t\t\t\nRobert Monroe - Far Journeys - OBEs - 1 of 4\t\t\t\nRobert Monroe - Far Journeys - OBEs - 2 of 4\t\t\t\nRobert Monroe - Far Journeys - OBEs - 3 of 4\t\t\t\nRobert Monroe - Far Journeys - OBEs - 4 of 4\t\t\t\nRobert Monroe - Journeys Out of Body - 1 of 2\t\t\t\nRobert Monroe - Journeys Out of Body - 2 of 2\t\t\t\nRobert Monroe - Out of Body Travel - 1 of 4\t\t\t\nRobert Monroe - Out of Body Travel - 2 of 4\t\t\t\nRobert Monroe - Out of Body Travel - 3 of 4\t\t\t\nRobert Monroe - Out of Body Travel - 4 of 4\t\t\t\nRoyal Rife - Killing Virii With HF Waves - 1 of 4\t\t\t\nRoyal Rife - Killing Virii With HF Waves - 2 of 4\t\t\t\nRoyal Rife - Killing Virii With HF Waves - 3 of 4\t\t\t\nRoyal Rife - Killing Virii With HF Waves - 4 of 4\t\t\t\nTom Bearden - Weather Modification by Scalar Waves - 1 of 2\t\t\t\nTom Bearden - Weather Modification by Scalar Waves - 2 of 2\t\t\t\nTom Bearden - Weather War - 1 of 4\t\t\t\nTom Bearden - Weather War - 2 of 4\t\t\t\nTom Bearden - Weather War - 3 of 4\t\t\t\nTom Bearden - Weather War - 4 of 4\t\t\t\nTom Bearden, John Bedini, Ike Muller, Steve Werth - Free Energy - 1 of 3\t\nTom Bearden, John Bedini, Ike Muller, Steve Werth - Free Energy - 2 of 3\t\nTom Bearden, John Bedini, Ike Muller, Steve Werth - Free Energy - 3 of 3\t\nZecharia Sitchin - Sumer and The 12th Planet - 1 of 4\t\t\t\nZecharia Sitchin - Sumer and The 12th Planet - 2 of 4\t\t\t\nZecharia Sitchin - Sumer and The 12th Planet - 3 of 4\t\t\t\nZecharia Sitchin - Sumer and The 12th Planet - 4 of 4\n\n---\nKeywords for internet search engines: KABC Open Mind Bill Jenkins Derek Partridge Jordan Maxwell The Naked Truth 2012 metaphysics aliens military abductions milabs","torrent":{"xt":"urn:btih:ca9473ddf6587d07fd6163cca4827f2a9d6b3b6d","amp;dn":"OPEN+MIND+with+Bill+Jenkins+-+Rare+MP3+Collection+-+for+Coast+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9473ddf6587d07fd6163cca4827f2a9d6b3b6d","infoHashBuffer":{"type":"Buffer","data":[202,148,115,221,246,88,125,7,253,97,99,204,164,130,127,42,157,107,59,109]},"announce":[],"urlList":[]}}