{"title":"Peter Veruki - 250 Job Interview Questions You'll Most Likely","uid":5265931,"size":185344000,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cb1a83c550ede0a40e42511f664b9c2ba249cb25&amp;dn=Peter+Veruki+-+250+Job+Interview+Questions+You%5C%27ll+Most+Likely&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"u983752","files":4,"time":1262885930,"description":"Peter Veruki - 250 Job Interview Questions You'll Most Likely Be Asked\n\nWhy do you want this job?\n\nWhy should I hire you?\n\nWhy do you want to leave your current job?\n\nDo you have convincing answers ready for these important questions? Landing a good job is a competitive process and often the final decision is based on your performance at the interview. By following the advice of prominent career planning and human resources expert Peter Veruki, you'll know you have the right answers at your job interview.\n\nPeter Veruki has been Director of Career Planning and Placement at the Owen Graduate School of Management at Vanderbilt University for ten years. In addition to serving on the College Placement Council Board of Governors for six years, Mr. Veruki was chairman of the CPC's professional Training and Development Committee, where he helped design and conduct interview training programs.\n\nNona Pipes has worked in theatre, film and television since the age of 11. She has recorded more than 70 audiobooks, including works for children.\n\nKen Kliban has been a narrator of audiobooks for 23 years, recording hundreds of titles. He has also worked extensively on Broadway, off-Broadway and in regional theatres.","torrent":{"xt":"urn:btih:cb1a83c550ede0a40e42511f664b9c2ba249cb25","amp;dn":"Peter+Veruki+-+250+Job+Interview+Questions+You%5C%27ll+Most+Likely","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1a83c550ede0a40e42511f664b9c2ba249cb25","infoHashBuffer":{"type":"Buffer","data":[203,26,131,197,80,237,224,164,14,66,81,31,102,75,156,43,162,73,203,37]},"announce":[],"urlList":[]}}