{"title":"Comprehensive Structural Integrity - I. Milne et al.","uid":15576721,"size":180629392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb1df8a909d300874be514bd596c0dc951bd7cfd&amp;dn=Comprehensive+Structural+Integrity+-+I.+Milne+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"clouderone","files":1,"time":1471347242,"description":"Comprehensive Structural Integrity - I. Milne et al. (Elsevier, 2003).pdf\r\n\r\nThe aim of this major reference work is to provide a first point of entry to the literature for the researchers in any field relating to structural integrity in the form of a definitive research/reference tool which links the various sub-disciplines that comprise the whole of structural integrity.\r\n\r\nSpecial emphasis will be given to the interaction between mechanics and materials and structural integrity applications. Because of the interdisciplinary and applied nature of the work, it will be of interest to mechanical engineers and materials scientists from both academic and industrial backgrounds including bioengineering, interface engineering and nanotechnology.\r\n\r\nThe scope of this work encompasses, but is not restricted to:\r\nfracture mechanics, fatigue, creep, materials, dynamics, environmental degradation, numerical methods, failure mechanisms and damage mechanics, interfacial fracture and nano-technology, structural analysis, surface behaviour and heart valves.\r\n\r\nThe structures under consideration include:\r\npressure vessels and piping, off-shore structures, gas installations and pipelines, chemical plants, aircraft, railways, bridges, plates and shells, electronic circuits, interfaces, nanotechnology, artificial organs, biomaterial prostheses, cast structures, mining... and more. Case studies will form an integral part of the work","torrent":{"xt":"urn:btih:cb1df8a909d300874be514bd596c0dc951bd7cfd","amp;dn":"Comprehensive+Structural+Integrity+-+I.+Milne+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1df8a909d300874be514bd596c0dc951bd7cfd","infoHashBuffer":{"type":"Buffer","data":[203,29,248,169,9,211,0,135,75,229,20,189,89,108,13,201,81,189,124,253]},"announce":[],"urlList":[]}}