{"title":"Rikyu, Hiroshi Teshigahara, 1989","uid":6498057,"size":1583533262,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb60bbe907e3de2ed4f7024fa316c850937f9e82&amp;dn=Rikyu%2C+Hiroshi+Teshigahara%2C+1989&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":2,"time":1309150905,"description":"NOT THE SLINGSHOT RELEASE WITH HORRIBLE PICTURE AND PAN &amp; SCAN\n\nBUT!\n\nThe subtitles really do suck.  It's filled with confusing translations and inexcusable spelling errors.  Not saying it's impossible to understand but it's the best (well, only) I could find.  I still know that there will be a few morons who comment with a complaint even though they will never read this.\n\nSeeing as the American release is disgusting, and the film's rights are stuck in legal limbo, it's only fair that this film be shared. It got rave reviews around the world upon it's release, only to be forgotten soon after.  \n\nI was gonna give the Video Information, but this is the only known digital copy so either you want it or you don't.  It's more than tolerable, I'll just leave it at that.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0098204/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0098204/&lt;/a&gt;\n\nLate in the 1500s, an aging tea master teaches the way of tea to a headstrong Shogun. Through force of will and courageous fighting, Hideyoshi becomes Japan's most powerful warlord, unifying the country. Rikyu, through the tea ceremony and floral arrangements, tempers his lord, helping Hideyoshi focus on a single flower or be in a simple room where the shape of a cup is of most importance. But other forces fuel Hideyoshi's ambitions: the Portuguese bring a globe and guns, and he believes he can conquer Korea and China. When Rikyu raises doubts about invading China, Hideyoshi demands an apology, and Rikyu himself must find courage in the way of tea.\n\n7/10","torrent":{"xt":"urn:btih:cb60bbe907e3de2ed4f7024fa316c850937f9e82","amp;dn":"Rikyu%2C+Hiroshi+Teshigahara%2C+1989","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb60bbe907e3de2ed4f7024fa316c850937f9e82","infoHashBuffer":{"type":"Buffer","data":[203,96,187,233,7,227,222,46,212,247,2,79,163,22,200,80,147,127,158,130]},"announce":[],"urlList":[]}}