{"title":"VMware Workstation 9","uid":7731538,"size":446684339,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb8b6fafd632bc92e868a3a7165f365eac4f327d&amp;dn=VMware+Workstation+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"Maherz","files":-1,"time":1350351727,"description":"VMware Workstation 9 with VMware Tools for all operating systems\n\n\nVMware Workstation is a virtual machine software suite for x86 and x64 computers from VMware, a division of EMC Corporation, which allows users to set up multiple x86 and x64 virtual machines (VMs) and use one or more of these virtual machines simultaneously with the hosting operating system. Each virtual machine instance can execute its own guest operating system, including Windows, Linux, BSD variants, and others. In simple terms, VMware Workstation allows one physical machine to run multiple operating systems simultaneously, whereas other VMware products help manage or migrate VMware virtual machines across multiple physical host machines. Workstation is sold and developed by VMware; VMware Player is a similar program with fewer features supplied free of charge.\n\nVMware Workstation supports bridging to existing host network adapters, CD-ROM devices, hard disk drives, and USB devices (including USB Isochronous devices such as webcams, microphones etc.), and provides the ability to simulate some hardware. For example, it can mount an ISO file as a CD-ROM, and .vmdk files as hard disks, and can configure its network adapter driver to use network address translation (NAT) through the host machine rather than bridging through it (which would require an IP address for each guest machine on the host network).\n\nMultiple successive snapshots of an operating system running under VMware Workstation can be taken, and the virtual machine can be restarted in the state it was in when any snapshot was saved.\n\nVMware Workstation includes the ability to designate multiple virtual machines as a team which administrators can then power on and off, suspend, and resume as a single object, making it particularly useful for testing client-server environments.\n\nVersion: 9.0.0-812388\nRelease Date: August 23, 2012\nSerial: 4F4HQ-85LDK-AZGA8-Y1CQ2-9A1MG\n\n- Instructions:\n\n1) Install the program by running the exe file.\n2) When you're asked to enter a serial use the one shown above.\n3) Restart your PC when you're done installing.\n\nEnjoy..","torrent":{"xt":"urn:btih:cb8b6fafd632bc92e868a3a7165f365eac4f327d","amp;dn":"VMware+Workstation+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb8b6fafd632bc92e868a3a7165f365eac4f327d","infoHashBuffer":{"type":"Buffer","data":[203,139,111,175,214,50,188,146,232,104,163,167,22,95,54,94,172,79,50,125]},"announce":[],"urlList":[]}}