{"title":"GamersGoMakers 1.1.6","uid":11167742,"size":101999260,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbbb6e84393d6fb39738f26faf706daa389727f5&amp;dn=GamersGoMakers+1.1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gargig","files":1,"time":1412652987,"description":"In GamersGoMakers, you found a little company creating the first video games in history. Create your first game with only basic sound and simple graphics available in the year 1980. YouÂ´re one of the pioneers entering the rising global market for computer games. At the beginning, there are only few genres you can pick for a game to create, later you have plenty of options for more genres and sub-genres. \n\nYou start in 1980 creating one of the first computer games in history \nGo your own way: Be a developer, designer, producer, artist or composer \nOptional start in 1990 or 2000, choose from 3 difficulty levels \n31 genres of games to choose from \nReal influence on creating games (find the genre matching game parts out of 15x4 options) \nIntelligent game reviews give you hints about what to improve for next game in same genre \nSales are influenced by trends, platform market share, competitorÂ´s performance and many more \nYou can create patches, addons, sequels or a new edition for a different platform \nHire up to 21 employees with specialisations in genre and/or platform \nRich role playing elements: level up your character and employees in 21 different skills \nLearning by doing: Your employees gain levels in skills by takig part in projects \nImprove your employees skills additionally by trainings, education programs and specializations \nEmployees will ask for more loan, holiday, trainings or they get sick, maybe even quit for a better job at a rivalÂ´s company \nBecome a specialized company of high renown in a certain genre, e.g. the global number 1 in Shooter games \nResearch new gaming technologies \nExpand your business, rent or buy a bigger office \nEquip 14 different rooms like studios for sound and motioncapture, labs and marketing office \nUpgrade your rooms several times as time advances \nCompete within a global simulated games market - hundreds of simulated competitors release games \nWin awards for game of the month/game of the year \nConsoles and platforms retire from the market...except you create a game hit extending the platformÂ´s lifetime \nBuy out your rival competitors: Let them work for you or destroy them \nWin achievements and beat the global highscore \n...and many more features for a very deep gaming experience! \n\nVersion 1.1.6 \n\n- Added: \n- some menus for the current game in development and games/consoles on sale \n+ quit a current game in development \n+ announce a current game in development (PR Manager option) \n+ end a games sale \n+ change the price of a game on sale \n+ extend the duration of a game on sale by 30 days (Marketing Manager option) \n+ change the price of a console on sale \n- new starting location: france \n- save over old save files (just click on the image of the save file) \n- some small UI improvements \n\n- Fixed: \n- Bug within the sales report \n- some other filthy little bugs ;)\n","torrent":{"xt":"urn:btih:cbbb6e84393d6fb39738f26faf706daa389727f5","amp;dn":"GamersGoMakers+1.1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbbb6e84393d6fb39738f26faf706daa389727f5","infoHashBuffer":{"type":"Buffer","data":[203,187,110,132,57,61,111,179,151,56,242,111,175,112,109,170,56,151,39,245]},"announce":[],"urlList":[]}}