{"title":"The Alan Parsons Symphonic Project - Live in Colombia (2016)","uid":14706422,"size":244663825,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbe979a091271d2af2227f5ee49d0683528e2606&amp;dn=+The+Alan+Parsons+Symphonic+Project+-+Live+in+Colombia+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Freak0370","files":25,"time":1464363879,"description":"Artist: The Alan Parsons Symphonic Project\r\nTitle: Live in Colombia\r\nYear Of Release: 2016\r\nLabel: earMUSIC\r\nGenre: Progressive Rock, Classic Rock\r\nQuality: 320 kbps\r\nTotal Time: 1:40:28\r\nTotal Size: 254 MB\r\n\r\n\r\nTo the great delight of Alan Parsons' fans, for the first time on a live video and audio recording, THE ALAN PARSONS SYMPHONIC PROJECT combines the talents of his amazing band with the lush sound of a 70-piece symphony orchestra, creating a very special show with unmatched quality. Together, they revitalize hits such as “Eye In The Sky“, “Don't Answer Me“ and “Sirius“.\r\n\r\nThe concert was recorded on August 31st 2013 at the exotic location of the Parque Pies Descalzos in Medellín, Colombia. The lineup consists of Alan Parsons on acoustic guitar, keys, and vocals, P.J. Olsson (lead vocals), Alastair Greene (guitar, vocals), Guy Erez (bass,vocals), Danny Thompson (drums, vocals), Tom Brooks (keyboards, vocals) und Todd Cooper (saxophone, guitar, percussion, vocals). Alejandro Posada conducts the Medellin Philharmonic Orchestra.Alejandro Posada conducts the Medellin Philharmonic Orchestra\r\n\r\n\r\n\r\n\r\n01. The Alan Parsons Symphonic Project – I Robot (Live) (6:24)\r\n02. The Alan Parsons Symphonic Project – Damned If I Do (Live) (4:33)\r\n03. The Alan Parsons Symphonic Project – Don’t Answer Me (Live) (4:36)\r\n04. The Alan Parsons Symphonic Project – Breakdown (Live) (4:05)\r\n05. The Alan Parsons Symphonic Project – The Raven (Live) (2:52)\r\n06. The Alan Parsons Symphonic Project – Time (Live) (5:29)\r\n07. The Alan Parsons Symphonic Project – I Wouldn’t Want to Be Like You (Live) (4:59)\r\n08. The Alan Parsons Symphonic Project – La Sagrada Familia (Live) (6:04)\r\n09. The Alan Parsons Symphonic Project – The Turn of a Friendly Card (Part One) [Live] (2:54)\r\n10. The Alan Parsons Symphonic Project – Snake Eyes (Live) (3:01)\r\n11. The Alan Parsons Symphonic Project – The Ace of Swords (Live) (2:47)\r\n12. The Alan Parsons Symphonic Project – Nothing Left to Lose (Live) (4:34)\r\n13. The Alan Parsons Symphonic Project – The Turn of a Friendly Card (Part Two) [Live] (4:23)\r\n14. The Alan Parsons Symphonic Project – What Goes Up… (Live) (4:38)\r\n15. The Alan Parsons Symphonic Project – Luciferama (Live) (5:22)\r\n16. The Alan Parsons Symphonic Project – Silence and I (Live) (7:46)\r\n17. The Alan Parsons Symphonic Project – Prime Time (Live) (8:13)\r\n18. The Alan Parsons Symphonic Project – Sirius (Live) (2:13)\r\n19. The Alan Parsons Symphonic Project – Eye in the Sky (Live) (5:11)\r\n20. The Alan Parsons Symphonic Project – Old and Wise (Live) (5:40)\r\n21. The Alan Parsons Symphonic Project – Games People Play (Live) (4:55)\r\n\r\n\r\n \nhttp://extraimago.com/image/a0DF\r\n\r\n \nhttp://extraimago.com/image/a0Dp","torrent":{"xt":"urn:btih:cbe979a091271d2af2227f5ee49d0683528e2606","amp;dn":"+The+Alan+Parsons+Symphonic+Project+-+Live+in+Colombia+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe979a091271d2af2227f5ee49d0683528e2606","infoHashBuffer":{"type":"Buffer","data":[203,233,121,160,145,39,29,42,242,34,127,94,228,157,6,131,82,142,38,6]},"announce":[],"urlList":[]}}