{"title":"Capture the flag (Race naar de maan) 3D (2016)","uid":14301186,"size":10539242544,"categoryP":"video","categoryS":"3d","magnet":"?xt=urn:btih:cc6aebd093e98fc4b86959e09fe37512ca615174&amp;dn=Capture+the+flag+%28Race+naar+de+maan%29+3D+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"superdjwacko","files":5,"time":1460495478,"description":"First of all, \r\nthanks to Kickass.cr uploaders Uterkof for the Spanisch 3D version of this movie.\r\nThanks to MkvCage for the English Audio of his 2D version.\r\nthanks to Qoq releases for the subs.\r\n\r\nIt also includes the normal NL sub srt file. \r\nYou don't need the .srt to watch in 3D. just the other three files are the 3D subs.\r\n\r\nAnimation, Adventure, Comedy \r\n\r\nVideo : BDRip 1080p MPEG4 Video (H264) 1920×1080\r\n\r\nHet verhaal speelt in op een hardnekkige legende die nog steeds bij sommige mensen leeft: dat de maanlanding in 1969 niet echt was. Om te bewijzen dat alles nep was en om de maan voor zichzelf op te eisen, plant miljonair Richard Carson een eigen ruimte-expeditie. Daarop schakelt de Amerikaanse president de hulp in van NASA-astronaut Scott Goldwing: hij moet met zijn team de vlag terughalen die daar door Neil Armstrong geplant werd bij de eerste maanlanding. De sportieve, twaalfjarige jongen Mike (de zoon van astronaut Scott) houdt zelf ook wel van een vlaggenrace. Nadat zijn vader gewond raakt, besluit hij om de gemene plannen van Carson te verijdelen. Mike krijgt hulp van zijn vrienden; de nieuwsgierige Amy en de slimme Marty, de gekke kameleon Igor en zijn norse grootvader Frank. Samen glippen ze aan boord van de raket en vliegen ze naar de maan, het begin van een dol ruimteavontuur.\r\n\r\nMike Goldwing, a plucky, determined 12-year old boy, is the son and grandson of NASA astronauts. His grandfather Frank, a once revered, but now forgotten retired astronaut, lives his days isolated from his family after missing out on his big chance to fly to the moon with Neil Armstrong and Buzz Aldrin as a part of the Apollo XI mission. When an eccentric billionaire Richard Carson sets an evil plan to fly to the moon, steal the moon's vast mineral resources, and destroy the American flag planted by the Apollo XI team, Mike embarks on a magnificent adventure as a stowaway on a rejuvenated Saturn-V rocket. Accompanied by his grandfather, best friends Amy and Marty, and a clever chameleon, Mike blasts off to the moon to capture the flag and reunite his family","torrent":{"xt":"urn:btih:cc6aebd093e98fc4b86959e09fe37512ca615174","amp;dn":"Capture+the+flag+%28Race+naar+de+maan%29+3D+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc6aebd093e98fc4b86959e09fe37512ca615174","infoHashBuffer":{"type":"Buffer","data":[204,106,235,208,147,233,143,196,184,105,89,224,159,227,117,18,202,97,81,116]},"announce":[],"urlList":[]}}