{"title":"[Clips4sale] The Hottest Diaper girls! - Cory Chase - Shane","uid":14792936,"size":1860580399,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cc96a3cdf1a7324c809fcc46857682108444c40b&amp;dn=%5BClips4sale%5D+The+Hottest+Diaper+girls%21+-+Cory+Chase+-+Shane+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"enterdrone","files":1,"time":1465075212,"description":"\n\r\n[b][color=&quot;blue&quot;][size=200]FILEINFO[/size][/color][/b]\r\n\r\nShane_Blair_in_Chasing_White_Tails_HD-1080p_.wmv\r\nSize: 1860580399 bytes (1.73 GiB), duration: 00:31:43, avg.bitrate: 7822 kb/s\r\nAudio: 0x0162, 44100 Hz, stereo, 440 kb/s\r\nVideo: wmv3, yuv420p, 1920x1080, 8000 kb/s, 29.97 fps(r)\r\n\r\nAdded: 4/2/16\r\n\r\nScene One: Mom's tight white thong\r\n\r\nBeautiful young Shane is alone in her room when the urge hits her. She spreads her legs and pulls her mom's tiny white panties to the side. As she masturbates her mind wanders to her mom. The thought of her mom's hot body makes her quiver. With her fingers she slowly and seductively plays with herself. Teasing, fingering and edging to a powerful orgasm.\r\n\r\nI can't believe I just masturbated to my step-mom Shane says. What's wrong with me... Shane walks into the kitchen to clear her head. There she finds her mom Cory in the kitchen. Are you wearing my white thong? Cory asks angry at her daughter. I can't give them back, they're a little wet Shane says awkwardly. Get to your room! Cory yells at her disgusting daughter. I'm going to give you a good tongue lashing!\r\n\r\nScene Two:Shane's secret\r\n\r\nI'm going to give it to you Cory says pulling up the younger girls shirt. Cory touches her daughters tiny breasts before stripping off the soaked white panties. Shane's so nervous, pulling off her mom's tight cloths. It's everything she ever fantasied about.\r\n\r\nThey kiss passionately, Cory laying her daughter on the bed and giving her the tongue lashing she deserves for wearing her panties. Shane finds herself with her face in her mom's bush flicking her tongue and making her mom moan.\r\n\r\nScene Three: Circle of\r\n\r\nThey 69, mother and daughter in a beautiful circle of lust. Shane shakes as orgasm after orgasm is ripped from her young body by her experienced mother. Cory rubs Shane, licks Shane, and makes her into a puddle of lesbian .\r\n\r\nThey fill themselves with each other until they are both satisfied then they kiss and leave to take a shower. They will be sharing more than clothes as mother and daughter...\r\nCategory: MILF\r\nRelated Categories: GIRL-GIRL, MILF, TABOO\r\nKeywords: cory chase, milf, shane blair, girl girl, taboo, masturbating","torrent":{"xt":"urn:btih:cc96a3cdf1a7324c809fcc46857682108444c40b","amp;dn":"%5BClips4sale%5D+The+Hottest+Diaper+girls%21+-+Cory+Chase+-+Shane+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc96a3cdf1a7324c809fcc46857682108444c40b","infoHashBuffer":{"type":"Buffer","data":[204,150,163,205,241,167,50,76,128,159,204,70,133,118,130,16,132,68,196,11]},"announce":[],"urlList":[]}}