{"title":"Imperial Armour Volume One - Second Edition: Imperial Guard","uid":8255893,"size":50865428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cccaf6035d895c402fd0e7c8bec0d6e1c103e6fa&amp;dn=Imperial+Armour+Volume+One+-+Second+Edition%3A+Imperial+Guard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"YonanX","files":1,"time":1363222259,"description":"Here it is lads, Imperial Armour Volume One - Second Edition: Imperial Guard. Took me a while of searching for a scan of it, but i found it. Now I'm sharing it with you, becuase i know a lot of people are going to be after this. \nThis is legit, no bullshit, no virus. I'd hate it if someone were to do it to me. Excellent quality as well, surprisingly.\n\nImperial Armour Volume One - Second Edition: Imperial Guard is a book dedicated to the fighting vehicles of the Imperial Guard; the steel-clad behemoths that rumble and clank their way across the battlefields of the far future, unleashing fire and shell at the enemies of Mankind. Inside this 294-page book, the full panoply of Imperial Guard armored vehicles are displayed in exhaustive detail, including profiles and rules for over fifty tanks, support vehicles, artillery pieces and super-heavy vehicles, alongside extensive background material on these war machines, their munitions and manufacture.\n\nIn addition to the wealth of information, color profiles and photographs, the book also includes a full army list that allows you to field the sledgehammer of Imperial military power: the Imperial Guard Armored Battle group. Also included are rules for some of the most famous Tank Aces of the Imperium including General Grizmund of the 1st Narmenian Armoured Regiment","torrent":{"xt":"urn:btih:cccaf6035d895c402fd0e7c8bec0d6e1c103e6fa","amp;dn":"Imperial+Armour+Volume+One+-+Second+Edition%3A+Imperial+Guard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cccaf6035d895c402fd0e7c8bec0d6e1c103e6fa","infoHashBuffer":{"type":"Buffer","data":[204,202,246,3,93,137,92,64,47,208,231,200,190,192,214,225,193,3,230,250]},"announce":[],"urlList":[]}}