{"title":"Arlo Guthrie - Alice's Restaurant (1990) 320 vtwin88cube","uid":7035765,"size":86216752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd3168cd3acf87af82730a07fabbaff368623ac4&amp;dn=Arlo+Guthrie+-+Alice%5C%27s+Restaurant+%281990%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1329372125,"description":"\n\n\nArlo Guthrie\nAlice's Restaurant (1990)\n\n\n\n\nIs it possible to be a one-hit wonder three times? The question is provoked by the recording career of Arlo Guthrie, which is best remembered for three songs in three different contexts. There is &quot;The City of New Orleans,&quot; Guthrie's only Top 40 hit, which earns him an entry in Wayne Jancik's The Billboard Book of One-Hit Wonders. There is also &quot;Coming into Los Angeles,&quot; which Guthrie sang at the legendary Woodstock music festival, and which featured prominently in both the Woodstock movie and multi-platinum soundtrack album. And there is &quot;Alice's Restaurant Massacree,&quot; the comic-monologue-in-song that gave him his initial fame and took up the first side of his debut LP, the million-selling Alice's Restaurant. Whether these successful tracks make him a one-, two-, or three-hit wonder, they were arguably both flukes in a performing career that was still going strong a full 40 years after Guthrie first gained national recognition and facilitators of that career. With their help, he spent 15 years signed to a major record label, charting 11 LPs, after which he was able to set up his own label and go on issuing albums. More significant, he maintained a steady following as a live performer, touring worldwide year after year to play before audiences delighted by his humorous persona and his musical mixture of folk, rock, country, blues, and gospel styles in songs almost equally divided between his own originals and well-chosen cover tunes. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\nReleased:\t\t1967\n\n\n\n\nAt the outset of his second recorded performance of the anti-war shaggy-dog story-song &quot;Alice's Restaurant,&quot; Arlo Guthrie notes that 30 years have passed since the events described in the song. That anniversary may serve as a useful touchstone for this only slightly revised retelling, but a more likely explanation for why Guthrie would re-record not only his most famous song, but also his entire first album in soundalike fashion is simply that, unlike most of his records, Alice's Restaurant is still owned by Warner Bros. Records and not by Guthrie's own Rising Son label. The new version of the title song has a few new jokes in it (it's even longer than the original), and Guthrie faithfully re-creates such songs as &quot;Ring-Around-A-Rosy Rag&quot; and &quot;The Motorcycle Song,&quot; but the original album is still the one to own. \n\n\n\n\nAudio-Info:\n\n\n\n\n01.Alice's Restaurant Massacree\n02.Chilling Of The Evening\n03.Ring-Around-A-Rosy Rag\n04.Now And Then\n05.I'm Going Home\n06.The Motorcycle Song\n07.Highway In The Wind\n\n\n\n\n\n\n\n\n\n              ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                  ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:cd3168cd3acf87af82730a07fabbaff368623ac4","amp;dn":"Arlo+Guthrie+-+Alice%5C%27s+Restaurant+%281990%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3168cd3acf87af82730a07fabbaff368623ac4","infoHashBuffer":{"type":"Buffer","data":[205,49,104,205,58,207,135,175,130,115,10,7,250,187,175,243,104,98,58,196]},"announce":[],"urlList":[]}}