{"title":"EWQL - Voices of Passion (India &amp; Syria) [KONTAKT]","uid":9015520,"size":416755769,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cd3a442b0dc2cb5efcbeee7f512f94cabcd48deb&amp;dn=EWQL+-+Voices+of+Passion+%28India+%26amp%3B+Syria%29+%5BKONTAKT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"NewSky006","files":-1,"time":1381186653,"description":"Torrent Info:\n==============\n\nThis is an incomplete extract from Voices of Passion.\n\n\nTorrent Contents:\n==================\n\nKontakt Instruments &amp; Samples\n\n\nInstallation:\n==============\n\nNone. To use, open one of the libraries in (cracked) Kontakt.\n\n\nProduct Info:\n==============\n\nVOICES OF PASSION is a tool designed to use vocal samples as the foundation for creating new instruments, and includes female vocals from Wales, Syria, India, Bulgaria and America. It includes ethereal, passionate, flowing, mysterious, wailing and whispering vocals for Film, TV and Game composers as well as songwriters, new age artists and zen horticulturists. Altos and Sopranos. VOICES OF PASSION is not designed to replace a live singer in your studio.\n\nVOICES OF PASSION features 5 stunning female artists singing vowels, words, morphing vowels, effects, phrases, calls, whispers and breath noises. This is the first virtual instrument created specifically for use in the film/TV/game genre. This is also the first virtual instrument or sample library created specifically for use in ambient or new age music.\n\nVOICES OF PASSION is the first virtual instrument to feature true legato intervals (American and Wales only). The Middle Eastern and Indian phrases are presented in a construction kit format allowing users to create very long consistent performances. Mod-wheel controls entry point on ethnic phrases.\n\nQUICK FACTS\nProduced by NICK PHOENIX\nOver 7 GBs of vocals\nFemale Vocalists from Wales, Syria, India, Bulgaria and America\nAll singers recorded with great attention paid towards pitch\nOo, oh and ah true legato intervals (American and Wales only)\nOver 1000 ethnic phrases with a great deal of passion\nPhrase generator for Welsh vocals\nExpressive samples, non vibrato, delayed vibrato\nEthereal style, breathy vocals\nNew Age vocal performances, staccato and swells\nPLAY features allow for very quick and intuitive sound loading and organization\nAll singers recorded with a Telefunken Elam 251 and a RCA 44 ribbon mic for tonal variation","torrent":{"xt":"urn:btih:cd3a442b0dc2cb5efcbeee7f512f94cabcd48deb","amp;dn":"EWQL+-+Voices+of+Passion+%28India+%26amp%3B+Syria%29+%5BKONTAKT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3a442b0dc2cb5efcbeee7f512f94cabcd48deb","infoHashBuffer":{"type":"Buffer","data":[205,58,68,43,13,194,203,94,252,190,238,127,81,47,148,202,188,212,141,235]},"announce":[],"urlList":[]}}