{"title":"The Jesus And Mary Chain - Psychocandy (1985) [FLAC] {Remastered","uid":4416367,"size":324055282,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ce07844f065ebd353033de9e77d6e728fe34113a&amp;dn=The+Jesus+And+Mary+Chain+-+Psychocandy+%281985%29+%5BFLAC%5D+%7BRemastered&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"no_fun","files":26,"time":1222537031,"description":"The Jesus &amp; Mary Chain - Psychocandy\n\n\n1985, 2006 RHINO / WEA R2 436348\n\n\n\nAll songs written and composed by Jim and William Reid\n\n1. Just Like Honey\n2. The Living Dead\n3. Taste The Floor\n4. The Hardest Walk\n5. Cut Dead\n6. In A Hole\n7. Taste Of Cindy\n8. Never Understand\n9. Inside Me\n10. Sowing Seeds\n11. My Little Underground\n12. You Trip Me Up\n13. Something&amp;#039;s Wrong\n14. It&amp;#039;s So Hard\n\n\nAlbum Credits\n\nPerformance Credits:\n\nThe Jesus and Mary Chain    Primary Artist\nBobby Gillespie             Drums, Snare Drums\nDouglas Hart                Bass,Bass Guitar\nJim Reid                    Guitar, Vocals, Guitar (Baritone)\nWilliam Reid                Guitar, Vocals, Guitar (Baritone)\n\nTechnical Credits:\n\nThe Jesus and Mary Chain    Producer\nGreg Allen                  Art Direction\nDan Hersch                  Mastering\nBill Inglot                 Mastering\nJohn Loder                  Engineer\nKieron Tyler                Liner Notes\n\n\nQuote:\nAn interesting variation on the psychedelic revival of the 1980s came out of Scotland when Jesus And Mary Chain coined &quot;feedback-pop&quot;. The idea was quite simple and certainly not new: take the Velvet Underground&amp;#039;s White Light/White Heat and add a catchy melody, or take Phil Spector&amp;#039;s &quot;wall of sound&quot; and add a layer of guitar noise. Massive distortions, coupled with nihilistic ethos borrowed from the Sex Pistols, bestowed on Psychocandy (1985) a funereal mood. - Piero Scaruffi -\n\n\nQuote:\nArguably Psychocandy is an album with one trick and one trick alone -- Beach Boys melodies meet Velvet Underground feedback and beats, all cranked up to ten and beyond, along with plenty of echo. However, what a trick it is. Following up on the promise of the earliest singles, the Jesus and Mary Chain with Psychocandy arguably created a movement without meaning to, one that itself caused echoes in everything from bliss-out shoegaze to snotty Britpop and back again. The best tracks were without question those singles, anti-pop yet pure pop at the same time: &quot;Just Like Honey,&quot; starting off like the Ronettes heard in a canyon and weirdly beautiful with its bells, &quot;You Trip Me Up&quot; and its slinking sense of cool, and most especially &quot;Never Understand.&quot; Storming down like a rumble of bricks wrapped in cotton candy and getting more and more frenetic at the end, when there&amp;#039;s nothing but howls and screaming noise, it&amp;#039;s one hell of a track. However, at least in terms of sheer sonic violence and mayhem, most of the other cuts were pretty hard to beat, as sprawling, amped-up messes like &quot;The Living End&quot; (which later inspired both a band and a movie title) and &quot;In a Hole.&quot; &quot;My Little Underground&quot; is actually the secret gem on the album, with a great snarling guitar start, an almost easygoing melody and a great stuttering chorus -- not quite the Who but not quite anything else. What the Reids sing about -- entirely interchangeable combinations regarding girls, sex, drugs, speed, and boredom in more or less equal measure -- is nothing compared to the perfectly disaffected way those sentiments are delivered. Bobby Gillespie&amp;#039;s &quot;hit the drums and then hit them again&quot; style makes Moe Tucker seem like Neil Peart, but arguably in terms of sheer economy he doesn&amp;#039;t need to do any more. Ned Raggett, All Music Guide\n\n\nFrom Amazon:\n\nQuote:\nJess (Beaumont, TX USA)\nI wasn&amp;#039;t old enough to hear the original verison of this album on vinyl so I&amp;#039;ve always been stuck with the &quot;muddy&quot; sounding original CD version. I&amp;#039;m always a little skeptical about the so-called digitally remastered albums but it seems they took their time on Psychocandy. The album sounds blisteringly better than the older version. I would recomend it to anyone who has listened to the older CD versions, it is great.\n\n\n&quot;Some Candy Talking&quot; is not included on this CD release to conform to the original playlist.\n\nScans have not been descreened\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Psychocandy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Psychocandy&lt;/a&gt;","torrent":{"xt":"urn:btih:ce07844f065ebd353033de9e77d6e728fe34113a","amp;dn":"The+Jesus+And+Mary+Chain+-+Psychocandy+%281985%29+%5BFLAC%5D+%7BRemastered","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce07844f065ebd353033de9e77d6e728fe34113a","infoHashBuffer":{"type":"Buffer","data":[206,7,132,79,6,94,189,53,48,51,222,158,119,214,231,40,254,52,17,58]},"announce":[],"urlList":[]}}