{"title":"Jenny Lawson - Furiously Happy","uid":12526676,"size":15668797,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cec74edf960823ac44dd1af5b4e170108df11e5c&amp;dn=Jenny+Lawson+-+Furiously+Happy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"laned130","files":5,"time":1444073975,"description":"I take no credit for this torrent - it was uploaded to KAT by BinanGotit.\r\n\r\n\r\nPerfect Paperback\r\nPublisher: Macmillan USA (Sept. 2015)\r\nLanguage: English\r\nISBN-10: 1250082900\r\nISBN-13: 978-1250082909\r\nFormat: epub, mobi, pdf, including cover and metadata\r\n\r\n&quot;It's the difference between surviving life and living life. It's the difference between taking a shower and teaching your monkey butler how to shampoo your hair.&quot; Jenny Lawson - aka The Bloggess - returns with the follow-up to her bestselling memoir Let's Pretend This Never Happened, recounting stories from everyday family life in her inimitably frank, hilarious, bizarre and endearing way. She describes her battles with depression and anxiety and her quest to overcome them by saying yes to even the absurdist opportunities and making the good times gloriously good. For as Jenny says: 'You can't experience pain without also experiencing the baffling and ridiculous moments of being fiercely, unapologetically, intensely and (above all) furiously happy...' It's a philosophy that has - quite literally - saved her life.\r\n\r\n\r\nFrom the Inside Flap\r\n\r\nIn Furiously Happy, Jenny Lawson explores her lifelong battle with mental illness. A hysterical, ridiculous book about crippling depression and anxiety? That sounds like a terrible idea.\r\n\r\nBut terrible ideas are what Jenny does best.\r\n\r\nAs she says herself:\r\n'Like John Hughes wrote in The Breakfast Club, &quot;We're all pretty bizarre. Some of us are just better at hiding it.&quot; Except go back and cross out the word &quot;hiding&quot; . . . '\r\nJenny Lawson is beloved around the world for her inimitable humour and honesty, and in Furiously Happy she is at her snort-inducing funniest. This is a book about embracing everything that makes us who we are - the beautiful and the flawed - and then using it to find joy in fantastic and outrageous ways. Because, as Jenny's mom says, 'Maybe &quot;crazy&quot; isn't so bad after all.' In fact, sometimes crazy is just right","torrent":{"xt":"urn:btih:cec74edf960823ac44dd1af5b4e170108df11e5c","amp;dn":"Jenny+Lawson+-+Furiously+Happy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cec74edf960823ac44dd1af5b4e170108df11e5c","infoHashBuffer":{"type":"Buffer","data":[206,199,78,223,150,8,35,172,68,221,26,245,180,225,112,16,141,241,30,92]},"announce":[],"urlList":[]}}