{"title":"Sonicomi","uid":15195152,"size":3666144745,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cef68b8802094c29d04799acc6fd094f30e54a55&amp;dn=Sonicomi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dauphong","files":1,"time":1467561028,"description":"\nAbout This Game\r\nSuper Sonico is a cheerful, hardworking college student and amateur musician who's about to make her modeling debut. As her personal photographer, you will be responsible for Sonico's image, balancing the needs of your clients with your own vision for Sonico's future. Cute, sexy, weird -- the costumes you choose will determine her path as a model. Will you cultivate mainstream appeal? Make Sonico a subculture icon? Or will she become something even you can't imagine? It all depends on you!\r\nLead Sonico to Stardom\r\nSonico has the potential to become an international superstar. It's your job to provide her with guidance and support as she chases her dreams. Depending on your actions, you can reach one of 18 wildly different endings.\r\nIn between shoots, you'll have the opportunity to interact with Sonico in many different situations. Your choices will affect her opinion of you, potentially unlocking new story paths. In addition to dialogue options, you will also have opportunities to interact with Sonico through personal interactions. Be careful, as some choices can be dangerous, while others can lead to sparks of love!\r\nBecome a Photographer\r\nChoose a location, put together an outfit, and get to shooting! During each photography session you must score points by shooting quality photographs as requested by the client. Your photographer's eye will show colored rings to identify the best shots. Don't get too carried away! You must also manage Sonico's enthusiasm and stamina. Lift her spirits with well-timed banter and breaks. The greater her enthusiasm, the more daring her poses!\r\nFeatures\r\n\r\n    Become Super Sonico's personal photographer.\r\n    Hundreds of costumes, accessories and styles to collect.\r\n    Shoot at 8 different locations across Tokyo, Japan.\r\n    Meet a cast of interesting characters and rivals.\r\n    Your choices matter – 18 different endings to unlock","torrent":{"xt":"urn:btih:cef68b8802094c29d04799acc6fd094f30e54a55","amp;dn":"Sonicomi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef68b8802094c29d04799acc6fd094f30e54a55","infoHashBuffer":{"type":"Buffer","data":[206,246,139,136,2,9,76,41,208,71,153,172,198,253,9,79,48,229,74,85]},"announce":[],"urlList":[]}}