{"title":"Clips4Sale - Missa (Wife Swap)","uid":15712464,"size":278610543,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cf2512750b69ebc2139bd67c1e038e681e8cf52b&amp;dn=Clips4Sale+-+Missa+%28Wife+Swap%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SudoSu","files":1,"time":1472591425,"description":"http://youpornbook.com\r\n\r\n—————————————————————————\r\n ... : Screenshots : ... \r\n————————————————————————— \nhttp://imgreborn.com/?v=879432 \nhttp://imgreborn.com/?v=963843\r\n\r\nMother possesses wife's body, Mother seduces reluctant son, sex, massive cum shot\r\n\r\nWhat would you do if your mother possessed your wife's body? Your new-age witchy mother, who's always been obsessed with youth, has found a way to swap bodies with your hot wife. Your wife, now in your mother's body is horrified and runs out of the home.\r\n\r\nYour mother gets used to her new young body, her ability to get moist, have a strong youthful orgasm. She even loves the smell and taste of her new young pussy. You walk in on her in the bathroom. You think it's you wife, she's acting a little strange, covering up her nude body. She asks you not to kiss her lips, but her cheek, just as you do your sweet, old mother. You quickly realize something's up, and she confesses what she did. &quot;I've possessed your wife's body, and there's nothing you can do about it. My darling, it's irreversible.&quot;\r\n\r\nYour mom was always so sexy in her youth. You remember her charming many men with her natural sex appeal. Now that she has this young body again, she can't get enough of shamelessly flaunting her body in your wife's clingy lingerie. &quot;I wear it better than her, don't I baby?&quot;\r\n\r\nIn the middle of the night you hear a buzzing, you brush the sleep from your eyes, and turn on the lamp. Your mother is next to you masturbating with your wife's vibrator. You're disgusted and she tells you that she needs to cum to go back to sleep. You turn your back to her, turn the light off and pout like a little boy. Your mother always gets her way. You hear her moaning, your wife's voice is different, so much like you mother when she was younger, and the sound of it makes your dick hard. You cringe at the thought of getting hard from your mother.\r\n\r\nThe following night your mother comes in the bed, twirling around in your wife's black lace lingerie. She struts in front of you. The contrast of the black against her fair skin makes you weak, but it's your mother for fuck's sake! You can't be turned on by her.. or can you? She seduces you, calls you her baby, and she sees the tent in the bedsheets. &quot;Let Mommy take care of that for you, sweetheart.&quot; You resist still, but not as much, your cock aches for her. &quot;Don't you want to know how Mommy does it?&quot; You can't deny that you dream of how your mom sucks dick, you want to feel her mouth, you fight with your body's urges but Mommy assure you it's going to be marvelous.\r\n\r\nWhen your Mommy sucks you, her tongue dances around your cock, you want to cum, but Mommy reminds you, &quot;make me cum, Mommy needs to cum too.&quot; Your mother coos to you in her sexy youthful voice how bad she wants to fuck you. She rides your cock, you pump her tight, pink fluffy pussy and cum so hard. Maybe you'll get used to having your mother as a wife, your wife was never perfect for you anyway. &quot;I'm your Mommy and your wife, it's the perfect combination. Now pump my pussy again, baby, I need to cum again.&quot; You could never deny an opportunity to make your mother happy.\r\n\r\n\r\nMore exclusive porn at:  https://thepiratebay.org/user/SudoSu/","torrent":{"xt":"urn:btih:cf2512750b69ebc2139bd67c1e038e681e8cf52b","amp;dn":"Clips4Sale+-+Missa+%28Wife+Swap%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2512750b69ebc2139bd67c1e038e681e8cf52b","infoHashBuffer":{"type":"Buffer","data":[207,37,18,117,11,105,235,194,19,155,214,124,30,3,142,104,30,140,245,43]},"announce":[],"urlList":[]}}