{"title":"Pans Labyrinth [ENG SUB] (2006) 720p BrRip x264 - CLOWNSEC (Phre","uid":9511537,"size":3269791014,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:cf47dae554af5a995f099a2432c4d4ca1b03412d&amp;dn=Pans+Labyrinth+%5BENG+SUB%5D+%282006%29+720p+BrRip+x264+-+CLOWNSEC+%28Phre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"clownsec","files":-1,"time":1390417893,"description":"Pans Labyrinth [ENG SUB] (2006) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nMexican filmmaker Guillermo del Toro returns to the phantasmagorical cinema that defined such early fare as Cronos and The Devil's Backbone with this haunting fantasy-drama set in the aftermath of the Spanish Civil War and detailing the strange journeys of an imaginative young girl who may be the mythical princess of an underground kingdom. Her mother, Carmen (Ariadna Gil), recently remarried to sadistic army captain Vidal (Sergi Lpez) and soon to bear the cruel military man's child, shy young Ofelia (Ivana Baquero) is forced to entertain herself as her recently-formed family settles into their new home nestled deep in the Spanish countryside. As Ofelia's bed-ridden mother lies immobilized in anticipation of her forthcoming child and her high-ranking stepfather remains determined to fulfill the orders of General Francisco Franco to crush a nearby guerilla uprising, the young girl soon ventures into an elaborate stone labyrinth presided over by the mythical faun Pan (Doug Jones). Convinced by Pan that she is the lost princess of legend and that in order to return to her underground home she must complete a trio of life-threatening tasks, Ofelia sets out to reclaim her kingdom and return to her grieving father as Vidal's housekeeper Mercedes (Maribel Verd) and doctor (Alex Angulo) plot secretly on the surface to keep the revolution alive\n\nBROUGHT TO YOU BY CLOWNSEC  * HONK *","torrent":{"xt":"urn:btih:cf47dae554af5a995f099a2432c4d4ca1b03412d","amp;dn":"Pans+Labyrinth+%5BENG+SUB%5D+%282006%29+720p+BrRip+x264+-+CLOWNSEC+%28Phre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf47dae554af5a995f099a2432c4d4ca1b03412d","infoHashBuffer":{"type":"Buffer","data":[207,71,218,229,84,175,90,153,95,9,154,36,50,196,212,202,27,3,65,45]},"announce":[],"urlList":[]}}