{"title":"The Police - 1986 - Every Breath You Take The Singles","uid":3468598,"size":48290366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf79711bd7349581dd6b57f1ce7c7f19219420e3&amp;dn=The+Police+-+1986+-+Every+Breath+You+Take+The+Singles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"KindTorrents","files":12,"time":1144591971,"description":"[b]Artist:[/b]\n\nThe Police\n\n[img]http://image.allmusic.com/00/amg/pic200/drP100/P158/P15812A2OR1.jpg[/img]\n\n[b]Album:[/b]\n\nEvery Breath You Take: The Singles\n\n[b]Cover:[/b]\n\n[img]http://image.allmusic.com/00/amg/cov200/drh000/h025/h02539rbljf.jpg[/img]\n\n[b]Review:[/b]\n\nDepending on whose report you believe, the Police recongregated in 1985 to either begin work on their sixth studio album or a greatest-hits collection that was to include all new, reworked versions of the hits. Neither ever materialized due to hostility between the members, and when all the trio could show for its work was an insipid remake of &quot;Don&amp;#039;t Stand So Close to Me,&quot; the Police decided to call it a day. So instead of following the original plan, A&amp;M issued Every Breath You Take: The Singles, which included 11 original versions of their hits plus the new track, titled &quot;Don&amp;#039;t Stand So Close to Me &amp;#039;86,&quot; which prevents the collection from being definitive. Still, the Police were responsible for some of the greatest rock tunes of all time, and all 11 originals are superb: &quot;Roxanne,&quot; &quot;Walking on the Moon,&quot; &quot;Invisible Sun,&quot; &quot;Every Little Thing She Does Is Magic,&quot; &quot;King of Pain,&quot; the title track, and others. The only criticism is the absence of other hits/videos/radio faves such as &quot;Synchronicity II,&quot; &quot;Demolition Man,&quot; and &quot;So Lonely.&quot; [In 1995, A&amp;M replaced Every Breath You Take: The Singles with Every Breath You Take: The Classics, which finally included the original version of &quot;Don&amp;#039;t Stand So Close to Me,&quot; as well as its 1986 remake, and a remix of &quot;Message in a Bottle.&quot;]\n\n[b]Bio:[/b]\n\nNominally, the Police were punk rock, but that&amp;#039;s only in the loosest sense of the term. The trio&amp;#039;s nervous, reggae-injected pop/rock was punky, but it wasn&amp;#039;t necessarily punk. All three members were considerably more technically proficient than the average punk or new wave band. Andy Summers had a precise guitar attack that created dense, interlocking waves of sounds and effects. Stewart Copeland could play polyrhythms effortlessly. And Sting, with his high, keening voice, was capable of constructing infectiously catchy pop songs. While they weren&amp;#039;t punk, the Police certainly demonstrated that the punk spirit could have a future in pop music. As their career progressed, the Police grew considerably more adventurous, experimenting with jazz and various world musics. All the while, the band&amp;#039;s tight delivery and mastery of the pop single kept their audience increasing, and by 1983, they were the most popular rock &amp; roll band in the world. Though they were at the height of their fame, internal tensions caused the band to splinter apart in 1984, with Sting picking up the majority of the band&amp;#039;s audience to become an international superstar.\n\nStewart Copeland and Sting (born Gordon Sumner) formed the Police in 1977. Prior to the band&amp;#039;s formation, Copeland, the son of a CIA agent, had attended college in California, before he moved to England and joined the progressive rock band Curved Air. Sting was a teacher and a ditch digger who played in jazz-rock bands, including Last Exit, on the side. The two musicians met at a local jazz club and decided to form a progressive pop band with guitarist Henri Padovani. For the first few months, the group played local London pubs. Soon, they were hired to appear as a bleached-blonde punk band in a chewing gum commercial. While the commercial provided exposure, it drew the scorn of genuine punkers. Late in 1977, the band released its first single, &quot;Fall Out,&quot; on IRS, an independent label Stewart Copeland founded with his brother Miles, who was also the manager of the Police. The single was a sizable hit for an independent release, selling about 70,000 copies.\n\nPadovani was replaced by Andy Summers, a veteran of the British Invasion, following the release of &quot;Fall Out.&quot; Summers had previous played with Eric Burdon&amp;#039;s second lineup of the Animals, the Zoot Money&amp;#039;s Big Roll Band, the Kevin Ayers Band, and Neil Sedaka. The Police signed with A&amp;M by the spring of 1978, committing to a contract that gave the group a higher royalty rate in lieu of a large advance. A&amp;M released &quot;Roxanne&quot; in the spring of 1978, but it failed to chart. The Police set out on a tour of America in the summer of 1978 without any record to support, traveling across the country in a rented van and playing with rented equipment. Released in the fall of 1978, Outlandos d&amp;#039;Amour began a slow climb into the British Top Ten and American Top 30. Immediately after its release, the group began a U.K. tour supporting Alberto y los Trios Paranoias and released the &quot;So Lonely&quot; single. By the spring of 1979, the re-released &quot;Roxanne&quot; had climbed to number 12 on the U.K. charts, taking Outlandos d&amp;#039;Amour to number six. In the summer of 1979, Sting appeared in Quadrophenia, a British film based on the Who album of the same name; later that year, he acted in Radio On.\n\nPreceded by the number one British single &quot;Message in a Bottle,&quot; Reggatta de Blanc (fall 1979) established the group as stars in England and Europe, topping the U.K. charts for four weeks. Following its release, Miles Copeland had the band tour several countries that rarely received concerts from foreign performers, including Thailand, India, Mexico, Greece, and Egypt. Zenyatta Mondatta, released in the fall of 1980, became the Police&amp;#039;s North American breakthrough, reaching the Top Ten in the U.S. and Canada; in England, the album spent four weeks at number one. &quot;Don&amp;#039;t Stand So Close to Me,&quot; the album&amp;#039;s first single, became the group&amp;#039;s second number one single in the U.K.; in America, the single became their second Top Ten hit in the spring of 1981, following the number ten placing of &quot;De Do Do Do, De Da Da Da&quot; in the winter. By the beginning of 1981, the Police were able to sell out Madison Square Garden. Capitalizing on their success, the band returned to the studio in the summer of 1981 to record their fourth album with producer Hugh Padgham. The sessions, which were filmed for a BBC documentary hosted by Jools Holland, were completed within a couple months, and the album, Ghost in the Machine, appeared in the fall of 1981. Ghost in the Machine became an instant hit, reaching number one in the U.K. and number two in the U.S. as &quot;Every Little Thing She Does Is Magic&quot; became their biggest hit to date.\n\nFollowing their whirlwind success of 1980 and 1981, in which they were named the Best British Group at the first Brit Awards and won three Grammys, the band took a break in 1982. Though they played their first arena concerts and headlined the U.S. Festival, each member pursued side projects during the course of the year. Sting acted in Brimstone and Treacle, releasing a solo single, &quot;Spread a Little Happiness,&quot; from the soundtrack; the song became a British hit. Copeland scored Francis Ford Coppola&amp;#039;s Rumble Fish, as well as the San Francisco Ballet&amp;#039;s King Lear, and released an album under the name Klark Kent; he also played on several sessions for Peter Gabriel. Summers recorded an instrumental album, I Advance Masked, with Robert Fripp. The Police returned in the summer of 1983 with Synchronicity, which entered the U.K. charts at number one and quickly climbed to the same position in the U.S., where it would stay for 17 weeks. Synchronicity became a blockbuster success on the strength of the ballad &quot;Every Breath You Take.&quot; Spending eight weeks at the top of the U.S. charts, &quot;Every Breath You Take&quot; became one of the biggest American hits of all time; it spent four weeks at the top of the U.K. charts. &quot;King of Pain&quot; and &quot;Wrapped Around Your Finger&quot; became hits over the course of 1983, sending Synchronicity to multi-platinum status in America and Britain. The Police supported the album with a blockbuster, record-breaking world tour that set precedents for tours for the remainder of the &amp;#039;80s. Once the tour was completed, the band announced they were going on &quot;sabbatical&quot; in order to pursue outside interests.\n\nThe Police never returned from sabbatical. During the Synchronicity tour, personal and creative tensions between the bandmembers had escalated greatly, and they had no desire to work together for a while. Sting began working on a jazz-tinged solo project immediately, releasing The Dream of the Blue Turtles in 1985. The album became an international hit, establishing him as a commercial force outside of the band. Copeland and Summers demonstrated no inclination to follow their bandmate&amp;#039;s path. Copeland recorded the worldbeat exploration The Rhythmatist in 1985, and continued to compose scores for film and television; he later formed the prog rock band Animal Logic. With his solo career -- which didn&amp;#039;t officially begin until the release of 1987&amp;#039;s XYZ -- Summers continued his art rock and jazz fusion experiments; he also occasionally collaborated Fripp and John Etheridge.\n\nDuring 1986, the Police made a few attempts to reunite, playing an Amnesty International concert and attempting to record a handful of new tracks for a greatest-hits album in the summer. As the studio session unraveled, it became apparent that Sting had no intention of giving the band his new songs to record, so the group re-recorded a couple of old songs, but even those were thrown off track after Copeland suffered a polo injury. Featuring a new version of &quot;Don&amp;#039;t Stand So Close to Me,&quot; the compilation Every Breath You Take: The Singles was released for the 1986 Christmas season, becoming the group&amp;#039;s fifth straight British number one and their fourth American Top Ten. Following its release, the group quietly disbanded, reuniting to play Sting&amp;#039;s marriage in 1992. That same year, a Greatest Hits album was released in the U.K. The following year, the box set Message in a Box: The Complete Recordings was released, followed in 1995 by the double album Live. \n\n[b]Tracks:[/b]\n\n   1.  Roxanne\n   2. Can&amp;#039;t Stand Losing You\n   3. Message in a Bottle\n   4. Walking on the Moon\n   5. Don&amp;#039;t Stand So Close to Me &amp;#039;86\n   6. De Do Do Do, De Da Da Da\n   7. Every Little Thing She Does Is Magic\n   8. Invisible Sun\n   9. Spirits in the Material World\n  10. Every Breath You Take\n  11. King of Pain\n  12. Wrapped Around Your Finger\n\n[b]Rating (of 10):[/b]\n\n9\n\n[b]Release Date:[/b]\n\n1986\n\n[b]Label:[/b]\n\nA&amp;M\n\n[b]Genre:[/b]\n\n* Rock\n\n[b]Styles:[/b]\n\n    * Pop/Rock\n    * Album Rock\n\n[b]Bitrate:[/b]\n\n128kbps\n\n[b]File format:[/b]\n\nmp3\n\n[b]File size:[/b]\n\n46.0 MB\n\n[b]Discography[/b]\n\n1978 Outlandos d&amp;#039;Amour\n1979 Reggatta de Blanc\n1980 Zenyatta Mondatta\n1981 Ghost In The Machine\n1983 Synchronicity\n1995 Live!","torrent":{"xt":"urn:btih:cf79711bd7349581dd6b57f1ce7c7f19219420e3","amp;dn":"The+Police+-+1986+-+Every+Breath+You+Take+The+Singles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf79711bd7349581dd6b57f1ce7c7f19219420e3","infoHashBuffer":{"type":"Buffer","data":[207,121,113,27,215,52,149,129,221,107,87,241,206,124,127,25,33,148,32,227]},"announce":[],"urlList":[]}}