{"title":"Werner Herzog - Mein Liebster Feind (1999)","uid":3579751,"size":680912530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf8f8f96fbefa1291b690ce378bbb75ddacce70e&amp;dn=Werner+Herzog+-+Mein+Liebster+Feind+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"IggyPop","files":3,"time":1166538644,"description":"Mein Liebster Feind / My Best Fiend\nDirected By : Werner Hezog\nLanguage : German\nSubtitles : English\n\n\n\nFile Name .............: Mein liebster Feind - Klaus Kinski.avi\nFile Size (in bytes) ..: 680,852,122 bytes\nRuntime (# of frames) .: 01:35:03 (142570 frames)\n\nVideo Codec ...........: XviD\nFrame Size ............: 720x416 () [=] [=1.731]\nFPS ...................: 25.000\nVideo Bitrate .........: 818 kb/s\nBits per Pixel ........: 0.109 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[N-VOP]...[]...[]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 128 kb/s [2 channel(s)] CBR audio\nInterleave ............: 84 ms\nNo. of audio streams ..: 1\n\n\n\nAMG Review:\n    To say the working relationship between director Werner Herzog and actor Klaus Kinski was often stormy strains the boundaries of understatement. Kinski&amp;#039;s tirades against Herzog are the stuff of legend -- Kinski&amp;#039;s scabrous autobiography All I Need is Love features a number of venomous rants against the director far too foul to recount here, while Herzog had to threaten Kinski with murder to get him to complete his work on Aguirre, The Wrath Of God. However, the collaboration between these two men, no matter how combative, resulted in the finest, most memorable work of either&amp;#039;s career, including Aguirre, Nosferatu, Woyzeck and Fitzcarraldo, before Kinski&amp;#039;s death in 1991 ended the partnership. Mein Leibster Feind/My Best Fiend is a documentary by Herzog about his work with Kinski, and portrays the actor with a large degree of affection while making no secret of his volatile nature (an actor displays a scar on his head from a wound Kinski inflicted with a sword, while an outtake from Fitzcarraldo shows him terrorizing a member of the crew). Despite their remarkable differences, Herzog sums up their working relationship with admirable conclusion: &quot;We complemented one another. I needed him and he needed me.&quot; Mein Leibster Feind/My Best Fiend was produced for European television, though it did receive a screening (out of competition) at the 1999 Cannes Film Festival.\n    Werner Herzog&amp;#039;s documentary is a thoughtful and clever examination by the director of his longstanding friendship and creative partnership with the late Klaus Kinski. It&amp;#039;s not a biography, and there&amp;#039;s little information about Kinski&amp;#039;s life outside of Herzog&amp;#039;s purview. There&amp;#039;s a brief, but fascinating clip of Kinski on stage during his &quot;Jesus Tour,&quot; wherein the actor traveled through Germany, ranting at his audiences, claiming to be the &quot;new Jesus.&quot; Herzog claims that Kinski was a madman, and there&amp;#039;s ample evidence of the actor&amp;#039;s mental imbalance in outtakes as he throws lengthy tantrums and is seen smashing another actor over the head with a sword. But Herzog also shows Kinski&amp;#039;s power as an actor, contrasting a clip of Jason Robards playing Fitzcarraldo with a clip of the raving Kinski playing the same scene after he replaced Robards. Herzog also interviews Claudia Cardinale and Eva Mattes, who worked with Kinski on Herzog&amp;#039;s films and remember him as a gentle and sensitive man. Herzog is a skilled documentarian, and is himself a fascinating subject, as had already been proven in Les Blank&amp;#039;s excellent account of the making of Fitzcarraldo, Burden of Dreams. He&amp;#039;s softened a bit since those days, but his fierce intellect shines through. Some may wish that the film included more clips of Kinski, as the footage there is of him -- raving, performing, and playing with a butterfly -- is incredible, while Herzog&amp;#039;s stories are even more astounding. The director takes credit for a lot of the actor&amp;#039;s work, describing how he essentially tricked Kinski into giving him just the performance he wanted, and at one point even claiming he helped Kinski come up with the horrible insults he throws at Herzog in his autobiography. One wishes Kinski were still around to let Herzog have it one more time.\n\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\&amp;#039;\t\t","torrent":{"xt":"urn:btih:cf8f8f96fbefa1291b690ce378bbb75ddacce70e","amp;dn":"Werner+Herzog+-+Mein+Liebster+Feind+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf8f8f96fbefa1291b690ce378bbb75ddacce70e","infoHashBuffer":{"type":"Buffer","data":[207,143,143,150,251,239,161,41,27,105,12,227,120,187,183,93,218,204,231,14]},"announce":[],"urlList":[]}}