{"title":"Wynton Marsalis-14 albums","uid":4680253,"size":1110470832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cfb995a38d89aec7369914c98ee6a05ab5a6d548&amp;dn=Wynton+Marsalis-14+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1233047490,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nWynton Learson Marsalis (born October 18, 1961) is an American trumpeter and composer. He is among the most prominent jazz musicians of the modern era and is also a well-known instrumentalist in classical music. He is also the Musical Director of Jazz at Lincoln Center. A compilation of his series of inspirational letters to a young jazz musical student, named Anthony, has been published as To a Young Jazz Musician.\nMarsalis has made his reputation with a combination of skill in jazz performance and composition, a sophisticated yet earthy and hip personal style, an impressive knowledge of jazz and jazz history, and skill as a virtuoso classical trumpeter. As of 2006, he has made sixteen classical and more than thirty jazz recordings, has been awarded nine Grammys between the genres, and has been awarded the Pulitzer Prize for Music, the first time it has been awarded for a jazz recording.\nMarsalis (pronounced: mar-sal-us) was born to Dolores Ferdinand and Ellis Marsalis, Jr., a New Orleans-based music teacher and pianist. He is the second of six sons: Branford (1960), Wynton (1961), Ellis III (1964), Delfeayo (1965), Mboya Kinyatta (1971), and Jason (1977). Branford, Delfeayo, and Jason are also jazz musicians. Ellis is a poet, photographer and network engineer based in Baltimore. Mboya has autism. \nAt an early age, Marsalis exhibited a keen interest and aptitude in music. At age six, Marsalis was given his first trumpet by a friend of his father, the legendary Al Hirt. At age eight he performed traditional New Orleans music in the Fairview Baptist Church band led by legendary banjoist, Danny Barker. At fourteen he was invited to perform with the New Orleans Philharmonic. During his high school years attending Benjamin Franklin High School, Marsalis was a member of the New Orleans Symphony Brass Quintet, New Orleans Community Concert Band, under the direction of Peter Dombourian, New Orleans Youth Orchestra, New Orleans Symphony and on weekends he performed in a jazz band as well as in the popular local funk band, the Creators.\nHe moved to New York City to attend the Juilliard School of Music in 1978 and quickly garnered a lot of attention.\nTwo years later in 1980, he joined the Jazz Messengers to study under master drummer and bandleader, Art Blakey. It was from Blakey that Marsalis acquired his concept for bandleading and for bringing intensity to each and every performance. In 1981, Marsalis toured with the Herbie Hancock quartet throughout the USA and Japan, as well as performing at the Newport Jazz Festival with Herbie. In the years to follow, Marsalis was invited to perform with Sarah Vaughan, Dizzy Gillespie, Harry Edison, Clark Terry, Sonny Rollins, and other countless jazz legends.\nMarsalis eventually assembled his own band and hit the road, performing over 120 concerts every year for ten consecutive years. His objective was to learn how to play, and to comprehend how best to give to his audience. Through an exhaustive series of performances, lectures, and music workshops, Marsalis rekindled widespread interest in an art form that had been largely abandoned and redefined out of what he saw as its artistic substance. Marsalis invested his creative energy as an advocate for a relatively small era in the history of jazz. He garnered recognition for the older generation of jazz musicians and prompted the re-issuance of jazz catalog by record companies worldwide. A quick glance at the better known jazz musicians today reveals many students of Marsalis's workshops and members of his formations: James Carter, Christian McBride, Roy Hargrove, Harry Connick, Jr., Nicholas Payton, Eric Reed and Eric Lewis.\nNot content to focus solely on his musicianship, Marsalis devoted equal time to developing his compositional skills. The dance community quickly embraced his works, and he received commissions to create major compositions for Garth Fagan Dance, Peter Martins at the New York City Ballet, Twyla Tharp for the American Ballet Theatre, and for the Alvin Ailey American Dance Theatre.\nMarsalis collaborated with The Chamber Music Society of Lincoln Center in 1995 to compose the string quartet, At The Octoroon Balls, and again in 1998 to create a response to the Stravinsky: A Soldier's Tale with his composition, A Fiddler's Tale.\nIn 1997 he became the first jazz musician to win the Pulitzer Prize in music, for his epic oratorio, Blood on the Fields, on the subject of slavery.\nIn 2006, Marsalis's US$833,686 annual salary as Artistic Director of Jazz at Lincoln Center drew negative attention in an article published by Reader's Digest magazine regarding overspending by non-profit organizations. Marsalis has never been married but has two sons with Candace Stanley and another son with actress Victoria Rowell. \n\n","torrent":{"xt":"urn:btih:cfb995a38d89aec7369914c98ee6a05ab5a6d548","amp;dn":"Wynton+Marsalis-14+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfb995a38d89aec7369914c98ee6a05ab5a6d548","infoHashBuffer":{"type":"Buffer","data":[207,185,149,163,141,137,174,199,54,153,20,201,142,230,160,90,181,166,213,72]},"announce":[],"urlList":[]}}