{"title":"Writing Art and Architecture (Art Ebook).pdf","uid":11397863,"size":11490004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0253365f322f7563a485cc2678fa10316df67c6&amp;dn=Writing+Art+and+Architecture+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1415385973,"description":"Pdf / English / 184 pages / 2010 / 10.9 MB / by Andrew Benjamin\n\nIn his new book, the eminent philosopher Andrew Benjamin turns his attention to architecture, design, sculpture, painting and writing. Drawing predominantly on a European tradition of modern philosophical criticism running from the German Romantics through Walter Benjamin and beyond, he offers a sequence of strong meditations on a diverse ensemble of works and themes: on the library and the house, on architectural theory, on Rachel Whiteread, Peter Eisenman, Anselm Kiefer, Peter Nielson, David Hawley, Terri Bird, Elizabeth Presa and others. In Benjamin's hands, criticism is bound up with judgment. Objects of criticism always become more than mere documents. These essays dissolve the prejudices that have determined our relation to aesthetic objects and to thought, releasing in their very care and attentiveness to the 'objects themselves' the unexpected potentialities such objects harbour. In his sensitivity to what he calls 'the particularity of material events', Benjamin's writing comes to exemplify new possibilities for the contemporary practice of criticism itself. These essays are a major contribution to critical thought about art and architecture today, and a genuine work of what Benjamin himself identifies as a 'materialist aesthetics'","torrent":{"xt":"urn:btih:d0253365f322f7563a485cc2678fa10316df67c6","amp;dn":"Writing+Art+and+Architecture+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0253365f322f7563a485cc2678fa10316df67c6","infoHashBuffer":{"type":"Buffer","data":[208,37,51,101,243,34,247,86,58,72,92,194,103,143,161,3,22,223,103,198]},"announce":[],"urlList":[]}}