{"title":"InfiniteSkills Learning jQuery Programming","uid":8670303,"size":492372770,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d0924587e0f04f8bb5c165e7feafa5c7e16e54f1&amp;dn=InfiniteSkills+Learning+jQuery+Programming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"sigor10","files":-1,"time":1373484137,"description":"Learning jQuery Programming\n\nSKU: 01660 | Duration: 4.5 hours - 62 tutorial videos \nWorks on: Windows PC or Mac | Format: DVD and Download | Instructor: Craig Buckler\n\nIn this Query programming Training Video, expert developer, author and all around web training guru Craig Buckler introduces you to the world of AJAX programming with the popular Javascript library - jQuery. Part of the Web 2.0 revolution - jQuery makes rich web interactions easier to program by providing a toolbox of functions that you can use to spruce up your website!\n\nStarting by first introducing you to jQuery, the teaching style Craig uses to convey this sometimes complex topic makes it easy to learn. The examples he uses are easy to understand, and the lessons build on one another throughout the training course. You will begin by learning the essentials of working with CSS selections, and quickly move on to creating animations - slides, easing, fading, and more. The training escalates with DOM manipulation, event handling, and AJAX interactions. You will even learn how to create your own jQuery plugins. The training course concludes with you working alongside Craig to create real-world usable tab controls, and a browser game written with jQuery!\n\nAnyone, regardless of your level of experience, can follow this easy-to-learn training tutorial, and quickly pick up the essentials you need to add jQuery to your web development portfolio. By the conclusion of this video training, you will be fully capable of creating rich-web interactions on your personal, or clients websites. Extensive working files are included so you can follow along with the author.","torrent":{"xt":"urn:btih:d0924587e0f04f8bb5c165e7feafa5c7e16e54f1","amp;dn":"InfiniteSkills+Learning+jQuery+Programming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0924587e0f04f8bb5c165e7feafa5c7e16e54f1","infoHashBuffer":{"type":"Buffer","data":[208,146,69,135,224,240,79,139,181,193,101,231,254,175,165,199,225,110,84,241]},"announce":[],"urlList":[]}}