{"title":"The Flaming Lips - Discography (1987-2013) [FLAC]","uid":8893832,"size":9977756279,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0dc090a1d7a567d4d1df184851a06f72903eeeb&amp;dn=The+Flaming+Lips+-+Discography+%281987-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":9,"uploader":"politux","files":-1,"time":1378651265,"description":"\n  The Flaming Lips - Discography (1987-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Dream Pop, Noise Pop\n  Source: CD, vinyl\n  Codec: FLAC\n  Bit Rates: ~ 900 kbps, ~ 2,900 kbps\n  Bit Depth: 16, 24\n  Sampling Rates: 44,100 Hz, 96,000 Hz\n\n  CD Rips (16/44)\n\n  1987 Hear It Is\n  1987 Oh My Gawd!!\n  1989 Telepathic Surgery\n  1990 In a Priest Driven Ambulance\n  1992 Hit to Death in the Future Head\n  1993 Transmission from the Satellite Heart\n  1995 Clouds Taste Metallic \n  1997 Zaireeka\n  1999 The Soft Bulletin\n  2002 Yoshimi Battles The Pink Robots\n  2006 At War with the Mystics\n  2009 Embryonic\n  2009 Dark Side of the Moon\n  2013 The Terror\n\n  EP's \n\n  2003 Ego Tripping at the Gates of Hell\n  2003 Fight Test\n  2006 It Overtakes Me\n  2009 The Soft Bulletin Outtakes\n\n  Vinyl Rips (24/96)\n\n  1999 The Soft Bulletin (two versions, 24/44 and 24/96)\n  2013 The Terror \n  \n  Even within the eclectic world of alternative rock, few bands were so brave, so frequently brilliant, and so deliciously weird as the Flaming Lips. From their beginnings as Oklahoma weirdos to their mid-'90s pop culture breakthrough to their status as one of the most respected groups of the 2000s, the Lips rode one of the more surreal and haphazard career trajectories in pop music. An acid-bubblegum band with as much affinity for sweet melodies as blistering noise assaults, their off-kilter sound, uncommon emotional depth, and bizarre history (packed with tales of self-immolating fans and the like) firmly established them as true originals.\n\n  The Flaming Lips formed in Oklahoma City, Oklahoma, in 1983, when founder and guitarist Wayne Coyne allegedly stole a collection of musical instruments from an area church hall and enlisted his vocalist brother Mark and bassist Michael Ivins to start a band. Giving themselves the nonsensical name the Flaming Lips (its origin variously attributed to a porn film, an obscure drug reference, or a dream in which a fiery Virgin Mary plants a kiss on Wayne in the back seat of his car), the band made its live debut at a local transvestite club. After progressing through an endless string of drummers, they recruited percussionist Richard English and recorded their self-titled debut, issued on green vinyl on their own Lovely Sorts of Death label in 1985.\n\n  When Mark Coyne soon departed to get married, Wayne assumed full control of the group; in addition to remaining its lead guitarist, he also became the primary singer and songwriter. Continuing on as a trio, the Lips released 1986's Hear It Is, followed a year later by Oh My Gawd!!!...The Flaming Lips. While touring in support of the Butthole Surfers, they played Buffalo, New York, where they were befriended by concert promoter Jonathan Donahue; after a jam session with Donahue's nascent band Mercury Rev, he and Coyne became close friends, and Donahue eventually signed on as the group's sound technician.\n\n  After recording 1988's difficult Telepathic Surgery, English exited, reducing the Lips to the core duo of Coyne and Ivins; after adding drummer Nathan Roberts, Donahue adopted the name Dingus and became a full-time member in time to cut 1990's stellar In a Priest Driven Ambulance while simultaneously recording the brilliant Mercury Rev debut, Yerself Is Steam. Following a series of hopeful phone calls to Warner Bros., the company signed the Lips in 1991, and in 1992 their oft-delayed major-label debut, Hit to Death in the Future Head, appeared to little commercial notice. Donahue soon exited to focus his full energies on Mercury Rev, followed by the departure of Roberts.","torrent":{"xt":"urn:btih:d0dc090a1d7a567d4d1df184851a06f72903eeeb","amp;dn":"The+Flaming+Lips+-+Discography+%281987-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0dc090a1d7a567d4d1df184851a06f72903eeeb","infoHashBuffer":{"type":"Buffer","data":[208,220,9,10,29,122,86,125,77,29,241,132,133,26,6,247,41,3,238,235]},"announce":[],"urlList":[]}}