{"title":"THE SIMS 3: PETS - SWAG - XBOX360 - REGION FREE {BOOBSMAN}","uid":6750477,"size":6636923470,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d0e65755943d39af5f10cb73b47bc18316c92b4e&amp;dn=THE+SIMS+3%3A+PETS+-+SWAG+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"boobsman","files":70,"time":1318811877,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.pix2links.com/image/STm9b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pix2links.com/image/STm9b.jpg&lt;/a&gt;\n\nThe Sims 3: Pets is an entirely new, standalone game for the Xbox 360\n\nCreate perfect-or imperfect-pets for your Sims, from loyal dogs to daring kitties, as you determine their looks and personality traits. Then take control of these pets and experience the world from their perspective. Enjoy a little mischief by destroying furniture or impress others by mastering new skills like hunting. Lead your Sims on adventures, like uncovering relics and solving mysteries.\n\nMore pets mean more fun: With a variety of breeds and creative ways to customize your Sims' pets, create unique dogs and cats with limitless possibilities!\n\nBe the pet: Wield control of your pets to chase, dig, tackle, and more. Be the perfect companion or wreak havoc on your Sims!\n\nEmbark on an adventure: Sims can explore the history of town, using their pets to sniff out treasures, uncover mysteries, catch rare collectible pets, and maybe even seen ghosts\n\nPets have their own traits: From intelligent, friendly, and proud to playful, adventurous, and aggressive, determine the personalities of your Sims' pets\n\nPets can learn skills: Cats and dogs can learn to hunt, dogs can learn to locate collectibles and fetch your Sims a date. With career opportunities, your Sims' pets can even work their way up the chain to become the ultimate criminal mastermind\n\nSims can take their pets outside! Take Spike to the park, bring Whiskers to the library, or ride Star to the new Equestrian Center\n\nExclusively on XBOX 360: Use Kinect for Xbox 360 to direct your Sims and their pets using voice commands. Tell Spike to sit, send Billy to the bathroom, or get Mary to make breakfast\n","torrent":{"xt":"urn:btih:d0e65755943d39af5f10cb73b47bc18316c92b4e","amp;dn":"THE+SIMS+3%3A+PETS+-+SWAG+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e65755943d39af5f10cb73b47bc18316c92b4e","infoHashBuffer":{"type":"Buffer","data":[208,230,87,85,148,61,57,175,95,16,203,115,180,123,193,131,22,201,43,78]},"announce":[],"urlList":[]}}