{"title":"Nanban: Japanese Soul Food (2015) epub","uid":11879761,"size":25849043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d111d158d7d5681fd44e19233cb88ede516cd05a&amp;dn=Nanban%3A+Japanese+Soul+Food+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"bookzilla","files":1,"time":1430652487,"description":"Nanban: Japanese Soul Food is an exploration of southern Japanese cookery focused on authentic yet easy-to-follow recipes. \n\nThese recipes are set within the context of the region's history and the story of 2011 MasterChef winner Tim Anderson's personal relationship with the cuisine of Japan; from first discovering Japanese food on American TV as a teenager, through his time spent as a researcher and English teacher in Japan, up to his victory on MasterChef and opening the Nanban pop-up restaurants in London. Nanban means 'barbaric' and it is what the Japanese originally called Europeans, when they first arrived in the south of Japan having travelled via the East Indies. The food of southern Japan is still flavoured by its history of foreign influences, and in some ways it can still be described as barbaric: it tends to be unrefined, casual, filling and boasts brash flavours like garlic, pork fat, chilli, sweet potatoes and citrus. Challenging the commonly held idea that Japanese food is delicate and fussy, the book reveals a cuisine that is both accessible and delicious. As well as over 100 mouthwatering recipes, the book features practical guides to ingredients, techniques and equipment. A stunning combination of lush photography, compelling narratives and inspirational recipes make this a book as suited to the coffee table as it is to the kitchen countertop","torrent":{"xt":"urn:btih:d111d158d7d5681fd44e19233cb88ede516cd05a","amp;dn":"Nanban%3A+Japanese+Soul+Food+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d111d158d7d5681fd44e19233cb88ede516cd05a","infoHashBuffer":{"type":"Buffer","data":[209,17,209,88,215,213,104,31,212,78,25,35,60,184,142,222,81,108,208,90]},"announce":[],"urlList":[]}}