{"title":"Deception Point - Dan Brown - Unabridged Audio Book","uid":3501577,"size":486766880,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1136f17a2ef8c9666eebb108b667a944eacd82f&amp;dn=Deception+Point+-+Dan+Brown+-+Unabridged+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"rhild","files":1,"time":1152326886,"description":"Deception Point by  Dan Brown. Unabridged Audio Book. 64kbps MP3 encoded.\n\nBrown&amp;#039;s dazzling high-tech adventure opens with NASA personnel making a startling discovery. An ancient meteorite is found buried within an Arctic glacier. Samples taken from this meteorite reveal that it contains fossils from life forms not previously seen on Earth. Could this discovery prove that we are not alone in the universe? To answer that question, several civilian scientists are dispatched to the site in order to investigate the origin of the fossils and verify NASA&amp;#039;s findings. Before any official announcement can be made, however, one of the scientists dies under mysterious circumstances. The remaining scientists quickly realize that all is not what it appears to be as they struggle to separate truth from deceit. With this latest story, Brown (Digital Fortress) proves once again that he is among the most intelligent and dynamic of authors in the thriller genre. He has skillfully blended his own wit and style with the rip-roaring adventure of Cussler and the modern technology of Clancy.","torrent":{"xt":"urn:btih:d1136f17a2ef8c9666eebb108b667a944eacd82f","amp;dn":"Deception+Point+-+Dan+Brown+-+Unabridged+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1136f17a2ef8c9666eebb108b667a944eacd82f","infoHashBuffer":{"type":"Buffer","data":[209,19,111,23,162,239,140,150,102,238,187,16,139,102,122,148,78,172,216,47]},"announce":[],"urlList":[]}}