{"title":"Black Sabbath - Heaven &amp; Hell 320cbr (Big Papi)","uid":9485262,"size":96385995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d1b947ea2a7b6807ad97fac35050268a4c7734b0&amp;dn=Black+Sabbath+-+Heaven+%26amp%3B+Hell+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389877418,"description":"Source: CD rip\n\n\n\n\nBy J. Wesley\nI have had this for about a year, and I cannot stress this enough: Heaven and Hell by Black Sabbath is very possibly the best rock album EVER. I cannot put into words how great this album is. Ronnie James Dio's powerful voice was not so much a replacement for Ozzy Osbourne, it was more of a transformation. This &quot;new&quot; Sabbath sounds NOTHING like the old Sabbath. The musical and lyrical themes are magical, mystical kinds of stuff.\n\nThe album kicks off with, in my opinion, the best Sabbath song in their entire career. &quot;Neon Knights&quot; also happens to be my all-time favorite rock song. Right from the start, you know that something has changed about the band. They start off with a hard-rocking groove, and then all of a sudden... Dio's amazing voice takes the music into another dimension! In terms of songwriting, this is one of the best songs in either Sabbath's or Dio's catalog. The climax of the song, though, is Iommi's guitar solo. I could listen to this guitar solo on repeat for the rest of my life. Feel it!\n\nThe second song, &quot;Children of the Sea,&quot; is slower, and heavier. The main crawling criff is one of the best on the album, and Dio's vocal part is very melodic and beautiful. This is one of the best songs on the album.\n\n&quot;Lady Evil&quot; is an uptempo rocker that makes you want to move! &quot;There's a place just south of Witches' Valley...&quot; This is also a highlight of the album. It has one of the best guitar solos on the record, as well.\n\n&quot;Heaven and Hell,&quot; for many people, is the climax of the album (and for good reason!). From the opening hard-driving riff, you know this song is going to be something special. The guitar pummels away with the rhythm section for a little while, then pulls back, leaving only the drums and a mid-paced, galloping bass line. Enter Dio!\nThen, suddenly, the first power chords of &quot;Wishing Well&quot; shake the silence! This is another great melodic track.\n\n&quot;Die Young&quot; is one of the highlights of the album, with its furious, power-chord-driven riff, and infectious melody. This song contains some of Iommi's best guitar work on the album, even the little filler licks in between the vocal lines are incredible. Some of Iommi's most inspired work.\n\n&quot;Walk Away&quot; is the only track on the album I would not recommend to everyone. It is kind of a pop attempt, and many Sabbath fans slander it for this reason. However, it is still a very good song, and should be appreciated for what it is.\n\nThe closer, &quot;Lonely Is the Word,&quot; is obviously a personal song to Iommi. It is sloooow, and very bluesy. Tony Iommi himself says that it is one of his favorite guitar solos. This is a very sad song, but very calm also, and a great way to close the album.\n\nWhat else can I say? If you are a fan of rock music, this is one of the best things you can possibly spend your money on. It has been my all-time favorite album ever since I got it, and it still is! It stands the test of time, and has redeeming value through many, many listens.","torrent":{"xt":"urn:btih:d1b947ea2a7b6807ad97fac35050268a4c7734b0","amp;dn":"Black+Sabbath+-+Heaven+%26amp%3B+Hell+320cbr+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b947ea2a7b6807ad97fac35050268a4c7734b0","infoHashBuffer":{"type":"Buffer","data":[209,185,71,234,42,123,104,7,173,151,250,195,80,80,38,138,76,119,52,176]},"announce":[],"urlList":[]}}