{"title":"Macross Frontier - The Complete Series plus Complete Music MP3s","uid":4429918,"size":5385751189,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d2942fa9ff2e45890a8534e17a1644199224fab8&amp;dn=Macross+Frontier+-+The+Complete+Series+plus+Complete+Music+MP3s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"HolyTreeOneGross","files":95,"time":1223232109,"description":"Macross Frontier is the most recent Japanese anime television series set in the Macross universe.\n\n\n\n\n\n\nFor those of you who haven't seen the original Macross, well, you missed one of the classics of Anime.  This is its heir- surpassing the original, and being probably one of the best anime's on its own merits.  From the plot to the story to the singing (song is an integral part of the story, not just something that happens over the credits- but thankfully, not in a 'musical' way, (i.e., this isn't the Sound of Music) \n\nMy suggestion if you're on the fence is to download this, setting priority to the first seven episodes- watch them.  Episode 7 is frankly, and I am not alone in thinking this, a crowning moment of awesome- I don't mean it has one, or a few- the whole bloody episode is.  If you're a (new) Battlestar Galactica fan, you're gonna like it, (and does the original Macross feel like BSG in reverse almost)?  Incredible battle scenes, music that gets you going, animation that is spot on, characters that you can relate to and feel for, homages that sometimes are there to mess with the audience (episiode 17, anyone?), ...  If you've never really tried anime, this is where to do it- Its a great mature (as in, you can enjoy if you're over 8, not 'naughty') anime that is fairly accessable and just simply fantastic.\n\nThis is my first torrent, and I will seed as long as I can- but help is appreciated!\n\n\nEveryone...  LISTEN TO MY SONG!  \n\n\n\n\n\n\n\n\nPlot and overview\nThe new show celebrates the 25th anniversary of the original Super Dimension Fortress Macross TV series (1982~1983), and is chronologically subsequent to Macross 7 (1994~1996). This third TV series introduces Earth's latest main variable fighter, the VF-25 Messiah and a new ship called the Macross Frontier. The show retains the signature space opera theme consistent with all series set in the Macross universe (which intertwine musical numbers with fast-paced variable fighter combat). \n\nThe series features the 25th New Macross-class Colonial Fleet, dubbed the Macross Frontier, en route to the galactic center. This heavily-populated interstellar fleet (consisting of numerous civilian vessels and their military escorts) contains a makeup of both human occupants and their Zentradi allies. As such, many of the Macross Frontier's companion vessels appear to merge more metallic Human designs with organic Zentradi aesthetics. On the Macross timeline, the story is set in the year 2059, 47 years after the original Super Dimension Fortress Macross, 19 years after Macross Plus and 14 years after the story of Macross 7. Macross Frontier's plot explores a combination of action/political intrigue/space drama more than previous Macross series have done in the past.\n\nAs the series begin, during a mission to an unexplored asteroid belt a reconnaissance New U.N. Spacy (N.U.N.S.) VF-171 is destroyed by extremely powerful and fast insectoid biomechanical alien mecha known as the &quot;Vajra&quot;, which immediately begin their attack on the rest of the fleet. Not being able to stop the new enemy threat, the N.U.N.S. Colonial Defense Forces authorize the deployment of a Civilian Military Provider organization called S.M.S. (Strategic Military Services) which utilizes the new VF-25 Messiah variable fighter to destroy the alien menace.\n\n\n\n\nLunar Anime Forums were responsible for the subbing- I'd give them a 95/100, and a big thank you for doing it at all!\n","torrent":{"xt":"urn:btih:d2942fa9ff2e45890a8534e17a1644199224fab8","amp;dn":"Macross+Frontier+-+The+Complete+Series+plus+Complete+Music+MP3s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2942fa9ff2e45890a8534e17a1644199224fab8","infoHashBuffer":{"type":"Buffer","data":[210,148,47,169,255,46,69,137,10,133,52,225,122,22,68,25,146,36,250,184]},"announce":[],"urlList":[]}}