{"title":"Ezra Furman and The Harpoons - Banging Down the Doors [2007] [FL","uid":8748667,"size":377428388,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2a16f892e8e0fb380bcca7b743f6927fdff3a5c&amp;dn=Ezra+Furman+and+The+Harpoons+-+Banging+Down+the+Doors+%5B2007%5D+%5BFL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dickspic","files":16,"time":1374986800,"description":"Artist: Ezra Furman &amp; The Harpoons\nRelease: Banging Down the Doors\nReleased: 2007\nLabel: Minty Fresh\nCatalog#: 70080\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: indie folk,rock\n\n\n1. Mother's Day\n\n2. How Long, Diana?\n\n3. I Wanna Be a Sheep\n\n4. I Wanna Be Ignored\n\n5. American Highway\n\n6. God Is a Middle-Aged Woman\n\n7. Hotel Room in Casablanca\n\n8. Halloween Snow\n\n9. The Little Red-Haired Girl\n\n10. My Soul Has Escaped from My Body\n\n11. She's All I Got Left\n\n12. I Dreamed of Moses\n\n13. Lydia Sherman\n\nEvery few years or so, an artist is hailed as the next Bob Dylan and 99 times out of 100 it's a completely unjust comparison. That said, the confessional commentary and whimsical stream of conscious narratives that Ezra Furman spews forth on Banging Down the Doors could have been taken straight out of a textbook of Dylanology 101. But the key factor that makes Furman stand out from many of the other Zimmerman wannabes and upcoming indie folk revivalists is a unique personality and a childlike innocence that shine through and make him easily relatable. It's similar to the &quot;pal factor&quot; that Jonathan Richman had fronting the Modern Lovers and that Gordon Gano had in the Violent Femmes. Furman connects to his audience intimately, like a friend who is casually baring his soul, and delivers literal references and abstract theories without a hint of pretension. There's a whole lot of heart behind Furman's delivery, and he deeply means whatever he says, no matter how strange the situation. In one instance, he tries to talk God (who, in this case, is personified as a middle-aged woman with planets for earrings) out of marrying &quot;some stupid guy&quot; that she is settling for because she's not getting any younger. In another, he sings from the perspective of a bloodthirsty wolf that falls in love with a shepherd and desperately longs to change his ways, despite his intrinsically violent nature and ends his last verse with an agonizing howl. Furman's enthusiastic delivery can sometimes distract from the merits of the prose as he yelps with an unnerving urgency, shifting between awkward, quirky, and playful and straining his voice to a grating frequency that earns comparisons to Alec Ounsworth from Clap Your Hands Say Yeah. It's an acquired taste, and something that will likely overwhelm a lot of the audience's eardrums, which is unfortunate, because it becomes abundantly clear that his intention is not to alienate anyone, but just the contrary as he screams, &quot;this is only our first record, I want you to love me!&quot; Whether he's singing from his personal perspective, as in the lucid &quot;She's All I Got Left,&quot; or tells stories riddled in metaphors in &quot;My Soul Has Escaped from My Body,&quot; the themes always feel accessible and the tunes are the type that reward with repeated listens. The Harpoons do a great job of keeping the accompaniment simple and Furman, well, even if he's not the first to try and emulate an iconic folk legend, he's one of the rare few authentic poets to do it so well.","torrent":{"xt":"urn:btih:d2a16f892e8e0fb380bcca7b743f6927fdff3a5c","amp;dn":"Ezra+Furman+and+The+Harpoons+-+Banging+Down+the+Doors+%5B2007%5D+%5BFL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2a16f892e8e0fb380bcca7b743f6927fdff3a5c","infoHashBuffer":{"type":"Buffer","data":[210,161,111,137,46,142,15,179,128,188,202,123,116,63,105,39,253,255,58,92]},"announce":[],"urlList":[]}}