{"title":"Che Guevara -A Revolutionary Life by Jon Lee Anderson(epub)[roge","uid":6260215,"size":7341541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d37a3b8d7527668944b6401c867bb0e572ca2079&amp;dn=Che+Guevara+-A+Revolutionary+Life+by+Jon+Lee+Anderson%28epub%29%5Broge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"rogercc1","files":1,"time":1300724857,"description":"Che Guevara: A Revolutionary Life By Jon Lee Anderson\nPublisher: Grove Press\nISBN: 978-0-8021-9725-2\nPages: 1037\nLanguage:English\nFormat:epub\n\nChe Guevara: A Revolutionary Life: Che Guevara was a dashing rebel whose epic dream was to end poverty and injustice in Latin America and the developing world through armed revolution. Jon Lee Anderson traces Che's extraordinary life from his comfortable Argentine upbringing to the battlefields of the Cuban revolution, from the halls of power in Castro's government to his failed campaign in the Congo and his assassination in the Bolivian jungle. Meticulously researched and full of exclusive information, this work illuminates as never before the mythic figure who embodied the high-water mark of revolutionary communism as a force in history.\n\n\n\nJon Lee Anderson (born January 15, 1957)[/b] is a biographer, author, international investigative reporter, and staff writer for The New Yorker, reporting from warzone locales such as Afghanistan, Iraq, Uganda, Israel, El Salvador, Ireland, Lebanon, Iran, and throughout the Middle East. Anderson has also written for The New York Times, Harper's, Life, and The Nation.\nAnderson began working as a reporter in 1979 for the Lima Times in Peru. During the 1980s he covered Central America, first for the syndicated columnist Jack Anderson and later for Time magazine.\n\n","torrent":{"xt":"urn:btih:d37a3b8d7527668944b6401c867bb0e572ca2079","amp;dn":"Che+Guevara+-A+Revolutionary+Life+by+Jon+Lee+Anderson%28epub%29%5Broge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37a3b8d7527668944b6401c867bb0e572ca2079","infoHashBuffer":{"type":"Buffer","data":[211,122,59,141,117,39,102,137,68,182,64,28,134,123,176,229,114,202,32,121]},"announce":[],"urlList":[]}}