{"title":"Casomai (DvdRip ITA)","uid":5178052,"size":729716736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d380594248aa53077ff5d16a9c8212748b78afcf&amp;dn=Casomai+%28DvdRip+ITA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"black mamba TNT","files":-1,"time":1259083989,"description":"Anno: 2002\nGenere: Commedia\nRegia: Alessandro D'Alatri\nCast: Stefania Rocca, Fabio Volo\n\n\nInfo: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0319147/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0319147/&lt;/a&gt;\n\n\nTrama:\n\nStefania e Tommaso s'incontrano, si innamorano e cominciano una storia che li porterÃƒÂ  al matrimonio. Il loro rapporto perÃƒÂ² deve costantemente confrontarsi con le aspettative, i consigli, le interferenze di amici, parenti, datori di lavoro. Con il tempo la passione comincia a scemare e contemporaneamente sorgono i problemi legati alla maternitÃƒÂ , al lavoro, all'isolamento sociale. Stefania e Tommaso entrano in crisi, si tradiscono e arrivano persino ad odiarsi.Scopriamo che questo quadro a tinte fosche non ÃƒÂ¨ altro che una previsione fatta da don Livio il giorno delle nozze di Stefania e Tommaso. Il sacerdote vuole far riflettere gli invitati sulle loro responsabilitÃƒÂ  e convincerli a non interferire con la coppia. Stefania e Tommaso si sposano nella chiesa momentaneamente vuota perchÃƒÂ© quel momento sia unicamente loro.\n\n\nCommento:\n\nDel tutto avulso dal filone generazionale, &quot;Casomai&quot; ÃƒÂ¨ un film che attinge alla migliore tradizione del cinema italiano, dal realismo alla commedia, per superane gli aspetti piÃƒÂ¹ datati e inventare, da quella grammatica, un linguaggio nuovo e originale. Il montaggio, in modo particolare, riesce a creare atmosfere dense di significati e immagini affascinanti, dando a tutta la pellicola un ritmo musicale e moderno che si sposa particolarmente bene con la colonna sonora. Voltando le spalle a quel cinema che punta tutto sulla sceneggiatura, D'Alatri dirige il suo film come un'orchestra in cui tutti gli strumenti sono ugualmente importanti. Dialoghi realistici che conservano la freschezza del parlato, attori giovani e brillanti, scenografie che non rimangono sullo sfondo ma si modellano sulle emozioni dei personaggi, una fotografia che taglia lo spazio e lo immerge in tinte innaturali, poetiche, metaforiche. Tutto questo al servizio di una storia che percorre un lungo lasso di tempo e costringe lo spettatore a seguire il percorso completo dei protagonisti. Non una coppia colta in un momento di crisi dunque, ma la denuncia di un male che logora l'amore e che si chiama invadenza. Una passione che muore perchÃƒÂ© non ha la forza di opporsi alle interferenze di amici, parenti, denaro, aspetti reali di un quotidiano che troppo spesso soffoca i sentimenti.\n\n\n\nScheda Tecnica:\n\nDimensione: 695Mb\nDurata: 01h51\n\nVideo codec: DX50/Divx\nVideo bitrate: 754kbps\nRisoluzione: 640x336\nFPS (Frames/sec): 25000\n\nAudio codec: Mp3\nAudio bitrate: 112Kb/s (2chnls)\nFreq Audio: 48000 Hz\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/2-26.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/2-26.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/1-25.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/1-25.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d380594248aa53077ff5d16a9c8212748b78afcf","amp;dn":"Casomai+%28DvdRip+ITA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d380594248aa53077ff5d16a9c8212748b78afcf","infoHashBuffer":{"type":"Buffer","data":[211,128,89,66,72,170,83,7,127,245,209,106,156,130,18,116,139,120,175,207]},"announce":[],"urlList":[]}}