{"title":"PMI.Practice.Standard.for.Work.Breakdown.Structures.Second.Editi","uid":4455395,"size":1958679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3a368bf3e08009216380abb37fca8a0940b1ca0&amp;dn=PMI.Practice.Standard.for.Work.Breakdown.Structures.Second.Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"rlabs","files":1,"time":1224457067,"description":"Project Management Institute &quot;Practice Standard for Work Breakdown Structures&quot;, Second Edition.\n\nThis is the first practice standard that the Project Management Institute (PMI) has developed to complement and elaborate on the information contained in its de facto global standard for the profession, A Guide to the Project Management Body of Knowledge (PMBOK Guide) - 2000 Edition. It provides guidance and universal principles for the initial generation, subsequent development, and application of the Work Breakdown Structure (WBS). Successful project management uses planning techniques to define the project objectives in sufficient detail to support effective management of the project. The WBS provides the foundation for defining work as it relates to project objectives and establishes the structure for managing the work to its completion. Each descending level of a WBS represents an increasingly detailed definition of the project work.\n\nThis PMI standard provides an introduction to the WBS concept, defines the WBS and its characteristics, discusses the benefits of using a WBS, and demonstrates how to build a WBS and determine if it is sufficient for subsequent planning and control. A unique feature of this handbook is the inclusion of 11 industry-specific WBS examples. Constituting over half of the book, these examples aid the reader in further understanding, creating, and using WBSs in the following industries or applications:\n\n-Oil, Gas, and Petrochemical (OGP)\n-Environmental Management\n-Process Improvement\n-Pharmaceutical\n-Process Plant Construction\n\n-Service Industry Outsourcing\n-Web Design\n-Telecommunications\n-Refinery Turnaround\n-Government Design-Bid-Build\n-Software Implementation\n\nExamples are in different stages of completion and represent the evolutionary development of a WBS. None of the examples should be taken as the only right WBS for that type of project. This is the first-of-its-kind Practice Standard from the world's largest professional association for project management. It will enable project managers, project team leaders, contract personnel, and others interested in managing any aspect of a project to prepare a useful and high quality Work Breakdown Structure.","torrent":{"xt":"urn:btih:d3a368bf3e08009216380abb37fca8a0940b1ca0","amp;dn":"PMI.Practice.Standard.for.Work.Breakdown.Structures.Second.Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3a368bf3e08009216380abb37fca8a0940b1ca0","infoHashBuffer":{"type":"Buffer","data":[211,163,104,191,62,8,0,146,22,56,10,187,55,252,168,160,148,11,28,160]},"announce":[],"urlList":[]}}