{"title":"Elvis Costello - This Years Model [1978][2002][320 KBPS]","uid":8380928,"size":109593540,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d40c58cab510d4d7614ae47d79ba13d3db2845fa&amp;dn=Elvis+Costello+-+This+Years+Model+%5B1978%5D%5B2002%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"LameDuck69","files":17,"time":1366159421,"description":"Elvis Costello - This Years Model [1978][2002]\n\n\n\n\n\n01. No Action  \n02. This Year's Girl  \n03. Beat  \n04. Pump It Up  \n05. Little Triggers  \n06. You Belong to Me  \n07. Hand in Hand  \n08. (I Don't Want to Go To) Chelsea  \n09. Lip Service  \n10. Living in Paradise  \n11. Lipstick Vogue  \n12. Night Rally  \n13. Radio, Radio \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\n \nElvis Costello (born Declan Patrick MacManus; 25 August 1954) is an English singer-songwriter. He began his career as part of London's pub rock scene in the early 1970s and later became associated with the first wave of the British Punk/New Wave movement of the mid-to-late 1970s. His critically acclaimed debut album, My Aim Is True, was recorded in 1976. Shortly after recording his first album, he formed The Attractions as his backing band. They toured and recorded together for the better part of a decade, though differences between Costello and members of The Attractions caused them to split by 1986. Much of Costello's work since 1986 has been credited to him as a solo artist, though partial reunions with some members of The Attractions have been credited to the group over the years.\n\nSteeped in word play, the vocabulary of Costello's lyrics is broader than that of most popular songs. His music has drawn on many diverse genres; one critic described him as a &quot;pop encyclopaedia&quot;, able to &quot;reinvent the past in his own image&quot;.\n\nCostello has won multiple awards in his career, including a Grammy Award, and has twice been nominated for the Brit Award for Best British Male. In 2003, Elvis Costello and the Attractions were inducted into the Rock and Roll Hall of Fame. In 2004, Rolling Stone ranked Costello number 80 on their list of the 100 Greatest Artists of All Time.\n\n-----------------------------------------------------------------------------------\n\nThis Year's Model is Elvis Costello's second album and his first with The Attractions, released in 1978. It was recorded mainly at Eden Studios in West London.\n\nIt was voted the best album of the year in The Village Voice Pazz &amp; Jop critics poll. In 2000, Q magazine placed This Year's Model at number 82 in its list of the 100 Greatest British Albums Ever. In 1987, Rolling Stone magazine ranked it number 11 on its list of the best albums of the period 1967-1987. In 2003, the album was ranked number 98 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n","torrent":{"xt":"urn:btih:d40c58cab510d4d7614ae47d79ba13d3db2845fa","amp;dn":"Elvis+Costello+-+This+Years+Model+%5B1978%5D%5B2002%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d40c58cab510d4d7614ae47d79ba13d3db2845fa","infoHashBuffer":{"type":"Buffer","data":[212,12,88,202,181,16,212,215,97,74,228,125,121,186,19,211,219,40,69,250]},"announce":[],"urlList":[]}}