{"title":"Guide to Research Techniques in Neuroscience, 2E [PDF][StormRG]","uid":11805407,"size":8971035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4577a085219dae2f28a5d45b06244d596ddb8ab&amp;dn=Guide+to+Research+Techniques+in+Neuroscience%2C+2E+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"0xmovva","files":3,"time":1428558591,"description":"TITLE/EDITION Guide to Research Techniques in Neuroscience, Second Edition\nBy: Matt Carter (Author), Jennifer C. Shieh (Author)\nPaperback: 418 pages\nPublisher: Academic Press; 2 edition (March 16, 2015)\nLanguage: English\nISBN-10: 0128005114\nISBN-13: 978-0128005118\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nNeuroscience is, by definition, a multidisciplinary field: some scientists study genes and proteins at the molecular level while others study neural circuitry using electrophysiology and high-resolution optics. A single topic can be studied using techniques from genetics, imaging, biochemistry, or electrophysiology. Therefore, it can be daunting for young scientists or anyone new to neuroscience to learn how to read the primary literature and develop their own experiments.\n\nThis volume addresses that gap, gathering multidisciplinary knowledge and providing tools for understanding the neuroscience techniques that are essential to the field, and allowing the reader to design experiments in a variety of neuroscience disciplines.\n\nWritten to provide a &quot;hands-on&quot; approach for graduate students, postdocs, or anyone new to the neurosciences\nTechniques within one field are compared, allowing readers to select the best techniques for their own work\nIncludes key articles, books, and protocols for additional detailed study\nData analysis boxes in each chapter help with data interpretation and offer guidelines on how best to represent results\nWalk-through boxes guide readers step-by-step through experiments","torrent":{"xt":"urn:btih:d4577a085219dae2f28a5d45b06244d596ddb8ab","amp;dn":"Guide+to+Research+Techniques+in+Neuroscience%2C+2E+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4577a085219dae2f28a5d45b06244d596ddb8ab","infoHashBuffer":{"type":"Buffer","data":[212,87,122,8,82,25,218,226,242,138,93,69,176,98,68,213,150,221,184,171]},"announce":[],"urlList":[]}}