{"title":"Sonic the Hedgehog - The Movie - 1999 - xVid - [TheByrus]","uid":4344114,"size":735368024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4e11d1fffef67e17352b4e500fd9134e309911f&amp;dn=Sonic+the+Hedgehog+-+The+Movie+-+1999+-+xVid+-+%5BTheByrus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"thebyrus","files":-1,"time":1218779390,"description":"===============================================================================\nUploader:\tTheByrus\n\nSite:\t\tPirateBay.org\n\nFiles:\t\tSonic the Hedgehog - The Movie (OVA) - [TheByrus].avi (701 MB - xVid - Encoded with AutoGK)\n\t\tTheByrus - MOVIE INFO!.txt (0 Bytes)\n\nTrackers:\thttp://tpb.tracker.thepiratebay.se:80/announce\n\t\tudp://tpb.tracker.thepiratebay.se:80/announce\n===============================================================================\n                    \n[Information from imdb.com]\n\nSonic the Hedgehog - The Movie\n\nDirector: \tKazunori Ikegami\n\nWriters: \tMasashi Kubota (story)\n\t \tYuji Naka (characters)\n\nGenre:\t\tAnimation | Action | Adventure | Comedy | Family | Sci-Fi\n\nVoice Actors:\tMartin Burke  \t\tSonic the Hedgehog\n    \t\tLainie Fraiser  \tMiles &quot;Tails&quot; Prower\n    \t\tBill Wise  \t\tKnuckles the Echidna\n    \t    \tEdwin Neal  \t\tDr. Robotnik/The President\n   \t\tSascha Biesi  \t\tSara\n    \t\tCharlie Campbell  \tOld Man Owl\n   \t\tGary Dehan  \t\tMetal Sonic\n\nRelease:\t1999 (USA)\n\n\nLength:\t\t60 Minutes/1 Hour\n\nLanguage:\tEnglish\n\nSubtitles:\tNone\n\nRating:\t\tG (USA), PG (UK)\n\n==================================================================================\n[Information from Wikipedia]\n\nSummary:\n\nSonic and Tails are enjoying a peaceful day when the President's messenger comes asking Sonic to come to his office. Once there, Doctor Eggman has kidnapped the President and his daughter in order to get Sonic to take care of a problem: a giant mecha (known as Black Eggman in the Japanese version and Metal Robotnik in English dub) appeared in Dr. Eggman's utopian city of Eggmanland (called Robotropolis in English dub as a tie-in with the Sonic cartoon) and banishes the doctor and sabotages the Robot Generator, which will explode in less than a day. Eggman asks Sonic to head the Land of Darkness to stop it. Once there, the blue blur defeats the mecha, who turns out to be Eggman himself who lured Sonic to his base in order to copy his memories and knowledge for his new robot, Hyper Metal Sonic, an evil Sonic-shaped robot who shares his memories and feelings, and essentially lives the same life as Sonic himself.\n\nIn the English dubbed version, the two regions are referred to as being &quot;separate dimensions&quot;, most likely due to a translation error.\n\nThe Land of the Sky consists of an unknown number of continents that drift high in the stratosphere of the planet, all of them connected to a massive ice formation (referred to in the dubbed version as a glacier, but more likely a mountain) which also serves to anchor them to the planet's surface below, much like the Little Planet from Sonic the Hedgehog CD. According to Knuckles of this continuity, if this ice network was destroyed, Planet Freedom's rotation would hurl the Land of the Sky into outer space, undoubtedly killing everyone on it.\n\nThe Land of Darkness is the title used to address the actual surface of Planet Freedom, a post-apocalyptic wilderness where only one known individual lives: Dr. Eggman. Most of its terrain is untamed and mountainous, but Sonic and Tails eventually reach a very modern city, where they see that the ruins of buildings are crumbling into the sea. This is where Robotnik's empire of Eggmanland is located (landmarks strongly suggest that it resides in what was once Manhattan). The Land of Darkness may earn its name because the thick clouds that block out most of the sun's light. Despite its gloom, the Land of Darkness is quite verdant, though all of its regions are littered with deadly booby-traps and killer robots designed by Eggman. The Land of Darkness can only be accessed in one of two ways: by a whirlwind-like &quot;portal&quot; in the Land of the Sky, or by chancing into a warp zone; an extradimensional link between two points on Planet Freedom. The city and look of the land strongly imply that Planet Freedom is a post apocalyptic Earth that was built upon with floating islands known as the Land of the Sky.\n===================================================================================\n\nPLEASE! If you enjoy this movie, purchase it on DVD! It's a fun film to have as a Sonic fan. A real blast from the past. Enjoy! =) Also, this is my first rip/upload ^.^; I hope the quality is good enough for you guys.","torrent":{"xt":"urn:btih:d4e11d1fffef67e17352b4e500fd9134e309911f","amp;dn":"Sonic+the+Hedgehog+-+The+Movie+-+1999+-+xVid+-+%5BTheByrus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4e11d1fffef67e17352b4e500fd9134e309911f","infoHashBuffer":{"type":"Buffer","data":[212,225,29,31,255,239,103,225,115,82,180,229,0,253,145,52,227,9,145,31]},"announce":[],"urlList":[]}}