{"title":"Jerry Garcia &amp; David Grisman - Shady Grove (1996) [FLAC]","uid":11012030,"size":444333754,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d5027e1e376b5575e4622f358174214c992bb2ad&amp;dn=Jerry+Garcia+%26amp%3B+David+Grisman+-+Shady+Grove+%281996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":45,"time":1410378084,"description":"Here it is with full scans worth having. Enjoy!\n\n Review by William Ruhlmann  [-]\n\nIn the last five years of his life, Jerry Garcia frequently dropped in on his old friend, mandolin player David Grisman, to play and record the kind of folk, bluegrass, and old-timey music they had both begun their careers with in the early '60s. Grisman released two Garcia/Grisman albums on his Acoustic Disc label during Garcia's lifetime, and this is the first to be compiled since his death. In a note, Grisman writes, &quot;I decided to organize this material by genre; this first volume is comprised of traditional folk songs and ballads.&quot; Indeed, among the 13 tracks here are versions of children's ballads and other ancient songs that formed the repertoire of some of the folk groups that both players belonged to. Grisman has included a lavish CD booklet containing thorough annotations by New Lost City Ramblers member John Cohen that trace the origins of each of the songs and detail Garcia and Grisman's backgrounds. One gets the sense that Cohen and Grisman are trying to provide a tutorial to Deadheads who may be puzzled. The effect of all the scholarship is to imply that the sessions are more deliberate than a hearing suggests, however. The playing is loose and spontaneous, and Garcia is not always in the best voice. Nevertheless, Grisman is right to begin his documentation of Garcia's last sessions with an album that ties directly into the guitarist's initial musical passions.\n","torrent":{"xt":"urn:btih:d5027e1e376b5575e4622f358174214c992bb2ad","amp;dn":"Jerry+Garcia+%26amp%3B+David+Grisman+-+Shady+Grove+%281996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5027e1e376b5575e4622f358174214c992bb2ad","infoHashBuffer":{"type":"Buffer","data":[213,2,126,30,55,107,85,117,228,98,47,53,129,116,33,76,153,43,178,173]},"announce":[],"urlList":[]}}