{"title":"PlÃƒÂ¡cido, 1961 Luis GarcÃƒÂ­a Berlanga","uid":5588741,"size":731799552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d53c977547a21f9f1cc7f9fa0e14b2362c849526&amp;dn=Pl%C3%83%C2%A1cido%2C+1961+Luis+Garc%C3%83%C2%ADa+Berlanga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Darkman64","files":1,"time":1274793561,"description":"Esta sÃƒÂ¡tira disfrazada de comedia es una inteligente crÃƒÂ­tica social que desnuda las hipocresÃƒÂ­as mÃƒÂ¡s acÃƒÂ©rrimas de quienes aparentan hacer caridad de corazÃƒÂ³n y en el fondo sienten fastidio por la misericordia hacia los demÃƒÂ¡s. Tenemos una interesante descripciÃƒÂ³n sobre cÃƒÂ³mo funcionan los dobleces en la sociedad humana, donde en apariencias y en dichos todos ayudan y acogen a un pobre en la cena de nochebuena, pero en el fondo se sienten desprestigiados por tener a un marginal sentado con ellos. La mezquindad disimulada con el uso indiscriminado de caretas de amabilidad y misericordia, las falsas apariencias pululan, la falsedad y la astucia de los mÃƒÂ¡s pudientes que acallan sus conciencias mostrÃƒÂ¡ndose colaboradores con los miserables ante la vista de todos mientras en su interioridad sienten repugnancia. Una comedia inteligente que nos pone en situaciÃƒÂ³n de reflexiÃƒÂ³n y en donde la risa surge de situaciones que deberÃƒÂ­an avergonzar por las miserias humanas que son destapadas en esta vertiginosa cinta de enredos y de incisivos diÃƒÂ¡logos. Gran reparto donde no se destaca nadie porque todos juntos, en un trabajo coral interesante, constituyen un bloque indisoluble para que la pelÃƒÂ­cula funcione. ","torrent":{"xt":"urn:btih:d53c977547a21f9f1cc7f9fa0e14b2362c849526","amp;dn":"Pl%C3%83%C2%A1cido%2C+1961+Luis+Garc%C3%83%C2%ADa+Berlanga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d53c977547a21f9f1cc7f9fa0e14b2362c849526","infoHashBuffer":{"type":"Buffer","data":[213,60,151,117,71,162,31,159,28,199,249,250,14,20,178,54,44,132,149,38]},"announce":[],"urlList":[]}}