{"title":"New torrent - THE SLOW-CARB COOKBOOK - Timothy Ferriss 4-hr Body","uid":8895155,"size":16803088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d542c00314feaf34987d4ed6bc77ba02b23ab10f&amp;dn=New+torrent+-+THE+SLOW-CARB+COOKBOOK+-+Timothy+Ferriss+4-hr+Body&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"tri895","files":2,"time":1378681978,"description":"&quot;4-Hour Body_ An Uncommon Guide to Rapid Fat-Loss, Incredible Sex, and Becoming Superhuman, The - Timothy Ferriss&quot;\n\n\nTHE SLOW-CARB COOKBOOK \n&quot;Simple Fat-Loss Recipes for 4-Hour Body, from Chefs, Readers, Foodies, and more&quot;\n\n\n\nThis is the diet cookbook and the Timothy Ferriss 4-Hour Body book. \n\nI think its great, I used the ideas and lost alot of weight and kept it off for over 3 years now. I really recommend you get his book like I did as the download one doesnt do it or him justice, so respect Timothy for all those years of hard work. (As you will see when you read his book, so go get it)\n\n\n\nThanks to atviking for the fixings (the orginal file).  \n\nnotes:\n- make sure you have breakfast within 30 mins of waking up, try to get as much protein in your breakfast as possible. have a meal every few hours and dont go hungry. cut out or reduce flour, rice and potatoes. also reduce fruit intake (too much sugar) especially acidic ones\n\nkeep the stomach full especially if on medication. stick to the diet for the week but take one day a week off and eat whatever you want for that day - I chose Saturday (try to go to a restaurant to do this or eat out, so there is no left over foods for the next day)\n\n\nEnjoy, let me know if it worked for you and good luck.\n\n\n\n&gt;&gt;ok lets try this again, sorry computer trouble","torrent":{"xt":"urn:btih:d542c00314feaf34987d4ed6bc77ba02b23ab10f","amp;dn":"New+torrent+-+THE+SLOW-CARB+COOKBOOK+-+Timothy+Ferriss+4-hr+Body","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d542c00314feaf34987d4ed6bc77ba02b23ab10f","infoHashBuffer":{"type":"Buffer","data":[213,66,192,3,20,254,175,52,152,125,78,214,188,119,186,2,178,58,177,15]},"announce":[],"urlList":[]}}