{"title":"Password Recovery Bundle 2012 Enterprise v2.5 with Key [iahq76]","uid":7691453,"size":34790708,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d5a4a35fa76c0743b678126597c7a0634306b6a7&amp;dn=Password+Recovery+Bundle+2012+Enterprise+v2.5+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"TorDigger","files":3,"time":1349264295,"description":"Password Recovery Bundle\n \nPowerful All-In-One Password Recovery Software\n \nPassword Recovery Bundle 2012 is a handy toolkit to recover all your lost or forgotten passwords in an easy way! Quickly recover or reset passwords for Windows, PDF, ZIP, RAR, Office Word/Excel/PowerPoint documents. Retrieve passwords for all popular instant messengers, email clients, web browsers, FTP clients and many other applications. A useful password recovery software for both newbie and expert with no technical skills required. No need to call in an expensive PC technician\n \nReset Windows Password\n \nInstantly bypass, unlock or reset lost administrator and other account passwords on any Windows 7, 2008, Vista, XP, 2003, 2000 system, if you forgot Windows password and couldn't log into the computer. It can also reset Windows domain administrator/user password for Windows 2008 / 2003 / 2000 Active Directory servers.\n \nRetrieve Email Password\n \nRetrieve passwords to mail accounts created in Microsoft Outlook 98 / 2000 / XP / 2003 / 2007 / 2010, Outlook Express, Windows Mail, Windows Live Mail, Hotmail, Gmail, Eudora, Incredimail, Becky! Internet Mail, Phoenix Mail, Ipswitch IMail Server, Reach-a-Mail, Mozilla Thunderbird, Opera Mail, The Bat!, PocoMail, Pegasus Mail, etc.\n \nInstant Messenger Password\n \nRecovers lost or forgotten passwords for MSN Messenger, Windows Messenger, MSN Explorer, Windows Live Messenger, AIM Pro, AIM 6.x and 7.x, Google Talk, MyspaceIM, Trillian Basic, Trillian Pro, Trillian Astra, Paltalk, Miranda, Digsby, Pidgin, GAIM, EasyWebCam, Camfrog Video Chat, Ipswitch Instant Messaging, etc.\n \nUnlock Password-Protected Files\n \nPST Password Recovery - Instantly recover lost or forgotten passwords for Microsoft Outlook 2010 / 2007 / 2003 / XP / 2000 / 97 personal folder (.pst) files.PDF Password Recovery - Recover lost passwords of protected PDF files (*.pdf). Instantly remove PDF restrictions for editing, copying, printing and extracting data.Office Password Recovery - Recover forgotten passwords for Microsoft Office Word / Excel / PowerPoint 2010 / 2007 / 2003 / X P / 2000 / 97 documents.Archive Password Recovery - Recover lost or forgotten passwords for WinRAR or RAR archives, and ZIP archive created with WinZip, WinRAR, PKZip, etc.MS Access Password Recovery - Unlock Microsoft Office Access XP / 2003 / 2000 / 97 / 95 database.SQL Server Password Recovery - Reset forgotten SQL Server login password for SQL Server 2000 / 2005 / 2008.\n \nRecover Internet Password\n \nBrowser Password Recovery - Recover passwords to Web sites saved in Microsoft Internet Explorer 6 / 7 / 8 / 9, Mozilla Firefox, Opera, Apple Safari, Google Chrome. It also allows you to remove IE Content Advisor password.FTP Password Recovery - Decrypt FTP passwords stored by most popular FTP clients: CuteFTP, SmartFTP, FileZilla, FlashFXP, WS_FTP, CoreFTP, FTP Control, FTP Navigator, FTP Commander, FTP Voyager, WebDrive, 32bit FTP, SecureFX, AutoFTP, BulletProof FTP, Far Manager, etc.\n \nReveal Asterisk Password\n \nIt enables you to view passwords hidden behind the asterisks in password fields of many programs, such as Internet Explorer, CoffeeCup FTP, WinSCP, FTP Explorer, FTP Now, Direct FTP, Orbit Downloader, Mail.Ru Agent, Group Mail, Evernote and much more.\n \n\nSystem Requirement\n \nWindows 7, 2008, Vista, XP, 2003, 2000 (32-bit &amp; 64-bit)At least 512M physical RAM50 MB or more free hard disk space \n\nHomepage:\n \nInstallation Instructions:\n \n1. Install Program.\n2. Use given key to register application.\n3. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:d5a4a35fa76c0743b678126597c7a0634306b6a7","amp;dn":"Password+Recovery+Bundle+2012+Enterprise+v2.5+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5a4a35fa76c0743b678126597c7a0634306b6a7","infoHashBuffer":{"type":"Buffer","data":[213,164,163,95,167,108,7,67,182,120,18,101,151,199,160,99,67,6,182,167]},"announce":[],"urlList":[]}}