{"title":"[X-Art] Gabriella, Anneli, Veronika, Samantha (Girls Night Out)","uid":11697278,"size":267977535,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d68e08268a69bb3cf305be24c01c58e9e0c194e6&amp;dn=%5BX-Art%5D+Gabriella%2C+Anneli%2C+Veronika%2C+Samantha+%28Girls+Night+Out%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1423766797,"description":"---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-54dce7150630c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54dce7150630c.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://image-tpb.com/img-54dce7159f226.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54dce7159f226.html&lt;/a&gt; \n\nIn this exclusive HD X-Art video four gorgeous girls go out on the town for an evening of uninhibited sex and unforgettable good times! The story is a twist on a popular sexual fantasy, but this time - the GIRLS are in control!\nIt's Friday Night and it's time to have some fun! Spanish brunette Gabriella, little blond Anneli and her two sexy girlfriends hire a limousine to chauffeur them around the city as they go clubbing. As the wheels get rolling and the champagne starts flowing, the girls chat freely, each recounting her most recent sexual experience.\nWhen Anneli brags about the time she fooled around with one of her female roommates, the other girls in the limo perk up. Acting on a dare, the older blond moves in for a flirtatious kiss. Annelia returns the favor and starts to unbutton her blouse.\nWith the music blaring, all four girls loosen their clothes and start to make out, snapping photos with their digital camera. Feeling totally uninhibited, Gabriella dares the other girls to grab a cute guy off the street and let him ride in back for a couple of blocks.\nAs the car turns the corner, they spot a handsome, dapper young man in his mid-twenties. Anneli rolls the window down. &quot;Hey! Would you mind jumping in here to take a few photos of my girlfriends and I?&quot; one of the girls asks. He gladly accepts the invitation and jumps in the back seat. Once he's inside the car, the girls agree that the guy is even cuter than they thought. They signal approval to each other and Gabriella starts to pull his shirt open to get a closer look.\nOnce his clothes are off, the girls take turns sucking the guy's cock, all the while snapping photos with their camera! Those are going to be some pretty naughty Facebook updates! Rock hard and ready, the guy needs no further encouragement. He proceeds to fuck three of the girls, one at a time, while the others cheer him on!\nThis is one Friday Night you'll never forget! Make sure to download and save this video to your permanent collection of quality erotica!\n\nSize: 267977535 bytes (255,56 MiB), duration: 00:21:57, avg.bitrate: 1628 kb/s\nAudio: mp3, 22050 Hz, 2 channels, s16, 8 kb/s\nVideo: flv, yuv420p, 960x540, 800 kb/s, 25,00 fps(r)","torrent":{"xt":"urn:btih:d68e08268a69bb3cf305be24c01c58e9e0c194e6","amp;dn":"%5BX-Art%5D+Gabriella%2C+Anneli%2C+Veronika%2C+Samantha+%28Girls+Night+Out%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68e08268a69bb3cf305be24c01c58e9e0c194e6","infoHashBuffer":{"type":"Buffer","data":[214,142,8,38,138,105,187,60,243,5,190,36,192,28,88,233,224,193,148,230]},"announce":[],"urlList":[]}}