{"title":"The Electric Prunes - Lost Dreams Best Of  (2001) 320 vtwin88cub","uid":6084684,"size":154487898,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d69ef77ea61fb7bc7b9deaff765a2c389efc1c00&amp;dn=The+Electric+Prunes+-+Lost+Dreams+Best+Of++%282001%29+320+vtwin88cub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1294271423,"description":"The Electric Prunes\nLost Dreams (2001)\n\nThough they got considerable input from talented L.A. songwriters and producers, with their two big hits penned by outside sources, the Electric Prunes did by and large play the music on their records, their first lineup writing some respectable material of their own. On their initial group of recordings, they produced a few great psychedelic garage songs, especially the scintillating &quot;I Had Too Much to Dream Last Night,&quot; which mixed distorted guitars and pop hooks with inventive, oscillating reverb. Songwriters Annette Tucker and Nancie Mantz wrote most of the Prunes' material, much of which in turn was crafted in the studio by Dave Hassinger, who had engineered some classic Rolling Stones sessions in the mid-'60s. &quot;Too Much to Dream&quot; was a big hit in 1967, and the psychedelized Bo Diddley follow-up, &quot;Get Me to the World on Time,&quot; was just as good, and also a hit. Nothing else by the group made it big, and their initial pair of albums was quite erratic, although a few scattered tracks were nearly as good as those singles. Although they began to write more of their own material on their second album, their subsequent releases were apparently the products of personnel who had little to do with the original lineup. Their third LP, Mass in F Minor, was a quasi-religious concept album of psychedelic versions of prayers; a definitively excessive period piece, its best song (&quot;Kyrie Eleison&quot;) was lifted for the Easy Rider soundtrack. None of the original Prunes were still in the lineup when the band dissolved, unnoticed, at the end of the '60s.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\nM3U Playlist:\t\tYes\n\nThis 23 track CD is the definitive collection by these '60's psychedelic legends. Collecting the best tracks from the band's first two albums, ultra-rare singles, demos and a hilarious radio spot for Vox wah-wah pedals. This is the only release anyone will ever need by the Electric Prunes. All tracks are restored and remastered by 'Prunes leader James Lowe.\n\n01.Shadows\n02.Ain't It Hard\n03.Little Oliver\n04.I Had Too Much To Dream (Last Night)\n05.I've Got A Way Of My Own\n06.Luvin'\n07.I Happen To Love You\n08.Are You Lovin' Me More (But Enyoing It Less)\n09.Hideaway\n10.Try Me On For Size\n11.The Great Banana Hoax\n12.You Never Had It Better\n13.Dr. Do-Good\n14.Get Me To The World On Time\n15.Captain Glory\n16.World Of Darkness\n17.Train For Tomorrow\n18.Big City\n19.Wind-Up Toys\n20.It's Not Fair\n21.Sold To The Highest Bidder\n22.Everybody Knows You're Not In Love\n23.Long Day's Flight\n\n\nCheers!","torrent":{"xt":"urn:btih:d69ef77ea61fb7bc7b9deaff765a2c389efc1c00","amp;dn":"The+Electric+Prunes+-+Lost+Dreams+Best+Of++%282001%29+320+vtwin88cub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d69ef77ea61fb7bc7b9deaff765a2c389efc1c00","infoHashBuffer":{"type":"Buffer","data":[214,158,247,126,166,31,183,188,123,157,234,255,118,90,44,56,158,252,28,0]},"announce":[],"urlList":[]}}