{"title":"Aliens Omnibus Volume 1-6 (2007-2009) (Pudgy-Novus Year One) [NV","uid":9106652,"size":2295052314,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d6ab4a83a780955056d34320079b33f86454323f&amp;dn=Aliens+Omnibus+Volume+1-6+%282007-2009%29+%28Pudgy-Novus+Year+One%29+%5BNV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":4,"uploader":"blackcanary","files":-1,"time":1382894090,"description":"English | CBR |  6 Issues\n\nAliens Omnibus #1-6\nPublisher:  Dark Horse\nPublication Date:  June 20, 2007 - Feburary 4, 2009\n\nWriters:  Mark Verheiden, John Arcudi, Jerry Prosser, Chris Warner, Kelly Puckett, Dan Jolley, Ian Edginton, Peter Milligan, Jim Woodring, Dave Gibbons, Anina Bennet, Paul Guinan, Sarah Byam, Chet Williamson, John Wagner, Edward Martin III, Henry Gilroy, Justin Green, James Vance, John Byrne, Ron Marz, Mark Schultz, Thierry Gagnon, Richard Forgues, Randy Stradley, Mark Verheiden, Phil Amara, Tom Bierbaum, Mary Bierbaum, Mike W. Barr, Jay Stephens, Darko Macan, Nancy A. Collins, David Lloyd, David Wenzel, Chuck Dixon, Beau Smith, \nArtists:  Mark A. Nelson, Den Beauvias, Sam Kieth, Paul Guinan, Tony Akins, Kelley Jones, Will Simpson, Paul Johnson, Killian Plunkett, Paul Guinan, Simon Bisley, David Roach, Mark Nelson, Ronnie Del Carmen, Richard Corben, Francisco Solano Lopez, John Byrne, Bernie Wrightson, Richard Forgues, Doug Wheatley, Eduardo Risso, Frank Teran, Tommy Lee Edwards, Leif Jones, David Lloyd, David Wenzel, Gray Morrow\nPencillers:  Damon Willis, Tony Akins, Allen Nunis, John Nadeau, Mike Mignola, Tim Hamilton, Doug Mahnke, Paul Mendoza, Guy Davis, Rick Leonardi, David Ross, Gene Colan, Phil Hester, Flint Henry, \nInkers:  Karl Story, Ande Parks, Terry Pallot, John Dell, Bob Smith, Jim McDermott, Jordi Ensign, Monty Sheldon, Kevin Kowlan, Timothy Bradstreet, Jimmy Palmiotti, Doug Mahnke, Andy Mushynsky, Bob Wiacek, Andrew Pepoy, Ande Parks, John Stokes\nColorists:  Chris Chalenor, Rachelle Menashe, Arthur Suydam, Les Dorscheid, Matt Hollingsworth, Pamela Rambo, Doug Jones, Robbie Busch, Paul Johnson, Alex Wald, Matt Webb, Cary Porter, Ray P. Murtaugh, John Pound, Perry McNamee, James Sinclair, Matt Webb, Chris Chuckry, Dan Jackson\nLetterer:  Willie Schubert; Jim Massara, Clem Robins, John Costanza, Ellie DeVille, Phil Owen, Steve Dutro, Gary Fields, Vickie Williams, Sean Konot, Steve Haynie, Elitta Fell, Tracey Munsey, John Workman\nCover:  John Bolton, Dave Dorman, Den Beauvias, Kilian Plunkett, and Richard Corben\n\nAliens Omnibus Volume 1:\nDark Horse Comics took the industry by storm with its release of Aliens, a comics series that for the first time captured the power of film source material and expanded its universe in a way that fans applauded worldwide. Now, the first three Dark Horse Aliens series-Outbreak, Nightmare Asylum, and Female War-are collected in a value-priced, quality-format omnibus, featuring nearly four hundred story pages in full color. Written by screen and television scribe Mark Verheiden (The Mask, Battlestar Gallactica) and illustrated with consummate skill by Mark A. Nelson, Den Beauvais, and Sam Kieth.\n\nAliens Omnibus Volume 2:\nMany humans have died horribly at the claws of the Alien. The surface of Earth has been devastated to cleanse the beasts from our world. But the commercial value of this scourge has never been in doubt, especially when the special properties of the Alien Queen's royal jelly are discovered. Will Mankind once again risk its very survival as a species in order to sleep with the Alien?  Dark Horse Comics' critically acclaimed Aliens series set the bar for how the universe of a popular film could be expanded through graphic fiction. Aliens Omnibus Volume 2 collects more of these exciting series in a value-priced, quality-format omnibus, featuring over four hundred story pages in full color. Includes the complete story arcs of Genocide, Harvest, and the never-before-collected, epic-length Colonial Marines.\n\nAliens Omnibus Volume 3:\nThe old saying &quot;You can't unbreak an egg&quot; holds true, especially when that egg unleashes an interstellar scourge, the dreaded Alien. But as dangerous and lethal as this species has proven itself time and time again, some men cannot resist the awful gravity of the creatures' potential when merged with human science . . . and arrogance . . . and lust for power. But the cold contracts of these deals with the Devil also bring out the best in humanity, and the awful crucible of struggle against this interstellar cancer brings man closer to his neighbors . . . and to his God.  Collects complete story arcs of Rogue by Ian Edginton and Will Simpson, and Labyrinth by Jim Woodring and Kilian Plunkett, and the acclaimed tale &quot;Salvation,&quot; written by Dave Gibbons and illustrated by the incomparable Mike Mignola.\n\nAliens Omnibus Volume 4:\nLike sports, the victor is he who wants it more. Unlike sports, the loser earns extinction.  Mankind has fought for survival over countless millennia, but nothing has threatened humanity's existence like the murderous Alien scourge. While some have tried to use the creatures' deadly abilities to serve their own selfish ends, no one can dance with the devil, and ultimately only one species must prevail. To that end, men have turned their own lethal instincts and cold intellect against the monsters, creating engineered plagues, cybernetic fighting suits, and even bogus android aliens, but survival rides not on technology, but on the primacy of the most deep-rooted, feral instincts.\n\nAliens Omnibus Volume 5:\nLiving with the Alien has become a fact of life and death as mankind expands throughout the galaxy. And no matter how each encounter with the deadly xenomorphs inevitably leads to disaster, man's hubris and greed just as inevitably fuel the desire to try to unlock the secrets of the demonic beasts' biology or bring the creatures under control as tools to build an even more monstrous future.\n\nCollects Aliens: Alchemy #1-3, Aliens: Kidnapped TPB, Aliens: Cargo one-shot, Aliens: Survival #1-3, &quot;Aliens: Alien&quot; (DHC #17-19), Aliens: Earth Angel one-shot, &quot;Aliens: Incubation&quot; (DHP #101-102), Aliens: Havoc #1-2, Aliens: Lovesick one-shot, &quot;Aliens: Lucky&quot; (Decade of Dark Horse TPB)\n\nAliens Omnibus Volume 6:\nMankind has always struggled to balance exploration and exploitation when stepping into new lands. In the era of the colonization of space, the discovery of new wonders is countered by the awful realities when species once separated by light years of airless void are suddenly thrown together, and the heady intoxication of discovery becomes the feral nightmare of a battle for supremacy. Humanity's arrogance and greed have helped the Alien plague spread, and now men and women must step forward to ensure that the future of the galaxy does not become the age of the Alien!\n\nThanks goes to Pudgy for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:d6ab4a83a780955056d34320079b33f86454323f","amp;dn":"Aliens+Omnibus+Volume+1-6+%282007-2009%29+%28Pudgy-Novus+Year+One%29+%5BNV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ab4a83a780955056d34320079b33f86454323f","infoHashBuffer":{"type":"Buffer","data":[214,171,74,131,167,128,149,80,86,211,67,32,7,155,51,248,100,84,50,63]},"announce":[],"urlList":[]}}