{"title":"Mission Improper - Bec McMaster [EN EPUB MOBI] [ebook] [p_s]","uid":15936730,"size":2161353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6eab9824f731e0b16d54ce05ad4717f6891eabd&amp;dn=Mission+Improper+-+Bec+McMaster+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"perfect_stan","files":2,"time":1475408678,"description":"Mission: Improper by Bec McMaster (London Steampunk: The Blue Blood Conspiracy #1)\r\nEnglish | 2016 | Science Fiction | 2.1 MB\r\n\r\n\r\nThree years ago, London society changed forever, with a revolution placing the widowed Queen firmly on the throne her blue blood husband tried to take from her. Humans, verwulfen and mechs are no longer considered the lesser classes, but not everybody is happy with the new order…\r\nEntire families have gone missing in the East End. When Caleb Byrnes receives an invitation to join the Company of Rogues as an undercover agent pledged to protect the crown, he jumps at the chance to find out who, or what, is behind the disappearances. Hunting criminals is what the darkly driven blue blood does best, and though he prefers to work alone, the opportunity is too good to resist.\r\nThe problem? He’s partnered with Ingrid Miller, the fiery and passionate verwulfen woman who won a private bet against him a year ago. Byrnes has a score to settle, but one stolen kiss and suddenly the killer is not the only thing Byrnes is interested in hunting.\r\nSoon they’re chasing whispered rumours of a secret project gone wrong, and a monster that just might be more dangerous than either of them combined. The only way to find out more is to go undercover among the blue blood elite… But when their hunt uncovers a mysterious conspiracy, Byrnes and Ingrid must set aside their age-old rivalry if they have any chance at surviving a treacherous plot.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:d6eab9824f731e0b16d54ce05ad4717f6891eabd","amp;dn":"Mission+Improper+-+Bec+McMaster+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6eab9824f731e0b16d54ce05ad4717f6891eabd","infoHashBuffer":{"type":"Buffer","data":[214,234,185,130,79,115,30,11,22,213,76,224,90,212,113,127,104,145,234,189]},"announce":[],"urlList":[]}}