{"title":"John Grisham - Skipping Christmas - Audio Book","uid":9277010,"size":141738467,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d76d31aca37ed8597aaf6e5c102bd19213a2a50d&amp;dn=John+Grisham+-+Skipping+Christmas+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Big-Papi","files":40,"time":1385878061,"description":"\nJohn Grisham - Skipping Christmas Audio Book (Big Papi) 2001 Comedy Novel 4-CD Set\n \nBy Nancy Martin\nOK, it's not your typical Grisham courtroom drama but, once again, he makes a plausible argument for &quot;skipping Christmas&quot; in his latest book of the same title. &quot;Bah Humbug&quot;, I said, when first hearing about the book's premise until the plans surrounding the main characters' scheduled departure for the Caribbean sounded so enticing that it left me wondering if they might take me along.\nWhile this book is not about doing away with Christmas forever, it's one couple's desire to just skip it, for just one year, and spend the money on a cruise instead. And, why not? Their only child Blair has just left for a stint in Peru with the Peace Corps and they are looking at spending their first Christmas alone in a very long time. But skipping Christmas entirely means not doing anything &quot;holiday&quot; related at all - no cards, no presents, no holiday parties and, most importantly, no rooftop Frosty...the &quot;symbol&quot; of Christmas in their Hemlock Street neighborhood in Illinois. But Luther and Nora KRANK are about to find out what the true &quot;symbol&quot; of Christmas really is -- whether they like it or not.\n\nWhile their friends and neighbors are appalled at their decision to forego the Christmas festivities, Luther and Nora remain stalwart in their resolution of &quot;no Christmas for the Kranks.&quot; Grisham throws some humor into many of the scenes as he has the Kranks hiding out in their own home as carolers sing Christmas songs on their lawn and then has them eating lettuce leaves in an effort to lose weight for the trip.\n\nBut it's the end of the book where the true meaning of Christmas will be exhibited. It's not money spent or gifts bought or Frosty's on the roof. It's much simpler and easier than that. The Kranks will find out that the true meaning of Christmas, in Grisham's story, is that of giving...giving of yourself. And, you'll have a good time reading how they get to this point and hoping, just as I am, that all of us will come to this realization during this upcoming holiday season.","torrent":{"xt":"urn:btih:d76d31aca37ed8597aaf6e5c102bd19213a2a50d","amp;dn":"John+Grisham+-+Skipping+Christmas+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76d31aca37ed8597aaf6e5c102bd19213a2a50d","infoHashBuffer":{"type":"Buffer","data":[215,109,49,172,163,126,216,89,122,175,110,92,16,43,209,146,19,162,165,13]},"announce":[],"urlList":[]}}