{"title":"Wacky Races(PC GAME)","uid":4248983,"size":298495374,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d8320eb473a98215156917458c0f7380415dd45a&amp;dn=Wacky+Races%28PC+GAME%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"kingswoodtown","files":1,"time":1213918088,"description":"Wacky Races(PC GAME)  Full includes Music nothing is ripped..Enjoy\n\n\nWacky Races used to be my favourite cartoon as a youngster, and now I can relive all those wacky races on the new PC game from Infogrames. Based on a simple car racing game, you can take on one of those wacky racers as you compete in a tournament, a single race, or even get in a spot of practice. You can choose from being Penelope in her Compact Pussycat, or Red Max in the Crimson Haybailer, maybe the Gruesome Twosome in the Creepy Coupe. Or what about Captain Caveman look-alikes the Slag Brothers in the Boulder Mobile, or Sergeant Blast in the Army Surplus Special. Or of course you could be suave Peter Perfect in the Turbo Terrific. Dastardly and Muttley, in their Mean Machine are there as well, though you cannot race in their car, unless you win the championship that is. \n\nThe game has some great cartoon scenes and the cars all look like they used to in the series. As you race round one of 4 scenarios (to begin with, new scenarios are added as you progress through the championship) you race alongside the others. As you drive, you can pick up tokens which will provide you with various comic weapons, tailored to the car you are driving in (Penelope Pitstop has an hilarious shovel to flatten other cars), or you can choose an accessory which will boost your speed for a while. \n\nThe game features soundbites from each of the characters, and the original music, though the soundbites are limited and get a bit boring after a while. Similarly, the circuits are a bit repetitive, and four different tracks aren?t enough to keep the interest. \n\nThe game is very easy to play, and you can virtually guarantee you are going to win unless you do something really stupid. In other words, the game is for toddlers! And in the end, the repetitive talking and monotonous tracks aren?t enough to keep the interest factor going. \n\nTake my advice, and stick to watching the reruns on satellite!","torrent":{"xt":"urn:btih:d8320eb473a98215156917458c0f7380415dd45a","amp;dn":"Wacky+Races%28PC+GAME%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8320eb473a98215156917458c0f7380415dd45a","infoHashBuffer":{"type":"Buffer","data":[216,50,14,180,115,169,130,21,21,105,23,69,140,15,115,128,65,93,212,90]},"announce":[],"urlList":[]}}