{"title":"[TabooHandJobs / Clips4Sale] Zoey Holloway (Son, I can help you","uid":13566960,"size":288765829,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d84d11512eae85e3cfd6ab406c6b1f873fbac77f&amp;dn=%5BTabooHandJobs+%2F+Clips4Sale%5D+Zoey+Holloway+%28Son%2C+I+can+help+you+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1455635222,"description":"[TabooHandJobs / Clips4Sale] Zoey Holloway (Son, I can help you with your premature ejaculation problem) 720p {Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/GSf\r\n \nhttp://imgsnaps.com/image/GSI\r\n\r\nHoney, we need to talk. You returned my laptop with quite a few windows open regarding the topic of premature ejaculation. You are the only person I let use my laptop so I know this is something you have been researching information on. I know I'm not your real mother but maybe I can be of some help regarding this uncomfortable matter. You seem to be dating quite a lot of different girls lately, are they complaining about your sexual performance? Oh, I see. So anytime a hand gets near your cock you pretty much spew your goo after only a few minutes of stimulation? Oh dear, that is a problem and one that will only complicate your life the older you get. Why don't you lie down here next to me and I will most certainly use my knowledge and experience to help you.\r\n\r\nMake yourself comfortable and get used to the idea of me touching your penis in all sorts of ways. I want you to not focus so much on the sensations my hands are giving you. Think about playing basketball or some other activity than sex. Don't you dare cum before I say you can. I'm not into giving hand jobs away for no good reason. This is strictly to help you with a sexual dysfunction. You know, there are actual qualified therapists to help you with this matter but I genuinely care for you and figure we'll try therapy at home before going and spending money in a cold doctors office for treatment. How does this feel? I can see your balls tighten up as if you are getting ready to blow your load but you must not let it go yet!\r\n\r\nGet used to all the places on your shaft and your tip that I touch so gently. Oh I know how good this all feels but you must hold your cum back until I say you can release it otherwise how will I be able to truly help you? Now I'm going to give you a little more stimulation and show you my breasts. You have to learn to control yourself in all situations so you don't continue on as that 'two pump chump'.\r\n\r\nOk, you've lasted almost fifteen minutes for me so anytime you are ready you can let go of that nasty cum. I know how much you need to release this hot load that torments you so often everyday. You can do it for me now. Oh yes, give mommie all that warm goo. I am so proud of you for lasting as long as you did! Now, you know I am all about saving money so anytime you need me to give you this therapy you come to me and we will help solve this premature ejaculation problem together until you wont have a problem with it at all","torrent":{"xt":"urn:btih:d84d11512eae85e3cfd6ab406c6b1f873fbac77f","amp;dn":"%5BTabooHandJobs+%2F+Clips4Sale%5D+Zoey+Holloway+%28Son%2C+I+can+help+you+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d84d11512eae85e3cfd6ab406c6b1f873fbac77f","infoHashBuffer":{"type":"Buffer","data":[216,77,17,81,46,174,133,227,207,214,171,64,108,107,31,135,63,186,199,127]},"announce":[],"urlList":[]}}