{"title":"The Snowden Files - Luke Harding - Audiobook MP3","uid":11321861,"size":293829427,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d84f1bf09491aa6dd4435db9241ce60501dfe207&amp;dn=The+Snowden+Files+-+Luke+Harding+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1414606674,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Snowden Files: The Inside Story of the World's Most Wanted Man\n\nWritten by: Luke Harding\nNarrated by: Nicholas Guy Smith\nLength: 10 hrs and 11 mins\nUnabridged Audiobook\nRelease Date:10-21-14\n\nIt began with a tantalizing, anonymous email: &quot;I am a senior member of the intelligence community.&quot;\n\nWhat followed was the most spectacular intelligence breach ever, brought about by one extraordinary man. Edward Snowden was a 29-year-old computer genius working for the National Security Agency when he shocked the world by exposing the near-universal mass surveillance programs of the United States government. His whistleblowing has shaken the leaders of nations worldwide, and generated a passionate public debate on the dangers of global monitoring and the threat to individual privacy.\n\nIn a tour de force of investigative journalism that reads like a spy novel, award-winning Guardian reporter Luke Harding tells Snowden's astonishing story - from the day he left his glamorous girlfriend in Honolulu carrying a hard drive full of secrets, to the weeks of his secret-spilling in Hong Kong, to his battle for asylum and his exile in Moscow. For the first time, Harding brings together the many sources and strands of the story - touching on everything from concerns about domestic spying to the complicity of the tech sector - while also placing us in the room with Edward Snowden himself. The result is a gripping insider narrative - and a necessary and timely account of what is at stake for all of us in the new digital age","torrent":{"xt":"urn:btih:d84f1bf09491aa6dd4435db9241ce60501dfe207","amp;dn":"The+Snowden+Files+-+Luke+Harding+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d84f1bf09491aa6dd4435db9241ce60501dfe207","infoHashBuffer":{"type":"Buffer","data":[216,79,27,240,148,145,170,109,212,67,93,185,36,28,230,5,1,223,226,7]},"announce":[],"urlList":[]}}