{"title":"Air Alert 2 - The Complete Vertical Jump Program","uid":3388589,"size":93514275,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d87f5cfef2c699c4aa87c9654be2a2455b6d413c&amp;dn=Air+Alert+2+-+The+Complete+Vertical+Jump+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"jjevans","files":3,"time":1127779954,"description":"Quality: Good\nFormat: WMV\nFiles: 3\nContains: Air Alert Workout Chart\n          Air Alert DVD [2 Parts]\n\n\n\nAir Alert&amp;reg; is a natural body weight jump training program that utilizes 6 specifically designed jumping exercises that you are required to be do repetitively over the course of the workout.  Each exercise attacks and works your leg muscles at different angles helping to make jumping instinctual and effortless.\n\nAir Alert is a 2 phase program. Phase I is designed to be followed 3 days per week for 15 weeks. There is no weight training required or any specialized equipment needed.  It takes about 15 to 20 minutes per day to complete the program during the first 3 weeks. Each week thereafter requires about 2 to 4 minutes more due to the increase in repetitions added to each exercise every week.  \n\nPhase II is Air Alert&amp;reg; Advanced.  This workout is much more aggressive and time consuming, but you are only required to do this version for 6 consecutive weeks. Your legs will benefit, however, by getting stronger.  Phase II will help you add an additional 3-6 inches on your vertical.  So, when you order, you will receive a second program absolutely free.  That's two programs in one!\n\nThe  Air Alert&amp;reg; vertical jump program is not a cheap, digital product.  This package comes equipped complete with a training DVD and training manual both which educate you on the entire program. You will perform the weekly routine by following the Air Alert&amp;reg; Workout Chart and then the Air Alert&amp;reg; Advanced Workout Chart which defines the specific number of sets and repetitions you will do for each exercise.  At the completion of each week, you will record your progress with the Air Alert&amp;reg; Vertical Jump Measurement Chart.\n\nBy following the Air Alert&amp;reg; program as it is written and using the motivational tools provided with the DVD, you will increase your jumping ability by a minimum of 8 inches over the course of Phase I (15 weeks) and a possibility of an additional 3 to 6 inches by using Phase II. The program will also help you to improve your cardiovascular endurance, muscle strength and running speed. You will become an all-around, better athlete.\n","torrent":{"xt":"urn:btih:d87f5cfef2c699c4aa87c9654be2a2455b6d413c","amp;dn":"Air+Alert+2+-+The+Complete+Vertical+Jump+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d87f5cfef2c699c4aa87c9654be2a2455b6d413c","infoHashBuffer":{"type":"Buffer","data":[216,127,92,254,242,198,153,196,170,135,201,101,75,226,162,69,91,109,65,60]},"announce":[],"urlList":[]}}