{"title":"The Start-up of You - Reid Hoffman, Ben Casnocha (audiobook)","uid":9195292,"size":289055315,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d8a2d92b0fb871f1cb788478a0cb579c1341852e&amp;dn=The+Start-up+of+You+-+Reid+Hoffman%2C+Ben+Casnocha+%28audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":2,"time":1384479575,"description":"A blueprint for thriving in your job and building a career by applying the lessons of Silicon Valley's most innovative entrepreneurs.\n\nThe career escalator is jammed at every level. Unemployment rates are sky-high. Creative disruption is shaking every industry. Global competition for jobs is fierce. The employer-employee pact is over and traditional job security is a thing of the past.  \n \nHere, LinkedIn cofounder and chairman Reid Hoffman and author Ben Casnocha show how to accelerate your career in today's competitive world. The key is to manage your career as if it were a start-up business: a living, breathing, growing start-up of you.\n \nWhy? Start-ups - and the entrepreneurs who run them - are nimble. They invest in themselves. They build their professional networks. They take intelligent risks. They make uncertainty and volatility work to their advantage. \n \nThese are the very same skills professionals need to get ahead today. \n \nThis book isn't about cover letters or resumes. Instead, you will learn the best practices of Silicon Valley start-ups, and how to apply these entrepreneurial strategies to your career. Whether you work for a giant multinational corporation, a small local business, or launching your own venture, you need to know how to:\n \n* Adapt your career plans as you change, the people around you change, and industries change.\n* Develop a competitive advantage to win the best jobs and opportunities.\n* Strengthen your professional network by building powerful alliances and maintaining a diverse mix of relationships. \n* Find the unique breakout opportunities that massively accelerate career growth.\n* Take proactive risks to become more resilient to industry tsunamis. \n* Tap your network for information and intelligence that help you make smarter decisions.\n \nA revolutionary new guide to thriving in today's fractured world of work, the strategies in this book will help you survive and thrive and achieve your boldest professional ambitions. The Start-Up of You empowers you to become the CEO of your career and take control of your future.","torrent":{"xt":"urn:btih:d8a2d92b0fb871f1cb788478a0cb579c1341852e","amp;dn":"The+Start-up+of+You+-+Reid+Hoffman%2C+Ben+Casnocha+%28audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8a2d92b0fb871f1cb788478a0cb579c1341852e","infoHashBuffer":{"type":"Buffer","data":[216,162,217,43,15,184,113,241,203,120,132,120,160,203,87,156,19,65,133,46]},"announce":[],"urlList":[]}}