{"title":"Vetiver-Thing Of The Past (Advance) (2008) [Mp3]","uid":4189365,"size":56118459,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d91ebeeada005f8feaa2d54507999d3bc879409b&amp;dn=Vetiver-Thing+Of+The+Past+%28Advance%29+%282008%29+%5BMp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"webchella","files":12,"time":1210864670,"description":"Vetiver-Thing Of The Past (2008)\n\n\nComparte zonatorrent\nIdioma: English\nGenero: Indie\n\n\nTrack List: \n-------- \n01. Houses 3:42 \n02. Roll On Babe 4:27 \n03. Sleep A Million Years 2:54 \n04. Hook &amp; Ladder 3:09 \n05. To Baby 4:26 \n06. Road To Ronderlin 2:23 \n07. Lon Chaney 4:21 \n08. Hurry On Sundown 6:29 \n09. The Swimming Song 2:40 \n10. Blue Driver 3:55 \n11. Standin&amp;#039; 3:39 \n12. I Must Be In A Good Place Now 4:30 \n\nRelease Notes: \n-------- \nollowing a two year absence since their last long-player, Vetiver return with a \nnew album, Thing Of The Past. A set of cover versions of songs by some of \nband-leader Andy Cabic&amp;#039;s favourite artists, the album offers a joyful and \nintriguing insight into some of the music that has inspired and informed the \nband, whilst remaking the songs very much in their own image and existing as a \nstunning and coherent album in its own right. \n\nProduced by Thom Monahan and Cabic, Thing Of The Past was recorded in Spring, \n2007 in Sacramento and Los Angeles. The basic tracks (all the guitars, drums and \nbass and some of the vocals) were recorded live in the studio, with the \nresultant record clearly showcasing a tight-knit band of talented musicians. As \nwitnesses to their live shows over the past year will attest, this is a group in \nfull mastery of their craft, fluid yet fully aligned, intuitively able to open \nout or reign in their power as the mood dictates. Featuring core Vetiver \nmembers, Andy Cabic (vocals / guitar / banjo), Brent Dunn (bass), Sanders Trippe \n(guitar / vocals), Otto Hauser (drums / keyboards) and Kevin Barker (guitar/ \nbanjo/ vocals), the album includes contributions from two of Andy&amp;#039;s heroes, \nVashti Bunyan (who duets on &quot;Sleep A Million Years&quot;) and Michael Hurley (who \ndoes likewise on his own &quot;Blue Driver&quot;). Other players include &quot;Farmer&quot; Dave \nScher (keyboard / pedal steel / melodica); Jason Quever (piano / keyboard); Ben \nKunin (sarod); Jonathan Wilson (acoustic guitar); Emma Smith (violin); and \nvocalists Meara O&amp;#039;Reilly, and Abigail and Lily Chapin. \n\nCabic explains his thoughts behind preparing for the album: &quot;Though recording an \nalbum typically entails making a good many decisions, some complicated, some \ninstinctive, choosing which songs to record this time around happened pretty \neffortlessly. It was a mixture of a few tunes Vetiver had been performing live \nalongside others which I loved and thought we would do a decent job \ninterpreting. I wanted to share songs which were favorites of mine and my circle \nof friends and perform them with a reverence and appreciation for their finer \nqualities, the lyrical and sonic nuances which keep me returning to them time \nand again for inspiration.&quot; \n\nWhile they had played a few of these songs live, mostly they went in to the \nstudio with a list of tunes they hoped to try their hand at. From good-time \nstompers like Hawkwind&amp;#039;s &quot;Hurry On Sundown&quot; and Loudon Wainwright III&amp;#039;s &quot;The \nSwimming Song&quot; to the breathtakingly beautiful triptych of songs that runs from \nBiff Rose&amp;#039;s &quot;To Baby&quot; through Ian Matthews&amp;#039; &quot;Road To Ronderlin&quot; and Garland \nJeffreys&quot; &quot;Lon Chaney&quot;, this is a diverse and harmonious collection. With the \nalbum so centered around the lasting resonance of the song, the focus inevitably \nfalls upon Cabic&amp;#039;s gorgeously warm, honey-toned vocal, which appears perfectly \nsuited to the material he&amp;#039;s gathered. Rather than obvious plundering from the \nwell-worn rock cannon, these are largely overlooked and forgotten tunes \n(spanning a period from 1967-1973, and mostly by US songwriters) - dusted off, \nreverently refashioned and given the opportunity to sing again. Though a few of \nthe artists covered are well known (see Hawkwind&amp;#039;s &quot;Hurry On Sundown&quot;; Townes \nVan Zandt&amp;#039;s &quot;Standing&quot;, Michael Hurley&amp;#039;s &quot;Blue Driver&quot;, Loudon Wainwright III&amp;#039;s \n&quot;The Swimming Song&quot;), others among them are not, and in selecting and performing \nthese songs, Vetiver have appended enduring versions which are very much their \nown. \n\nAs Cabic comments, &quot;I think this is the best album I&amp;#039;ve yet to make, in no small \npart because the songs are so good, but also because I didn&amp;#039;t write them, which \noffered me a useful combination of restraint and freedom in performing them, \nbringing out the best in myself and the other musicians. It was an experiment in \na lot of ways, and it was one of the best experiences I&amp;#039;ve yet to have recording \nanything.&quot; \n\nVetiver have played all over the world--from New York City&amp;#039;s Carnegie and Town \nHalls, to the Roundhouse in London and La Trastienda in Buenos Aires, sharing \nthe stage with friends and performers including Devendra Banhart, Juana Molina, \nBert Jansch, The Shins, Vashti Bunyan, Bright Eyes, and Joanna Newsom. Currently \nworking on their fourth album, they will be touring the UK and Europe in May and \nJune in support of Thing Of The Past. ","torrent":{"xt":"urn:btih:d91ebeeada005f8feaa2d54507999d3bc879409b","amp;dn":"Vetiver-Thing+Of+The+Past+%28Advance%29+%282008%29+%5BMp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91ebeeada005f8feaa2d54507999d3bc879409b","infoHashBuffer":{"type":"Buffer","data":[217,30,190,234,218,0,95,143,234,162,213,69,7,153,157,59,200,121,64,155]},"announce":[],"urlList":[]}}