{"title":"Robert Batterman - The Oxford Handbook of Philosophy of Physics","uid":11161282,"size":6616578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d92d620c528d4bdefe64dac4cd61c27711a7a721&amp;dn=Robert+Batterman+-+The+Oxford+Handbook+of+Philosophy+of+Physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"philosophi","files":-1,"time":1412547577,"description":"Robert Batterman - The Oxford Handbook of Philosophy of Physics\n\nThis Oxford Handbook provides an overview of many of the topics that currently engage philosophers of physics. It surveys new issues and the problems that have become a focus of attention in recent years. It also provides up-to-date discussions of the still very important problems that dominated the field in the past.\n\nIn the late 20th Century, the philosophy of physics was largely focused on orthodox Quantum Mechanics and Relativity Theory. The measurement problem, the question of the possibility of hidden variables, and the nature of quantum locality dominated the literature on the quantum mechanics, whereas questions about relationalism vs. substantivalism, and issues about underdetermination of theories dominated the literature on spacetime. These issues still receive considerable attention from philosophers, but many have shifted their attentions to other questions related to quantum mechanics and to spacetime theories. Quantum field theory has become a major focus, particularly from the point of view of algebraic foundations. Concurrent with these trends, there has been a focus on understanding gauge invariance and symmetries. \n\nThe philosophy of physics has evolved even further in recent years with attention being paid to theories that, for the most part, were largely ignored in the past. For example, the relationship between thermodynamics and statistical mechanics---once thought to be a paradigm instance of unproblematic theory reduction---is now a hotly debated topic. The implicit, and sometimes explicit, reductionist methodology of both philosophers and physicists has been severely criticized and attention has now turned to the explanatory and descriptive roles of &quot;non-fundamental,'' phenomenological theories. This shift of attention includes &quot;old'' theories such as classical mechanics, once deemed to be of little philosophical interest. Furthermore, some philosophers have become more interested in &quot;less fundamental'' contemporary physics such as condensed matter theory. Questions abound with implications for the nature of models, idealizations, and explanation in physics. This Handbook showcases all these aspects of this complex and dynamic discipline.","torrent":{"xt":"urn:btih:d92d620c528d4bdefe64dac4cd61c27711a7a721","amp;dn":"Robert+Batterman+-+The+Oxford+Handbook+of+Philosophy+of+Physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92d620c528d4bdefe64dac4cd61c27711a7a721","infoHashBuffer":{"type":"Buffer","data":[217,45,98,12,82,141,75,222,254,100,218,196,205,97,194,119,17,167,167,33]},"announce":[],"urlList":[]}}