{"title":"Zumba Fitness Rush XBOX360-PROTON","uid":7028510,"size":7839139539,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d94ac417747e9772a2d358c4fbb77e5d749ff388&amp;dn=+Zumba+Fitness+Rush+XBOX360-PROTON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"boobsman","files":14,"time":1329152707,"description":" &lt;a href=&quot;http://www.freeimage.us/image-D053_4F38065D.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.freeimage.us/image-D053_4F38065D.jpg&lt;/a&gt;\n\nZumba Fitness Rush XBOX360-PROTON\n\nTHIS GAME REQUIRES THE KINECT SENSOR!\n\nFollowing the worldwide best-selling original, Zumba Fitness Rush builds on that phenomenal success \nwhile elevating the exercising game category to a new level of fun, effective fitness. This cutting\nedge experience layers in a wealth of exclusive content only available on Kinect, plus lots of new \nfeatures and improvements that amp up the dance fitness play so you can party yourself into shape! \n\nPlayers can get a total body workout with 42 electrifying new routines, and feel the rush with three \ndifferent game modes you can play solo or with a friend.\n\nFeatures:\n50% more content than Zumba Fitness 2 on Wii: more routines, more venues and more instructors, plus \nvoice control, online connectivity and DLC support for the most feature-rich, interactive Zumba \nexperience to date.\n\nGet a total body workout with 42 electrifying new routines and music tracks (10 exclusive to Kinect), \nnow featuring hits from todays hottest artists including Pitbull, Nicole Scherzinger and Yolanda Be \nCool &amp; DCUP, along with contagious Zumba originals that let you lose yourself to the music.\n\nLearn 24 different dance styles as you play (more than twice the number in the original game). From \nfan favorites like Merengue, Salsa and Cumbia to new additions that include Axe, Bollywood, Ragga, \nBachata, Latin Pop, Quebradita, Batucada, Pasodoble and more, Rush lets you experience a broad range \nof cultural rhythms from around the world.\n\nDance naturally hands-free with Kinect technology that enables full body motion tracking for an \nunencumbered interactive workout.\n\nTwo player support lets you party together with friends and family members in a cooperative format.\n\nVoice control for menu navigation gets you dancing even faster.\n\nSingle Song lets you dance any routine of your choice and the new song preview feature gives you a feel \nfor each rhythm. Full Class is a work-out block of routines in 20, 45 or 60 minute formats. Create your \nown custom workouts by saving a playlist of your favorite music and choreography. Learn the Steps is \nrevamped tutorial mode that lets you learn at your own pace by breaking down the four core dance styles \ninto the basics. Slow down or speed up each module as you receive focused per limb feedback that helps \nyou master each move and build confidence.\n\nFollow along as 6 superstar Zumba instructors (3 exclusive to Kinect) guide you through each routine: \nBeto, Tanya Beardsley, Gina Grant, Kass Martin, Jason Thompson and Erica Pierce. New 3D avatars of each \ninstructor make playing the game feel like taking a live class with Zumbas elite!\n\nGet your party on in 10 dynamic environments Miami Yacht, LA Nightclub, Rooftop, VIP Pool Party and Music \nVideo Set plus 5 Kinect exclusive venues: Bollywood, Rio Carnivale, Scandinavian Ice Hotel, New York City \nStreet and Las Vegas.\n\nNew video cueing system makes the choreography easier to follow for new players.\n\nNew Progress Tracker tallies every workout statistic, including calories burned, achievements earned, \noverall rank and technique score.\n\nAccessible gameplay features Low, Medium and High Intensity routines tiered for all skill levels plus a \nfull Tutorial mode.\n\nEarn achievements and unlock exclusive behind-the-scenes videos as you play.\n\nIn game class locator lets you find an instructor near you so you can try a live Zumba class and become \npart of the community.\n\nPost launch downloadable content will offer new dance style packs and hit music via Xbox LIVE\n\nPlatform: XBOX360\nRegion: Region FREE\nGenre: Sports / Fitness\nPublisher: Majesco\nDeveloper: Zoe Mode\nLanguage: English\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-B512_4F38065D.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-B512_4F38065D.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.freeimage.us/image-AB42_4F38065D.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-AB42_4F38065D.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d94ac417747e9772a2d358c4fbb77e5d749ff388","amp;dn":"+Zumba+Fitness+Rush+XBOX360-PROTON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d94ac417747e9772a2d358c4fbb77e5d749ff388","infoHashBuffer":{"type":"Buffer","data":[217,74,196,23,116,126,151,114,162,211,88,196,251,183,126,93,116,159,243,136]},"announce":[],"urlList":[]}}