{"title":"CleanApp 4.0.7 [include S/N]","uid":9450574,"size":17992463,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d95a7dcb50dc01075fc786b06f33039b08d23fca&amp;dn=CleanApp+4.0.7+%5Binclude+S%2FN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoogleWolf","files":-1,"time":1389177342,"description":"\nCleanApp 4.0.7 [include S/N]\n\n &lt;a href=&quot;\nhttp://www.syniumsoftware.com/cleanapp/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.syniumsoftware.com/cleanapp/&lt;/a&gt;\n\n\n## Delete Apps from your Mac\n\nAny app you run in OS X generates a large number of associated files in your system. Simply dragging an app to the trash will leave these files on your hard drive. CleanApp is your go-to application to remove apps and any associated files from your computer, keeping unused files from eating up memory space. CleanApp uses sophisticated analytical methods, a background process your apps' file activity and the CleanCommunity feature. CleanCommunity will provide CleanApp with information on applications and any associated files to be uninstalled alongside the app.\n\n\n\n## Uninstall Add-Ons\n\nOS X doesn't provide a built-in solution for administration of add-ons such as screen savers, Kernel extensions or Safari plugins. CleanApp searches for add-ons and creates a list overview of all add-ons, fonts and QuickTime components installed on your Mac. Choose the apps you want to remove completely and CleanApp will do the job for you!\n\n\n\n## Declutter\n\nCleanApp lets you search for large files that haven't been used in a long time to keep them from accumulating on your Mac. Once the search is finished, you decide which files you want to keep or delete. You can also use CleanApp to track down file duplicates, empty folders and unused language packages.\n\n\n\n## System Maintenance\n\nOS X runs maintenance scripts at predefined intervalls, removing for example temporary files that haven't been used in a long time. If you use your computer heavily, these intervalls might be too long. CleanApp allows you to run maintenance scripts manually without making you open the terminal or memorize any complex commands.\n\n\n\n## Analyze\n\nEver wondered why some folders, including your home folder, eat up so much memory space? Let CleanApp answer that question for you. Drag any folder into CleanApp and have it analyze what files require a lot of disk space and what components, such as language packages, can be removed.\n\n\n\n\n## Supported languages &amp; System requirements\n\nCleanApp 4 is available in nine languages. The user interface, including all buttons, labels and menu entries, automatically adapts to the language settings in your Mac's System Preferences. Currently, the following languages are available:\n\n English   German   French   Chinese   Italian   Dutch   Portuguese   Russian   Spanish\n\n\n## CleanApp requires a Mac with OS X 10.6.8 Snow Leopard, 10.7 Lion, 10.8 Mountain Lion or 10.9 Mavericks.\n\n","torrent":{"xt":"urn:btih:d95a7dcb50dc01075fc786b06f33039b08d23fca","amp;dn":"CleanApp+4.0.7+%5Binclude+S%2FN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95a7dcb50dc01075fc786b06f33039b08d23fca","infoHashBuffer":{"type":"Buffer","data":[217,90,125,203,80,220,1,7,95,199,134,176,111,51,3,155,8,210,63,202]},"announce":[],"urlList":[]}}