{"title":"Liars - Mess (2014) [FLAC]","uid":9825807,"size":381603149,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d9fb075161685c42de393361f2a0cb8f66ee4925&amp;dn=Liars+-+Mess+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"politux","files":-1,"time":1395774051,"description":"\n  Liars - Mess (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Experimental, Post-Rock\n  Source: Scene CD (outerspace)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Mask Maker \n  02 Vox Turned D.E.D. \n  03 I'm No Gold \n  04 Pro Anti Anti \n  05 Can't Hear Well \n  06 Mess on a Mission \n  07 Darkslide \n  08 Boyzone \n  09 Dress Walker \n  10 Perpetual Village \n  11 Left Speaker Blown\n\n  More than many other bands, Liars are guided by an overall aesthetic rather than dedication to any particular sound. The tension and contrast between their wicked sense of humor and their wounded introspection is at the heart of their music, whatever ways they choose to express this change from album to album. On WIXIW, Liars cocooned their vulnerable songs in subtle electronic textures -- with the notable exception of &quot;Brats&quot;' laser-guided disco-punk, which feels like a rough template for the warped dance music excursions they undertake on Mess. Dense synths and hammered beats on songs like &quot;I'm No Gold&quot; and &quot;Pro Anti Anti&quot; evoke packed dancefloors and nod to industrial music; Trent Reznor would be proud to call &quot;Perpetual Village&quot;'s slithering, almost slimy textures and free-floating dread his own. \n\n  The glee Liars have in turning dance music on its head recalls the dark mischief that ran free on their self-titled album and Sisterworld, particularly on the opening track, &quot;Mask Maker.&quot; Opening with a guttural voice demanding &quot;Eat my face off/Take my face off/Give me your face!&quot; before kicking into a sleekly sinister rhythm, it's equally terrifying and hilarious. Underneath the synths, Mess' songs feel familiar (but not overly so): &quot;Mess on a Mission&quot; gives one of the best examples of the band's taut, snotty art-punk a glossy chrome plating. Meanwhile, the rare quiet moments have just as much impact as &quot;Brats&quot; did on WIXIW, with the tender &quot;Can't Hear Well&quot; and expansive album closer &quot;Left Speaker Blown&quot; drifting off into the uncertain territory Liars somehow make strangely welcoming. As on the band's other albums, Mess' dramatic transformation works in large part because of the personality, and versatility, in Angus Andrew's vocals. The way he slurs &quot;Boyzone&quot;'s titular word into &quot;poison&quot; and his cartoonishly doomy turn on &quot;Vox Tuned D.E.D.&quot; add distinctive character(s) that give the album's forays depth. Given that Mess originated from Liars messing around in the studio, it's a more spontaneous, accessible set of songs than they've delivered in some time. Even if it's not quite as striking an achievement as WIXIW, it's a lot of fun and shows, once again, that Liars are unquestionably themselves no matter how much they push their boundaries.","torrent":{"xt":"urn:btih:d9fb075161685c42de393361f2a0cb8f66ee4925","amp;dn":"Liars+-+Mess+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9fb075161685c42de393361f2a0cb8f66ee4925","infoHashBuffer":{"type":"Buffer","data":[217,251,7,81,97,104,92,66,222,57,51,97,242,160,203,143,102,238,73,37]},"announce":[],"urlList":[]}}