{"title":"Israel: A Deadly Piece Of Dirt - Dr. Peter S. Ruckman","uid":11773658,"size":12987072,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9ff6c4549125c50cb422948abbcdd3cc2248da8&amp;dn=Israel%3A+A+Deadly+Piece+Of+Dirt+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"starxteel","files":1,"time":1427179623,"description":"This latest addition to the Biblical and historical studies shows the spiritual decline of Israel from the prophets of the Old Testament to the Reformed and Orthodox theology of today. At the same time, Dr. Ruckman traces how God has restored Israel to its present political state (and beyond) in fulfillment to His promises to Abraham, Isaac, and Jacob. Possibly the most unusual book Dr. Ruckman has ever written. The research behind this book is greater than any previous work, with the exception of his two volume work on Church History.\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:d9ff6c4549125c50cb422948abbcdd3cc2248da8","amp;dn":"Israel%3A+A+Deadly+Piece+Of+Dirt+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9ff6c4549125c50cb422948abbcdd3cc2248da8","infoHashBuffer":{"type":"Buffer","data":[217,255,108,69,73,18,92,80,203,66,41,72,171,188,221,60,194,36,141,168]},"announce":[],"urlList":[]}}