{"title":"The Faces-13 albums","uid":4632177,"size":1590615444,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dabe9e830f91ddbdf6b413632084bfd51c3c2bd3&amp;dn=The+Faces-13+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1231430342,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nFaces (sometimes known as The Faces) are a rock band formed in 1969 by members of the Small Faces after Steve Marriott left that group to form Humble Pie. The remaining Small Faces - Ronnie Lane (bass guitar), Ian McLagan (keyboards) and Kenney Jones (drums &amp; percussion) - were joined by Ronnie Wood (guitar) and Rod Stewart (lead vocals), both from The Jeff Beck Group, and the new line-up was renamed the Faces.\nThe Faces released four studio albums and toured regularly through the autumn of 1975, although Stewart simultaneously pursued a solo recording career, and during the band's final year Wood also toured with The Rolling Stones, whom he later joined\nThe first collaboration among the future Faces was in a formation called Quiet Melon, which also featured Art Wood and Kim Gardner; they recorded four songs and played a few shows in May 1969, during a break in Ronnie Wood's and Rod Stewart's commitments with the Jeff Beck Group. Later that summer Wood and Stewart parted ways with Beck and joined Lane, McLagan and Jones full time.\nWith the addition of Stewart and Wood, the &quot;small&quot; part of the original band name was dropped, partly because the two newcomers (at 5'8&quot; and 5'9&quot; respectively) were significantly taller than the three former Small Faces. Hoping to capitalize on the Small Faces' earlier success, record company executives wanted the band to keep their old name; however, the band objected, arguing the personnel changes resulted in a group very different from Small Faces. As a compromise, in the US their debut album was credited to Small Faces, while subsequent albums appeared under their new name. The group regularly toured Britain, Europe and the United States from 1970 to 1975, and were among the top-grossing live acts in that period;] in 1974 their touring also encompassed Australia, New Zealand and Japan Among their most successful songs were &quot;Had Me a Real Good Time&quot;, their breakthrough UK hit &quot;Stay with Me&quot;, &quot;Cindy Incidentally&quot; and &quot;Pool Hall Richard&quot;. As Rod Stewart's solo career became more successful than that of the group, the band became overshadowed by their lead singer. A disillusioned Ronnie Lane left the band in 1973; one reason given later for his departure was frustration over not having more opportunities to sing lead vocals. Lane's role as bassist was taken over by Tetsu Yamauchi (who had replaced Andy Fraser in Free). Released at about the time Lane left, the Faces' final studio album was Ooh La La.\nA live album early the following year, Coast to Coast: Overture and Beginners, was criticised by reviewers for being poorly recorded. They recorded a few tracks for another studio album, but had lost enthusiasm and their final release as a group was the late 1974 UK Top 20 hit &quot;You Can Make Me Dance, Sing, or Anything&quot;. In 1975 Wood began working with the Rolling Stones, which brought differences between Stewart and the others to a head, and in December the band announced that they were splitting\nAll members had varied post-band careers. Wood joined The Rolling Stones as a full member; Lane formed Slim Chance and had a modest solo career that ended prematurely when he was diagnosed with multiple sclerosis. Lane also worked on an album with Who guitarist Pete Townshend. Jones joined The Who after the death of Keith Moon; McLagan stated in a summer 2004 interview with reporter Scott Smith of the Times Record in Fort Smith, Arkansas, that Townshend also asked McLagan to join the Who, but McLagan had already promised Keith Richards that he would tour as a Rolling Stones sideman.[ McLagan moved to the United States, where he formed the Bump Band, with whom he continues to tour and record; he also works as a session musician. Stewart's solo career was extremely successful. There was also a Small Faces reunion in the late 1970s (without Ronnie Lane) that resulted in two albums; and in 1981 Ronnie Lane and Steve Marriott collaborated on the album The Legendary Majik Mijits. The Faces reformed for the encore of Rod Stewart's Wembley Stadium concert in 1986. Ronnie Lane was on stage to sing in his wheelchair, but was unable to play bass; Bill Wyman of the Rolling Stones filled in for him. The same lineup reunited once more (minus Lane) in 1993 when Rod Stewart was awarded the Lifetime Achievement award at the Brit Awards. Ronnie Lane made his final concert appearance in 1992 at a Ronnie Wood show with Ian McLagan on keyboards; Lane died in 1997.\nIn 2004 a 4-disc Faces box set entitled Five Guys Walk into a Bar... was released by Rhino Records, featuring many of the band's most popular tracks as well as several previously unreleased songs. Drummer Kenney Jones formed the rock group The Jones Gang, together with singer Robert Hart, Patrick Walford (formerly of Bad Company) and guitarist Rick Wills (formerly of Foreigner); in 2005 their first single &quot;Angel&quot; reached number 1 on the US Billboard &quot;hot singles sales&quot; listDuring 2004 and early 2005 the surviving Faces had several near-reunions, none of which featured more than three members at the same time: In May 2004 Kenney Jones and Ronnie Wood joined Ian McLagan on stage at his concert at The Mean Fiddler in London. In August 2004 Wood and McLagan joined Stewart at the Hollywood Bowl; Wood also appeared at several other of Stewart's 2004 gigs, including New York's Madison Square Garden, the Royal Albert Hall and a street performance in London for an audience of 80,000] In March 2005 McLagan joined Ronnie Wood's band at a London show, which also featured Kenney Jones on drums for the final encore; and in December 2005 Wood joined Ian McLagan &amp; the Bump Band for three numbers at a concert in Houston, Texas\nOn 11 June 2008 Rod Stewart announced that the surviving Faces were discussing a possible reunion, envisioning making a recording and/or performing at least one or two concerts.. On 11 November Rod Stewart, Ron Wood, Ian McLagan and Kenney Jones reunited for a rehearsal &quot;just to check if they can remember the songs&quot;;the band's official reunion website was launched earlier the same month. In December bassist Flea of the Red Hot Chili Peppers left an announcement on an RHCP website that he has rehearsed with the remaining Faces and plans to join them as bass player in the reunion.[14] Wood has stated that Stewart has asked him to write some new songs for an album and possible tour. \n\n","torrent":{"xt":"urn:btih:dabe9e830f91ddbdf6b413632084bfd51c3c2bd3","amp;dn":"The+Faces-13+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dabe9e830f91ddbdf6b413632084bfd51c3c2bd3","infoHashBuffer":{"type":"Buffer","data":[218,190,158,131,15,145,221,189,246,180,19,99,32,132,191,213,28,60,43,211]},"announce":[],"urlList":[]}}