{"title":"The Cars - The Cars [2CD's][1978][1999][320 KBPS][Deluxe Edition","uid":8325661,"size":222166599,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dad636679476783f094fe8cb094dda9a0017f369&amp;dn=The+Cars+-+The+Cars+%5B2CD%27s%5D%5B1978%5D%5B1999%5D%5B320+KBPS%5D%5BDeluxe+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"LameDuck69","files":28,"time":1364792517,"description":"The Cars - The Cars [2CD's][1978][1999][Deluxe Edition]\n\n\n\n\n\nCD1\n\n\n01. Good Times Roll\n02. My Best Friend's Girl\n03. Just What I Needed\n04. I'm In Touch With Your World \n05. Don't Cha Stop  \n06. You're All I've Got Tonight\n07. Bye Bye Love \n08. Moving In Stereo\n09. All Mixed Up\n\nCD2\n \n  \n01. Good Times Roll (Live) \n02. My Best Friend's Girl (Demo) \n03. Just What I Needed (Demo) \n04. I'm In Touch With Your World (Demo)\n05. Don't Cha Stop (Demo)\n06. You're All I've Got Tonight (Demo)\n07. Bye Bye Love (Demo) \n08. Moving In Stereo (Demo) \n09. All Mixed Up (Demo)\n10. They Won't See You (Demo)\n11. Take What You Want (Demo)\n12. Wake Me Up (Demo)\n13. You Just Can't Push Me (Demo) \n14. Hotel Queenie (Demo)   \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nThe Cars are an American rock band that emerged from the New Wave music scene in the late 1970s. The band originated in Boston, Massachusetts, with lead singer and rhythm guitarist Ric Ocasek, lead singer and bassist Benjamin Orr, guitarist Elliot Easton, keyboardist Greg Hawkes and drummer David Robinson. They were signed to Elektra Records by George Daly, then A&amp;R head, in 1977.\n\nThe Cars were at the forefront in merging 1970s guitar-oriented rock with the new synth-oriented pop that was then becoming popular and which would flower in the early 1980s. The Cars started fresh with their debut album The Cars which went on to go platinum in late 1978. The Cars' debut album was called a &quot;genuine rock masterpiece&quot; by Allmusic. The most successful and well known song from the album, &quot;Just What I Needed&quot;, started as a demo in 1977. The song was sent as a mix tape to a local DJ in the Boston area, who played the song in heavy rotation. This soon caught the attention of other DJs, which led to the signing of the band by Elektra Records in 1977.\n\nThe band broke up in 1988, and Ocasek had always discouraged talk of a reunion since then, telling one interviewer in 1997 &quot;I'm saying never and you can count on that.&quot; Bassist Benjamin Orr died in 2000 from pancreatic cancer. In 2005, Easton and Hawkes joined with Todd Rundgren to form a spin-off band, The New Cars, which performed classic Cars and Rundgren songs alongside new material. The surviving original members reunited in 2010 to record a new album, titled Move Like This, which was released May 10, 2011, and a tour to start on the same day.\n\n-----------------------------------------------------------------------------------\n\nThe Cars is the eponymous debut studio album by American rock band The Cars. It was released on June 6, 1978 on Elektra Records. With the popular tracks &quot;Just What I Needed&quot; and &quot;My Best Friend's Girl&quot; getting heavy airplay on AOR radio stations, the album sold one million copies by the end of the year and steadily climbed the charts, peaking at number 18 on the Billboard 200 chart in March 1979. The album was ranked number 4 on Billboard's &quot;Top Albums of the Year&quot; chart for 1979. The Cars remained on the album chart for 139 weeks with four more tracks &quot;Good Times Roll&quot;, &quot;You're All I've Got Tonight&quot;, &quot;Bye Bye Love&quot;, and &quot;Moving in Stereo&quot;, which all became radio favorites.\n\nThe album was critically well received. Allmusic reviewer Greg Prato described the album as &quot;a genuine rock masterpiece&quot;, and that &quot;all nine tracks are new wave/rock classics&quot; in their retrospective review. Rolling Stone magazine ranked the album No. 279 in its &quot;500 Greatest Albums of All Time&quot; list.\n\n\n\n","torrent":{"xt":"urn:btih:dad636679476783f094fe8cb094dda9a0017f369","amp;dn":"The+Cars+-+The+Cars+%5B2CD%27s%5D%5B1978%5D%5B1999%5D%5B320+KBPS%5D%5BDeluxe+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dad636679476783f094fe8cb094dda9a0017f369","infoHashBuffer":{"type":"Buffer","data":[218,214,54,103,148,118,120,63,9,79,232,203,9,77,218,154,0,23,243,105]},"announce":[],"urlList":[]}}