{"title":"Everyone Is African: Science Explodes the Myth of Race (2015)","uid":11811271,"size":987841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db6e6d599d30daf86f07a3f3cf7e83fce6ba2c97&amp;dn=Everyone+Is+African%3A+Science+Explodes+the+Myth+of+Race+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1428805216,"description":"Everyone Is African: How Science Explodes the Myth of Race\n\nepub\n\n\nWhat does science say about race? In this book a distinguished research geneticist presents abundant evidence showing that traditional notions about distinct racial differences have little scientific foundation. In short, racism is not just morally wrong; it has no basis in fact.\n\n The author lucidly describes in detail the factors that have led to the current scientific consensus about race. Both geneticists and anthropologists now generally agree that the human species originated in sub-Saharan Africa and darkly pigmented skin was the ancestral state of humanity. Moreover, worldwide human diversity is so complex that discrete races cannot be genetically defined. And for individuals, ancestry is more scientifically meaningful than race.\n\n Separate chapters are devoted to controversial topics: skin color and the scientific reasons for the differences; why ancestry is more important to individual health than race; intelligence and human diversity; and evolutionary perspectives on the persistence of racism.\n\n This is an enlightening book that goes a long way toward dispelling the irrational notions at the heart of racism","torrent":{"xt":"urn:btih:db6e6d599d30daf86f07a3f3cf7e83fce6ba2c97","amp;dn":"Everyone+Is+African%3A+Science+Explodes+the+Myth+of+Race+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db6e6d599d30daf86f07a3f3cf7e83fce6ba2c97","infoHashBuffer":{"type":"Buffer","data":[219,110,109,89,157,48,218,248,111,7,163,243,207,126,131,252,230,186,44,151]},"announce":[],"urlList":[]}}