{"title":"Successful Practice in Neuropsychology and Neuro-Rehabilitation,","uid":11331547,"size":2399025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbba97a462fb92d0db6415dd4d1598fe6b097e16&amp;dn=Successful+Practice+in+Neuropsychology+and+Neuro-Rehabilitation%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"0xmovva","files":2,"time":1414688020,"description":"TITLE/EDITION Successful Practice in Neuropsychology and Neuro-Rehabilitation, Second Edition: A Scientist-Practitioner Model (Practical Resources for the Mental Health Professional)\nAuthor: Mary Pepping \nSeries: Practical Resources for the Mental Health Professional\nPaperback: 320 pages\nPublisher: Academic Press; 2 edition (October 24, 2014)\nLanguage: English\nISBN-10: 0128002581\nISBN-13: 978-0128002582\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nThis 2nd edition (of the original Successful Private Practice in Neuropsychology) provides an updated overview of key principles and processes for establishing, maintaining and developing neuropsychology practice and neuro-rehabilitation program (NRP) treatment in medical center and/or private practice settings. Essential elements of an entrepreneurial model that work well in the medical center context and the necessary role of variety and peer review in the private practice setting are also discussed.\n\nHow to gather and report NPE and other evaluation findings with a neuro- rehabilitation focus that lead to specific neuro-rehabilitation recommendations. Benefit: this will make your evaluations and reports more desirable and sought after in the setting and community where you work.\nUpdated billing/diagnostic code recommendations to accurately capture the actual time spent in evaluating and/or treating patients. Benefit: increased appropriate billing and collections for your time\nRecommendations for clinical neuropsychology postdoctoral fellowship training of a Navy psychologist. Benefit: you may be able to obtain funding for an experienced Navy clinical psychologist who wants formal training in neuropsychology. This can expand your clinical services, increase variety and quality of your training program and ultimately support improved care for returning American military personnel","torrent":{"xt":"urn:btih:dbba97a462fb92d0db6415dd4d1598fe6b097e16","amp;dn":"Successful+Practice+in+Neuropsychology+and+Neuro-Rehabilitation%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbba97a462fb92d0db6415dd4d1598fe6b097e16","infoHashBuffer":{"type":"Buffer","data":[219,186,151,164,98,251,146,208,219,100,21,221,77,21,152,254,107,9,126,22]},"announce":[],"urlList":[]}}