{"title":"Sexually Broken--Auto BlowJob Machine Returns! Cherry Torn  Matt","uid":9091260,"size":665284013,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:dbd8568ffc1ed87dd355c3e26e22b4381b7ba5db&amp;dn=Sexually+Broken--Auto+BlowJob+Machine+Returns%21+Cherry+Torn++Matt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"merzedes","files":-1,"time":1382601481,"description":"The Automatic Blow Job Machine Returns!, Intensity turned up 10 fold! Catastrophic skull fucking! | Cherry Torn | Matt Williams\n\nOctober 23, 2013 \n \n\nMP4 only.\n \n \nToday we welcome back the return of two site favorites. The Automatic Blowjob Machine (ABM) and the beautiful Cherry Torn. We bring the modified fucking machine and custom head attachment, Cherry brings her all natural huge tits, and phat ass.\n\nWe have Cherry strapped to a wooden pillar with our homemade custom belts. Her legs are bound spread and her perfectly shaved, puffy pussy has a vibrator locked in place directly on her sensitive clit. Cherry's head is strapped to a custom metal interface that keeps her head attached to a fucking machine. The custom plate prevents Cherry from moving her head from side to side, so she will not be able to turn her head to remove the cock from her mouth.\n\nCherry specializes in hardcore deep throating. She loves getting her face completely and utterly fucked, however today the master has met her match. We turn on the powerful vibrator and instantly Cherry starts moaning. She knows that there is nothing she can do to stop from cumming, but right now that is the least of her problems. The hard cock pushes into her open mouth and the machine is turned on. Instantly her head is pushed forward by the powerful machine and the cock slides to the back, pushing deep into her throat. Before she can react, the machine pulls her head back, then it starts all over again. Cherry lets out a sound of utter despair as she just now understands the predicament she is in.\n\nWhat transpires next is beyond most mortals comprehension of what could accurately be described as a catastrophic face fucking. The amount of spit and drool that gushes from Cherry's helpless holes is staggering, as the machine pushes and pulls the hard cock into and out of her tight throat. The entire time the vibrator is working it's magic on Cherry's clit, the machine ipushes the cock deeper and deeper down her throat. No time for breaks, no time to &quot;get on top&quot;, Cherry simply must endure brutal orgasms and extreme face fucking simultaneously, without hope for relief. \n\nIf you have been on the fence, looking in, today is the day to check out what Sexually Broken is all about! \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_23ctorn9/SexuallyBroken-Cherry-Torn-The-Automatic-Blow-Job-Machine-Returns-Intensity-turned-up-10-fold-Catastrophic-skull-fucking.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_23ctorn9/SexuallyBroken-Cherry-Torn-The-Automatic-Blow-Job-Machine-Returns-Intensity-turned-up-10-fold-Catastrophic-skull-fucking.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:dbd8568ffc1ed87dd355c3e26e22b4381b7ba5db","amp;dn":"Sexually+Broken--Auto+BlowJob+Machine+Returns%21+Cherry+Torn++Matt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd8568ffc1ed87dd355c3e26e22b4381b7ba5db","infoHashBuffer":{"type":"Buffer","data":[219,216,86,143,252,30,216,125,211,85,195,226,110,34,180,56,27,123,165,219]},"announce":[],"urlList":[]}}