{"title":"A Wife of Noble Character - Yvonne Georgina Puig [EN EPUB MOBI]","uid":15848020,"size":1422275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc065a8b4ce02e9eada22ab7d8be8e76fd3baf56&amp;dn=A+Wife+of+Noble+Character+-+Yvonne+Georgina+Puig+%5BEN+EPUB+MOBI%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"perfect_stan","files":2,"time":1474128725,"description":"A Wife of Noble Character by Yvonne Georgina Puig\r\nEnglish | 2016 | Womens Fiction | 1.4 MB\r\n\r\n\r\nThirty-year-old Vivienne Cally is wealthy in name only. Orphaned as a child and raised by a cold but regal aunt, Vivienne was taught to rely on her beauty and Texas tradition, and is expected to marry a wealthy and respectable man who will honor the Cally name. Friends with Houston’s most prominent families, she’s a beloved fixture at social events, and suffers no shortage of access to the city’s most eligible bachelors. Preston Duffin has known Vivienne and her set since childhood, though he’s never shared their social aspirations or status. About to graduate from a prestigious architecture program, he is both fascinated and repelled by this group of friends he sits on the cusp of. He’s long admired Vivienne’s beauty, but isn’t sure he holds any place in so traditional a life. Intrigued by the extent to which Preston challenges the only way of life she’s ever known, Vivienne both courts his attention, and rebuffs his critiques of her antiquated values.\r\nInspired by Edith Wharton’s The House of Mirth, A Wife of Noble Character shares the original novel’s sharp social commentary at the same time that it illuminates the trappings and rewards of coming-of-age that are wholly unique to the twenty-first century. Part biting wit, part classic love story, it takes readers from Texas to Paris and Switzerland and back again, and will charm both fans of Wharton and anyone who has ever struggled to find their path in life.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:dc065a8b4ce02e9eada22ab7d8be8e76fd3baf56","amp;dn":"A+Wife+of+Noble+Character+-+Yvonne+Georgina+Puig+%5BEN+EPUB+MOBI%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc065a8b4ce02e9eada22ab7d8be8e76fd3baf56","infoHashBuffer":{"type":"Buffer","data":[220,6,90,139,76,224,46,158,173,162,42,183,216,190,142,118,253,59,175,86]},"announce":[],"urlList":[]}}