{"title":"Chuck Jackson-album","uid":5474236,"size":729807565,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc1bc2552b153a9807546b1f11a2b3dc400a2c1b&amp;dn=Chuck+Jackson-album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"flitigalisa","files":232,"time":1270050577,"description":"\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nChuck Jackson (born July 22, 1937) is an R&amp;B singer who was one of the first artists to successfully record material by Burt Bacharach and Hal David. He has performed with moderate success since 1961. His hits include &quot;I Don't Want to Cry,&quot; &quot;Any Day Now,&quot; &quot;I Keep Forgettin'&quot; and &quot;All Over The World&quot;.\nHe was born on July 22, 1937 in Latta, South Carolina, but was raised in Pittsburgh, Pennsylvania.\nHe was &quot;discovered&quot; when he opened for soul legend Jackie Wilson at the Apollo Theater. He signed a recording contract with Scepter Records. His first single, &quot;I Don't Want to Cry&quot;, which he co-wrote, was his first hit (1961). The song charted on both the R&amp;B and pop charts. In 1962, Jackson's recording of &quot;Any Day Now&quot;, the Burt Bacharach-Bob Hilliard classic, became a huge hit. He was so successful that in 1967 he bought up the time on his contract from Scepter and moved to Motown Records. There he recorded a number of successful singles, including &quot;Are You Lonely for Me Baby&quot; and &quot;Honey Come Back.&quot; He later recorded for All Platinum and other labels, but with minimal success.\nAfter meeting producer/composer Charles Wallert at the Third Annual Beach Music Awards, the two collaborated to record &quot;How Long Have You Been Loving Me&quot; on Carolina Records. The song became an instant Beach Music/Shag hit and remains a classic both in the Southeast and the UK.\nIn 1998 Jackson teamed with longtime friend Dionne Warwick to record &quot;If I Let Myself Go&quot;, arranged as a duet by Wallert for Wave Entertainment. The recording received critical acclaim and charted at number 19 on the highly competitive Gavin Adult Contemporary Charts. Jackson followed with &quot;What Goes Around, Comes Around&quot;, another Wallert production and composition, and reached number 13 on the Gavin Charts.\nSeveral of Jackson's songs later became successful hits for other artists: Ronnie Milsap covered &quot;Any Day Now&quot; in 1982, and reached #1 on the Country and Adult Contemporary charts. Michael McDonald had a huge hit with his cover of Jackson's &quot;I Keep Forgettin'&quot;. Jackson was close friends with political strategist Lee Atwater. He appears in the award-winning documentary Boogie Man: The Lee Atwater Story.\n\n\nPlease SEED and enjoy, thanks, thanks and thanks so mutch........!\n\n","torrent":{"xt":"urn:btih:dc1bc2552b153a9807546b1f11a2b3dc400a2c1b","amp;dn":"Chuck+Jackson-album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1bc2552b153a9807546b1f11a2b3dc400a2c1b","infoHashBuffer":{"type":"Buffer","data":[220,27,194,85,43,21,58,152,7,84,107,31,17,162,179,220,64,10,44,27]},"announce":[],"urlList":[]}}