{"title":"Sewing For Dummies","uid":8057592,"size":6823312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc4632ba709b81d5b9007122c78b59c79fc0b4e1&amp;dn=Sewing+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1359001650,"description":"Jan Saunders Maresh, &quot;Sewing For Dummies&quot;\n2010 | ISBN: 0470623209 | 416 pages | PDF | 10,1 MB\n\nKnowing nothing at all about sewing, when I first set out to master the craft I went straight to the big-name references (Singer books and the like) only to find either huge guides overloaded with incomprehensible technical information and impractical advice, or beautifully illustrated books with little or no instructions. I was about to give up the teach-yourself-idea and enroll in some very expensive classes when I chanced upon this book. Amazingly by the time it took me to finish studying it (less than a month) I had not only learned to sew, but had also completed several Halloween costumes that earned the praise and admiration of friends and family.\n\nWritten in the friendly Dummies style, illustrated with over 200 pictures, drawings, step-by-step diagrams, humorous icon guides and even hilarious cartoons, this book covers all the fundamentals of sewing from general information for beginners to tips and tricks for experienced sewers.\nThrough simple, yet detailed, fully cross-referenced, clearly written explanations in plain English, and using proper, well-defined terminology, this reference contains all the basics. It includes assembling a sewing kit; selecting fabrics and threads; understanding and using patterns; working with hems, sleeves, pockets, collars, and closures; sewing for the home; and making repairs and alterations. It also offers some projects to test your acquired knowledge and progress, an appendix listing wonderful sewing resources in the US and on the Web, and a very thorough index for quick check-ups and specific consultations.","torrent":{"xt":"urn:btih:dc4632ba709b81d5b9007122c78b59c79fc0b4e1","amp;dn":"Sewing+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc4632ba709b81d5b9007122c78b59c79fc0b4e1","infoHashBuffer":{"type":"Buffer","data":[220,70,50,186,112,155,129,213,185,0,113,34,199,139,89,199,159,192,180,225]},"announce":[],"urlList":[]}}