{"title":"Goliath Awaits (UPGRADE) [1981/TVRIP/XViD]","uid":4717066,"size":1573824559,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc693b8f64d18054049443ee8ac6d89d70cc444d&amp;dn=Goliath+Awaits+%28UPGRADE%29+%5B1981%2FTVRIP%2FXViD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"l1nt","files":2,"time":1234324042,"description":"This is the un-edited 3 &amp; 1/2 hour TV mini-series (a heavily edited version was released on VHS home video and is now out-of-print).\n\nThis is an upgrade to the version I previously posted that was ripped from a well worn VHS tape. This is straight from cable and has never seen VHS. I found someone with this copy on imdb and they gladly sent me a DL DVD with the whole movie.\n\nThis movie is one of my favorites.\n\nPlot\n\nIn 1939, the luxury British ocean liner Goliath, carrying 1,860 passengers, is hit by a torpedo fired by a U-boat and sinks while on a trans-Atlantic crossing to the United States three days after the outbreak of World War II.\n\nScientists aboard a research ship discover the wreck of the Goliath in 1981 lying upright in 1,000 feet (305 m) of water. Divers sent down to investigate the wreck, including oceanographer Peter Cabot (Mark Harmon), hear banging and music coming from the ship, and are shocked to see a face at a porthole. They discover 337 survivors and their descendants living in an air bubble in the wreck. The residents of Goliath, who have invented some technologies to help them survive, live in a utopian society under the leadership of John McKenzie (Christopher Lee).The scientists are surprised to discover that McKenzie and some of the ship's residents are not interested in being &quot;rescued&quot;.\n\nComplicating things, the Goliath had been carrying some sensitive documents to U.S. President Roosevelt. A joint American/British military team is sent by Admiral Wiley Sloan (Eddie Albert) to retrieve and destroy the documents.","torrent":{"xt":"urn:btih:dc693b8f64d18054049443ee8ac6d89d70cc444d","amp;dn":"Goliath+Awaits+%28UPGRADE%29+%5B1981%2FTVRIP%2FXViD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc693b8f64d18054049443ee8ac6d89d70cc444d","infoHashBuffer":{"type":"Buffer","data":[220,105,59,143,100,209,128,84,4,148,67,238,138,198,216,157,112,204,68,77]},"announce":[],"urlList":[]}}