{"title":"Distant Worlds Universe v1.9.5.7 update","uid":10761171,"size":18168491,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dc8672f55095191a075d6a0bcf8eb2bf067c6801&amp;dn=Distant+Worlds+Universe+v1.9.5.7+update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1407976545,"description":"Distant Worlds Universe v1.9.5.7 update\n\n\nExtract rar to your game folder &amp; play!\n\n\nDistant Worlds: Universe is now updated to 1.9.5.7.\n\nThe six major updates since release, including the newest 1.9.5.7 released today, have included fixes for most of the issues reported since release (over 100 in total)! Additionally, more than 100 improvements to game balance, AI and user interface have been made, as well as some additional tutorial tweaks and the addition of an &quot;Introductory Game&quot; mode to get new players started more easily.\n\nThe user interface improvements include significant adjustments to support larger font sizes on larger monitors and allow more of the interface to scale. In addition, game performance optimizations have nearly doubled performance since release.\n\nAlso included are several new modding features, which lift the limitations on race-specific technologies as well as improving modding in a few other areas. If you wish, each faction can have a much more detailed and fully unique tech tree now. The AI's research path can also now be specifically set to optimize each faction exactly the way you want.\n\nThe AI in Universe has improved significantly with each update, both in fleet coordination, exploration, research strategy, ship design, construction and pre-warp strategy.\n\nFinally, we've included a host of fixes for pirate gameplay as well, if you prefer to seek your own fortune among the stars.\n\nYou can download it using your update client or through our FTP. Please let us know if you have any issues updating.\n\nThis update will automatically install when you restart Steam, as long as you are on the non-beta branch.\n\nThis build has the following changes from 1.9.5.5:\n\nCRASH FIXES\n- fixed crash when evaluating designs\n- fixed rare crash when drawing ships\n- fixed crash when giving monetary gifts to other empires\n- fixed crash when sorting ships in fleets\n- fixed crash when ship attacks target\n- fixed crash when reviewing pirate character traits\n- fixed crash when fighter evaluates enemy threats\n- fixed crash when empire declares war\n- fixed crash when opening Construction Yards screen\n- fixed rare crash when applying sun shadow graphics on planets in low-memory conditions\n\nBUG FIXES\n- character energy savings bonuses now properly reduce energy consumption instead of increasing it\n\nGAME BALANCE\n- counterespionage strength adjusted - slightly less chance of intercepting enemy intelligence missions\n- reduced chance of empires switching to Corporate Nationalism government type when available\n- altered empire military strength measurement to better account for fighters (affects diplomacy and AI empire evaluations)\n- independent colonies now recruit more defending militia troops\n- AI now gives higher preference to mining station build locations that are closer to space ports, colonies, etc\n- strategic resources used in construction (for components) now weighted slightly higher when considering stockpiles at spaceports and elsewhere\n\nSHIP DESIGN\n- AI ship design now properly adds damage control components when repair bots are unavailable\n- further optimized AI ship design process to allow shrinking designs with maximum construction size while still ensuring critical components are present (e.g. weapons on military ships)\n- Fighter Bay components now considered as weapons in military ship designs (i.e. can have military ship designs with no weapons except for Fighter Bays)\n\nPIRATES\n- pirate factions now pay maintenance for any non-pirate raider troops (once have proper colonies)\n- pirate faction flags retain pirate symbol in top-left corner when edited in game editor\n- pirate faction flags propery update in galaxy view when edited in game editor\n- pirate factions can now build normal planetary facilities and wonders at fully owned colonies using right-click pop-up menu and action buttons\n\nMODDING\n- now allow per-race modding for user interface in a theme (add subfolders named by race under imagesuichrome folder to mod most chrome images, e.g. customizationTHEMENAMEimagesuichromehuman)\n- custom characters with '?' appearance order now never appear at game start\n- allow including GameText.txt from a custom mod (i.e. read from theme folder)\n- altered imagesunitscreatures folder to be read from the mod (if present) instead of the root game folder\n- allow modding MP3 files in soundsEFFECTS (not just WAV files)\n- fighters now properly use WeaponImageIndex value in fighters.txt to allow customization of fighter weapon effects\n- allow customizing diplomacy mood music to be race-specific (music played when open Diplomatic Contact screen). Will play race-specific music when named race subfolder present under CustomizationTHEMENAMEsoundseffects (e.g. CustomizationMyThemesoundseffectshuman). Mood music filenames as follows: diplomacyMoodNeutral.mp3, diplomacyMoodAngry.mp3, diplomacyMoodHappy.mp3, diplomacyMoodMenacing.mp3\n- increased maximum number of components from 170 to 300 (components.txt)\n- added optional ship design template files for planet destroyers in themes. To use, place a custom ship design template named &quot;PlanetDestroyer.txt&quot; in the appropriate race folder\n- added new super weapon types, allowing different types of planet destroyer weapons: in addition to the default super beam weapons can now also have super torpedos, super missiles, super rail guns, super phasers. Any of these can be set to be planet destroying weapons when damage is 10,000 or greater (weapon component Value1). Particularly useful in conjunction with new planet destroyer ship design templates mentioned above. To add these new super weapons to a custom theme, use the following values in the components.txt file (Type): 62=SuperTorpedo, 63=SuperMissile, 64=SuperRailGun, 65=SuperPhaser. You can also focus an empire's tech efforts to these new areas using the following new values in the race policy files (ResearchDesignTechFocus1-6): 30=SuperTorpedo, 31=SuperMissile, 32=SuperRailGun, 33=SuperPhaser\n\nOTHER\n- slightly improved game performance\n- can now build bases in disputed systems if your empire has a colony in the system\n- decreased chance of counterintelligence intercepting enemy intelligence missions, especially when targeted enemy agent has high mission skill level (i.e. harder to catch)\n- fixed display of game difficulty level in Achievements tab of Empire Comparisons screen (was previously sometimes mislabelling difficulty levels)\n- AI ship design now better at shrinking mining ships when maximum construction size is low\n- AI ship design now better at shrinking military ships with fighter bays when maximum construction size is low","torrent":{"xt":"urn:btih:dc8672f55095191a075d6a0bcf8eb2bf067c6801","amp;dn":"Distant+Worlds+Universe+v1.9.5.7+update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc8672f55095191a075d6a0bcf8eb2bf067c6801","infoHashBuffer":{"type":"Buffer","data":[220,134,114,245,80,149,25,26,7,93,106,11,207,142,178,191,6,124,104,1]},"announce":[],"urlList":[]}}