{"title":"Hijos de los hombres.[DVDRip](spanish).","uid":6010884,"size":730054656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc92dc7d0238f942f1cbba72091a77207216b3df&amp;dn=Hijos+de+los+hombres.%5BDVDRip%5D%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"zurera","files":-1,"time":1291453502,"description":"\t\nPredeterminado Hijos de los Hombres [dvdrip][castellano][ciencia-ficcion]MU 1 LINK\n\n\nDirecciÃƒÂ³n: Alfonso CuarÃƒÂ³n.\nPaÃƒÂ­ses: Reino Unido y USA.\nAÃƒÂ±o: 2006.\nDuraciÃƒÂ³n: 109 min.\nGÃƒÂ©nero: Thriller, ciencia-ficciÃƒÂ³n.\nInterpretaciÃƒÂ³n: Clive Owen (Theo), Julianne Moore (Julian), Michael Caine (Jasper), Chiwetel Ejiofor (Luke), Charlie Hunnam (Patric), Claire-Hope Ashitey (Kee).\nGuiÃƒÂ³n: Alfonso CuarÃƒÂ³n, Timothy J. Sexton, David Arata, Mark Fergus y Hank Ostby; basado en la novela &quot;Children of men&quot; de P.D. James.\nProducciÃƒÂ³n: Marc Abraham, Eric Newman, Hilary Shor, Tony Smith e Iain Smith.\nMÃƒÂºsica: John Tavener.\nFotografÃƒÂ­a: Emmanuel Lubezki.\nMontaje: Alex RodrÃƒÂ­guez y Alfonso CuarÃƒÂ³n.\nDiseÃƒÂ±o de producciÃƒÂ³n: Jim Clay y Geoffrey Kirkland.\nVestuario: Jany Temime.\nEstreno en Reino Unido: 22 Sept. 2006.\nEstreno en EspaÃƒÂ±a: 20 Octubre 2006.\n\nLa Tierra, aÃƒÂ±o 2027. La esperanza de futuro es un recurso que escasea. Hace 19 aÃƒÂ±os que naciÃƒÂ³ el ÃƒÂºltimo niÃƒÂ±o. Ante este inexplicable fenÃƒÂ³meno, la raza humana empieza a perder toda esperanza. La mayorÃƒÂ­a de la gente acepta lo inevitable y se deja caer hacia el separatismo y nihilismo carentes de leyes, otros luchan por defender un planeta unido y los derechos de la decreciente poblaciÃƒÂ³n. Gran BretaÃƒÂ±a, mediante una polÃƒÂ­tica militar imperialista, es el ÃƒÂºnico paÃƒÂ­s que ha conseguido acallar las luchas internas, pero a cambio debe soportar la continua llegada de inmigrantes ilegales a sus costas. Sin embargo, haciendo gala de una polÃƒÂ­tica dura y totalitaria, los refugiados son internados en campos y deportados. Nada de todo esto parece importarle a Theo (Clive Owen), un hombre en estado de parÃƒÂ¡lisis emocional. El antiguo activista convertido a burÃƒÂ³crata se protege contra los recuerdos de un doloroso pasado y la realidad de un futuro sin sentido intentando no sentir nada. Los ÃƒÂºnicos hitos de su monÃƒÂ³tona vida son las visitas que realiza a su viejo amigo Jasper (Michael Caine). Pero todo esto cambia de repente cuando le llevan a ver a Julian (Julianne Moore). La mujer, que fue su compaÃƒÂ±era sentimental y de armas, lidera una organizaciÃƒÂ³n ilegal que defiende los derechos de los refugiados. Julian sÃƒÂ³lo reaparece para pedirle un favor a Theo: que consiga papeles para que Kee (Clare-Hope Ashitey), una joven perteneciente a su organizaciÃƒÂ³n, pueda salir del paÃƒÂ­s sin problemas. Theo acepta, por Julian y tambiÃƒÂ©n porque cobrarÃƒÂ¡ 5.000 libras. Debe acompaÃƒÂ±ar a Kee y a un puÃƒÂ±ado de compaÃƒÂ±eros de Julian en un complicado viaje hasta llegar a la costa. Cuando lleguen, los miembros del casi mÃƒÂ­tico Proyecto Humano, a travÃƒÂ©s del cual las mentes mÃƒÂ¡s brillantes del mundo se esfuerzan en formar una nueva sociedad, les ayudarÃƒÂ¡n. Pero cuando unos terroristas atacan el grupo, queda claro que Kee es mucho mÃƒÂ¡s que una refugiada; de hecho, sus compaÃƒÂ±eros estÃƒÂ¡n dispuestos a morir por ella.\n\nCalidad: DVDRip\nAudio: castellano\nPelÃƒÂ­cula avi ","torrent":{"xt":"urn:btih:dc92dc7d0238f942f1cbba72091a77207216b3df","amp;dn":"Hijos+de+los+hombres.%5BDVDRip%5D%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc92dc7d0238f942f1cbba72091a77207216b3df","infoHashBuffer":{"type":"Buffer","data":[220,146,220,125,2,56,249,66,241,203,186,114,9,26,119,32,114,22,179,223]},"announce":[],"urlList":[]}}