{"title":"Bloc Party - Discography 2004-2013 [FLAC]","uid":9158277,"size":3289344712,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dce10366394876542ed5e2f143329163ec7746c2&amp;dn=Bloc+Party+-+Discography+2004-2013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"rudown78","files":227,"time":1383782511,"description":"Bloc Party - Discography 2004-2013 [FLAC]\n\n\nEqually inspired by Sonic Youth, Joy Division, Gang of Four, and the Cure, East London art punkers Bloc Party mix angular sonics with pop structures. Consisting of singer/guitarist Kele Okereke, guitarist Russell Lissack, bassist/singer Gordon Moakes, and drummer Matt Tong, the band was formerly known as Angel Range and Union before settling on Bloc Party. Okereke and Lissack met each other through mutual friends at the Reading Festival, and discovered that they had musical tastes as well as friends in common. Tong and Moakes soon joined their collaboration, and under the name Union, the quartet issued a demo in early 2003; later that year, they switched their name to Bloc Party.\n\nThe group's demo and concerts began to attract attention from both the press and their peers; Okereke sent a copy of the demo to Franz Ferdinand, who invited them to play at the Domino tenth anniversary bash in fall 2003. Early the following year, the band released one of the demo's tracks, &quot;She's Hearing Voices,&quot; as a single on Trash Aesthetics. A few months later, Banquet/Staying Fat arrived on Moshi Moshi. That spring, Bloc Party signed to Wichita to release their full-length album in the U.K., and to Dim Mak for U.S. distribution. The band spent summer 2004 recording and touring. Late that summer, Bloc Party, which collected the band's first two singles, arrived in the States.\n\nTheir debut album, Silent Alarm, appeared early in 2005 and was released by Vice Records in the States to widespread acclaim. Later that year, Silent Alarm Remixed capitalized on the band's burgeoning popularity, as did the 2006 EP Helicopter. A Weekend in the City, Bloc Party's second proper album, followed in 2007. A Weekend in the City leaked onto the Internet months before the album's street date, which inspired Bloc Party to issue their third album, Intimacy, online in late summer 2008; the album was released on compact disc that fall. Late in 2009, Bloc Party went on hiatus and Okereke began working on songs on his own, moving to Berlin and collaborating with producers Hudson Mohawke and XXXchange in New York on a solo album. In 2010, the single Tenderoni arrived, revealing that Okereke's solo work was more dance-oriented than his music with Bloc Party. His full-length debut, The Boxer, arrived in summer 2010. Meanwhile, Moakes formed a side project, Young Legionnaire, with the Automatic's Paul Mullen and La Roux's William Bowerman. The following year, Bloc Party reunited to record their fourth album; that July, the lead single &quot;Octopus&quot; showed that the band had returned to the angular, guitar-heavy sound of their earlier work. Four arrived in August 2012. The band's contribution to !K7's mix series Tapes, which featured cuts by Wiley, Junior Boys, and Fela Kuti, arrived the following October.\n\n\n2004 - Bloc Party [EP]\n2004 - Little Thoughts [Japan EP]\n2005 - Silent Alarm\n2005 - Silent Alarm Remixed\n2007 - A Weekend in the City\n2008 - Intimacy [US Bonus Tracks]\n2009 - Intimacy Remixed\n2012 - Four [Deluxe Edition]\n2012 - Four More [Promo EP]\n2013 - The Nextwave Sessions [EP]\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:dce10366394876542ed5e2f143329163ec7746c2","amp;dn":"Bloc+Party+-+Discography+2004-2013+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce10366394876542ed5e2f143329163ec7746c2","infoHashBuffer":{"type":"Buffer","data":[220,225,3,102,57,72,118,84,46,213,226,241,67,50,145,99,236,119,70,194]},"announce":[],"urlList":[]}}