{"title":"Southland Tales (2006) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)","uid":9292132,"size":3969241507,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:dd14a5993747e1bf11005c5b775ec5d518708aab&amp;dn=Southland+Tales+%282006%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":5,"uploader":"clownsec","files":-1,"time":1386112547,"description":"Southland Tales (2006) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\n\nCalifornia is at the epicenter of a political and environmental disaster that threatens to destroy the world in this ambitious fusion of comedy, drama, dystopian science fiction, and music from writer and director Richard Kelly, his first film after gaining a cult following with Donnie Darko. In the year 2005, a nuclear attack wipes out part of the state of Texas, and three years later America is a virtual police state, with the government taking control of nearly every part of people's lives, supposedly for their own good. A German firm has found a way to generate energy using seawater, but both public and private concerns are desperate to prevent the new technology from being introduced in the gasoline-starved United States. A Marxist underground based on the West Coast is determined to bring down the federal government through violent revolution.In this midst of this chaos, we follow a number of stories that continually return to three principle characters. Boxer Santaros (Dwayne Johnson, aka The Rock) is an actor famous for his role in action films; he's trying to secure financing for a new project, but reality keeps mirroring the events in his script and he struggles to hold on to his identity following a bout with amnesia. Krysta Now (Sarah Michelle Gellar) is a porn star who is reinventing herself as a television pundit offering her views on politics, contemporary culture, and teenage sex. And Roland Taverner (Seann William Scott) is an L.A. police officer whose identity has mysteriously split in two, and he struggles to track down his other half. Featuring a massive supporting cast which includes Mandy Moore, Miranda Richardson, Wallace Shawn, Jon Lovitz, Kevin Smith, Amy Poehler, and Justin Timberlake, Southland Tales received its world premiere at the 2006 Cannes Film Festival; director Kelly also created an accompanying series of three graphic novels that chart these events and characters prior to this story. ~ Mark Deming, Rovi\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:dd14a5993747e1bf11005c5b775ec5d518708aab","amp;dn":"Southland+Tales+%282006%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd14a5993747e1bf11005c5b775ec5d518708aab","infoHashBuffer":{"type":"Buffer","data":[221,20,165,153,55,71,225,191,17,0,92,91,119,94,197,213,24,112,138,171]},"announce":[],"urlList":[]}}