{"title":"The Chameleons UK -  Strange Times [1986]","uid":4117429,"size":111044480,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ddfbd08262912ba48c5ed4456d46dbd5cff20012&amp;dn=The+Chameleons+UK+-++Strange+Times+%5B1986%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"80zforever","files":15,"time":1207385073,"description":"The atmospheric pop band the Chameleons formed in Manchester, England, in 1981 from the ashes of a number of local groups: vocalist/bassist Mark Burgess began with the Cliches, guitarists Reg Smithies and Dave Fielding arrived from the Years, and drummer John Lever (who quickly replaced founding member Brian Schofield) originated with the Politicians.\n\nIf there was a should-have-been year in the Chameleons&amp;#039; history, 1986 would clearly be it, and Strange Times demonstrates that on every track, practically in every note. Signed to a huge label, with production help from the Dave Allen/Mark Saunders team who worked on the Cure&amp;#039;s brilliant series of late-&amp;#039;80s records (here providing a more balanced sound between guitar effects and direct punch than appeared on What), the Chameleons delivered an album that should have been the step to a more above-board existence on radio and beyond. Right from the start, a stunning upward spiral of a guitar riff begins the unnerving character study &quot;Mad Jack,&quot; the bandmembers mix their skills, experience, and songwriting ability perfectly and take everything to an even higher level. The first half continues with three more stunners: &quot;Caution,&quot; a semi-waltz that moves well, pulls back, and then slams home, &quot;Tears,&quot; a crushingly sad, acoustic ode to personal loss, and &quot;Soul in Isolation,&quot; combining a huge majestic wallop with Mark Burgess&amp;#039; anguished study of alienation. And just when you think it couldn&amp;#039;t get any better ? &quot;Swamp Thing,&quot; the definitive Chameleons song, complex, building, tense, epic, perfectly played (John Lever&amp;#039;s drumming is simply jaw-dropping, the Reg Smithies/Dave Fielding guitar pairing totally spot on), and with one of Burgess&amp;#039; most poetic, personal lyrics. It just keeps going from there, the second half covering everything from more sweeping tunes (&quot;Time,&quot; &quot;In Answer&quot;) to bare-bones melancholy (&quot;In Answer,&quot; &quot;I&amp;#039;ll Remember&quot;). Bonus tracks: an alternate and equally striking &quot;Tears,&quot; the driving &quot;Paradiso&quot; and &quot;Inside Out,&quot; and two covers. The take on Bowie&amp;#039;s &quot;John, I&amp;#039;m Only Dancing&quot; is a quick fun goof, but the version of &quot;Tomorrow Never Knows&quot; (Burgess especially has been and remains a massive John Lennon fanatic, quoting songs by him liberally throughout his career) surges and soars, beating out by a mile all the times others have covered it. From back to front, Strange Times could never have enough praise. [British versions of Strange Times on CD and LP came with a second disc of bonus tracks; when the album was reissued on CD in the U.S. in 1995, the bonus tracks were simply added to the album proper, without adding an extra disc.] \n \n\nTracks:\n \n01  Mad Jack\n02  Caution   \n03  Tears    \n04  Soul in Isolation    \n05  Swamp Thing    \n06  Time the End of Time   \n07  Seriocity    \n08  In Answer    \n09  Childhood    \n10  I&amp;#039;ll Remember        \n11  Tears\n12  Paradiso \n13  Inside Out  \n14  John, I&amp;#039;m Only Dancing         \n15  Tomorrow Never Knows     \n    \n    \n    \n    ","torrent":{"xt":"urn:btih:ddfbd08262912ba48c5ed4456d46dbd5cff20012","amp;dn":"The+Chameleons+UK+-++Strange+Times+%5B1986%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddfbd08262912ba48c5ed4456d46dbd5cff20012","infoHashBuffer":{"type":"Buffer","data":[221,251,208,130,98,145,43,164,140,94,212,69,109,70,219,213,207,242,0,18]},"announce":[],"urlList":[]}}