{"title":"Spice Dreams Flavored Ice Creams and Other Frozen Treats - Sara","uid":11285395,"size":7675666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de1931952698262050a636a3841438f10d5e8277&amp;dn=Spice+Dreams+Flavored+Ice+Creams+and+Other+Frozen+Treats+-+Sara+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MentalZero","files":-1,"time":1414270927,"description":"Inspired by the hot new trend of flavored frozen desserts, this beautiful cookbook features more than 50 recipes for spicing up everyone's favorite creamy, dreamy treat. \n\nIn Spice Dreams, Sara Engram and Katie Luber are back to transform desserts the same way they revolutionized spice cabinets with their two unique lines of organic spices: tsp spices and Smart Spice. In their previous cookbook, The Spice Kitchen, they gave us new ways to enhance everyday family meals with herbs and spices. Now they're spicing up everyone's favorite treat. \n\nDiscover how you can incorporate fresh and dried herbs and spices into your homemade frozen desserts with more than 50 recipes for ice creams, sorbets, sundaes, ice-cream sandwiches, and other frozen treats. Honey-Mint Ice Cream with Thyme and Basil, Chile-Orange-Chocolate Sorbet, Cardamom Snickerdoodle Cookie Ice-Cream Sandwiches, and Caramel Apple Sundaes are just a taste of the deliciously decadent desserts you'll find in this unique ice-cream book. \n\nBeautifully designed, Spice Dreams is a satisfying and wonderfully cool addition to the cookbook library for fans of ice cream, fans of spices, and food lovers everywhere","torrent":{"xt":"urn:btih:de1931952698262050a636a3841438f10d5e8277","amp;dn":"Spice+Dreams+Flavored+Ice+Creams+and+Other+Frozen+Treats+-+Sara+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de1931952698262050a636a3841438f10d5e8277","infoHashBuffer":{"type":"Buffer","data":[222,25,49,149,38,152,38,32,80,166,54,163,132,20,56,241,13,94,130,119]},"announce":[],"urlList":[]}}