{"title":"The.Mob.and.the.City.The.Hidden.History.of.How.the.Mafia.Capture","uid":11649527,"size":6080105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de2d6f9c9f3340e360a5d164c2c959528f432d2c&amp;dn=The.Mob.and.the.City.The.Hidden.History.of.How.the.Mafia.Capture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"wildturkey00","files":2,"time":1417857607,"description":"Forget what you think you know about the Mafia. After reading this book, even life-long mob aficionados will have a new perspective on organized crime.\nInformative, authoritative, and eye-opening, this is the first full-length book devoted exclusively to uncovering the hidden history of how the Mafia came to dominate organized crime in New York City during the 1930s through 1950s. Based on exhaustive research of archives and secret files obtained through the Freedom of Information Act, author and attorney C. Alexander Hortis draws on the deepest collection of primary sources, many newly discovered, of any history of the modern mob.\n\nShattering myths, Hortis reveals how Cosa Nostra actually obtained power at the inception. The author goes beyond conventional who-shot-who mob stories, providing answers to fresh questions such as:\n\n* Why did the Sicilian gangs come out on top of the criminal underworld?\n* Can economics explain how the Mafia families operated?\n* What was the Mafia's real role in the drug trade?\n* Why was Cosa Nostra involved in gay bars in New York since the 1930s?\n\nDrawing on an unprecedented array of primary sources, The Mob and the City is the most thorough and authentic history of the Mafia's rise to power in the early-to-mid twentieth century","torrent":{"xt":"urn:btih:de2d6f9c9f3340e360a5d164c2c959528f432d2c","amp;dn":"The.Mob.and.the.City.The.Hidden.History.of.How.the.Mafia.Capture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de2d6f9c9f3340e360a5d164c2c959528f432d2c","infoHashBuffer":{"type":"Buffer","data":[222,45,111,156,159,51,64,227,96,165,209,100,194,201,89,82,143,67,45,44]},"announce":[],"urlList":[]}}