{"title":"[SoM]Un pesce di nome Wanda[DvdRip-Xvid-Ita-Mp3]","uid":4384015,"size":836352088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de2e8bcdfc0ec5ad6906ebd3afc45c4c8bba4ace&amp;dn=%5BSoM%5DUn+pesce+di+nome+Wanda%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mitimex","files":1,"time":1220817337,"description":"In trasferta a Londra, un quartetto di lestofanti americani compie un furto di gioielli negli Hatton Gardens, sofisticato centro commerciale delle pietre preziose. Si tratta di Otto West, oriundo italiano, di George, capo banda, del pavido e balbuziente Ken Pile (appassionato di pescicoltura) e della sfrontatissima Wanda, che in pubblico spaccia Otto come fratello, ma che in realtÃƒÂ  ha dimestichezza con tutti. George perÃƒÂ², che a colpo effettuato ha nascosto i diamanti per sÃƒÂ© solo, finisce in galera e Wanda pensa bene di sedurre l&amp;#039;irreprensibile avvocato Archie Leach, cui spetterÃƒÂ  difendere il ladro in aula, nel tentativo di conoscere il nascondiglio dei gioielli. Ognuno dei ladri fa il doppio gioco e mentre Ken tenta di eliminare una vecchietta che ha visto il quartetto in fuga, Wanda incanta Archie, ne scombussola la vita familiare e finisce con l&amp;#039;innamorarsi del legale, che per lei ha perso la testa. Dopo complicazioni ed innumerevoli equivoci e dopo un&amp;#039;affannosa ricerca dei gioielli chiusi in una cassetta, la cui chiave passa dalle mani di Wanda a quelle della signora Wendy Leach, per tornare infine in quelle dell&amp;#039;americana, costei riesce a fuggire in Sud America con Archie e i gioielli.","torrent":{"xt":"urn:btih:de2e8bcdfc0ec5ad6906ebd3afc45c4c8bba4ace","amp;dn":"%5BSoM%5DUn+pesce+di+nome+Wanda%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de2e8bcdfc0ec5ad6906ebd3afc45c4c8bba4ace","infoHashBuffer":{"type":"Buffer","data":[222,46,139,205,252,14,197,173,105,6,235,211,175,196,92,76,139,186,74,206]},"announce":[],"urlList":[]}}