{"title":"Innocence of Muslims - Full Movie (74 min)","uid":7646360,"size":431709345,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de33ee20e7434ca2e57c01d89382a5dff4204ae8&amp;dn=Innocence+of+Muslims+-+Full+Movie+%2874+min%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"idle12","files":1,"time":1347914852,"description":"Anti Muslim Youtube video features a movie clip which portrays the Prophet Muhammad in a negative light with Islamophobia views of the Islam faith. Watch the FULL Movie Trailer in HD.\n\n'Innocence of Muslims' , blamed for inciting mobs in Egypt, Yemen, Tunisia, Morocco, Sudan, Iran, Iraq, Israel and the Palestinian territories the movie was originally titled &quot;Desert Warrior&quot; and possibly &quot;Innocence of Bin Laden&quot; and was filmed in California by Nakoula Basseley Nakoula under the alias &quot;Sam Bacile&quot;. Nakoula once claimed to be Israeli American but has been confirmed as a Coptic Christian from Egypt.\n\nThe video was translated into Arabic and made the news cycle across Arab nations which inspired the protests and riots on September 11, 2012 culminating in the storming of U.S. Embassy in Benghazi Libya and the death of the US Ambassador to Libya Christopher Stevens along with 3 other American citizens. Former U.S. Navy SEAL Glen Doherty, Tyrone Woods and computer expert Sean Smith were killed in the same siege of the U.S. Embassy in Benghazi.\n\nMany Americans are now questioning why the Embassy was so insecure and especially so on the anniversary of the Sept 11 attacks and wonder why the protesters were allowed unfettered access to the embassy. Still others question the timing of these attacks and how they will effect the U.S. Presidential Elections with Mitt Romney releasing a statement condemning the actions of President Obama and accusing him of sympathizing with the terrorists. Romney has come under fire now for &quot;shooting first and aiming later&quot; with his criticism of the seated U.S. President in the early stages of a national crisis. Some are calling this a September Surprise and comparing it to the release of US hostages from Iran in 1980 which some say cost Jimmy Carter the election.\n\nEgypt's Islamist President Mohammed Morsi on Monday condemned the attack on Libya that k Egypt's Islamist President Mohammed Morsi on Monday condemned the attack on Libya that killed the American ambassador and vowed to protect foreign embassies in Cairo, where police were using tear gas to disperse protesters at the U.S. mission. U.S. officials said that one destroyer, the USS Laboon, has moved to a position near the coast of Libya, and the USS McFaulis is on its way and will station itself on the coast. The two ships are manned by about 300 men and are carrying Tomahawk missiles, according to officials, and are waiting to receive a specific mission from the U.S.Commander-in-Chief.\n\nThe United States has sent Marines while NATO countries beef up embassy security as Middle East riots spread following Wednesday's tragic violence in Libya and Egypt.\n","torrent":{"xt":"urn:btih:de33ee20e7434ca2e57c01d89382a5dff4204ae8","amp;dn":"Innocence+of+Muslims+-+Full+Movie+%2874+min%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de33ee20e7434ca2e57c01d89382a5dff4204ae8","infoHashBuffer":{"type":"Buffer","data":[222,51,238,32,231,67,76,162,229,124,1,216,147,130,165,223,244,32,74,232]},"announce":[],"urlList":[]}}