{"title":"The Body Image Workbook: An Eight-Step Program for Learning to L","uid":8882063,"size":5525437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de48732e26b11345c4cf3cb02628e5d82e0ce349&amp;dn=The+Body+Image+Workbook%3A+An+Eight-Step+Program+for+Learning+to+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MANTESH","files":1,"time":1378353867,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51jiiNJ60BL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51jiiNJ60BL.jpg&lt;/a&gt;\n\n\nThe Body Image Workbook: An Eight-Step Program for Learning to Like Your Looks\n\nPublisher: New Harbinger Publications\nThomas Cash\nLanguage: English\nISBN-10: 1572245468\nISBN-13: 978-1572245464\n2008 \nPDF\n240 pages \n5.26 MB\n\n\n Have you ever wondered what it would feel like to accept and enjoy the way you look instead of constantly worrying about and criticizing your appearance? What if instead of focusing on your flaws, you felt confident with the body you have right now?\n\n If you don't like what you see when you look in the mirror, you may not realize that these feelings are entirely within your grasp. You don't need extensive cosmetic surgery, pricey beauty treatments, or weight loss programs, but you may need to do something even more drastic-change your perspective and the way you view yourself. The Body Image Workbook offers a comprehensive program to help you stop focusing on your perceived imperfections and start feeling more confident about the way you look.\n\n As you complete the helpsheets in this book, you'll learn to celebrate your body instead of feeling ashamed of it. This new edition includes discussions of our obsession with physical appearance and with body-fixing options. It helps you discover your personal body image strengths and vulnerabilities and then guides you in creating new, life-changing experiences of mindfulness and body acceptance. After completing this eight-step program, you'll look at yourself in a whole new light-seeing the beauty of the real you.\n\n","torrent":{"xt":"urn:btih:de48732e26b11345c4cf3cb02628e5d82e0ce349","amp;dn":"The+Body+Image+Workbook%3A+An+Eight-Step+Program+for+Learning+to+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de48732e26b11345c4cf3cb02628e5d82e0ce349","infoHashBuffer":{"type":"Buffer","data":[222,72,115,46,38,177,19,69,196,207,60,176,38,40,229,216,46,12,227,73]},"announce":[],"urlList":[]}}