{"title":"Shrimad Valmiki Ramayana - English Version [ALL KANDAS(CANTOS)]","uid":6922348,"size":2855170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de6a322fdee2eb934379aa7799339ae9d6831da8&amp;dn=Shrimad+Valmiki+Ramayana+-+English+Version+%5BALL+KANDAS%28CANTOS%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"594mgnav","files":-1,"time":1325318828,"description":"Shrimad Valmiki Ramayana - English Version [ALL KANDAS(CANTOS)] [Team Nanban][TPB]\n\nThe English Version of the great epic - THE RAMAYANA was given by RALPH T. H. GRIFFITH, M. A.,\n\nA special thanks to him from the Team Nanban...!!\n\nPLZ SEED AFTER DOWNLOADING..I SEE TO THAT MANY UNWANTED TORRENTS GETS SEEDS QUIET EASILY...\n\nBUT NOT FOR DIVINE TORRENTS WHICH DESERVE TO GET MANY SEEDS....\n\nSO PLZ SEED GUYZ....MAY GOD BLESS YOU ALL..\n\n\nAbout Valmiki:\n\n\n\n&quot;Valmiki&quot; (during Lord Rama's time) is celebrated as the poet harbinger \nin Sanskrit literature. \n\nHe is the author of the epic Ramayana, based on the attribution in the text of \nthe epic itself.\n\nHe is revered as the Adi Kavi, which means First Poet, for he discovered the first sloka \ni.e. first verse, which set the base and defined the form to Sanskrit poetry.\n\nThe Ramayana, originally written by Valmiki, consists of 24,000 verses in seven cantos \n(some say six i.e. excluding the Uttara Ramayana) (Kandas). \n\nThe Ramayana tells the story of a prince, Rama of Ayodhya, whose wife Sita is abducted \nby the demon (Raakshasa) king of Lanka, Ravana. \n\nThe Valmiki Ramayana is dated variously from 500 BC to 100 BC, or about co-eval with \nearly versions of the Mahabharata.\n\nAs with many traditional epics, it has gone through a long process of interpolations \nand redactions, making it impossible to date accurately.\n\n\n\n\nSHORT DESCRIPTION ON &quot;Shrimad Valmiki Ramayana&quot;:\n\n\n\nThe Ramayana is an ancient Sanskrit epic. \n\nIt is ascribed to the Hindu sage Valmiki and forms an important part of the Hindu canon, \nconsidered to be &quot;itihaasa&quot;.\n\nThe Ramayana is one of the two great epics of India and Nepal, \nthe other being the Mahabharata.\n\nIt depicts the duties of relationships, portraying ideal characters like the ideal father, \nideal servant, the ideal brother, the ideal wife and the ideal king.\n\nThe name Ramayana is a tatpurusha compound of Rama and ayana (&quot;going, advancing&quot;),\n translating to &quot;Rama's Journey&quot;. \n\nThe Ramayana consists of 24,000 verses in seven books (Kandas) and 500 cantos (sargas),\n and tells the story of Rama (an avatar of the Hindu preserver-God Vishnu), \nwhose wife Sita is abducted by the demon king of Lanka, Ravana. \n\nThematically, the Ramayana explores human values and the concept of dharma.\n\nVerses in the Ramayana are written in a 32-syllable meter called anustubh. \n\nThe Ramayana was an important influence on later Sanskrit poetry and Indian life \nand culture. \n\nLike the Mahabharata, the Ramayana is not just a story: it presents the teachings of \nancient Hindu sages in narrative allegory, interspersing philosophical \nand devotional elements. \n\nThe characters Rama, Sita, Lakshmana, Bharata, Hanuman and Ravana are all fundamental \nto the cultural consciousness of India and Nepal.\n\nThere are other versions of the Ramayana, notably Kambaramayana in Tamil, \nthe Buddhist (Dasaratha Jataka No. 461) and Jain in India, and also Indonesian, \nPhilippine, Thai, Lao, Burmese and Malay versions of the tale.\n\n\n\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF RAMAYANA THROUGHOUT THE WORLD..\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..\n\n\nPLZ SEED AS MUCH AS POSSIBLE..I AM LACKING SEEDS...\n\nITS A SHAME IF YOU DIDNT SEED...\n\nPLZ SEED THIS TORRENT AS MUCH AS POSSIBLE...\n\nI AM SORRY TO SAY THAT GOOD TORRENTS ARE LACKING BEHIND IN SEEDS BADLY..\nTHAN THE WASTE TORRENTS...\n\nPLZ MAKE THIS TORRENT[SMALL SIZED] A HIGHLY SEEDED ONE...THANK YOU..","torrent":{"xt":"urn:btih:de6a322fdee2eb934379aa7799339ae9d6831da8","amp;dn":"Shrimad+Valmiki+Ramayana+-+English+Version+%5BALL+KANDAS%28CANTOS%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6a322fdee2eb934379aa7799339ae9d6831da8","infoHashBuffer":{"type":"Buffer","data":[222,106,50,47,222,226,235,147,67,121,170,119,153,51,154,233,214,131,29,168]},"announce":[],"urlList":[]}}