{"title":"CodeIgniter for Rapid PHP Application Development.pdf","uid":12807393,"size":3598255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dee2c552a910d85fe88e39eaf238535deff574a7&amp;dn=CodeIgniter+for+Rapid+PHP+Application+Development.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"fitouri","files":1,"time":1448139497,"description":"Chapter 1 explains what CodeIgniter can do, the 'framework', and how CodeIgniter\r\nfits in. It further talks about the open-source business model and gives some\r\ndisadvantages of CodeIgniter, at the end.\r\nChapter 2 explains what happens when you install the site, and which files will be\r\ncreated. It gives a detailed overview of the required software, and explains the basic\r\nconfiguration of CodeIgniter.\r\nChapter 3 explains how MVC helps to organize a dynamic website. It goes further\r\nto explain the process by which CodeIgniter analyzes an incoming Internet request\r\nand decodes which part of your code will handle it. Then CodeIgniter syntax rules\r\nand the different types of files or classes you can find—or write for yourself—on a\r\nCodeIgniter site are explained. At the end of the chapter, some practical hints on site\r\ndesign are given.\r\nChapter 4 looks at how you set up a database to work with CodeIgniter, and then\r\nhow you use the Active Record class to manipulate the database.\r\nChapter 5 covers various ways of building views, how to create HTML forms quickly,\r\nand how to validate your forms using CodeIgniter's validation class.\r\nChapter 6 looks at one of the basic questions affecting any website i.e. session\r\nmanagement and security; we also explore CodeIgniter's session class.\r\nChapter 7 covers the way in which CodeIgniter uses objects, and the different ways in\r\nwhich you can write and use your own objects.\r\nChapter 8 covers CodeIgniter classes to help with testing: Unit tests, Benchmarking,\r\nthe 'profiler' and ways in which CodeIgniter helps you to involve your database in\r\ntests without scrambling live data.\r\nChapter 9 looks at using CodeIgniter's FTP class and email class to make\r\ncommunication easier, and then we venture into Web 2.0 territory using XML-RPC.\r\nChapter 10 talks about CodeIgniter classes that help in overcoming problems arising\r\nregularly when you are building a website, for example, the date helper, the text and\r\ninflector helpers, the language class, and the table class.\r\nChapter 11 looks at several useful CodeIgniter functions and helpers: file helper,\r\ndownload helper, fileupload class, image manipulation class, and the ZIP class.\r\nChapter 12 covers exploring your config files, using diagnostic tools, and potential\r\ndifferences between servers, along with some notes on security.\r\nChapter 13 shows you how to generalize CRUD operations so that you can do them\r\nwith two classes: one for the controller, and one for the CRUD model.\r\nChapter 14 looks at some coding examples, bringing together a lot of the functions\r\nthat have been discussed bit by bit in the preceding chapters.\r\nChapter 15 looks at some of the resources available to you when you start to code\r\nwith CodeIgniter, such as the libraries for AJAX and JavaScript, authentication,\r\ncharting, and CRUD","torrent":{"xt":"urn:btih:dee2c552a910d85fe88e39eaf238535deff574a7","amp;dn":"CodeIgniter+for+Rapid+PHP+Application+Development.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee2c552a910d85fe88e39eaf238535deff574a7","infoHashBuffer":{"type":"Buffer","data":[222,226,197,82,169,16,216,95,232,142,57,234,242,56,83,93,239,245,116,167]},"announce":[],"urlList":[]}}