{"title":"Adobe.Photoshop.Touch.v1.5.0-AnDrOiD","uid":8727102,"size":48011469,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:def88a7b8fa1b1a73ac8dcb244aad78f0b122803&amp;dn=Adobe.Photoshop.Touch.v1.5.0-AnDrOiD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"R0thschild","files":2,"time":1374528800,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                       &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nAdober Photoshopr Touch v1.5.0\n\nRequirements: 3.1 +\n\nTransform images with core Photoshop features in an app designed for tablets.\nCombine images, apply professional effects, share results with friends and family through sites like Facebook, and more - all from the convenience of your tablet.\nUse Photoshop features designed for the tablet such as layers, selection tools, adjustments, and filters to create mind-blowing images. \nUse your tablet camera to fill an area on a layer with the unique camera fill feature.\nSelect part of an image to extract by scribbling with the Scribble Selection tool. With Refine Edge, use your fingertip to capture even hard-to-select image elements, like hair, with ease. \nSearch and acquire images with the integrated Google Image Search. \nShare images on Facebook and view comments right within the app.\nBrowse an inspirational gallery for the styles and results you'd like to achieve. Then follow step-by-step tutorials to easily learn techniques the pros use for great-looking results.\nSync projects with Adobe Creative Cloud* and open layered files from Adobe Photoshop Touch in Photoshop CS5 or higher.\nFree membership to Creative Cloud gives you 2GB of cloud storage plus the ability to sync between tablet and desktop, access files from the web, and easily share with others. Learn more &gt; http://www.adobe.com/products/creativecloud\nMaximum image resolution: 2048 x 2048 pixels\nInternet connection and membership to Adobe Creative Cloud is required. Adobe online services, including the Adobe Creative Cloud* service, are available only to users 13 and older and require registration, agreement to additional terms and Adobe's online privacy policy athttp://www.adobe.com/go/privacy.\n\nAdobe online services are not available in all countries or languages, may require user registration and may be subject to change or discontinuation without notice.\n\nWhat's in this version : (Updated : Jul 18, 2013)\nAdded Ripple effect\nBug fixes\nUpdated Synchronization engine","torrent":{"xt":"urn:btih:def88a7b8fa1b1a73ac8dcb244aad78f0b122803","amp;dn":"Adobe.Photoshop.Touch.v1.5.0-AnDrOiD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def88a7b8fa1b1a73ac8dcb244aad78f0b122803","infoHashBuffer":{"type":"Buffer","data":[222,248,138,123,143,161,177,167,58,200,220,178,68,170,215,143,11,18,40,3]},"announce":[],"urlList":[]}}