{"title":"Griffin Family Guy - Season 2 (Pack 1 of 2) [DVDrip ITA ENG] TNT","uid":6595255,"size":1977107516,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df26300ba57313c3baebc2d0cbab1eea0d3b15d7&amp;dn=Griffin+Family+Guy+-+Season+2+%28Pack+1+of+2%29+%5BDVDrip+ITA+ENG%5D+TNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"l.diliberto","files":13,"time":1312986480,"description":"Griffin Family Guy - Season 2 (Pack 1 of 2) [DVDrip ITA ENG] TNT Village\n\nDual audio: #1 Italian #2 English\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=68878&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=68878&lt;/a&gt;\n\n.: Plot :.\n\nThe show revolves around the adventures of the family of Peter Griffin, a bumbling blue-collar worker. Peter is an Irish-American Catholic with a prominent Rhode Island and Eastern Massachusetts accent. He is married to Lois, a stay-at-home mother and piano teacher who, as member of the Pewterschmidt family of wealthy socialites, has a distinct New England accent. Peter and Lois have three children: Meg, their teenage daughter, who is awkward and does not fit in at school, and is constantly ridiculed and ignored by the family; Chris, their teenage son, who is overweight, unintelligent and a younger version of his father in many respects; and Stewie, their diabolical infant son of ambiguous sexual orientation who has adult mannerisms, and speaks fluently with stereotypical archvillain phrases.] Living with the family is Brian, the family dog, who is highly anthropomorphized, drinks martinis, and engages in human conversation, though he is still considered a pet in many respects. Many recurring characters appear alongside the Griffin family. These include the family's neighbors: sex-crazed airline-pilot bachelor Glenn Quagmire, Cleveland Brown and his wife Loretta Brown, paraplegic police officer Joe Swanson, his wife Bonnie and their baby daughter Susie (Bonnie is pregnant with Susie from the show's beginning until the seventh episode of the seventh season); neurotic Jewish pharmacist Mort Goldman, his wife Muriel, and their geeky and annoying son Neil; and elderly ephebophile Herbert. TV news anchors Tom Tucker and Diane Simmons, Asian reporter Tricia Takanawa, and Blaccu-Weather meteorologist Ollie Williams also make frequent appearances. Quahog mayor Adam West is in various episodes.\n\n.: Trama :.\n\nIl programma ruota attorno alle avventure di Peter Griffin e della sua famiglia residenti a Quahog, cittadina immaginaria del Rhode Island. Peter ÃƒÂ¨ un operaio incompetente, obeso ed ottuso, ed il suo comportamento ÃƒÂ¨ particolarmente mutevole: a volte ÃƒÂ¨ un padre assente e dedito all'alcool, che non riesce a farsi rispettare dai propri cari, altre volte invece, seppur per poco, riesce a svolgere degnamente il ruolo di capo famiglia. Sua moglie, Lois, ÃƒÂ¨ una bella e brava casalinga, insegnante di pianoforte, che dimostra talvolta velleitÃƒÂ  artistiche ed esibisce comportamenti disinibiti. La coppia ha tre figli: Meg ÃƒÂ¨ la tipica ragazza con problemi adolescenziali, come il non essere accettati o le difficoltÃƒÂ  nei rapporti sentimentali; Chris ÃƒÂ¨ anche lui obeso, ingenuo e, per quanto tutt'altro che talentuoso, con la passione per il disegno; infine il diabolico Stewie, un neonato intelligentissimo, in grado di costruire fantascientifici strumenti per liberarsi della madre, considerata l'ostacolo alla conquista del mondo. Con la famiglia vive anche un cane parlante, di nome Brian, il miglior amico di Peter, che deve fare i conti con i suoi grossi problemi di dipendenza dall'alcool e, in alcuni casi, dalla droga.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img82.imageshack.us/img82/2087/i20griffin2020stagione2ss9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img82.imageshack.us/img82/2087/i20griffin2020stagione2ss9.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo originale \tFamily Guy\nAutore \tSeth MacFarlane\nSceneggiatura     Seth MacFarlane,    David Zuckerman\nCharacter design     Bill Edwards,    Miguel Lopez\nMusiche     Ron Jones,     Walter Murphy\n\n0=============================0\n\n.: Media Info Ripping :.\n\nDimensione: 235 MB\nDurata: 00:22:30\n\nVideo Codec: DivX 5.0\nVideo Bitrate: 1198\nRisoluzione: 576 x 432\nFPS (Frames/sec): 25\nQF (Frame quality): 0.193\n\nAudio Codec: MP3\nAudio Bitrate: 128 kb/s\nFreq Audio: 48000Hz (2 chnls) ","torrent":{"xt":"urn:btih:df26300ba57313c3baebc2d0cbab1eea0d3b15d7","amp;dn":"Griffin+Family+Guy+-+Season+2+%28Pack+1+of+2%29+%5BDVDrip+ITA+ENG%5D+TNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df26300ba57313c3baebc2d0cbab1eea0d3b15d7","infoHashBuffer":{"type":"Buffer","data":[223,38,48,11,165,115,19,195,186,235,194,208,203,171,30,234,13,59,21,215]},"announce":[],"urlList":[]}}