{"title":"Enron The Smartest Guys In The Room 2005 1080p 6ch 6subs x265","uid":15034050,"size":1673873420,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e0d439bbba3c7e49c57706d939bcb82f63a795b5&amp;dn=Enron+The+Smartest+Guys+In+The+Room+2005+1080p+6ch+6subs+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bsg4you","files":3,"time":1466562754,"description":"Enron.The.Smartest.Guys.In.The.Room.2005.1080p.6ch.6subs.x265.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nEnron: The Smartest Guys in the Room (2005)\r\nvideo: 1920x1080 HEVC crf=23.00 preset=medium ~1783Kbps 8-bit\r\naudio1: 5.1 Surround English HE-AAC 256Kbps\r\nsubs1: English\r\nsubs2: Spanish\r\nsubs3: Dutch\r\nsubs4: Finnish\r\nsubs5: Korean\r\nsubs6: Turkish\r\nsubsX: plain text, built in, off by default\r\nsource: AVC 9952Kbps - DTS 1509Kbps\r\n1hour49min15sec 1,673,810,206bytes includes custom named chapters\r\n  http://www.imdb.com/title/tt1016268/  \r\n\r\n**********\r\n\r\nIMDB: Enron dives from the seventh largest US company to bankruptcy in less than a year in this tale told chronologically. The emphasis is on human drama, from suicide to 20,000 people sacked: the personalities of Ken Lay (with Falwellesque rectitude), Jeff Skilling (he of big ideas), Lou Pai (gone with $250 M), and Andy Fastow (the dark prince) dominate. Along the way, we watch Enron game California's deregulated electricity market, get a free pass from Arthur Andersen (which okays the dubious mark-to-market accounting), use greed to manipulate banks and brokerages (Merrill Lynch fires the analyst who questions Enron's rise), and hear from both Presidents Bush what great guys these are.\r\n\r\n**********\r\n\r\nWikipedia: A 2005 American documentary film based on the best-selling 2003 book of the same name by Fortune reporters Bethany McLean and Peter Elkind, a study of one of the largest business scandals in American history. McLean and Elkind are credited as writers of the film alongside the director, Alex Gibney.\r\n\r\nThe film examines the 2001 collapse of the Enron Corporation, which resulted in criminal trials for several of the company's top executives during the ensuing Enron scandal; it also shows the involvement of the Enron traders in the California electricity crisis. The film features interviews with McLean and Elkind, as well as former Enron executives and employees, stock analysts, reporters and the former Governor of California Gray Davis.\r\n\r\nThe film won the Independent Spirit Award for Best Documentary Feature and was nominated for Best Documentary Feature at the 78th Academy Awards in 2006.\r\n\r\n**********\r\n\r\nPlease check out other documentaries, Rifftrax, MST3K, Battlestar Galactica, Star Trek, Gotham, DC Comics, and more at:\r\n  https://thepiratebay.org/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:e0d439bbba3c7e49c57706d939bcb82f63a795b5","amp;dn":"Enron+The+Smartest+Guys+In+The+Room+2005+1080p+6ch+6subs+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0d439bbba3c7e49c57706d939bcb82f63a795b5","infoHashBuffer":{"type":"Buffer","data":[224,212,57,187,186,60,126,73,197,119,6,217,57,188,184,47,99,167,149,181]},"announce":[],"urlList":[]}}