{"title":"Functional Programming in JavaScript (2016).pdf Gooner","uid":15155031,"size":13194857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1ae2d8b0f74b5a6af68e8d022ecd4585e2fb4c5&amp;dn=Functional+Programming+in+JavaScript+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1467291900,"description":"Functional Programming in JavaScript - How to Improve Your JavaScript Programs Using Functional Techniques (2016).pdf Gooner\r\n\r\nPublisher: Manning Publications (18 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 1617292826\r\nISBN-13: 978-1617292828\r\n\r\n&quot;Functional Programming in JavaScript&quot; teaches JavaScript developers functional techniques that will improve extensibility, modularity, reusability, testability, and performance. Through concrete examples and jargon-free explanations, this book teaches you how to apply functional programming to real-life development tasks.\r\n\r\nAbout the Technology:\r\n\r\nIn complex web applications, the low-level details of your JavaScript code can obscure the workings of the system as a whole. As a coding style, functional programming (FP) promotes loosely coupled relationships among the components of your application, making the big picture easier to design, communicate, and maintain.\r\n\r\nAbout the Book:\r\n\r\n&quot;Functional Programming in JavaScript&quot; teaches you techniques to improve your web applications - their extensibility, modularity, reusability, and testability, as well as their performance. This easy-to-read book uses concrete examples and clear explanations to show you how to use functional programming in real life. If you're new to functional programming, you'll appreciate this guide's many insightful comparisons to imperative or object-oriented programming that help you understand functional design. By the end, you'll think about application design in a fresh new way, and you may even grow to appreciate monads!\r\n\r\nWhat's Inside:\r\n\r\nHigh-value FP techniques for real-world usesUsing FP where it makes the most senseSeparating the logic of your system from implementation detailsFP-style error handling, testing, and debuggingAll code samples use JavaScript ES6 (ES 2015)\r\n\r\nAbout the Reader:\r\n\r\nWritten for developers with a solid grasp of JavaScript fundamentals and web application design.\r\n\r\nAbout the Author:\r\n\r\nLuis Atencio is a software engineer and architect building enterprise applications in Java, PHP, and JavaScript","torrent":{"xt":"urn:btih:e1ae2d8b0f74b5a6af68e8d022ecd4585e2fb4c5","amp;dn":"Functional+Programming+in+JavaScript+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ae2d8b0f74b5a6af68e8d022ecd4585e2fb4c5","infoHashBuffer":{"type":"Buffer","data":[225,174,45,139,15,116,181,166,175,104,232,208,34,236,212,88,94,47,180,197]},"announce":[],"urlList":[]}}