{"title":"David Icke - The Biggest Secret [E-Book + Audio Book - Conspirac","uid":3747828,"size":16885735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1f529146920b50fa803c92b9941337448dfd07b&amp;dn=David+Icke+-+The+Biggest+Secret+%5BE-Book+%2B+Audio+Book+-+Conspirac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"lkobescak","files":2,"time":1184959615,"description":"David Icke - The Biggest Secret (The book)\n------------------------------------------\n\n\nFormat: The Biggest Secret (The Book in .PDF format)\nFormat: The Biggest Secret (The Book in .MP3 format)\n\n\n\nDavid Icke&amp;#039;s most powerful and explosive book so far includes the astonishing background to the murder of Diana, Princess of Wales. Every man, woman and child on the planet is affected by the stunning information that Icke exposes. He reveals in documented detail, how the same interconnecting bloodlines have controlled the planet for thousands of years. How they created all the major religions and suppressed the spiritual and esoteric knowledge that will set humanity free from its mental and emotional prisons.\n\nThis is the book that revealed the existance of a reptillian race from another planet and/or dimension covertly controlling humanity. (see also The Stars Are Falling)\n\nIt includes a devastating expose of the true origins of Christianity and the other major religions and documents the suppressed science, which explains why the world is facing a time of incredible change and transformation.\n\nThe Biggest Secret also exposes the true and astonishing background to the British Royal Family and, through enormous research and unique contacts, he reveals how, and why, Diana, Princess of Wales, was murdered in Paris in 1997. This includes information from a close confidant of Diana for nine years, which has never before been made public.\n\n\nThe Biggest Secret is a unique book and is quite rightly dubbed &quot;The book that will change the world.&quot; No one who reads it will ever be the same again.\n\nDiana Inquest Update - Coroner Steps Down\n\nYet another coroner backs out as the Diana inquest is getting &quot;too hot to handle&quot;.\n\n&quot;Baroness Butler-Sloss is to step down in June as coroner for the inquests into the death of Princess Diana and Dodi Al Fayed, it has been announced. Lady Butler-Sloss said she lacked the experience required to deal with an inquest with a jury.&quot;\n\n\n\n\nFor more information on David or to purchase his other works, please visit: &lt;a href=&quot;\nhttp://www.davidicke.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.davidicke.com&lt;/a&gt;\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO, the Illuminati and the great threat to you can be found at www infowars com or www.prisonplanet.com\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:e1f529146920b50fa803c92b9941337448dfd07b","amp;dn":"David+Icke+-+The+Biggest+Secret+%5BE-Book+%2B+Audio+Book+-+Conspirac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1f529146920b50fa803c92b9941337448dfd07b","infoHashBuffer":{"type":"Buffer","data":[225,245,41,20,105,32,181,15,168,3,201,43,153,65,51,116,72,223,208,123]},"announce":[],"urlList":[]}}