{"title":"Blumgarts Surgery of the Liver, Pancreas and Biliary Tract 5th E","uid":10634422,"size":277935483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e228dc6e0b266a852c183006ab299e64c3da4ae3&amp;dn=Blumgarts+Surgery+of+the+Liver%2C+Pancreas+and+Biliary+Tract+5th+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"tahir99","files":1,"time":1406371648,"description":"Blumgart's Surgery of the Liver, Biliary Tract and Pancreas: 2-Volume Set, Expert Consult - 5e (SURGERY OF THE LIVER &amp; BILIARY TRACT (2-VOL SET))\n\nby William R. Jarnagin (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nISBN-13: 978-1437714548 ISBN-10: 1437714544 Edition: 5th April 12, 2012\n\n\nComprehensive and complete, Blumgart's Surgery of the Liver, Pancreas and Biliary Tract - edited by Dr. William R. Jarnagin and a team of experts- delivers the comprehensive, cutting-edge guidance you need to achieve optimal outcomes in surgery of the liver, biliary tract, and pancreas. Edited by a panel of experts and featuring contributions by many leading authorities, this 2-volume reference brings you the latest information on pathology, diagnostics, surgery, and non-operative intervention all in one source. At www.expertconsult.com you can not only access the complete contents online, but also an abundance of detailed illustrations and step-by-step procedural video clips from the Memorial Sloan Kettering video library that show you how to perform key procedures step by step.\n\nGlean all essential, up-to-date, need-to-know information in one comprehensive reference that provides extensive coverage of pathology, diagnostics, surgery, and non-operative intervention as well as hepatobiliary and pancreatic surgery.\n\nDeepen your understanding of surgical anatomy to help with diagnosis, surgical operation, interventional radiology, and endoscopy.\n\nSee how to perform key procedures by watching operative videos from the Memorial Sloan Kettering video library.\n\nApply the most advanced diagnostic and management options for each disease, including interventional techniques.\n\nStay current with the latest knowledge and advancements including minimally invasive techniques in hepatic resection; surgical considerations for congenital disorders of the pancreas; non-surgical therapies for pancreatic cancer; microwave ablation and other emerging technologies; the most recent developments in the rapidly changing area of transplantation; and the newest best practices in pre- and post-operative care and blood transfusion.\n\nGet in-depth coverage of the pancreas from the only fully comprehensive text on both hepatobiliary and pancreatic surgery.\n\nLearn from the very best. Rely on the trusted guidance of experts, with a fresh perspective from senior editor, Dr. William Jarnigan, who has earned a national and international reputation in the surgical management of diseases of the biliary tract.\n","torrent":{"xt":"urn:btih:e228dc6e0b266a852c183006ab299e64c3da4ae3","amp;dn":"Blumgarts+Surgery+of+the+Liver%2C+Pancreas+and+Biliary+Tract+5th+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e228dc6e0b266a852c183006ab299e64c3da4ae3","infoHashBuffer":{"type":"Buffer","data":[226,40,220,110,11,38,106,133,44,24,48,6,171,41,158,100,195,218,74,227]},"announce":[],"urlList":[]}}