{"title":"Human Behavior and the Social Environment, 7E- Dale [PDF] [Storm","uid":11159417,"size":24288679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e23f995eae2313cb8c3393515f2dbf4e83794fee&amp;dn=Human+Behavior+and+the+Social+Environment%2C+7E-+Dale+%5BPDF%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"F1restorm","files":-1,"time":1412493022,"description":"Human Behavior and the Social Environment: Social Systems Theory, Seventh Edition\nAuthors: Orren Dale and Rebecca Smith\nPublished: 2013\nPublisher: Pearson\nISBN: 9780205036486\nFormat: Retail PDF\nNote: MySearchLab does not come automatically packaged with this text.\n__________________________________________________________________________\n\n\nPresents major theories for systems addressed in generalist practice\n \nThis text is part of the Connecting Core Competencies Series.\n \nHuman Behavior and the Social Environment: Social Systems Theory provides an expanded treatment of systems theory, and applies the theory to common social work concerns. The text links systems to social roles, and provides a framework for critical assessment of the theories from the systems/roles perspective. It assesses the strengths and weaknesses of each theory with regard to the value of each theory for social work practice.\n \nSocial systems theory remains the focus of this text.  In addition theories are identified as grand theories, middle range theories, or focal theories, to assist the student in understanding the scope and application of theories across system sizes.  This text breaks new ground in using role theory as a middle range theory to address common features of human systems at a level that is more intuitive for students, and yet detailed enough to stimulate independent thinking. The text addresses the standard repertoire of theories, and in addition presents application of the theories to social issues such as violence and addiction.","torrent":{"xt":"urn:btih:e23f995eae2313cb8c3393515f2dbf4e83794fee","amp;dn":"Human+Behavior+and+the+Social+Environment%2C+7E-+Dale+%5BPDF%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e23f995eae2313cb8c3393515f2dbf4e83794fee","infoHashBuffer":{"type":"Buffer","data":[226,63,153,94,174,35,19,203,140,51,147,81,95,45,191,78,131,121,79,238]},"announce":[],"urlList":[]}}