{"title":"Sometimes Love.Romantic Comedy Box Set-Peter Shortwell.Audiobook","uid":16026113,"size":250980119,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e2f401deefda26f215a022fab931991fba3ce6ca&amp;dn=Sometimes+Love.Romantic+Comedy+Box+Set-Peter+Shortwell.Audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"deepak60","files":1,"time":1476387871,"description":"SOMETIMES LOVE..A LAUGH OUT LOUD ROMANCE COMEDY BY PETER STOCKWELL. AUDIOBOOK.\r\n\r\nDating in the Dark and Bride and Gloom.\r\n\r\nJason is single and has been for all of his 32 years. It's depressing. But not as depressing as being told by his mother that he looks like Humpty Dumpty - after the accident. With a face that not even his own mother can love, it's hardly surprising that he'll try anything to get a woman to go out with him, even if it's only for a single date.\r\n\r\nWith little interest in anything other than his quest for a woman and a nice bit of cod and chips, Jason needs to think outside the box if he's going to find someone who'll give him a chance. Along with Barry - his best mate - Jason comes up with the only thing he thinks will work: dating a blind woman. However, to do that, he needs to pretend he's blind himself, which is a lot harder than you might think, especially when guide dogs are so hard to come by.\r\n\r\nEventually Jason's efforts pay off, and he meets Emma, a pretty professional with a host of friends. When he takes her out, they instantly hit it off. But will Jason be able to fool both Emma and her best friend, Jerry, into thinking he's blind? With everything to play for, Jason faces the biggest challenge of his life, and nobody - especially not him - can see how it'll all turn out","torrent":{"xt":"urn:btih:e2f401deefda26f215a022fab931991fba3ce6ca","amp;dn":"Sometimes+Love.Romantic+Comedy+Box+Set-Peter+Shortwell.Audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f401deefda26f215a022fab931991fba3ce6ca","infoHashBuffer":{"type":"Buffer","data":[226,244,1,222,239,218,38,242,21,160,34,250,185,49,153,31,186,60,230,202]},"announce":[],"urlList":[]}}