{"title":"#009 - Discography (Yoko Kanno; Seatbelts, The)","uid":4304309,"size":598283318,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e32afd051fe71e9524e015298373126b093e597b&amp;dn=%23009+-+Discography+%28Yoko+Kanno%3B+Seatbelts%2C+The%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"West-Independent","files":96,"time":1216428284,"description":"7 discs:\n Cowboy Bebop\n Vitaminless\n No Disc\n Blue\n Future Blues\n Ask DNA\n Cowgirl Ed\n\n\n\nTHE SHOW\n\nCowboy Bebop (?????????, Kaub?i Bibappu?) is a Japanese animated television series. Directed by Shinichiro Watanabe and written by Keiko Nobumoto, Cowboy Bebop was produced by Sunrise. Consisting of 26 episodes, the series follows the adventures of a group of bounty hunters traveling on their spaceship, the Bebop, in the year 2071.\n\nCowboy Bebop was a commercial success both in Japan and international markets, notably in the United States. After this reception, Sony Pictures released a feature film, Knockin&amp;#039; on Heaven&amp;#039;s Door to theaters worldwide and followed up with an international DVD release. Two Cowboy Bebop manga series were also adapted based on the anime, as well as two video games for the PlayStation and PlayStation 2 game consoles.\n\nCowboy Bebop has been strongly influenced by American music, especially the jazz movements of the 1940s, 1950s and 1960s and the early rock era of the 1950s, 1960s and 1970s. Many of its action sequences, from space battles to hand-to-hand martial arts combat, are set and timed to music. Following the musical theme, episodes are called Sessions, and titles are often borrowed from album or song names (such as Sympathy for the Devil or My Funny Valentine), or make use of a genre name (&quot;Mushroom Samba&quot;) indicating a given episode&amp;#039;s musical theme.\n\n\nTHE MUSIC\n\nThe Seatbelts (??????, Sh?toBerutsu, also known as SEATBELTS) is a Japanese blues/jazz band led by composer and instrumentalist Yoko Kanno. The name of the band, according to the fictional description given in the anime series Cowboy Bebop, derives from how the performers wear seatbelts to be safe while they play hardcore jam sessions.\n\nThe band performed the whole soundtrack of the anime series Cowboy Bebop and produced a total of seven albums and one live DVD. Their style is very diverse and ranges from straightforward big band jazz, blues, acoustic ballads, hard rock, country, funk to electronic, hip-hop and experimental compositions/elements.\n\nSince the band is focused mostly on instrumental work, The Seatbelts have no lead singer. However, Steve Conte (from The Contes and Crown Jewels) and Mai Yamane participate and sing on many of their songs. The lyrics of these songs are written mainly by Tim Jensen and Yoko Kanno herself. Singers Soichiro Otsuka and Gabriela Robin (rumored to be a pseudonym for Kanno) are responsible for the backing vocals on songs such as &quot;Blue&quot;.\n\nAfter a few years in hibernation, The Seatbelts regrouped in 2004 to perform the soundtrack for the second Cowboy Bebop video game, which is currently available in Japan.\n\nMany of the members of The Seatbelts have also worked with Kanno and with each other on other projects as well, and some have even gone on to compose their own work. For example, guitarist Tsuneo Imahori also played guitar on the soundtracks for Ghost in the Shell: Stand Alone Complex and Wolf&amp;#039;s Rain (both of which were composed by Kanno), as well as composing the soundtracks for Trigun and Gungrave.","torrent":{"xt":"urn:btih:e32afd051fe71e9524e015298373126b093e597b","amp;dn":"%23009+-+Discography+%28Yoko+Kanno%3B+Seatbelts%2C+The%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32afd051fe71e9524e015298373126b093e597b","infoHashBuffer":{"type":"Buffer","data":[227,42,253,5,31,231,30,149,36,224,21,41,131,115,18,107,9,62,89,123]},"announce":[],"urlList":[]}}