{"title":"John Cassavetes - A Woman Under the Influence (1974)","uid":3614203,"size":1469291910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e32c58c25da034c5e480bdf7c3bc70e54eba93b2&amp;dn=John+Cassavetes+-+A+Woman+Under+the+Influence+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Beksinski","files":9,"time":1171018548,"description":"Title: A Woman Under the Influence\nDirector: John Cassavetes\nYear: 1974\nLanguage: English\nSubtitles: English, Chinese\nSize: 1.36 GB (1,469,241,839 bytes)\nVideo Codec: XviD\nVideo Bitrate: 1115 kb/s\nResolution: 608x320 (1.90:1) [=19:10]\nQf: 0.239 bits/pixel\nFramerate: 23.97\nAudio Specs: ac3 (0x2000)\nAudio Bitrate: 192 kb/s, monophonic CBR      \nFs: 48000 Hz\nRuntime: 2h 30min\nSource: DVD\n\nDescription: John Cassavetes&amp;#039; harrowing masterpiece charts the emotional meltdown of a suburban housewife and its effects on her blue-collar Italian family. Gena Rowlands stars as Mabel Longhetti, a mother of three whose husband Nick (Peter Falk) works as a construction worker; a mismatched couple like so many others in Cassavetes films, the Longhettis seem to be complete opposites: she&amp;#039;s impetuous, extroverted, and fragile, while he&amp;#039;s controlling, distant, and hard-bitten. Their differences underscore a series of domestic dramas, culminating in a nervous breakdown that sends Mabel to a psychiatric hospital for six months, only to return to a home environment on even thinner ice than before. The improvisational style central to Cassavetes&amp;#039; vision is at its most acute throughout A Woman Under the Influence. Like its title heroine, the film threatens to veer out of control at any time, its shape and scope defined not by narrative but by the emotional upheaval at its center. Embracing the full spectrum of the Longhettis&amp;#039; relationship, from seismic bursts of high drama to small, even trivial moments of domestic tedium, its long scenes relentlessly probe every nook and cranny of the family&amp;#039;s life, drawing out each moment for maximum emotional impact; the film is by turns beautiful and ugly, illuminating and frustrating, and it features a performance by Rowlands as heartwrenching and unforgettable as any ever committed to celluloid.\nAMG\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\t","torrent":{"xt":"urn:btih:e32c58c25da034c5e480bdf7c3bc70e54eba93b2","amp;dn":"John+Cassavetes+-+A+Woman+Under+the+Influence+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32c58c25da034c5e480bdf7c3bc70e54eba93b2","infoHashBuffer":{"type":"Buffer","data":[227,44,88,194,93,160,52,197,228,128,189,247,195,188,112,229,78,186,147,178]},"announce":[],"urlList":[]}}