{"title":"[SexArt] Iwia A Lorena B Greg Baldwin - Dare 1080p","uid":14284046,"size":773596295,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e356e96cbbd8c6a17b8d7f402e8af30e8f3968f2&amp;dn=%5BSexArt%5D+Iwia+A+Lorena+B+Greg+Baldwin+-+Dare+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"distinc","files":1,"time":1460393073,"description":".......:::Screenshots:::.......\r\n\r\n\r\n \nhttp://imagedisco.net/?v=7041906323\r\n \nhttp://imagedisco.net/?g=4826181396\r\n\r\nItalian cinematic stylist Don Caravaggio's latest production for SexArt is a tantalizing take on a romantic triangle. Lorena B, international MetArt exclusive contract supermodel, headlines and sets the film in motion when she greets Greg Baldwin at the door of her apartment. Before they've taken more than a few steps the couple fall into a clinch, Lorena's breasts are both exposed and caressed, and sexual tension hangs heavy in the hallway. As quietly as possible they enter a bedroom in which Iwia A slumbers, totally nude, completely oblivious. And so &quot;Dare&quot; begins. The two long-haired brunette beauties kiss and caress one another. They kiss their male visitor. And once they're all in the nude the sexual activity accelerates. Iwia A gives suck to Baldwin's erect bone. Lorena B licks Iwia from behind. And then Baldwin proceeds to fuck Iwia in a variety of positions with Lorena circling around them. She kisses Iwia, she kisses Baldwin, she sits on Iwia's face and delights in her agile tongue. Lorena B is the orchestrator and arranger of this tryst, a surprise treat for her lesbian lover. Once Baldwin has come he is gone, and the two beauties continue on in his absence, making love, achieving orgasm, savoring the afterglow of their decadent and delicious &quot;Dare.&quot;","torrent":{"xt":"urn:btih:e356e96cbbd8c6a17b8d7f402e8af30e8f3968f2","amp;dn":"%5BSexArt%5D+Iwia+A+Lorena+B+Greg+Baldwin+-+Dare+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e356e96cbbd8c6a17b8d7f402e8af30e8f3968f2","infoHashBuffer":{"type":"Buffer","data":[227,86,233,108,187,216,198,161,123,141,127,64,46,138,243,14,143,57,104,242]},"announce":[],"urlList":[]}}