{"title":"The.Great.British.Bake.Off-S06E01-Cake - WebDL-720p-x264","uid":12200605,"size":1052866316,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e3915731c11eae0ce711070ea7cd59d865133a6f&amp;dn=The.Great.British.Bake.Off-S06E01-Cake+-+WebDL-720p-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"uggauga","files":2,"time":1438819418,"description":"\n\nThe bake off is back...\n\nOnce again, 12 new bakers don their aprons and head for the iconic tent in the heart of the British countryside. Judges Mary Berry and Paul Hollywood have created 30 new challenges that will test their baking prowess, creativity and skill in a bid to find the country's best amateur baker. From Victorian classics to high-end patisserie, from chocolate sculptures to everyday staples, the bakers will need cool heads and even colder hands to make it to the final. With them every step of the way are Mel Giedroyc and Sue Perkins, ready to lend a hand or a shoulder to cry on.\n\nStarting with cake week, the bakers' first signature challenge is to make a madeira cake. It's a well-loved cake, but which of our bakers will try to impress by reinventing this classic, and who will play safe in a bid to get perfect madeira with its traditional crack?\n\nWith one challenge out the way, the bakers face their first technical - Mary's frosted walnut cake, a pre-war classic that is as British as they come. Light sponge sandwiched with buttercream and covered with sweet meringue, this technically challenging cake is one of Mary's favourites, and no-one wants to disappoint the queen of baking.\n\nDay Two, and the bakers have to go all out to impress with their first show-stopper, the black forest gateau. This retro classic from the 70s has it all - chocolate, cherries and cream. It's ripe for a reinvention, and these 12 bakers are ready and willing.\n\n12 new bakers, 30 new challenges.\n\nOn your marks, get set... bake!","torrent":{"xt":"urn:btih:e3915731c11eae0ce711070ea7cd59d865133a6f","amp;dn":"The.Great.British.Bake.Off-S06E01-Cake+-+WebDL-720p-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3915731c11eae0ce711070ea7cd59d865133a6f","infoHashBuffer":{"type":"Buffer","data":[227,145,87,49,193,30,174,12,231,17,7,14,167,205,89,216,101,19,58,111]},"announce":[],"urlList":[]}}