{"title":"SonicCouture Pan Drum MULTiFORMAT - DYNAMiCS [Kontakt]","uid":9726751,"size":2652105252,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e3a9cdccce4e6bd24dc7903cd064face42ce4f5f&amp;dn=SonicCouture+Pan+Drum+MULTiFORMAT+-+DYNAMiCS+%5BKontakt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"hcdjp","files":57,"time":1394305573,"description":"This is not my torrent, just posting here because there was no Hang Drum Kontakt instrument over PirateBay!!!!\n\nENJOY   \n                                                                                \n        \n SonicCouture.Pan.Drum.MULTiFORMAT.DVDR.HAPPY.NEW.YEAR-DYNAMiCS         \n                                                                                \n      SUPPLiER..: Team DYNAMiCS                     DiSKS...: 54*50MB           \n      CRACKER...: n/a                               DATE....: Dec 2010          \n      PACKAGER..: Team DYNAMiCS                     RELEASE#: DYNAMiCS-1517     \n      PROTECTION: n/a                               FORMAT..: EXS24/KONTAKT/LiVE\n                                                                                \n             &lt;a href=&quot; http://www.soniccouture.com/en/products/g8-pan-drum/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.soniccouture.com/en/products/g8-pan-drum/&lt;/a&gt;              \n                                                                                \n  \n      Soniccouture's quest for the exotic,  the unique,  the esoteric, and      \n      the downright weird and quirky,  brings us to our latest  obsession,      \n      the Hang.                                                                 \n                                                                                \n      You may not have heard of the Hang  -  it's a relatively new instru-      \n      ment and it's extremely  hard to get hold of one. First  invented in      \n      the year 2000 by PANArt,  they are hand-built in  Switzerland by two      \n      very dedicated people,  Felix and Sabina.  If you want one, you must      \n      ask  them  if  they  will build you one. If they agree, then you may      \n      have to wait up to 2 years.                                               \n                                                                                \n      The Hang is  played  with  the  hands. Everyone who gets to play one      \n      falls in love with it a little bit. It's  incredibly  sensitive  and      \n      dynamic - the  entire  disc resonates at a central frequency as your      \n      hands move around the edge teasing the notes out.                         \n                                                                                \n      Two Different Drums                                                       \n      -------------------                                                       \n      There are two types of Hang,  the Mk1 and Mk2.  The Mk 1 had 8 notes      \n      around the Ding.  These were available in  45 different tunings, and      \n      PANArt produced nearly 4000 of them.                                      \n      The Mk 2 is basically the same shape  but has a brass coating on the      \n      top as well as around the rim. The Mk 2 comes in only five different      \n      tunings  and  has  only  seven  notes  around the Ding. It is a more      \n      sturdy design, stays in tune better over time, and  has  a  slightly      \n      longer and purer ring.  We have recorded an example of each Hang for      \n      this sampled instrument.                                                  \n                                                                                \n      The Sampled Instruments                                                   \n      -----------------------                                                   \n      The Soniccouture Pan Drum Instruments  feature over 1000 samples per      \n      drum,  with up to  21 velocity layers.  The  Hang  drums  have  been      \n      sampled  in  6  different  areas  ( Gu, Ding, Outer Ding, Tone-field      \n      Centre, Tone-Field Edge,  and in-between the Tone-field). Each  area      \n      was  sampled  being  played  with Finger, Slap and knuckle, which is      \n      triggered  by  key-switches. Each hit has up  to 3 alternate  round-      \n      robin versions, to ensure there is no 'machine-gun' effect.               \n                                                                                \n      We have presented our Hang Drums in their original keys. This can be      \n      quickly transposed  using  the  drop-down menu on the front panel of      \n      the instruments. There is also a full  chromatic  mapping  included,      \n      as well as a  choice  of  different  key-mappings  to suit different      \n      playing styles.                                                           \n                                                                                \n      The KSP Jammer                                                            \n      --------------                                                            \n      Built into each  Soniccouture Pan Drum Instrument is  the Pan Jammer      \n      script - a  generative  pattern  sequencer. This fantastic real-time      \n      peformance tool randomly  builds on  the notes  you play  to  create      \n      organic,  evolving  sequences from  the  Hang. The acompanying Tweak      \n      page  means you can Jam  and  create  soundscapes  using the delays,      \n      filters  and  reverbs  built  into  each  instrument. This  is  only      \n      available in Kontakt, although there  is a  reduced version of it in      \n      Ableton Live.                                                             \n                                                                                \n      Soniccouture Pan Drum is a unique  and  evocative sampled instrument      \n      that  will  bring  indefinable  atmosphere  to  all  kinds  of music      \n      production, from Film scores to IDM to  Song-Writing  to  Trance  to      \n      World Music, there is no genre that can't be touched by Pan Drum.         \n                                                                                \n\n\n===================================================================================\n\n\n\nINSTALATTION:\n\n\n\n \n                                                                                \n      1. Unpack                                                                 \n      2. Burn or Mount                                                          \n      3. Use                                                                    \n                                                                                \n                     Remember to BUY the stuff if you USE it.                   \n\n                                                                                \n                                We hate you all.                                \n                                                                                \n","torrent":{"xt":"urn:btih:e3a9cdccce4e6bd24dc7903cd064face42ce4f5f","amp;dn":"SonicCouture+Pan+Drum+MULTiFORMAT+-+DYNAMiCS+%5BKontakt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a9cdccce4e6bd24dc7903cd064face42ce4f5f","infoHashBuffer":{"type":"Buffer","data":[227,169,205,204,206,78,107,210,77,199,144,60,208,100,250,206,66,206,79,95]},"announce":[],"urlList":[]}}