{"title":"SG-Bedini The complete handbook series","uid":11499589,"size":447447689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e40d615ded0603256fc560a4caf371e219e2d65c&amp;dn=SG-Bedini+The+complete+handbook+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"ufonany","files":4,"time":1416323309,"description":"This is my first upload. I can only upload 40 KB/s but the files are small.\nThey sell them for about $100 but I think this info should be free.\nThese are very nice books for novices and once you learn these tricks, you can understand how all these free energy machines work.\nOf course N. Tesla didn't have diodes and transistors but he used spark gaps (diodes in a dc system)and mechanical switches connected to the rotor of some motor.\nI made Adam's Motor/generator whom is the father of all these &quot;M/G inventors&quot;.\nIt worked so nice that I spent about 2 years experimenting with different arrangements.\nI didn't and still don't like Bedini because he learned all these from Dr. Robert Adams in the early 80's and passed them (with some minor modifications) as his own invention. He wasn't alone. Many people like Bill Muller and alike did the same thing without giving an ounce of credit to Robert Adams or even mention his name.\nThe same thing happened to Tesla. People used his ideas but don't even know who he was!!!\nFor this reason, I am putting up this and other videos of Bedini so that he won't make money on someone elses brilliant Ideas.\nPROOF : look at the date of patents for Adams and Bedini and study their patents and see for yourself who screwed who.\nOnce you understand the principals, you can move on to a very powerful solid state unit like I did. Walk before you run","torrent":{"xt":"urn:btih:e40d615ded0603256fc560a4caf371e219e2d65c","amp;dn":"SG-Bedini+The+complete+handbook+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e40d615ded0603256fc560a4caf371e219e2d65c","infoHashBuffer":{"type":"Buffer","data":[228,13,97,93,237,6,3,37,111,197,96,164,202,243,113,226,25,226,214,92]},"announce":[],"urlList":[]}}