{"title":"Lectures on the History of Political Philosophy - John Rawls.epu","uid":9145759,"size":840480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e41677b2a58e580a039de3532fd3f1e4507c5ae4&amp;dn=Lectures+on+the+History+of+Political+Philosophy+-+John+Rawls.epu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"420weedman","files":1,"time":1383590454,"description":"This last book by the late John Rawls, derived from written lectures and notes for his long-running course on modern political philosophy, offers readers an account of the liberal political tradition from a scholar viewed by many as the greatest contemporary exponent of the philosophy behind that tradition.\n\nRawls's goal in the lectures was, he wrote, &quot;to identify the more central features of liberalism as expressing a political conception of justice when liberalism is viewed from within the tradition of democratic constitutionalism.&quot; He does this by looking at several strands that make up the liberal and democratic constitutional traditions, and at the historical figures who best represent these strands--among them the contractarians Hobbes, Locke, and Rousseau; the utilitarians Hume, Sidgwick, and J. S. Mill; and Marx regarded as a critic of liberalism. Rawls's lectures on Bishop Joseph Butler also are included in an appendix. Constantly revised and refined over three decades, Rawls's lectures on these figures reflect his developing and changing views on the history of liberalism and democracy--as well as how he saw his own work in relation to those traditions.\nGenre: Non-fiction. Political philosophy.","torrent":{"xt":"urn:btih:e41677b2a58e580a039de3532fd3f1e4507c5ae4","amp;dn":"Lectures+on+the+History+of+Political+Philosophy+-+John+Rawls.epu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e41677b2a58e580a039de3532fd3f1e4507c5ae4","infoHashBuffer":{"type":"Buffer","data":[228,22,119,178,165,142,88,10,3,157,227,83,47,211,241,228,80,124,90,228]},"announce":[],"urlList":[]}}