{"title":"Maximum Willpower: How to Master the Science of Self-Control","uid":7854098,"size":432414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e44ef3a03a39f37f9468eedf2ea30962900f72ca&amp;dn=Maximum+Willpower%3A+How+to+Master+the+Science+of+Self-Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353691539,"description":"\nMaximum Willpower: How to Master the New Science of Self-Control by Kelly McGonigal\nMacMillan | 2012 | ISBN: 0230761550 | English | 272 pages | EPUB \n\nWillpower - the ability to control your attention, emotions, appetites and behaviour - influences your physical health, financial security, the quality of your relationships and your professional success. We all know this. But why is it so hard to control and why, sometimes, do we have so little of it? Willpower: How to master the new science of self-control brings together the newest insights about self-control from psychology, economics, neuroscience and medicine, explaining how we can break old habits and create healthy habits, conquer procrastination and manage stress and emotions. Discover why we give in to temptation and how we can find the strength to resist. By understanding the limits of willpower you can prioritize goals, make conscious choices, change old habits and give up the pursuit of perfection. This book focuses on strategies that can help you transcend limitations, strengthen self-control and escape the grip of chronic stress and procrastination. Whether you are trying to break a habit, improve your health, or find your focus, this book will change the way you think about willpower and help you make real and lasting changes in your life.","torrent":{"xt":"urn:btih:e44ef3a03a39f37f9468eedf2ea30962900f72ca","amp;dn":"Maximum+Willpower%3A+How+to+Master+the+Science+of+Self-Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44ef3a03a39f37f9468eedf2ea30962900f72ca","infoHashBuffer":{"type":"Buffer","data":[228,78,243,160,58,57,243,127,148,104,238,223,46,163,9,98,144,15,114,202]},"announce":[],"urlList":[]}}