{"title":"POV Junkie 5 [Dvdrip]","uid":15969545,"size":1462687799,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e516679b88e0016b80943324be08d89dd3e79fb7&amp;dn=POV+Junkie+5+%5BDvdrip%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"ImgSnaps","files":6,"time":1475762928,"description":"POV Junkie 5 [Dvdrip]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57f63eb2827da.html\r\n \nhttp://imgsnaps.com/img2-57f63eb2867cd.html\r\n \nhttp://imgsnaps.com/img2-57f63eb28a486.html\r\n \nhttp://imgsnaps.com/img2-57f63eb2a520f.html\r\n\r\n\r\nThe POV Junkies are Back with Bouncing Booty's in Volume 5! Lots of Anal and ATM's!\r\nLeilani Leeane needs no introduction. Anal addict Leilani Leeane is at it again stuffing white cock up her black ass POV style and sucking the Butt juice right off. Leilani takes the cock in all holes getting DP'd with cock and toys ending in an OILY facial!! Ava Alvares - Brown eyed big booty Ava Alvares shows Vince how a big booty should be handled!This brown eyed beauty really is something to look at not to mention Fuck. Ava insists on showing Vince how to handle such a Huge ASS by suggesting drenching it in baby oil!\r\nCherry Torn - 1 dirty white girl with a booty, Cherry Torn, gapes both her holes and loves ATM's!In her words 'there is not much I won't put in my mouth'. Cherry takes the Cock in all holes in true Porn Star fashion, taking ass to mouths from the Anal pile driver not to mention trading spaces from her Pussy to her Ass. Cherry is a True Porn Slut hands down!\r\nNikki brings the biggest natural Rack to the screen: 38DDD's. Yup Triple D's! This nut case really takes to the cock and titty fucking her felt as good as pussy.\r\nZuri - Zuri brings her all natural 38D's and her ebony ass over to bounce on some white cock in her Porn Debut!21 Year old Video Virgin Zuri comes all the way from the windy City of Chicago. This all natural breasted ebony slut brings her 38D's over for some fuckin' and suckin'. Zuri says she is more into girls than guys but she definitely likes to get some dick and it shows. If you like 'em black your gonna love Zuri!\r\nSheena Ryder may have the Roundest Butt I have ever seen. Perfectly proportioned Vince decides to stuff It with His cock in Sheena's 2nd anal Scene to date. Sheena really Rides the cock in all holes for a frosty facial!","torrent":{"xt":"urn:btih:e516679b88e0016b80943324be08d89dd3e79fb7","amp;dn":"POV+Junkie+5+%5BDvdrip%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e516679b88e0016b80943324be08d89dd3e79fb7","infoHashBuffer":{"type":"Buffer","data":[229,22,103,155,136,224,1,107,128,148,51,36,190,8,216,157,211,231,159,183]},"announce":[],"urlList":[]}}