{"title":"Texe Marrs - Robot Alchemy - Androids, Cyborgs, and the Magic of","uid":15483886,"size":10737432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e524abd9e442c66bb3f2e7d7aaabcd90a2b580ad&amp;dn=Texe+Marrs+-+Robot+Alchemy+-+Androids%2C+Cyborgs%2C+and+the+Magic+of&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1470293145,"description":"https://extraimago.com/images/2016/08/04/6a39f62be1db8a43f885621cf7d8e3ab.md.png\r\n\r\nTexe Marrs - Robot Alchemy - Androids, Cyborgs, and the Magic of Artificial Life\r\n\r\nCome and take a thrilling excursion across the robot galaxy. Since time immemorial, humans have sought to build artificial creatures that move and talk. You will see and discover many of these fantastic creations in this book. \r\nBut you will also see depicted a startling future in which science and alchemy turn everything upside down. Robotic life thrives, the machines conquer the workday world, and humanity shrinks before the advance of a superior life form. \r\nThis new age of robotic superiority, a time when humans are outworked, outthought, and outdone in every field, is no more than 25 years away. Artificial life--androids, cyborgs, robots--will prosper as the era of human life quickly vanishes and fades away. Homo Sapiens, the creator of robotics, must now bow to the strange new creature, for he is stronger, more cunning, and more useful. \r\nCome and envision a near future in which a bold and intelligent Avatar rules a planetary kingdom of machines. It will be a time when artificial men and women are our sex partners, postal deliverers, chauffeurs, entertainers, and bankers; a transhuman era in which the wealthy, favored few are given artificial parts and a biochip to expand intelligence; when fast and brutal robots play an exciting form of professional football; and when the vast majority of humans grow extinct, unworthy of life extension. \r\nCome and see what incredible things are made possible in the Age of Imagination...the astonishing future of Robot Alchemy","torrent":{"xt":"urn:btih:e524abd9e442c66bb3f2e7d7aaabcd90a2b580ad","amp;dn":"Texe+Marrs+-+Robot+Alchemy+-+Androids%2C+Cyborgs%2C+and+the+Magic+of","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e524abd9e442c66bb3f2e7d7aaabcd90a2b580ad","infoHashBuffer":{"type":"Buffer","data":[229,36,171,217,228,66,198,107,179,242,231,215,170,171,205,144,162,181,128,173]},"announce":[],"urlList":[]}}