{"title":"BLADE's Guide to Making Knives - 2nd Edition (2012).pdf Gooner","uid":13441299,"size":21918158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6a9af3cb0c666114cfe8f9863fa0a07bc03253f&amp;dn=BLADE%27s+Guide+to+Making+Knives+-+2nd+Edition+%282012%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1454708190,"description":"BLADE's Guide to Making Knives - 2nd Edition (2012).pdf Gooner\r\n\r\nPublisher: Krause Publ; 2 edition (May 25, 2012)\r\nLanguage: English\r\nISBN-10: 1440228558\r\nISBN-13: 978-1440228551\r\n\r\nLearn the Secrets of Knifemaking From the Masters of the Trade With an all-star cast of renowned knifemakers, BLADE's Guide To Making Knives 2nd Edition brings you the most up-to-date, inside information available on fashioning edged implements. In this full-color, meticulously illustrated volume: John Lewis Jensen, designer and fabricator of one-of-a-kind ornamental edged weaponry, presents a step-by-step guide to creating your own art knife in &quot;Desk Daggers: A Limited Edition Jensen Knives Trio&quot; Tim Zowada, forger of damascus and smelted steel, reveals his trade secrets and methods in &quot;Making the Using Knife&quot; Allen Elishewitz lends his knowledge and know-how in &quot;Making Patterns and Using a Pantograph&quot; for those in the design stages of fashioning fine knives. Don Fogg, arguably one of the best sword makers on the planet, shares his expertise in &quot;Forging Steel from Raw Materials&quot; Vince Evans, crafter of Scottish dirks, Viking swords, Central Asian weaponry and other exotic and historical pieces, reveals his methods for &quot;Making and Carving a Scottish Dirk&quot; Rick Dunkerley, known for his mosaic-damascus masterpieces, opens his world of knowledge in &quot;Building a Damascus Locking-Liner Folder&quot; Kevin Hoffman unlocks the mysteries of &quot;Lost Wax Casting for Guards &amp; Pommels&quot; illustrating each and every step of this tedious yet rewarding process. It's All Here! Forging Grinding Heat Treating Etching Polishing Sharpening Blades Guards Pommels Bolsters Handles Sheaths Whether your interest in making knives is new or you've been crafting blades for years, BLADE's Guide to Making Knives 2nd Edition arms you with knowledge to help you reap the rewards of a fruitful and fulfilling knifemaking hobby or career","torrent":{"xt":"urn:btih:e6a9af3cb0c666114cfe8f9863fa0a07bc03253f","amp;dn":"BLADE%27s+Guide+to+Making+Knives+-+2nd+Edition+%282012%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a9af3cb0c666114cfe8f9863fa0a07bc03253f","infoHashBuffer":{"type":"Buffer","data":[230,169,175,60,176,198,102,17,76,254,143,152,99,250,10,7,188,3,37,63]},"announce":[],"urlList":[]}}