{"title":"A woman in Berlin (2008) DivX HD Eine Frau in Berlin Anonyma  ","uid":7034140,"size":1346116484,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e6f8d002bf0d2490f5171b5953b24dd77a15c609&amp;dn=A+woman+in+Berlin+%282008%29+DivX+HD+Eine+Frau+in+Berlin+Anonyma++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1329321559,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1035730/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1035730/&lt;/a&gt;\n\n1024 X 432 video resolution Divx HD 1100k bitrate 256k audio\n2hrs_11 minutes runtime\n\nIn German and some Russian\n\nSubtitles found were for English certainly in addition to Dutch, Bulgarian\nFinnish Spanish and Greek - The German pal dvd subtitles we tried had perfectly\nmatching sync at the start however the subs didnt fit the HD version in later\nscenes as it is a different cut. \n\n\nStars the lovely Ms. Nina Hoss from Germany \n\nThe end of the war brought terrible tragedy to the German people - \nparticularly including those there of our most dear of womenfolk \non the planet.\n\nThis was a sad time with the crime of rape being taken for granted as a right\ngranted to the invader courtesy of Stalin-like thinking amongst many amongst\nthe invading red army of Russia.\n\nThat said, there is some human interaction amidst it all that keeps us \nsane enough and human enough to pick up the pieces after since it appears\nthat maliciousness is not in fact a universal crime even amongst those that\nare found in the wrong company as it were as not all can be equally tainted\ncompletely with the crimes if in fact there is no fair enough basis for such\nfr those who were altogether innocent at heart.\n\nThe peoples of Russia have greatness in them too - especially the Irish\nspirited women there too - often better true humanly warm spirited and sensible\nthan even what you will find in all the Americas (where they deservedly reign\nsupreme as the best German-Irish Christians of beauty on the planet!)  without\na doubt - and we are sorry that Russia was too invaded and brutally demeaned\nby Nazi forces that should have been elsewhere looking for &quot;lower forms of \nbeings&quot; (this causes insane levels of hate and malice towards all) instead - \nas Russia is not the place for such an attitude. It was Hitler that was \nexactly such a menace to the core - and he was cruel to our women\nin what befell them as a result in Germany too from the defeat of\nGerman forces of the Reich.\n\nNor is Germany ever going to be allowed to be defiled this way again \nas were the women of Berlin depicted in this terrible tale of a sad\nstate of criminality run-amok - so help me god (on behalf of all good men\nthat remain true to their spirit))!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\nA man who is capable of being good to a woman will remain so even in war\nOn the other hand a jerk is always a jerk - looking for any excuse to be\neven more of a jerk when he can - if only they should all be made to fall\noff the edge of the earth eh!\n","torrent":{"xt":"urn:btih:e6f8d002bf0d2490f5171b5953b24dd77a15c609","amp;dn":"A+woman+in+Berlin+%282008%29+DivX+HD+Eine+Frau+in+Berlin+Anonyma++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f8d002bf0d2490f5171b5953b24dd77a15c609","infoHashBuffer":{"type":"Buffer","data":[230,248,208,2,191,13,36,144,245,23,27,89,83,178,77,215,122,21,198,9]},"announce":[],"urlList":[]}}