{"title":"Britney Spears - Britney Jean [2013] [DELUXE] [FLAC]","uid":9289425,"size":384443944,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e71f32deff6e558df6fc122c763db87922154bbf&amp;dn=Britney+Spears+-+Britney+Jean+%5B2013%5D+%5BDELUXE%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1386064722,"description":"Britney Spears - Britney Jean [2013] [DELUXE] [FLAC]\n\nReleased ................ 2013\nSource .................. CD (Deluxe Edition)\nGenre ................... Pop/Rock\nStyle ................... Pop\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\n\n01 - Alien\n02 - Work Bitch\n03 - Perfume\n04 - It Should Be Easy (feat. will.i.am)\n05 - Tik Tik Boom (feat. T.I.)\n06 - Body Ache\n07 - Til It's Gone\n08 - Passenger\n09 - Chillin' With You (feat. Jamie Lynn)\n10 - Don't Cry\n11 - Brightest Morning Star\n12 - Hold On Tight\n13 - Now That I Found You\n14 - Perfume (The Dreaming Mix)\n\nTypically, whenever a self-titled album arrives fairly far into an artist's career it signifies a rebirth, a moment when the musician reconnects to what's real and true. That's the party line on Britney Jean, Britney Spears' eighth album (she already used Britney as the title of her third album, way back in 2001). Prior to its December 2013 release, Britney called Britney Jean one of her most &quot;personal&quot; records, a term that carries a certain weight, suggesting that the brief album -- a mere ten songs and 36 minutes in its standard form and not much longer in its deluxe expansion -- would offer insight into the spectral pop star. As it turns out, Britney Jean is a streamlined approximation of 2011's Femme Fatale, which itself attempted to re-create the producer-driven magic of 2007's Blackout, the album that seems destined to be the apex and turning point of Spears' career. Dr. Luke, the main producer behind Femme Fatale's two big hits (&quot;Till the World Ends&quot; and &quot;Hold It Against Me&quot;), is absent, as is her longtime collaborator Max Martin, who worked on those two Dr. Luke-produced hits. In their place is will.i.am, the Black Eyed Peas leader who happened to be responsible for Femme Fatale's nadir, &quot;Big Fat Bass.&quot; will.i.am sports producer credits on seven of the ten songs on Britney Jean and is listed as executive producer, responsible for shaping the sound and direction of the album. Often, this means Britney seems to be playing a role will.i.am created just for her, a situation not unfamiliar to Spears, who has been receding from her own albums since the tumultuous Blackout, but often seems little more than a whisper here. Naturally, the best moments arrive when she's forced to the front, which is usually the case with pop stars: she's the focus on the Katy Perry co-written and Diplo-produced &quot;Passenger,&quot; the purest pop moment on the record that finds a counterpart in the album's best ballad, &quot;Perfume&quot;; her bizarre vocal affectations invigorate &quot;Work Bitch&quot; (it's hard to resist her faux British phrasing) and are mildly irritating but memorable on the Jamie Lynn Spears duet &quot;Chillin' with You.&quot; Elsewhere, will.i.am, sometimes assisted by David Guetta, puts Britney through Euro-disco paces, not quite caring whether it reveals something personal about Spears or even fits her vocals. As the record progresses, Britney sounds increasingly listless, fading into the synthesizers and bass, and only William Orbit knows what to do with that sad, existential loneliness, placing it firmly in the center on &quot;Alien.&quot; As the album opener, it's hard to ignore but it inadvertently sets the tone for the rest of Britney Jean: she's not one of us and doesn't feel comfortable where she's at, and that uneasiness underpins the rest of this vaguely dispiriting album.\n &lt;a href=&quot;\nhttp://i.imgur.com/ROAXfLH.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/ROAXfLH.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e71f32deff6e558df6fc122c763db87922154bbf","amp;dn":"Britney+Spears+-+Britney+Jean+%5B2013%5D+%5BDELUXE%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e71f32deff6e558df6fc122c763db87922154bbf","infoHashBuffer":{"type":"Buffer","data":[231,31,50,222,255,110,85,141,246,252,18,44,118,61,184,121,34,21,75,191]},"announce":[],"urlList":[]}}