{"title":"SAW-RELOADED","uid":5134839,"size":3352911913,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e755d8ed2ca5f29f852b53a1c2fbaf5ed154c5db&amp;dn=SAW-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"extremezone","files":70,"time":1256401089,"description":"SAW (c) Konami Digital Entertainment Inc.\n\n10/2009 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nSAW centers on Detective David Tapp who awakens in a decrepit, abandoned\nasylum.  He has been captured by his longtime nemesis, Jigsaw.  Obsessed with\ncatching this serial killer, Tapp's mission has consumed him and ruined his\nfamily, resulting in divorce, mental imbalance, and abandonment. Worse yet,\nthis frantic hunt destroyed Tapp's career while he watched his long-time\nfriend and partner get killed by one of Jigsaw's traps.  Now Jigsaw has the\nupper hand and has captured the detective. Tapp must play a deadly gamethe\nlikes of which he has been investigating for yearsto escape, and in order\nto do so he must survive the lethal traps and puzzles that Jigsaw has put in\nplace for him and others. But each victim has a dark connection to Tapp. Will\nTapp save them? Can he survive his obsession to find the Jigsaw killer?\n\nFeatures\n* Traps of Lethal Cunning - Jigsaw has laid out a gauntlet of torturous\ntraps for a handful of innocents.  Only you stand between them and the\nmost brutal death imaginable.  Think quickly and act! The clock is\nticking.\n* Choices of conscience - The player is forced to make difficult moral\nchoices.  Who lives and who dies in the game is determined by the\nplayer's choices.\n* Mysteries Revealed - Unanswered questions from the films are finally laid\nto rest. Gamers will discover the origin of Jigsaw and why he devoted his\nlife to games, while also finding out what happened to the characters\nfrom the first SAW movie.\n* Ecology of Terror - The asylum in which Jigsaw has trapped you is\nabandoned, but it is far from empty.  It is a living world of horror\npopulated by Jigsaw's minions and the insane souls they torture and\nthey have no intention of letting you leave.\n\n1.Unrar\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n\n\nSaw: The Videogame\nSystem Requirements*\nIntel CPU - Core 2 Duo E4700 2.6GHz\nAMD CPU - Athlon 64 X2 Dual Core 4200+\nNvidia Graphics Card - Geforce 7600 GT 256MB\nATI &amp; Intel Graphics Card - Radeon X1900 Series\nRAM - 2 GB\nHard Disk Space - 12 GB\nDirect X - 9\n","torrent":{"xt":"urn:btih:e755d8ed2ca5f29f852b53a1c2fbaf5ed154c5db","amp;dn":"SAW-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e755d8ed2ca5f29f852b53a1c2fbaf5ed154c5db","infoHashBuffer":{"type":"Buffer","data":[231,85,216,237,44,165,242,159,133,43,83,161,194,251,175,94,209,84,197,219]},"announce":[],"urlList":[]}}