{"title":"The Beach Boys - Surf's Up (1971 quad mix 24/96 lossless 4.0 DVD","uid":9989771,"size":1842210691,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7b24ef96c12e68cb3d6b5357939b0ed23108477&amp;dn=The+Beach+Boys+-+Surf%27s+Up+%281971+quad+mix+24%2F96+lossless+4.0+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"OEM","files":7,"time":1397836012,"description":"The Beach Boys - Surf's Up (1971 quad mix 24/96 lossless 4.0 DVD-A)\n\n24/96 4.0 lossless MLP (DVD-Audio).\n16/48 4.0 DTS @ 1536kbps (DVD-Video) for compatibility with standard DVD players.\nFlat transfer with slight noise/crackle filtering applied (Izotope RX 3), no EQ, dynamic range compression, or rear channel boost.\n\nConverted from quad DY encoded vinyl using a SANSUI QS-D1000 VARIO MATRIX hardware decoder.\n\nNote: For those of you that doubt the QS-D1000 is capable of correct DY decoding (in QS mode): DY test tones decode correctly with little to no crosstalk (no worse than QS test tones). I have also done a channel by channel comparison to OxfordDickie's software conversion available on his Blog, and with one exception (see below) I couldn't find any notable differences. I also tested Dolby Pro Logic which just sounded weird, and not like quad at all. The Wikipedia claim that DPL will correctly decode DY is definitely incorrect.\n\nOD's conversion has the volume in the rear channels set slightly louder than this version. To my ears this version sounds more natural, but feel free to compare and see which version you prefer. OD used a CD as source, and I suspect the dynamic range compression / normalization applied to the CD versions of Surf's Up during mastering may be responsible for the volume difference.\n\nAccording to posts by sound engineer Stephen W. Desper on the Smiley Smile forum, CD releases of Surf's Up use too much noise reduction. Thus he recommends the vinyl version over all CD releases. So if this version sounds a bit more noisy than you'd expect in places, now you know why.\n\n\n&quot;Their worst since Friends, which just goes to show that making like a great group is as bad for your music as making like a buncha mystics. Except for the sophomoric &quot;Student Demonstration Time,&quot; the songs on the first side are all right--&quot;Take a Load Off Your Feet&quot; is worthy of Wild Honey and &quot;Disney Girls (1957)&quot; is worthy of Jack Jones's Greatest Hits--but the pop impressionism of side two drags hither and yon. The dying words of a tree are delivered in an apt, gentle croak, but the legendary title opus is an utter failure even on its own woozy terms and there are several disasters from the guest lyricists--Van Dyke Parks's wacked-out meandering is no better than Jack Rieley's. I'll trade you my copy for Surfin' Safari even up, and you'll be sorry.&quot; B-\n- Robert Christgau, Village Voice","torrent":{"xt":"urn:btih:e7b24ef96c12e68cb3d6b5357939b0ed23108477","amp;dn":"The+Beach+Boys+-+Surf%27s+Up+%281971+quad+mix+24%2F96+lossless+4.0+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b24ef96c12e68cb3d6b5357939b0ed23108477","infoHashBuffer":{"type":"Buffer","data":[231,178,78,249,108,18,230,140,179,214,181,53,121,57,176,237,35,16,132,119]},"announce":[],"urlList":[]}}