{"title":"MathCAD 13: Additional libraries","uid":3573850,"size":155304056,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e7e1e8b6d94d4e23e38966a9fa4617b4d92ae8a4&amp;dn=MathCAD+13%3A+Additional+libraries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"pail","files":7,"time":1165695176,"description":"Additional libraries for MathCAD 13\n\nInstallation:\n  Unpack every archive to MathCAD 13 folder\n  ( usually &quot;C:\\Program Files\\Mathsoft\\Mathcad 13\\&quot; )\n\nRun:\n  Libraries could be executed from MathCAD menu &quot;Help&quot;-&gt;&quot;eBooks&quot;\n\nThanks:\n  Thanks to my dear admins of Adeptscience,Inc. for their hard work. \n  This is a third distib they allowed me to hack.\n  Also I have to say thanks to Juliette, who decided to go to bed early,\n  giving me a chance to work freely ;)\n\nDescription:\n  Additional libraries for MathCAD 13.\n    Mathsoft Civil Engineering library\n    Mathsoft Electrical Engineering library\n    Mathsoft Mechanical Engineering library\n    Mathsoft ODE Solve Blocks handbook\n    Mathsoft Solving and Optimisation Extension Pack\n\n  The Civil Engineering Library combines the encyclopedic Roark&amp;#039;s \n  Formulas for Stress and Strain with easy-to-adapt structural design \n  templates and examples of thermal design problems. Because these are \n  delivered electronically for use within Mathcad, you can apply these \n  resources every day with ease. Explanatory text and examples give you \n  detailed background and guidance along with the equations. \n\n  Three best selling Mathcad Electronic Books are packaged together to \n  deliver over 130 sections that cover key areas in electrical engineering.\n  These titles have been entirely updated with a new interface and added \n  features that take advantage of Mathcad&amp;#039;s new calculation and browsing \n  capabilities. Because they are delivered electronically for use within \n  Mathcad, you can apply these resources everyday with ease. And explanatory\n  text and examples give you detailed background and guidance when you \n  want it. Electronic Titles in the Library:\n   # Electrical &amp; Electronic Engineering from Hicks&amp;#039;\n   # Electrical Power Systems Engineering\n   # Topics in Mathcad: Electrical Engineering \n  \n  The Mechanical Engineering Library combines three classic mechanical \n  references: Roark&amp;#039;s Formulas for Stress and Strain, Hick&amp;#039;s formulas, \n  and an interactive introduction to the finite element method. Because \n  these e-books are delivered electronically for use within Mathcad, you \n  can apply these resources every day with ease. Explanatory text and \n  examples give you detailed background and guidance when you want it. \n  \n  Mathsoft Differential Equation Solve Blocks: ODEs and DAEs.\n  These example worksheets demonstrate improvements and expansions to \n  the functionality of ordinary differential equation solve blocks and \n  tips for solving ODEs in Mathcad 13.\n  \n  The Solving &amp; Optimization Extension Pack delivers the most powerful \n  solving technology available for Mathcad, enabling you to handle even \n  the most complex problems in engineering, finance, operations research \n  and manufacturing. With this comprehensive tool, you get the expanded \n  capabilities required to solve optimization problems, linear and \n  non-linear systems of equations, and linear, quadratic and mixed integer\n  programming problems. Upon installing the Solving &amp; Optimization \n  Extension Pack, Mathcad&amp;#039;s problem-solving capacity is automatically \n  extended to handle hundreds of additional constraints and variables.\n  In addition, this extension pack includes a variety of pre-made \n  templates, which you can quickly and easily apply to your own work.  \n","torrent":{"xt":"urn:btih:e7e1e8b6d94d4e23e38966a9fa4617b4d92ae8a4","amp;dn":"MathCAD+13%3A+Additional+libraries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7e1e8b6d94d4e23e38966a9fa4617b4d92ae8a4","infoHashBuffer":{"type":"Buffer","data":[231,225,232,182,217,77,78,35,227,137,102,169,250,70,23,180,217,42,232,164]},"announce":[],"urlList":[]}}