{"title":"Vincent van Gogh - The Drawings (Art Ebook).pdf","uid":8999758,"size":95174824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e84ec17f25aea2e98be806a4b4f776298b209e5b&amp;dn=Vincent+van+Gogh+-+The+Drawings+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":-1,"time":1380930211,"description":"Format: pdf\nSize: 90 mb\nPages: 392\nPublisher: Metropolitan Museum of Art (October 1, 2005)\nLanguage: English\nISBN-10: 030010720X\nISBN-13: 978-0300107203\n\n*Starred Review* &quot;Drawing is the root of everything,&quot; van Gogh wrote to his brother, and, as Ives explains, his drawings, like his justifiably famous letters, were &quot;regular and faithful records of what was on his mind.&quot; Commanding in their vigor and acuity, stunning in their directness, van Gogh's drawings are as magnificent in their way as his paintings. It is a boon, therefore, to have nearly 400 line drawings and watercolors gathered in one comprehensive volume. A passionate landscape artist, van Gogh discerned the beauty of even the most modest terrains. You sense grass growing, flowers exhaling fragrance, leaves lifting on a breeze. Then, in winter scenes, he conveys a potent dormancy as bare branches sketch a calligraphy of longing against a brooding sky. His portraits of working people are also evocative, deeply empathic, and respectful. But for all the vitality of his line, loneliness pools in every shadow, and even as van Gogh celebrates fecundity and fortitude, death is ever present. Yet because his attunement to beauty is a form of faith, his drawings trace the unceasing whirl and fusion of life and embody the promise that nothing is truly lost but, rather, transformed. Donna Seaman","torrent":{"xt":"urn:btih:e84ec17f25aea2e98be806a4b4f776298b209e5b","amp;dn":"Vincent+van+Gogh+-+The+Drawings+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84ec17f25aea2e98be806a4b4f776298b209e5b","infoHashBuffer":{"type":"Buffer","data":[232,78,193,127,37,174,162,233,139,232,6,164,180,247,118,41,139,32,158,91]},"announce":[],"urlList":[]}}