{"title":"Martin Lawrence Live - Talkin' Shit (Big Papi) 1993 Stand-Up Com","uid":9631470,"size":74977671,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e8fb68deeb57c438b48addc0eb957531dcece800&amp;dn=Martin+Lawrence+Live+-+Talkin%27+Shit+%28Big+Papi%29+1993+Stand-Up+Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1392790572,"description":"By Perverted Alchemist\n\n\nWhen Martin Lawrence debuted in 1987, it was in the short-lived sitcom &quot;What's Happening Now!!&quot;. Around the same time, he began to develop his career as a stand up comedian. While he got a little recognition on the stand-up circut, he got the most fame from his small roles in films like &quot;Hangin' With The Homeboys&quot;, &quot;Boomerang&quot; as well as two films in the &quot;House Party&quot; franchise. His fortunes would soon change as he would become the host of Russell Simmons' comedy show &quot;Def Comedy Jam&quot;. His exposure from that show lead him to the Fox network to headline his own sitcom &quot;Martin&quot;. He then signed with the Atlantic Records subsidiary Eastwest Records America to release his debut album &quot;Martin Lawrence Live: Talkin' S***&quot;. The album is Martin Lawrence at is best- complete with all of the hilarity one can muster.\n\nHe starts the album off with &quot;Boxin'&quot;, on which he recounts his short-lived foray into the boxing world. On &quot;Eddie's House&quot;, he offers a hilarious take on being invited to the house of fellow actor/comedian Eddie Murphy while they were filming &quot;Boomerang&quot;. He tries to console the obese community on &quot;Worrying About Your Weight&quot;- but not without going into Oprah Winfrey's ill-fated dieting attempt. He later details a comedic encounter with singer Michael Jackson, while mocking his father Joe Jackson's appearance on Geraldo Rivera's talk show. Toward the second half of the album, Martin engages in crude humor for the remaining duration of the album. The album's highlight comes when he takes on a heckler who decides to interrupt him during the recording of the album. &quot;Martin Lawrence Live: Talkin' S***&quot; is a great album from the comedian, but it went barely noticed. However, half of the jokes on the recording would resurface almost a year later in his stand-up film &quot;You So Crazy&quot;. Despite the excessive profanity and the prolonged lewd nature of the set, Martin Lawrence's album is a welcome addition.","torrent":{"xt":"urn:btih:e8fb68deeb57c438b48addc0eb957531dcece800","amp;dn":"Martin+Lawrence+Live+-+Talkin%27+Shit+%28Big+Papi%29+1993+Stand-Up+Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8fb68deeb57c438b48addc0eb957531dcece800","infoHashBuffer":{"type":"Buffer","data":[232,251,104,222,235,87,196,56,180,138,221,192,235,149,117,49,220,236,232,0]},"announce":[],"urlList":[]}}