{"title":"The Fratellis - We Need Medicine (2013) [FLAC]","uid":8977307,"size":326374495,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e922c939c4d95225a6c39da9f8fb1f13427206c1&amp;dn=The+Fratellis+-+We+Need+Medicine+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"politux","files":-1,"time":1380475805,"description":"\n  The Fratellis - We Need Medicine (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16 \n  Sampling Rate: 44,100 Hz  \n\n  01 Halloween Blues \n  02 This Old Ghost Town \n  03 She's Not Gone Yet But She's Leaving \n  04 Seven Nights Seven Days\n  05 Shotgun Shoes \n  06 Whisky Saga \n  07 This Is Not the End of the World \n  08 Jeannie Nitro \n  09 We Need Medicine \n  10 Rock N Roll Will Break Your Heart\n  11 Until She Saves My Soul\n\n  A brashly melodic indie rock outfit from Glasgow, the Fratellis feature vocalist/guitarist Jon Fratelli, drummer Mince Fratelli, and bassist Barry Fratelli. The witty trio played its first show in early 2005, maintaining that the band's moniker was merely an homage to Barry's original surname (however, other rumors suggest that the Fratellis borrowed it from the nemesis family featured in Steven Spielberg's film The Goonies). Such trivia only added to the Fratellis' growing appeal upon their performance debut, and the band's limited-edition self-titled EP arrived in April 2006. Although few copies were pressed, the record received a helpful boost from Zane Lowe's Radio One program, which put the acoustic-driven track &quot;Creepin Up the Backstairs&quot; into regular rotation. Televised appearances on Later with Jools Holland and Top of the Pops followed during the early summer, while the group's second single, &quot;Henrietta,&quot; earned the Fratellis their first U.K. Top 20 hit. &quot;Chelsea Dagger&quot; began climbing the U.K. Top 40 that August, and the debut album Costello Music finally arrived in September. Although the album failed to chart in most countries (even an American iPod commercial featuring the track &quot;Flathead&quot; failed to spark much interest across the pond), Costello Music enjoyed a great deal of success at home, earning the bandmates a BRIT Award and peaking at number two in their native U.K. The band then returned to the British charts in 2008 with &quot;Mistress Mabel,&quot; a track from their polished sophomore effort Here We Stand. After a self-imposed hiatus to focus on other projects, the band regrouped in 2012 for a U.K. tour and announced in 2013 that they had recorded their third studio album in their native Glasgow. We Need Medicine was scheduled for a September 2013 release.","torrent":{"xt":"urn:btih:e922c939c4d95225a6c39da9f8fb1f13427206c1","amp;dn":"The+Fratellis+-+We+Need+Medicine+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e922c939c4d95225a6c39da9f8fb1f13427206c1","infoHashBuffer":{"type":"Buffer","data":[233,34,201,57,196,217,82,37,166,195,157,169,248,251,31,19,66,114,6,193]},"announce":[],"urlList":[]}}