{"title":"GTR 2 FIA GT Racing Game","uid":4590091,"size":1573297404,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e929220f3a9ef8061fb5c60ba9588651a0f3c7b2&amp;dn=GTR+2+FIA+GT+Racing+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"remwa","files":-1,"time":1229794434,"description":"The successor to the international award-winning racing simulation GTR accurately represents the challenges of Motorsport racing.\nThe detailed, photo-realistic depiction of these powerful cars and beautiful circuits, thanks to the latest graphics technology, and the enhanced driving model will make your adrenaline rise in one of more than one hundred HP-beasts.\nBeginners can start with the driving school where they are taught the basics of race driving by a professional instructor.\nThanks to dynamic day, night and weather changes and an impressive damage system, the races of the exciting FIA GT series become a thrilling gaming experience.\nRacing simulations have come a long way from their humble beginnings.\nContemporary PC racing gamers are blessed with the most technologically advanced racing simulation titles available.\nNo other platform offers racing titles with such depth and breadth as the PC.\nFrom involved F1 simulations to casual NASCAR games, PC gamers are spoiled with the choices offered in this genre.\nGTR 2: FIA Racing has gained almost universal acceptance as the benchmark by which other racing simulations are judged.\nDriving, crashing, and racing simply doesn't get much better than this, meticulously detailed tracks and cars, 28-player online racing is fun and lag-free, massive tuning options, driving school is a great addition.\n\nFor installations info please check the &quot;nfo.txt&quot; file:))","torrent":{"xt":"urn:btih:e929220f3a9ef8061fb5c60ba9588651a0f3c7b2","amp;dn":"GTR+2+FIA+GT+Racing+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e929220f3a9ef8061fb5c60ba9588651a0f3c7b2","infoHashBuffer":{"type":"Buffer","data":[233,41,34,15,58,158,248,6,31,181,198,11,169,88,134,81,160,243,199,178]},"announce":[],"urlList":[]}}