{"title":"Encyclopedia of Energy, Six-volume set -  Cutler J. Cleveland","uid":12132611,"size":84061281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e92a7f50b0f17ad8d9adfd847891a62bdaddea4c&amp;dn=Encyclopedia+of+Energy%2C+Six-volume+set+-++Cutler+J.+Cleveland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1437080182,"description":"Encyclopedia of Energy, Six-volume set -  Cutler J. Cleveland (Elsevier, 2004).pdf\n\nIn recent years our usage and understanding of different types of energy has grown at a tremendous rate. The editor-in-chief, Cutler Cleveland, and his international team of associate editors have brought together approximately 400 authors to produce the Encyclopedia of Energy. This highly topical reference draws together all aspects of energy, covering a wealth of areas throughout the natural, social and engineering sciences. \nThe Encyclopedia will provide easily accessible information about all aspects of energy, written by leading international authorities. It will not only be indispensible for academics, researchers, professionals and students, but also for policy makers, energy and environmental consultants, and all those working in business corporations and non-governmental organisations whose activities relate to energy and the environment. \nAlso available online via ScienceDirect featuring extensive browsing, searching, and internal cross-referencing between articles in the work, plus dynamic linking to journal articles and abstract databases, making navigation flexible and easy. For more information, pricing options and availability visit www.info.sciencedirect.com. \nAn invaluable resource for all academics, researchers, professionals and students either working in or conducting research in energy and related environmental fields\nAn A-Z of energy, covering environmental and renewable energy through to fossil fuels and nuclear power","torrent":{"xt":"urn:btih:e92a7f50b0f17ad8d9adfd847891a62bdaddea4c","amp;dn":"Encyclopedia+of+Energy%2C+Six-volume+set+-++Cutler+J.+Cleveland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e92a7f50b0f17ad8d9adfd847891a62bdaddea4c","infoHashBuffer":{"type":"Buffer","data":[233,42,127,80,176,241,122,216,217,173,253,132,120,145,166,43,218,221,234,76]},"announce":[],"urlList":[]}}