{"title":"Sniper on the Eastern Front: The Memoirs of Sepp Allerberger, Kn","uid":11909656,"size":280918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea16253b10acd6b91c0e0f8f9c6435dd67b57971&amp;dn=Sniper+on+the+Eastern+Front%3A+The+Memoirs+of+Sepp+Allerberger%2C+Kn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"JinRohEX","files":1,"time":1431451567,"description":"Sniper on the Eastern Front: The Memoirs of Sepp Allerberger, Knight's Cross\nby Albrecht Wacker\n\nDESCRIPTION:\n\nJosef &quot;Sepp&quot; Allerberger was the second most successful sniper of the German Wehrmacht and one of the few private soldiers to be honored with the award of the Knight's Cross.\nAn Austrian conscript, after qualifying as a machine gunner he was drafted to the southern sector of the Russian Front in July 1942. Wounded at Voroshilovsk, he experimented with a Russian sniper-rifle while convalescing and so impressed his superiors with his proficiency that he was returned to the front on his regiment's only sniper specialist.\nIn this sometimes harrowing memoir, Allerberger provides an excellent introduction to the commitment in field craft, discipline and routine required of the sniper, a man apart. There was no place for chivalry on the Russian Front. Away from the film cameras, no prisoner survived long after surrendering. Russian snipers had used the illegal explosive bullet since 1941, and Hitler eventually authorised its issue in 1944. The result was a battlefield of horror.\nAllerberger was a cold-blooded killer, but few will find a place in their hearts for the soldiers of the Red Army against whom he fought.\n\n\nBook Cover: https://img.bi/#/ob00nGC!viuyFAL9jjhAp9QFEA6J-vEA33rmnwG9ko-wsj3L","torrent":{"xt":"urn:btih:ea16253b10acd6b91c0e0f8f9c6435dd67b57971","amp;dn":"Sniper+on+the+Eastern+Front%3A+The+Memoirs+of+Sepp+Allerberger%2C+Kn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea16253b10acd6b91c0e0f8f9c6435dd67b57971","infoHashBuffer":{"type":"Buffer","data":[234,22,37,59,16,172,214,185,28,14,15,143,156,100,53,221,103,181,121,113]},"announce":[],"urlList":[]}}