{"title":"Beth Gibbons &amp; Rustin Man - Out of Season","uid":3669209,"size":74055518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ea26b32dec77837b26032cebb43de56bf5aa275e&amp;dn=Beth+Gibbons+%26+Rustin+Man+-+Out+of+Season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"marckos","files":12,"time":1177114464,"description":"Encoding : EAC 0.95b + LAME 3.97 _ -V 0 --vbr-new -m s\n\nReview\n\nOut of Season plays to Beth Gibbons\\&amp;#039; strengths as a vocalist and songwriter more than anything released prior by Portishead. On both Dummy and Portishead, her pained, worn, resilient voice was often made to sound as if it was as much an artifact as the Isaac Hayes and Lalo Schifrin samples. That voice of hers was perfectly suited for the backing provided by her bandmates, but more than a few wondered if it would sound even more perfect -- or in a better setting, naked and completely central -- if it were supported by the type of folk, jazz, and R&amp;B recordings it could\\&amp;#039;ve been plucked from in the first place. That \\&quot;what if\\&quot; is answered with this album, made by Gibbons in collaboration with Paul Webb, several of his fellow Talk Talk alums, and numerous others. Brass, strings, reeds, organs, acoustic guitar, double bass, and lightly brushed drums are all part of the mix, which never threatens to take the spotlight away from Gibbons. The lyrical themes aren\\&amp;#039;t much of a departure for the singer, who contemplates the passing of time and her love/hate relationship with existence throughout -- one song opens with \\&quot;God knows how I adore life,\\&quot; and then one song later, she\\&amp;#039;s \\&quot;So tired of life.\\&quot; The icing on the cake is in the little details, like the sly Carol Kaye imitation snuck in by bassist Adrian Utley during \\&quot;Romance\\&quot; and the way the background vocals discreetly drift in and out, alternating between serene and spooky. The sticker that came affixed to the disc contains a quote that proclaims this to be one of the best albums of all time. While that is a stretch, there\\&amp;#039;s no denying that the quote below that one -- \\&quot;Quietly devastating\\&quot; -- is 100 percent accurate.\n\nAll Music: http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hifoxqualdde\n\nSample: http://media.putfile.com/05---Sand-River-94","torrent":{"xt":"urn:btih:ea26b32dec77837b26032cebb43de56bf5aa275e","amp;dn":"Beth+Gibbons+%26+Rustin+Man+-+Out+of+Season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea26b32dec77837b26032cebb43de56bf5aa275e","infoHashBuffer":{"type":"Buffer","data":[234,38,179,45,236,119,131,123,38,3,44,235,180,61,229,107,245,170,39,94]},"announce":[],"urlList":[]}}