{"title":"(2001) Elton John - Tumbleweed Connection (Japan Remasterd Editi","uid":11329777,"size":378728935,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea2eb8608896e232707d5ff1a8d7301a47e1d0e8&amp;dn=%282001%29+Elton+John+-+Tumbleweed+Connection+%28Japan+Remasterd+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"100.XY","files":-1,"time":1414663579,"description":"(2001) Elton John - Tumbleweed Connection (Japan Remasterd Edition)\n\n\n\nReview:\nThe only criticism heard with any frequency of Elton John's first American album, Elton John, was that the production was too grandiose. The melodies were superb, and lyrics frequently very good, and the performances flawless. However, Elton did inevitably get lost on many of the tracks and like many of his admirers, I am glad he toned things down a bit on Tumbleweed Connection. In fact, my main reservation about the new album is that he didn't go far enough.\n\nTumbleweed Connection centers around and is structured by Bernie Taupin's lyrics. Like the Band and Creedence, both of whom have influenced him, Taupin writes about the mythical American south and west and seems to prefer the past to the present as a subject. &quot;There Goes a Well Known Gun&quot; is about an outlaw on the run; &quot;Country Comfort&quot; concerns the pleasures of the farm. One of its verses brilliantly announces the coming of industrialization:\n\nDown at the well they've got a new machine\nForeman says it cuts manpower by fifteen\nBut that ain't natural, well so old Clay would say\nYou see he's a horse drawn man until his dying day.\n\n&quot;Son of Your Father&quot; is a moralistic tale which, after describing a fight between friends that leaves them both dead, concludes that &quot;... charity's an argument that only leads to harm.&quot;\n\nViolence is very much a part of the vision Taupin has created here. Besides in &quot;Well Known Gun&quot; and &quot;Son of Your Father,&quot; it recurs in &quot;My Father's Gun,&quot; which is distinctly reminiscent of &quot;The Night They Drove Old Dixie Down.&quot; Oddly, Taupin too takes the Southern point of view. I guess the grey was always synonymous with romanticism in American history but from what source does Taupin draw his emotions on the subject? &quot;Oh I'll not rest until I know the cause is fought and won/From this day on until I die I'll wear my father's gun.&quot; And then, describing the joys of imagined victory for the South, &quot;To watch the children growing and see the women sewing.&quot; When the South has won the Civil War? How strange.\n\nThe violent theme serves as the conclusion of the album as well. Here he seems to be vaguely echoing the sentiments of revolution although the historical context established in so many other songs on the album is no longer clearly present.\n\nBring your family down to the riverside\nLook to the east to see where the fat stock hide\nBehind four walls of stone the rich man sleeps\nIt's time we put the flame torch to their keep\nBurn down the mission\nIf we're gonna stay alive\nWatch the black smoke fly to heaven\nSee the red flame light the sky.\n\nThe several love songs on the album express old fashioned sentiments and one wonders if the context is understood by now or if the song represents a departure from the historical approach.\n\nTaupin's constructions are often awkward and hard to sing and sometimes the ambiguities get out of hand. He is not a great lyricist but he is certainly an interesting one and he provides Elton John with a fine vehicle for expressing himself.\n\nJohn is a fine singer in the soul-folk vein. His singing and his melodies on this album are exceptionally good. What isn't so exciting is the busy arrangements that seem to diffuse the energy of the performances. For example, John's &quot;Country Comfort&quot; has nothing close to the power of Rod Stewart's simpler, more straight-forward interpretation. Especially irritating are the recurring use of such instruments as harmonicas, steel guitars, and other producer touches. It sounds too complicated to my ears and a simpler approach would have left more room for Elton to shine through without distraction.\n\nMost cuts do feature just bass, drums, piano and guitar but every one is so busy that the sound loses its focus. Elton's piano is at the center and his overly-syncopated style contributes to the fragmented and sometimes chaotic style of the band tracks. One place where things do get themselves together is on &quot;My Father's Gun.&quot; The big soul chorus conjures up the appropriate images brilliantly. The large sound on &quot;Burn Down the Mission&quot; is also effective, and the beginning of &quot;Amoreena&quot; is just great. Still, more cuts with the limited instrumentation of &quot;Talking Old Soldiers&quot; and &quot;Love Song&quot; might have given the album greater personal depth.\n\nTumbleweed Connection is interesting primarily because of the themes that Taupin has taken on and the melodies John has created. The performances are fine but somehow they lose the force one can envision them having had in some earlier stage of production. It is still an exciting album, one that I have played endlessly for a week, but it is also something of a missed opportunity. Tumbleweed Connection is simpler than John's last album and next time around I hope he goes all the way and gets down to nothing but the basics. He is one of the few who is good enough not to need anything else.\nReview By Jon Landau\nRating 4/5\n\nimage\n\n\n\nTracklist:\n01. Ballad of a Well-Known Gun (4:59) \n02. Come Down in Time (3:26) \n03. Country Comfort (5:07) \n04. Son of Your Father (3:49) \n05. My Father's Gun (6:21) \n06. Where to Now St. Peter? (4:11) \n07. Love Song (3:42) \n08. Amoreena (5:00) \n09. Talking Old Soldiers (4:06) \n10. Burn Down the Mission (6:35) \n11. Into the Old Man's Shoes [bonus track] (4:03) \n12. Madman Across the Water (Original Version) [bonus track] (8:52) \n\n\nSummary:\nCountry: UK\nGenre: Rock, pop rock, glam rock, soft rock, R&amp;B\nStyles:\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~830 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits","torrent":{"xt":"urn:btih:ea2eb8608896e232707d5ff1a8d7301a47e1d0e8","amp;dn":"%282001%29+Elton+John+-+Tumbleweed+Connection+%28Japan+Remasterd+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea2eb8608896e232707d5ff1a8d7301a47e1d0e8","infoHashBuffer":{"type":"Buffer","data":[234,46,184,96,136,150,226,50,112,125,95,241,168,215,48,26,71,225,208,232]},"announce":[],"urlList":[]}}