{"title":"Daniel Tiger's Neighborhood (PBS Kids) S1, Eps 11-20 [Nanto]","uid":8180843,"size":2344986924,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea62cf12a7cad90381814368349284b6fcbe6392&amp;dn=Daniel+Tiger%27s+Neighborhood+%28PBS+Kids%29+S1%2C+Eps+11-20+%5BNanto%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"NantoVision","files":-1,"time":1361579272,"description":"Created by Angela Santomero, the creator of Blue's Clues and Super Why!, Daniel Tiger's Neighborhood is a new animated sequel to Mr. Rogers' Neighborhood, where all the original characters from the Neighborhood of Make-Believe are now grown up with their own preschool-aged children. The series centers around a four-year-old Daniel Tiger, son of the original Daniel Striped Tiger. Other characters include Katerina Kittycat, O the Owl, and Prince Wednesday. Two 11-minute episodes are linked by a common socio-emotional theme, such as disappointment, sadness or anger. The theme also uses a Musical Motif phrase to reenforce the theme and help children remember. The series is co-produced by The Fred Rogers Company (formerly Family Communications) and Out of the Blue Enterprises, with animation produced in Canada by 9 Story Entertainment.\t\n\nIf you enjoy this torrent, be sure to leave me a comment! And please continue to seed after your download completes, so that others can enjoy this great kids educational show. If people keep seeding I will continue to post more episodes.\t","torrent":{"xt":"urn:btih:ea62cf12a7cad90381814368349284b6fcbe6392","amp;dn":"Daniel+Tiger%27s+Neighborhood+%28PBS+Kids%29+S1%2C+Eps+11-20+%5BNanto%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea62cf12a7cad90381814368349284b6fcbe6392","infoHashBuffer":{"type":"Buffer","data":[234,98,207,18,167,202,217,3,129,129,67,104,52,146,132,182,252,190,99,146]},"announce":[],"urlList":[]}}