{"title":"AIR Ignite 1.3.1 windows","uid":9995316,"size":1026127631,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea71ed421eae1dc5b9ad1cce2e7dd3d74fb96d5f&amp;dn=AIR+Ignite+1.3.1+windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"mjchopper","files":-1,"time":1397867517,"description":"Ignite Version 1.3.1\n\nFeaturing the new MIDI Learn Mode, Ignite 1.3.1 lets you write, record, and produce music with your favorite keyboard controller.\n\nInspiring Sounds\n\nIgnite includes over 275 instruments, many of which are taken from our renowned instrument collections - including Strike, Structure, and Velvet. All sounds have been optimized to load quickly, and the editing controls are automatically mapped to your Ignite supported keyboard. These extraordinary sounds include keyboards, drums, percussion, basses, guitars, synths, strings, brass, and woodwinds.\n\nAudio Appeal\n\nIn addition to hundreds of onboard instruments and extensive MIDI control, Ignite supports two tracks of simultaneous audio recording, such as guitar and voice, a stereo workstation, bass and guitar, etc. Effects can be added to any audio track, and time stretching--powered by Radius from iZotope--is also provided.\n\nPowerful Creative Tools\n\nIgnite features Smart MIDI technology to help jump-start your ideas and enhance your music-making skills. The Chord Player generates a chord pattern from a single key, while the Phrase Player can provide a single-voice line to add to your composition. Both the Chord and Phrase player include dozens of patterns in modern music genres - these aren't canned, boring MIDI patterns. Tailor the performance of these Players by adjusting feel, speed and intensity. The Flexible arpeggiator plays held notes individually, either as a musical flourish or in a rhythmic pattern.","torrent":{"xt":"urn:btih:ea71ed421eae1dc5b9ad1cce2e7dd3d74fb96d5f","amp;dn":"AIR+Ignite+1.3.1+windows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea71ed421eae1dc5b9ad1cce2e7dd3d74fb96d5f","infoHashBuffer":{"type":"Buffer","data":[234,113,237,66,30,174,29,197,185,173,28,206,46,125,211,215,79,185,109,95]},"announce":[],"urlList":[]}}