{"title":"Bad Boys 2(2003)DVDRip.AC3(ENG)-DROCK","uid":6196771,"size":734095676,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea795e70031bd3705db69a865ab4ee477b7ae532&amp;dn=Bad+Boys+2%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"drock232","files":-1,"time":1298472048,"description":"Stars Martin Lawrence and Will Smith return along with director Michael Bay and producer Jerry Bruckheimer for this sequel to the 1995 sleeper hit Bad Boys, the film that sparked the careers of both actors, as well as Bay. Once again, Lawrence and Smith play hotshot, wisecracking Miami narcotics officers Marcus Burnett and Mike Lowrey. This time around, Burnett and Lowrey have been assigned to head up a task force to investigate the illegal trafficking of ecstasy into the city. They discover that an underground gang war has been instigated by drug kingpin Johnny Tapia (Jordi Molla). In order to cut off the flow of the designer drug, they have to take down Tapia. Unfortunately, there's a wrench thrown into the gears in the form of Burnett's sister Syd, whom Lowrey takes a liking to and begins a relationship with. Tensions rise between the partners, threatening both their friendship and the investigation and putting Syd in harm's way. Also returning from the first film are Joe Pantoliano as Captain Howard, Theresa Randle as Burnett's wife Theresa, and former-NBA star John Salley as 'Hacker' Fletcher. Among the supporting players new to this entry in the series are Peter Stormare and musician, spoken-word artist, and sometimes-actor Henry Rollins.\n\nRipped with Handbrake.\n\nLength: 2 Hours 26 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:ea795e70031bd3705db69a865ab4ee477b7ae532","amp;dn":"Bad+Boys+2%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea795e70031bd3705db69a865ab4ee477b7ae532","infoHashBuffer":{"type":"Buffer","data":[234,121,94,112,3,27,211,112,93,182,154,134,90,180,238,71,123,122,229,50]},"announce":[],"urlList":[]}}