{"title":"None but the Dead (2016) [WWRG]","uid":15976105,"size":2963052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea90cfecad79584b356411b3c4dbdc3487f22879&amp;dn=None+but+the+Dead+%282016%29+%5BWWRG%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Lion.King","files":5,"time":1475842194,"description":"\nNone but the Dead is the thrilling eleventh book in Lin Anderson's Rhona MacLeod series.\r\n\r\nSanday, one of Britain's northernmost islands, inaccessible when the wind prevents the ferry crossing from the mainland, or fog grounds the tiny, island-hopping plane.\r\n\r\nWhen human remains are discovered to the rear of an old primary school, forensic expert Dr Rhona MacLeod and her assistant arrive to excavate the grave. Approaching midwinter, they find daylight in short supply, the weather inhospitable and some of the island's inhabitants less than co-operative. When the suspicious death of an old man in Glasgow appears to have links with the island, DS Michael McNab is dispatched to investigate. Desperately uncomfortable in such surroundings, he finds that none of the tools of detective work are there. No internet, no CCTV, and no police station.\r\n\r\nAs the weather closes in, the team - including criminal profiler and Orkney native Professor Magnus Pirie - are presented with a series of unexplained incidents, apparently linked to the discovery of thirteen magic flowers representing the souls of dead children who had attended the island school where the body was discovered. But how and in what circumstance did they die? And why are their long forgotten deaths significant to the current investigation?\r\n\r\nAs a major storm approaches, bringing gale-force winds and high seas, the islanders turn on one another, as past and present evil deeds collide, and long buried secrets break the surface, along with the exposed bones","torrent":{"xt":"urn:btih:ea90cfecad79584b356411b3c4dbdc3487f22879","amp;dn":"None+but+the+Dead+%282016%29+%5BWWRG%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea90cfecad79584b356411b3c4dbdc3487f22879","infoHashBuffer":{"type":"Buffer","data":[234,144,207,236,173,121,88,75,53,100,17,179,196,219,220,52,135,242,40,121]},"announce":[],"urlList":[]}}