{"title":"Head.1968.(The Monkees)","uid":6791485,"size":583182504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb198bfd689c2d9fd15915d039dc12151a6dc6d4&amp;dn=Head.1968.%28The+Monkees%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Xeokym","files":1,"time":1320282403,"description":"A plot-less collection of various musical encounters and adventures by the famous rock band &quot;The Monkees&quot; which follows Davy, Peter, Mike and Mickey as they travel through an assortment of places in search of meaning. Written by Anonymous\n\nIn this 1968 film, the Monkees valiantly attempted to deflate their own myth. The plot is, essentially, about demystification. Mickey Dolenz, Davy Jones, Peter Tork, and Mike Nesmith - with the aid of writer Jack Nicholson (the only credited author due to legalities)- tackle such topics as filmmaking, the media treatment and madness of the Vietnam War, Davy Jones' &quot;way with the ladies&quot;, and, most importantly, commercialization. Each group member is presented in a unique light - in every case shattering the image that had been produced by the &quot;media machine&quot;. The Monkees went out on a limb with this film by creating an almost surreal work with a loosely bound &quot;plot&quot;. Their younger fans, unfortunately, simply missed the point. Because of the poor publicity of the film at the time of its release, older teenagers had no clue what &quot;Head&quot; was trying to say. As a result, its box office showing was disastrous. &quot;Head&quot; is more for the film enthusiast than the casual Monkees fan in some respects. The soundtrack does, however, feature some of the finest and most sophisticated music of the group's career. And yes, they DO play their own instruments on the tunes, but receive assistance in composing and performing from the likes of Neil Young, Stephen Stills, and Carole King","torrent":{"xt":"urn:btih:eb198bfd689c2d9fd15915d039dc12151a6dc6d4","amp;dn":"Head.1968.%28The+Monkees%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb198bfd689c2d9fd15915d039dc12151a6dc6d4","infoHashBuffer":{"type":"Buffer","data":[235,25,139,253,104,156,45,159,209,89,21,208,57,220,18,21,26,109,198,212]},"announce":[],"urlList":[]}}