{"title":"V.C Andrews - Dollanganger Series - Books 1-5 (Unabridged)","uid":4422297,"size":1759148537,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eb77b62629470a42c3ff2380ba21681677ab59ae&amp;dn=V.C+Andrews+-+Dollanganger+Series+-+Books+1-5+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"dodo12288","files":6,"time":1222848901,"description":"V.C Andrews - Dollanganger Series - Books 1-5\n\nContains All 5 Unabridged Audio Books\n\n    * Flowers in the Attic \n    * Petals on the Wind \n    * If There Be Thorns \n    * Seeds of Yesterday \n    * Garden of Shadows \n\nDescriptions From Amazon.com\n\nFlowers in the Attic\n------------------------------\nThe four Dollanganger children had such perfect lives -- a beautiful mother, a doting father, a lovely home. Then Daddy was killed in a car accident, and Momma could no longer support the family. So she began writing letters to her parents, her millionaire parents, whom the children had never heard of before.\n\nMomma tells the children all about their rich grandparents, and how Chris and Cathy and the twins will live like princes and princesses in their grandparents' fancy mansion. The children are only too delighted by the prospect. But there are a few things that Momma hasn't told them.\n\nShe hasn't told them that their grandmother considers them &quot;devil's spawn&quot; who should never have been born. She hasn't told them that she has to hide them from their grandfather if she wants to inherit his fortune. She hasn't told them that they are to be locked away in an abandoned wing of the house with only the dark, airless attic to play in. But, Momma promises, it's only for a few days....\n\nThen the days stretch into months, and the months into years. Desperately isolated, terrified of their grandmother, and increasingly convinced that their mother no longer cares about them, Chris and Cathy become all things to the twins and to each other. They cling to their love as their only hope, their only strength -- a love that is almost stronger than death. \n\nPetals on the Wind \n------------------------------\nFor Carrie, Chris and Cathy the attic was a dark horror that would not leave their minds.\n\nOf course mother had to pretend they didn't exist and grandmother was convinced they had the devil in them.\n\nBut that wasn't their fault. Was it?\n\nCathy knew what to do. She knew it was time to show her mother and grandmother that the pain and terror of the attic could not be forgotten...Show them. Show them -- once and for all. \n\nIf There Be Thorns\n------------------------------\nChris and Cathy made such a loving home for fourteen-year-old Jory -- so handsome, so gentle. And for Bart,who had such a dazzling imagination for a nine year old.\n\nThen the lights came on in the house next door. Soon the Old Lady in Black was there, watching them, guarded by her strange old butler. Soon she had Bart over for cookies and ice cream and asked him to call her &quot;Grandmother&quot;.\n\nAnd soon Bart's transformation began...\n\nFed by the hint of terrible things about his mother and father...leading him into shocking acts of violence.\n\nNow while this little boy trembles on the edge of madness, his anguished parents await the climax to a horror that flowered in an attic long ago, a horror whose thorns are still wet with blood, still tipped with fire. \n\nSeeds of Yesterday\n------------------------------\nThe final, haunting novel, in the extraordinary story that has enthralled millions!\n\nThe horror began with Flowers in the Attic, the terrifying tale of four innocent children locked away from the world by a cruel mother.\n\nThe shocking fury continued with Petals on the Wind and If There be Thorns. Now V.C. Andrews has created the last dark chapter in the strange, chilling tale of passion and peril. \n\nGarden of Shadows (Prequel)\n-----------------------------------------\nOlivia dreamed of a sun-filled love, a happy life. Then she entered Foxworth Hall...\n\nV.C. Andrews' thrilling new novel spins a tale of dreadful secrets and dark, forbidden passions -- of the time before Flowers in the Attic began. Long before terror flowered in the attic, thin, spinsterish Olivia came to Virginia as Malcolm Foxworth's bride. At last, with her tall handsome husband, she would find the joy she had waited for, longed for. But in the gloomy mansion filled with hidden rooms and festering desires, a stain of jealous obsession begins to spread...an evil that will threaten her children, two lovely boys and one very special, beautiful girl. For within one innocent child, a shocking secret lives...a secret that will taint the proud Foxworth name, and haunt all their lives forever!\n","torrent":{"xt":"urn:btih:eb77b62629470a42c3ff2380ba21681677ab59ae","amp;dn":"V.C+Andrews+-+Dollanganger+Series+-+Books+1-5+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb77b62629470a42c3ff2380ba21681677ab59ae","infoHashBuffer":{"type":"Buffer","data":[235,119,182,38,41,71,10,66,195,255,35,128,186,33,104,22,119,171,89,174]},"announce":[],"urlList":[]}}