{"title":"George Duke - Dreamweaver [24 bit FLAC] HD tracks","uid":8788468,"size":1595637036,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb7de1e58af40e2ea0b2592599acfe0a37ed24ef&amp;dn=George+Duke+-+Dreamweaver+%5B24+bit+FLAC%5D+HD+tracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"politux","files":-1,"time":1375883070,"description":"  George Duke - Dreamweaver [24 bit FLAC] HD tracks\n\n  Released: 2013\n  Genres: Jazz, R&amp;B\n  Source: 24/96 HD Tracks\n  Codec: FLAC\n  Bit Rate: ~ 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 DreamWeaver \n  02 Stones of Orion \n  03 Trippin' \n  04 AshTray\n  05 Missing You\n  06 Transition 1 / Change The World\n  07 Jazzmatazz\n  08 Round The Way Girl\n  09 Transition 2 / Brown Sneakers\n  10 You Never Know\n  11 Ball &amp; Chain\n  12 Burnt Sausage Jam\n  13 Happy Trails\n\n  Dreamweaver marks George Duke's return to recording after a three year silence, and his first since the death of his wife Corine in 2012. While he is always diverse, this set is uncommonly so. The opener, a slippery, atmospheric title intro, flows directly into the Latin-tinged &quot;Stones of Orion,&quot; a jazz tune with Duke on piano, Rhodes, and synths, Stanley Clarke on upright bass, and a four-piece horn section. It's shimmering groove-oriented jazz that reflects the time that Duke spent with Cannonball Adderley. &quot;Trippin'&quot; is a funky, jazzed-up R&amp;B tune where he offers his autobiography; it features some fine muted trumpet work by Michael Patches Stewart. &quot;Missing You&quot; is a jazz ballad tribute to Corine, with the finest vocal Duke has laid down in a decade. But there's funk here, too, in the fat stomper &quot;Ashtray.&quot; \n\n  Another highlight is the leisurely, wonderfully sophisticated, 15-plus-minute &quot;Burnt Sausage Jam,&quot; which features Duke on a wide array of keys, Christian McBride on bass, the late, great, and certainly under-celebrated Jef Lee Johnson on guitar, and John Roberts on drums and horns. &quot;Change the World,&quot; with a slew of vocalists including Lalah Hathaway, Jeffrey Osborne, and BeBe Winans, is obviously inspired by Michael Jackson's &quot;We Are the World,&quot; but is far less anthemic, as it weaves modern gospel, adult contemporary R&amp;B, and reggae into a seamless whole. The biggest surprise here is the inclusion of the sultry, bluesy, nocturnal jazz ballad &quot;Ball &amp; Chain,&quot; with the late Teena Marie. It was cut for her Congo Square album, but was shelved because she wanted to use it on a planned collaborative jazz album with Duke. Sparsely adorned with his drum and synth programming, Stewart on trumpet, and Kamasi Washington on tenor saxophone, it's a killer performance from Marie. The closing reading of the Dale Evans' standard &quot;Happy Trails&quot; is rearranged as a soulful, sexy, gospelized jazz tune celebrating the lives of those who added so much to Duke's. While it's true that Dreamweaver's creation was inspired by the desire to move on from so many losses -- Corine, Johnson, Marie -- it is not remotely a sad record. If anything, with its smooth, warm, grooves, it celebrates life in the present.","torrent":{"xt":"urn:btih:eb7de1e58af40e2ea0b2592599acfe0a37ed24ef","amp;dn":"George+Duke+-+Dreamweaver+%5B24+bit+FLAC%5D+HD+tracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7de1e58af40e2ea0b2592599acfe0a37ed24ef","infoHashBuffer":{"type":"Buffer","data":[235,125,225,229,138,244,14,46,160,178,89,37,153,172,254,10,55,237,36,239]},"announce":[],"urlList":[]}}