{"title":"Daniel J. Levitin - This Is Your Brain on Music (2007).mp3","uid":11806645,"size":336841155,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eb930cff619ed9a4f7d40b972ee72df8a8725923&amp;dn=Daniel+J.+Levitin+-+This+Is+Your+Brain+on+Music+%282007%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":null,"files":1,"time":1428623615,"description":"What can music teach us about the brain? What can the brain teach us about music? And what can both teach us about ourselves?\n\nIn this groundbreaking union of art and science, rocker-turned-neuroscientist Daniel J. Levitin (The World in Six Songs and The Organized Mind) explores the connection between music - its performance, its composition, how we listen to it, why we enjoy it - and the human brain. Drawing on the latest research and on musical examples ranging from Mozart to Duke Ellington to Van Halen, Levitin reveals:\n\n    * How composers produce some of the most pleasurable effects of listening to music by exploiting the way our brains make sense of the world\n    * Why we are so emotionally attached to the music we listened to as teenagers, whether it was Fleetwood Mac, U2, or Dr. Dre\n    * That practice, rather than talent, is the driving force behind musical expertise\n    * How those insidious little jingles (called earworms) get stuck in our head\n\nTaking on prominent thinkers who argue that music is nothing more than an evolutionary accident, Levitin poses that music is fundamental to our species, perhaps even more so than language. A Los Angeles Times Book Award finalist, This Is Your Brain on Music will attract readers of Oliver Sacks and David Byrne, as it is an unprecedented, eye-opening investigation into an obsession at the heart of human nature","torrent":{"xt":"urn:btih:eb930cff619ed9a4f7d40b972ee72df8a8725923","amp;dn":"Daniel+J.+Levitin+-+This+Is+Your+Brain+on+Music+%282007%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb930cff619ed9a4f7d40b972ee72df8a8725923","infoHashBuffer":{"type":"Buffer","data":[235,147,12,255,97,158,217,164,247,212,11,151,46,231,45,248,168,114,89,35]},"announce":[],"urlList":[]}}