{"title":"Cat Stevens 24 Bit Vinyl Pack","uid":9514240,"size":5438367203,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec68d83777d6f31ebbf5b5c0be9031191b5ece41&amp;dn=Cat+Stevens+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"politux","files":-1,"time":1390486896,"description":"\n  Cat Stevens 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Soft Rock\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1970 Tea for the Tillerman - MFSL UHQR 200g (US)\n  1970 Tea for the Tillerman - APP 9135 200g (US, Dr. Robert)\n  1970 Mona Bone Jakon - Island 0042284235112 (Reissue 2010, EU)\n  1970 Mona Bone Jakon - Island 842 351-1 (Reissue 2008, EU)\n  1972 Catch Bull at Four - Island ILPS 9206 (UK)\n  1973 Foreigner - A&amp;M SP-4391 (Original Press, US)\n  1974 Buddah and the Chocolate Box - A&amp;M SP 3623 (Promo, Dr. Robert)\n    \n  Cat Stevens, born Steven Demetre Georgiou, was the son of a Swedish mother and a Greek father who ran a restaurant in London. He became interested in folk music and rock &amp; roll in his teens while attending Hammersmith College and in 1965 began performing under the name Steve Adams. Mike Hurst, a former member of the folk-pop group the Springfields, who had become a record producer, heard him and took him into a recording studio to cut his composition &quot;I Love My Dog.&quot; This demo caused Decca Records to sign him under the name Cat Stevens and assign him to its newly formed Deram subsidiary. &quot;I Love My Dog&quot; reached the British charts in October 1966, peaking in the Top 40. Stevens' next single, &quot;Matthew &amp; Son,&quot; entered the charts in January 1967 and just missed getting to number one (in America, it grazed the bottom of the charts). It was another self-written effort, and Stevens' reputation as a writer was further enhanced by the success of his song &quot;Here Comes My Baby,&quot; which was recorded by the Tremeloes and entered the British charts in February, reaching the Top Five. (In America, it peaked just outside the Top Ten.)\n\n  Stevens' third single, &quot;I'm Gonna Get Me a Gun,&quot; entered the British charts in March and reached the Top Ten, preceded by his debut album, Matthew &amp; Son, also a Top Ten entry. In May, P.P. Arnold got into the British charts with Stevens' composition &quot;The First Cut Is the Deepest,&quot; peaking in the Top 20. (Ten years later, Rod Stewart topped the U.K. charts and reached the U.S. Top 20 with his revival of the song. Sheryl Crow revived it for an American Top 20 hit in 2003.) Stevens' fourth single, &quot;A Bad Night,&quot; was in the charts in August, peaking in the Top 20. That was a disappointment, considering his recent success, and his next records did even worse: &quot;Kitty,&quot; his fifth single, barely made the charts in December, while New Masters, his second album, didn't chart at all. Even worse, in March 1968, Stevens contracted tuberculosis and was hospitalized for three months. He spent a year recuperating. After the failure of an intended comeback single, &quot;Where Are You,&quot; released in July 1969, he parted ways with Deram.\n\n  Disillusioned by his experience in the music business, Stevens began writing more personal, introspective material. He signed a new contract with Island Records and released his third album, Mona Bone Jakon, in April 1970. Drawn from the album, the single &quot;Lady D'Arbanville&quot; was issued in June 1970 and became his third Top Ten hit in the U.K., causing Mona Bone Jakon to chart modestly in July. Stevens' talent as a songwriter for others had not deserted him; in August, Jimmy Cliff entered the British charts with his composition &quot;Wild World,&quot; reaching the Top Ten. With a backlog of material, Stevens had a second Island album, Tea for the Tillerman, out in November; it made the U.K. Top 20. In America, where his Island recordings were licensed to A&amp;M Records, Mona Bone Jakon had not charted, but Tea for the Tillerman marked his American LP chart debut in February 1971, followed shortly by the single release of his own recording of &quot;Wild World,&quot; which appeared on the album; it peaked in the Top 20. With that, Stevens suddenly became a major star in the U.S. Tea for the Tillerman reached the Top Ten and went gold; Mona Bone Jakon finally reached the charts (it was belatedly certified gold in 1976); and Deram reissued Matthew &amp; Son and New Masters as a two-LP set, which also charted. Stevens was hailed as one of the most important figures in the currently popular folk-rock singer/songwriter trend, along with James Taylor, Carole King, and others.\n\n  In June 1971, Stevens released a new single, &quot;Moon Shadow,&quot; which made the Top 40 in the U.S. and the U.K. This was followed in September by &quot;Peace Train,&quot; which hit the pop Top Five and reached number one in the easy listening charts in the U.S., just in advance of Stevens' fifth album, Teaser and the Firecat. An immediate gold-record seller, the LP just missed the top of the U.S. charts and hit the Top Five in the U.K. In addition to &quot;Moon Shadow&quot; and &quot;Peace Train,&quot; it contained &quot;Morning Has Broken,&quot; an adaptation of a hymn, which became Stevens' second consecutive easy listening number one and reached the pop Top Ten on both sides of the Atlantic. Meanwhile, Deram compiled another collection of juvenilia, Very Young and Early Songs, which peaked in the U.S. Top 100 in early 1972, as did a belated American release of the single &quot;Where Are You.&quot;\n\n  Stevens contributed new and old songs to the film Harold and Maude, a black comedy that became a cult success after its release in 1972, though no soundtrack album was released. (The previously unreleased songs from the film finally turned up on his album Footsteps in the Dark: Greatest Hits, Vol. 2 in 1984.) He also toured and worked on his sixth album, Catch Bull at Four. A slightly harder-rocking effort, the LP, released in October 1972, represented Stevens' commercial peak: it hit number one in the U.S. and just missed duplicating that feat in the U.K., earning gold-record status immediately. Different singles from the album were released in the two countries, in the U.S. &quot;Sitting&quot; and in the U.K. &quot;Can't Keep It In&quot;; both reached the Top 20.","torrent":{"xt":"urn:btih:ec68d83777d6f31ebbf5b5c0be9031191b5ece41","amp;dn":"Cat+Stevens+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec68d83777d6f31ebbf5b5c0be9031191b5ece41","infoHashBuffer":{"type":"Buffer","data":[236,104,216,55,119,214,243,30,187,245,181,192,190,144,49,25,27,94,206,65]},"announce":[],"urlList":[]}}