{"title":"MAGIC SAM BLUES BAND - WEST SIDE SOUL[TNTVILLAGE]","uid":5074122,"size":236864730,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed63bb8c803d771a7b0ddc0ec83554cff1db2611&amp;dn=MAGIC+SAM+BLUES+BAND+-+WEST+SIDE+SOUL%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":7,"time":1251667890,"description":"[b][color=blue]MAGIC SAM BLUES BAND [/color]\n\n[color=red] WEST SIDE SOUL[/b][/color]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n[img]http://img444.imageshack.us/img444/1333/magic.jpg[/img]\n\n[b][color=green]::-&gt;DATI ALBUM&lt;-::[/color][/b]\n\n[b]Titolo:[/b] WEST SIDE SOUL\n[b]Data Uscita:[/b] 1991\n[b]Genere:[/b] BLUES\n[b]Etichetta:[/b] DELMARK\n\n\n[b][color=green]::-&gt;TRACKLIST&lt;-::[/color][/b]\n\n1. That's All I Need\n2. I Need You So Bad\n3. I Feel So Good (I Wanna Boogie)\n4. All of Your Love\n5. I Don't Want No Woman\n6. Sweet Home Chicago\n7. I Found a New Love\n8. Every Night and Every Day\n9. Lookin' Good (Instrumental)\n10. My Love Will Never Die\n11. Mama, Mama-Talk to Your Daughter\n12. I Don't Want No Woman (Alternate)\n\n\nAltri Musicisti oltre a Magic Sam - Chitarra\n\t\nStrumento\nEarnest Johnson\n\t\nBasso\nOdie Payne\n\t\nBatteria\nStockholm Slim\n\t\nPiano\nMighty Joe Young\n\t\nChitarra\nOdie Payne III\n\t\nBatteria nei Brani 1, 3 e 8\nMack Thompson\n\t\nBasso nei Brani 1, 3 e 8\n[/b]\n\n[b][color=green]::-&gt;CHI ERA MAGIC SAM&lt;-::[/color][/b]\n\nMagic Sam, uno dei nomi di punta della chitarra blues nella Chicago degli anni cinquanta e sessanta, pur avendo esercitato una importante influenza su molti \n\nchitarristi affermatisi nei decenni successivi, sta ingiustamente passando un po' nel dimenticatoio, anche a causa della brevitÃƒÂ  della sua carriera, \n\ninterrotta bruscamente a dicembre del 1969, per l'improvvisa morte dovuta ad un attacco di cuore malandrino. \nQuesta tendenza a dimenticarsi di Samuel Maghett, vero nome di Magic Sam, non ÃƒÂ© comunque giustificabile e vale la pena mettere un po' di ordine fra la poche \n\nproposte discografiche attualmente disponibili. \nNato il 14 febbraio 1937 a Grenada, nel cuore dello stato del Mississippi, il giovanissimo Sam Maghett si trasferÃƒÂ¬ a Chicago nel 1950 e riuscÃƒÂ¬ lentamente a \n\nfarsi strada negli innumerevoli club che caratterizzavano e caratterizzano tuttora la cittÃƒÂ . Influenze importanti furono il vicino di casa Syl Johnson e \n\nl'armonicista Shakey Jake, da molti citato come lo zio del chitarrista anche se questa parentela non ÃƒÂ¨ mai stata acclarata ufficialmente. \nAll'inizio il chitarrista si faceva chiamare Good Rockin' Sam, ma, dietro suggerimento del bassista Mack Thompson, fratello di Syl Johnson, decise di \n\ncambiare il proprio nome d'arte in Magic Sam, piÃƒÂ¹ o meno all'epoca delle sue prime registrazioni per la Cobra di Eli Toscano, avvenute nel 1957. Subito venne \n\nraggiunto un buon successo con il brano &quot;All Your Love&quot;, caratterizzato da una linea melodica particolarmente profumata che in qualche modo continueremo a \n\nritrovare durante tutta la sua breve carriera, camuffata e leggermente modificata in altri celebri brani come &quot;Easy Baby&quot; e &quot;Everything Gonna Be Allright&quot;. \nPiÃƒÂ¹ o meno nello stesso periodo un altro giovane chitarrista, Otis Rush, stava percorrendo un tragitto simile, ponendo le basi per una importante evoluzione \n\nnel blues elettrico, caratterizzata da un approccio ritmico meno duro e da una vocalizzazione piÃƒÂ¹ accentuata delle frasi solistiche della chitarra, spesso \n\nutilizzata con l'aggiunta del tremolo nella componente amplificata. \nAssieme a Buddy Guy, portatore di uno stile ritmicamente e melodicamente piÃƒÂ¹ duro e ritmato, spesso caratterizzato da funambolismi scoppiettanti, i due \n\nchitarristi della Cobra riuscirono a dare una forte spinta in avanti alla transizione che stava avvenendo e che muoveva dal blues elettrico sviluppatosi \n\nnell'immediato dopoguerra al blues moderno che tuttora forma una delle spine dorsali della musica afro-americana. \nLa compagnia discografica di Toscano fallÃƒÂ¬ miseramente e Magic Sam decise di affidarsi alla Chief di Mel London, una scelta non particolarmente felice, dal \n\npunto di vista del business, che oltretutto concise con un periodo piuttosto complicato della vita del chitarrista uscito ingloriosamente dal periodo di leva \n\ncon l'accusa di diserzione. \nL'unico brano col quale il nostro virtuoso delle sei corde riuscÃƒÂ¬ a farsi notare nei primissimi anni sessanta fu una versione vivace del brano di Fats Domino \n\n&quot;Every Night About This Time&quot;. Malgrado la scarsa attivitÃƒÂ  in studio di registrazione, Magic Sam continuava incessantemente a suonare nei piccoli club e nei \n\nblues bar di Chicago. Una ottima testimonianza di tutto questo la troviamo nell'album postumo Live della Delmark che nella prima parte contiene registrazioni \n\nrealizzate all'Alex Club di Chicago nell'ottobre del 1963 e nel febbraio dell'anno successivo. La qualitÃƒÂ  audio non ÃƒÂ¨ straordinaria, ma il blues che \n\nascoltiamo ÃƒÂ¨ una musica che chiaramente proviene da un artista moderno e innovativo che sta cercando di portare avanti in un modo originale e appassionato la \n\ntradizionale forma musicale dei neri americani. \nDopo successivi alti e bassi che lo vedono comunque impegnato anche al Fillmore e all'Avalon Ballroom di San Francisco e alla Royal Albert Hall di Londra, \n\nMagic Sam approda finalmente alla etichetta Delmark, e incide i due album in studio che sono certamente i suoi capolavori. \nSi parte nel 1967 con West Side Soul, uno degli album che meglio rappresenta il blues elettrico degli anni sessanta. Undici brani eccellenti che lasciano un \n\nsegno profondo anche nei primi chitarristi bianchi che sia negli States che in Inghilterra stanno cercando di esprimere le tensioni e la voglia di rompere le \n\nbarriere del perbenismo usando la musica come grimaldello. \nL'album contiene un rifacimento di &quot;All Your Love&quot; qui citata piÃƒÂ¹ correttamente con il titolo &quot;All of Your Love&quot;, anche per non confonderla con la &quot;All Your \n\nLove&quot; di Otis Rush che negli stessi anni Eric Clapton aveva portato al successo alla corte di John Mayall nel celeberrimo album Bluesbreakers. \nL'album vede Magic Sam alla testa di un quintetto che comprende il chitarrista ritmico Mighty Joe Young, il pianista Stockholm Slim, il fido bassista Mack \n\nThompson (che si alterna con Earnest Johnson)e il batterista Odie Payne, III. \nOltre al brano giÃƒÂ  citato segnaliamo la strumentale &quot;Lookin' Good&quot;, l'iniziale &quot;That's All I Need&quot;, &quot;I Don't Want No Woman&quot; (che nella riedizione in CD ÃƒÂ¨ \n\nproposta anche in una versione alternativa) e la spiritata &quot;I Feel So Good (I Wanna Boogie)&quot;. Una bella e personale versione di &quot;Sweet Home Chicago&quot; dimostra \n\nperfettamente come il chitarrista fosse in grado di plasmare in modo davvero originale un brano tradizionale, eseguito da migliaia di altri chitarristi. \nL'anno successivo il chitarrista porta in studio la stessa band con l'aggiunta del saxofonista Eddie Shaw e con il pianista Lafayette Leake al posto di \n\nStockholm Slim, mantenendo Mack Thompson al basso. L'album esce col titolo Black Magic ed ÃƒÂ¨ un altro clamoroso successo in un'epoca ormai dominata dai nuovi \n\nchitarristi emergenti nel mondo del rock, fra i quali spicca il grandissimo Jimi Hendrix, decisamente piÃƒÂ¹ vicino a Buddy Guy che non a Magic Sam. \nIn questo album abbiamo altri dieci brani di eccellente fattura e in questo caso spiccano &quot;Easy, Baby&quot;, &quot;It's All Your Fault&quot; che sembra fare un po' il verso \n\na B.B. King e una versione molto interessante di &quot;San-Ho-Zay&quot; di Freddy King. \nSembra che ormai la strada del successo sia completamente spianata: arrivano ingaggi nei Festival piÃƒÂ¹ prestigiosi, si programmano tour europei, la Stax si \n\npropone come casa discografica per un grande lancio, non appena il contratto con la Delmark sarÃƒÂ  completato. Ma il destino crudele non prevede che tutto ciÃƒÂ² \n\nsi avveri. Il primo giorno del mese di dicembre del 1969 Sam Maghett, alla giovane etÃƒÂ  di 32 anni, muore improvvisamente per un attacco di cuore, che \n\ncomunque era stato in qualche modo preannunciato dalla salute non particolarmente florida che aveva caratterizzato gli ultimi anni della breve vita di Magic \n\nSam. \nNel 1981 la Delmark acquisÃƒÂ¬ da un paio di grandi appassionati e immise sul mercato, in un doppio album intitolato Live (ora disponibile in un unico CD che \n\nriporta integralmente tutto il doppio vinile), le registrazione provenienti dall'Alex Club (di cui abbiamo giÃƒÂ  dato cenno) e quelle del Festival di Ann Arbor \n\ndell'agosto 1969, l'ultimo grande concerto di Magic Sam e, a giudizio di tutti gli appassionati, una delle migliori prove lasciate dal chitarrista di \n\nGrenada. Anche qui le registrazioni non sono di qualitÃƒÂ  audio eccelsa, ma riescono a rendere benissimo la grande maturitÃƒÂ  raggiunta dal chitarrista. \nMalgrado l'importanza di questo Festival, che allora era un vero avvenimento nella emergente scena musicale giovanile, Magic Sam sembrÃƒÂ² snobbare un poco \n\nl'occasione e arrivÃƒÂ² all'ultimissimo minuto, con gli organizzatori giÃƒÂ  in paranoia per l'immotivato e non annunciato ritardo. E per di piÃƒÂ¹ si presentÃƒÂ² \n\naccompagnato solo dal bassista Bruce Barlow, senza alcuna traccia del previsto batterista. Un veloce giro nel backstage permise a Magic Sam di individuare in \n\nSam Lay (giÃƒÂ  con Muddy Waters e con Paul Butterfield) un degno compare da proporre alla batteria e l'improvvisato trio salÃƒÂ¬ sul palco per un set che esaltÃƒÂ² \n\nil numerosissimo pubblico presente. Vennero riproposti brani provenienti dai due album in studio degli anni immediatamente precedenti e il formato del trio \n\naccentuÃƒÂ² ulteriormente la sensazione che la eccellente padronanza strumentale del chitarrista e la sua splendida voce fossero elementi importanti destinati a \n\nfare da fondamenta per una carriera di grande spessore. Come si diceva il destino non era d'accordo e questa esibizione rimase come ultima perla di una \n\ncollana incompiuta.\nNegli anni novanta la Delmark ha proposto altri due ottimi album che completano la breve discografia di questo musicista.\nDapprima ÃƒÂ¨ stato proposto Give Me Time, un bellissimo ritratto domestico di Sam Maghett, registrato nella sua cantina, da solo, alle prese con la chitarra \n\nelettrica e con i rumori della lavatrice e dei bambini che giocano e chiacchierano in lontananza. Una sorta di anello mancante molto intimo fra il blues dal \n\nquale il nostro eroe aveva preso ispirazione e gli eccellenti risultati molto personali che stava ottenendo negli album in studio e nelle esibizioni dal \n\nvivo. \nLe registrazioni sono del gennaio 1968 e in un brano si aggiunge Eddie Boyd alla voce. Vengono proposti brani dello stesso chitarrista ma anche &quot;I Can't Quit \n\nYou Baby&quot; dell'amico-rivale Otis Rush, &quot;Sweet Little Angel&quot; di B.B. King e &quot;I'm So Glad&quot; di Skip James, brano che i Cream stavano portando al successo nello \n\nstesso periodo. \nPoi piÃƒÂ¹ recentemente ÃƒÂ¨ arrivato The Magic Sam Legacy che mette assieme registrazioni inedite effettuate durante le sedute per West Side Soul e per Black \n\nMagic, con l'aggiunta di alcuni brani provenienti invece da sedute precedenti di un paio d'anni. Sono tredici brani che ci aiutano ad avere una visione \n\nancora piÃƒÂ¹ ampia di quella che fu la grande arte di Magic Sam e ci invogliano a riscoprire anche tutte le altre registrazioni che finalmente sono \n\ndisponibili. \nCome si diceva all'inizio, un musicista di grande importanza per il blues moderno, un musicista dotato di ottimi mezzi tecnici messi al servizio di una \n\nnotevole urgenza espressiva, una vera fonte di ispirazione per tutti i chitarristi blues successivi, specialmente quelli piÃƒÂ¹ interessati ad esplorare anche \n\nla variante piÃƒÂ¹ 'dolce' e rilassata, da Peter Green a Mick Taylor, da Ronnie Earl a Robert Cray. Quest'ultimo, nella sua fase iniziale in particolare, era \n\nchiaramente influenzato dal chitarrista di Grenada che portÃƒÂ² una ventata di dolce ma elettrico profumo del sud nella fredda cittÃƒÂ  aggrappata alle rive del \n\nlago Michigan. \nMaurizio Comandini \n\n[b][color=green]::-&gt;DATI TECNICI&lt;-::[/color][/b]\n\n- APE + CUE\n- COVER+BOOKLET\n\n[color=RED][b]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:ed63bb8c803d771a7b0ddc0ec83554cff1db2611","amp;dn":"MAGIC+SAM+BLUES+BAND+-+WEST+SIDE+SOUL%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed63bb8c803d771a7b0ddc0ec83554cff1db2611","infoHashBuffer":{"type":"Buffer","data":[237,99,187,140,128,61,119,26,123,13,220,14,200,53,84,207,241,219,38,17]},"announce":[],"urlList":[]}}