{"title":"Scary Movie 1 t/m 4 NL subs","uid":5544720,"size":2935818240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed9ebde511dd2fe41c6d6183f323b53277f5e94f&amp;dn=Scary+Movie+1+t%2Fm+4+NL+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Koedje","files":-1,"time":1273345576,"description":"Scary Movie 1 t/m 4 NL subs ingebakken.\n\n\n\n\nScary Movie 1:\n\n\nOp een Halloween-avond rijden Cindy Campbell en vijf vrienden per ongeluk een man aan. Ze besluiten om het ongeluk geheim te houden, maar een jaar later wordt het zestal achterna gezeten door een gemaskerde seriemoordenaar, die wrede spelletjes met hen wil spelen. Het begint bij de brute moord op Drew Decker en het duurt niet lang voor de moordenaar achter Cindy en de rest aangaat. Deze zetten alles op alles om te overleven, maar de moordenaar geeft niet makkelijk op; hij heeft namelijk een behoorlijke grote kennis op het gebied van horrorfilms.\n\n\nScary Movie 2:\n\nCindy Campbell en de andere overlevenden uit de eerste film zijn verder gegaan met hun leven en proberen de gruwelijke gebeurtenissen te vergeten. Dan worden ze plotseling uitgenodigd door professor Oldman, die onderzoek doet naar Hell House, een groot spookhuis met een geheimzinnig verleden. De jongeren denken in eerste instantie dat het gaat om een onderzoek naar slapeloosheid, maar als de nacht begint, ontdekken ze de angstaanjagende waarheid.\n\n\nScary Movie 3:\n\n\nCindy is nu televisiejournalist en maakt een reportage over graancirkels op de boerderij van Tom (Sheen), die zijn vrouw in een auto-ongeluk heeft verloren. Ook wordt ze verliefd op Toms broer George (Rex), een witte rapper. Cindy komt erachter dat er een videoband in circulatie is, en iedereen die de band kijkt gaat na zeven dagen dood. Het is dus aan Cindy, Tom, George en de president (Leslie Nielsen) om de wereld te redden voordat deze band op tv komt.\n\nScary Movie 4:\n\n\nWanneer de aarde wordt bestormd door gigantische tri-pods, is niemand meer veilig. Cindy Campbell probeert de aarde te redden, maar ze heeft meer aan haar hoofd. Ze is namelijk bezig te achterhalen wat er aan de hand is met een jongetje uit 'Grudge house' waar ze op moet passen. De problemen stapelen zich pas echt op wanneer ze slachtoffer wordt van zieke spelletjes van een moordenaar.","torrent":{"xt":"urn:btih:ed9ebde511dd2fe41c6d6183f323b53277f5e94f","amp;dn":"Scary+Movie+1+t%2Fm+4+NL+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9ebde511dd2fe41c6d6183f323b53277f5e94f","infoHashBuffer":{"type":"Buffer","data":[237,158,189,229,17,221,47,228,28,109,97,131,243,35,181,50,119,245,233,79]},"announce":[],"urlList":[]}}