{"title":"ABC of Colorectal Cancer, 2E [PDF] [StormRG]","uid":11036382,"size":4593509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edc9b273db9ca51e993c3a0b028c527afcec90f3&amp;dn=ABC+of+Colorectal+Cancer%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":2,"time":1410800665,"description":"Author: Annie Young (Editor), Richard Hobbs (Editor), David Kerr (Editor)\nPaperback: 88 pages\nPublisher: BMJ Books; 2 edition (November 14, 2011)\nLanguage: English\nISBN-10: 1405177632\nISBN-13: 978-1405177634\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nColorectal cancer is a common cause of morbidity and mortality in which prevention, screening and early detection are vital. Beginning with the patient perspective and following the patient pathway, this new second edition covers epidemiology and prevention, screening programmes, decision support networks, the role of primary care, and supportive care for patients with colorectal cancer.\nThe ABC of Colorectal Cancer provides the core knowledge on clinical genetics, diagnosis, imaging, therapy and surgery options and the latest evidence based guidelines for treating and managing colorectal cancer patients within the multidisciplinary team. Highly illustrated and accessible, it covers the full spectrum of the disease to provide the basis to make a real difference to clinical management.\n\nThis is an invaluable practical guide for the non-specialist on all aspects of colorectal cancer, and is ideal for general practitioners, junior doctors, nurses and allied health professionals.","torrent":{"xt":"urn:btih:edc9b273db9ca51e993c3a0b028c527afcec90f3","amp;dn":"ABC+of+Colorectal+Cancer%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc9b273db9ca51e993c3a0b028c527afcec90f3","infoHashBuffer":{"type":"Buffer","data":[237,201,178,115,219,156,165,30,153,60,58,11,2,140,82,122,252,236,144,243]},"announce":[],"urlList":[]}}