{"title":"PlayerPro 3.04 + DSP &amp; Widget Pack","uid":11707631,"size":14187631,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:eddbb90fcc7c47cb67f2da8acd8fe31ad9179cdf&amp;dn=PlayerPro+3.04+%2B+DSP+%26amp%3B+Widget+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Jallentino","files":5,"time":1424190461,"description":"Player Pro has a beautiful, fast and intuitive interface, as well as c powerful audio configuration options.\n\nKey features:\nBrowse and play your music by albums, artists, genres, songs, playlists, folders, and album artists.\nMusic and video browser / player.\nChoose an album cover, artist pictures and genre illustrations from various sources: the Internet, the Gallery app, ID3-tags (embedded artwork), or album folder.\nChange the user interface of the player, install one of the 20+ available skins.\nCustomize the layout, choosing between Grid or List views.\nView the lyrics of built-in ID3 tags of music files.\nMixing audio effects for Android&gt; 2.3 devices: 5 band graphic equalizer with default / customizable presets, stereo widening effect, reverb effects (large hall, medium hall, plate, small room, medium room, large room), bass boost effect, volume control .\nFree additional DSP plugin 10-band graphic equalizer with 15 default / customizable presets, control PRE-AMP, BASS BOOST control, monitoring stereo widening, left-right volume control. Gapless playback. Automatic / manual CROSSFADE. Replay Gain. Audio Limiter. Go to Settings&gt; Audio and select &quot;Download DSP pack&quot; to install the free plugin.\nMusic statistics and smart playlists: Recently added, Top rated, Most Viewed, Recently played, Least played. Build additional custom playlists using the Smart Playlist Editor and many different criteria it offers: album, artist, genre, title, play / skip counts, last played / added, rating, is a podcast, duration, year, way file, etc. All smart playlists AUTO-UPDATE.\nImport and export music history and ratings from your favorite desktop music player.\nSelecting a folder Music.\nSelection of 2 lock screen widgets with many customization options: unlock slider, sound Toggler, skip tracks using volume buttons, gestures, background selection, controls selection, time display, skin selection ...\nThe choice of 5 different widgets, home screen (4x1, 2x2, 3x3, 4x4, 4x2). All widgets are customizable and skinnable: 6 different skins available, the ability to display artist picture instead of album artwork, option to display estimates the shuffle / repeat controls etc.\nSupport Status Notification: display album artwork, title, album and artist, play / pause, skip forward and stop CONTROLS (ICS) in the status notification.\nMost popular SCROBBLERS supported.\nSleep timer with damping.\nText notifications, album / artist painting on your favorite social networks.\nSupport headset. Switch long press and double / triple press actions.\nA library with a wide range of search. Search support voice control\nSwipe gestures (player: swipe album art to skip songs, browsers: swipe left to play next, swipe right to play last).\nFunction Shake: shake the phone to move to the next song, the next / previous song (eg: shake top to bottom or bottom to top to play next / previous song).\n\nChanges in version 3.04:\nComplete revamp of the UI\nSupport of the action bar\nMulti selection mode and item contextual menus\nNavigation drawer\nFavorites\nAlbum artwork gestures and quick actions\nRedesign of the now playing queue\nRedesign of the video browser\nAnd many new features ...\nUpdated translations\nA few bug fixes","torrent":{"xt":"urn:btih:eddbb90fcc7c47cb67f2da8acd8fe31ad9179cdf","amp;dn":"PlayerPro+3.04+%2B+DSP+%26amp%3B+Widget+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eddbb90fcc7c47cb67f2da8acd8fe31ad9179cdf","infoHashBuffer":{"type":"Buffer","data":[237,219,185,15,204,124,71,203,103,242,218,138,205,143,227,26,217,23,156,223]},"announce":[],"urlList":[]}}