{"title":"J.R.R. Tolkien - The Hobbit - NPR Radio Drama [96]","uid":7869685,"size":183775433,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eea5823767c4f93302ab1ce5976aa97928ad5350&amp;dn=J.R.R.+Tolkien+-+The+Hobbit+-+NPR+Radio+Drama+%5B96%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"rambam1776","files":-1,"time":1354164801,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/The_Lord_of_the_Rings_(1979_radio_series)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/The_Lord_of_the_Rings_(1979_radio_series)&lt;/a&gt;\n\nIn 1979 the US National Public Radio broadcast a radio dramatization of J. R. R. Tolkien's The Lord of the Rings. It was produced by The Mind's Eye and has since been made available by several different companies.\n\nIt is sometimes confused with the later BBC production in 1981, but is distinguished by the fact that the most widely circulated US edition comes in a wooden box, whether on compact discs or cassette tapes. The Mind's Eye cast for The Hobbit (a separate production) recorded their tracks separately (unlike the BBC production which, like most British radio serials, assembled the cast to record their dialogue together) but the adaptation for The Lord of the Rings was recorded en group and received much praise as being better than the BBC productions (&quot;a masterpiece&quot; (The Courier), &quot;spirited production, stirring music&quot; (Washington Post&quot;, &quot;The best available&quot;(Booklist}.\n\nThe cast includes Ray Reinhardt (Bilbo), James Arrington (Frodo), Pat Franklyn (Merry), Mac McCaddon (Pippin), Lou Bliss (Sam), Bernard Mayes (Gandalf), Gail Chugg (Narrator), Bernard Mayes (Tom Bombadil), and Tom Luce (Strider/Aragorn). Additionally, Franklyn, McCaddon, Chugg, Reinhardt, Bob Lewis, John Vickery, Erik Bauersfeld and Carl Hague were credited for &quot;additional voices&quot;.\n\nThe radio script of The Lord of the Rings was written by Bernard Mayes, was an abridged version of the book, and emphasized dialogue over description. The broadcasts totaled more than 11 hours. The budget was small and production time was limited. The cast were local theater players, and the production used stock music and homemade sound effects. The script of The Lord Of The Rings is notable for including the Tom Bombadil scenes, unlike most other adaptations of the book.\n\nRadio drama was a rarity in the United States at that time, and this production was popular at the time of its broadcast. It was later overshadowed by the BBC radio dramatization. The Mind's Eye also produced a six-hour adaptation of The Hobbit.\n\nThe Mind's Eye adaptation has also been identified with Soundelux, and, most recently, with Highbridge. The name changes correspond to the companies which owned the rights at different times.\n\nThe newer editions of the drama on compact disc and MP3 have a somewhat shorter running time than the original cassettes, omitting or condensing a considerable amount of dialogue and narration.","torrent":{"xt":"urn:btih:eea5823767c4f93302ab1ce5976aa97928ad5350","amp;dn":"J.R.R.+Tolkien+-+The+Hobbit+-+NPR+Radio+Drama+%5B96%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea5823767c4f93302ab1ce5976aa97928ad5350","infoHashBuffer":{"type":"Buffer","data":[238,165,130,55,103,196,249,51,2,171,28,229,151,106,169,121,40,173,83,80]},"announce":[],"urlList":[]}}