{"title":"The Inner Circle by Brad Meltzer (ePUB/Mobi)","uid":7811596,"size":4570676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef08e525dcb142c929ab577d57c435e83e9c550b&amp;dn=The+Inner+Circle+by+Brad+Meltzer+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"azizex666","files":-1,"time":1352507186,"description":"There are stories no one knows. Hidden stories. I love those stories. And since I work in the National Archives, I find those stories for a living.\n\nBeecher White, a young archivist, spends his days working with the most important documents of the U.S. government. He has always been the keeper of other people's stories, never a part of the story himself...\n\nUntil now.\n\nWhen Clementine Kaye, Beecher's first childhood crush, shows up at the National Archives asking for his help tracking down her long-lost father, Beecher tries to impress her by showing her the secret vault where the President of the United States privately reviews classified documents. After they accidentally happen upon a priceless artifact - a 200 hundred-year-old dictionary that once belonged to George Washington, hidden underneath a desk chair, Beecher and Clementine find themselves suddenly entangled in a web of deception, conspiracy, and murder.\n\nSoon a man is dead, and Beecher is on the run as he races to learn the truth behind this mysterious national treasure. His search will lead him to discover a coded and ingenious puzzle that conceals a disturbing secret from the founding of our nation. It is a secret, Beecher soon discovers, that some believe is worth killing for.\n\nGripping, fast-paced, and filled with the fascinating historical detail for which he is famous, THE INNER CIRCLE is a thrilling novel that once again proves Brad Meltzer as a brilliant author writing at the height of his craft\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                              Published - January 11th 2011\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:ef08e525dcb142c929ab577d57c435e83e9c550b","amp;dn":"The+Inner+Circle+by+Brad+Meltzer+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef08e525dcb142c929ab577d57c435e83e9c550b","infoHashBuffer":{"type":"Buffer","data":[239,8,229,37,220,177,66,201,41,171,87,125,87,196,53,232,62,156,85,11]},"announce":[],"urlList":[]}}