{"title":"OCP: Oracle Certified Professional Java SE 8 Programmer II","uid":14559791,"size":14084756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef25aef14766483a29b06553a6f8ce51b060a114&amp;dn=OCP%3A+Oracle+Certified+Professional+Java+SE+8+Programmer+II&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":1,"time":1462728915,"description":"OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide: Exam 1Z0-809\r\n\r\nFrom the Back Cover\r\nCovers 100% of exam objectives, including advanced class design, functional programming, concurrency, JDBC, and much more...\r\n\r\nIncludes online interactive learning environment with:\r\n\r\n+3 custom practice exams\r\n\r\n+More than 250 electronic flashcards\r\n\r\n+Searchable key term glossary\r\n\r\nYour Complete Guide to preparing for OCP Exam 1Z0-809\r\n\r\nThe OCP, Oracle Certified Professional Java SE 8 Programmer II Study Guide is your one-stop resource for complete coverage of Exam 1Z0-809. This Sybex Study Guide covers 100% of exam objectives and guides you through the process of re-learning key Java APIs, now that nearly every framework in Java 8 has been updated to include lambda expressions and streams. You'll prepare for the exam smarter and faster with Sybex thanks to superior content including assessment tests that check exam readiness, key topic exam essentials, an appendix custom tailored for those taking the upgrade Exams 1Z0-810 or 1Z0-813, and much more. Reinforce what you have learned with the Sybex online learning environment and test bank, accessible across multiple devices. Get prepared for the OCP exam with Sybex.\r\n\r\nCoverage of 100% of all exam objectives in this Study Guide means you'll be ready for:\r\n\r\nCreating and applying lambda expressions\r\nDemonstrating functional programming competence\r\nApplying Object-Oriented design principles and design patterns\r\nWorking with generics, collections, and class design\r\nInheriting abstract classes and interfaces\r\nDealing with exceptions and assertions\r\nWorking with IO, NIO.2, JDBC, threads, and concurrency\r\nHandling advanced strings and localization\r\nInteractive learning environment\r\n\r\nTake your exam prep to the next level with Sybex's superior interactive online study tools. To access our learning environment, simply visit http://sybextestbanks.wiley.com, type in your unique PIN, and instantly gain access to:\r\n\r\nInteractive test bank with 3 bonus practice exams. Practice exams help you identify areas where further review is needed. Get more than 90% of the answers correct, and you're ready to take the certification exam. 180 questions total!\r\nMore than 250 Electronic Flashcards to reinforce learning and last minute prep before the exam\r\nComprehensive glossary in PDF format gives you instant access to the key terms so you are fully prepared\r\nAbout the Author\r\nJeanne Boyarsky, OCA/OCP 8, has worked as a Java developer for a bank in NYC for 13 years where she develops, mentors and conducts training. In her free time, she is a senior moderator at CodeRanch and works on the forum code base. Scott Selikoff, OCA/OCP 8, has been a professional Java Enterprise developer for over 15 years. He currently operates Selikoff Solutions, LLC, which provides software consulting services to businesses in the tri-state New York City area.\r\n\r\nPaperback: 720 pages\r\nPublisher: Sybex; 1 edition (December 14, 2015)\r\nLanguage: English","torrent":{"xt":"urn:btih:ef25aef14766483a29b06553a6f8ce51b060a114","amp;dn":"OCP%3A+Oracle+Certified+Professional+Java+SE+8+Programmer+II","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef25aef14766483a29b06553a6f8ce51b060a114","infoHashBuffer":{"type":"Buffer","data":[239,37,174,241,71,102,72,58,41,176,101,83,166,248,206,81,176,96,161,20]},"announce":[],"urlList":[]}}