{"title":"Mastermind How to Think Like Sherlock Holmes.mp3","uid":8320697,"size":172957563,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:efacad5a6653e8ac11e4da5313e8d69d69cbbe48&amp;dn=Mastermind+How+to+Think+Like+Sherlock+Holmes.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"drhouse_","files":1,"time":1364663580,"description":"Mastermind: How to Think Like Sherlock Holmes \nAuthor: Maria Konnikova\nYear: 2013 \nLanguage: English\nFormat: MP3\nTime: 9 hours\nTTS: Rachel22k (British Female)\nSize: 164MB\nUploader: drhouse\n\nThis is an unofficial high-quality TTS audiobook conversion of the novel. Beginning at the Prelude, this is a perfect accompaniment to the novel or for enjoying on its own.\n\nNo fictional character is more renowned for his powers of thought and observation than Sherlock Holmes. But is his extraordinary intellect merely a gift of fiction, or can we learn to cultivate these abilities ourselves, to improve our lives at work and at home?\n\nWe can, says psychologist and journalist Maria Konnikova, and in Mastermind she shows us how. Beginning with the &quot;brain attic&quot;--Holmes's metaphor for how we store information and organize knowledge--Konnikova unpacks the mental strategies that lead to clearer thinking and deeper insights. Drawing on twenty-first-century neuroscience and psychology, Mastermind explores Holmes's unique methods of ever-present mindfulness, astute observation, and logical deduction.\n\nIn doing so, it shows how each of us, with some self-awareness and a little practice, can employ these same methods to sharpen our perceptions, solve difficult problems, and enhance our creative powers. For Holmes aficionados and casual readers alike, Konnikova reveals how the world's most keen-eyed detective can serve as an unparalleled guide to upgrading the mind.","torrent":{"xt":"urn:btih:efacad5a6653e8ac11e4da5313e8d69d69cbbe48","amp;dn":"Mastermind+How+to+Think+Like+Sherlock+Holmes.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efacad5a6653e8ac11e4da5313e8d69d69cbbe48","infoHashBuffer":{"type":"Buffer","data":[239,172,173,90,102,83,232,172,17,228,218,83,19,232,214,157,105,203,190,72]},"announce":[],"urlList":[]}}