{"title":"Get The Life You Want - Richard Bandler","uid":4583319,"size":6120315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f04c8f0a611397459bbf205a57998c8ee784cb81&amp;dn=Get+The+Life+You+Want+-+Richard+Bandler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"SupaFant","files":-1,"time":1229520494,"description":"In one sentence: The first Easy To Read Bandler's Book :-)\n\n'Richard Bandler has made an extraordinary contribution to people's lives across the planet.  His highly powerful personal change techniques have enabled millions around the world to feel better about themselves and improve their lives. He gets results that nobody else can.  Read Richard Bandler's Guide to Personal Change: It will change your life.'\n\n-- Paul McKenna, Ph.D., coauthor of I Can Make You Thin and host of TLC's I Can Make You Thin\n\n\nProduct Description\n\nWhen people and therapists alike have a problem they can't fix, they call Richard Bandler because he delivers--often with miraculous results. Hailed as one of the greatest geniuses in the field of personal change, and the father of Neuro-Linguistic Programming, Richard Bandler has helped tens of thousands of people around the globe rid themselves of 'incurable' phobias, fears, anxieties, addictions, negative habits, and past traumas often in a single session. Get the Life You Want is Richard Bandler at his best, sharing his remarkable insights, his controversial signature wit, and more than thirty-five time-tested NLP techniques that will bring about quick and lasting change in every area of your life, from breaking free of toxic or non-productive relationships, to delivering business presentations without a knot in your stomach, to quitting smoking for good. By putting Bandler's techniques into practice, you can literally change your brain chemistry without expensive drugs or endless therapy sessions; most of all, you can finally learn how to run your own brain instead of rehashing the same problems. You'll discover: How to Hone the Habit of Being Happy Why Thinking Positively Won't Change Your Life. . . And Why Thinking Precisely Will The Fast Phobia Cure That Will Banish Any Fear Including Fear of Flying, Public Speaking, and Heights How to Fall Out of Love with Someone (for Real!) If you're plagued with the past, stuck in a fear, or just unable to get your mental motor running on time, Get the Life You Want will offer a mental toolbox of ways to get your life in order. If you have spent too much time in therapy or too much money trying to do it yourself, this book is for you. The key to quick and lasting change is not only right at your fingertips, it's in your head literally. Get the Life You Want will help you unleash it.\n\nProduct Details\n\n    * Hardcover: 264 pages\n    * Publisher: HCi; 1 edition (August 21, 2008)\n    * Language: English\n    * ISBN-10: 0757307760\n    * ISBN-13: 978-0757307768\n    * Product Dimensions: 8.5 x 5.8 x 0.9 inches\n    * Shipping Weight: 11.2 ounces\n    * Average Customer Review:\n       \n      19 Reviews\n      5 star: \t89% \t (17)\n      4 star: \t10% \t (2)\n      3 star: \t  \t (0)\n      2 star: \t  \t (0)\n      1 star: \t  \t (0)\n\n      See all 19 customer reviews...\n      4.9 out of 5 stars See all reviews (19 customer reviews)\n    * Amazon.com Sales Rank: #4,743 in Books (See Bestsellers in Books)","torrent":{"xt":"urn:btih:f04c8f0a611397459bbf205a57998c8ee784cb81","amp;dn":"Get+The+Life+You+Want+-+Richard+Bandler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f04c8f0a611397459bbf205a57998c8ee784cb81","infoHashBuffer":{"type":"Buffer","data":[240,76,143,10,97,19,151,69,155,191,32,90,87,153,140,142,231,132,203,129]},"announce":[],"urlList":[]}}