{"title":"Rapid Neurology and Neurosurgery [PDF] [StormRG]","uid":10259554,"size":2448542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1072dfbaf734576c74f7825f4bab8409a706ae1&amp;dn=Rapid+Neurology+and+Neurosurgery+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401449560,"description":"Author: Kumar Abhinav , Richard Edwards , Alan Whone\nPaperback: 202 pages\nPublisher: Wiley-Blackwell; 1 edition (September 4, 2012)\nLanguage: English\nISBN-10: 0470654430\nISBN-13: 978-0470654439\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nRapid Neurology and Neurosurgery is a must for all medical students and junior doctors - it is a quick and easy on-the-ward or clinic reference and the perfect revision tool for those approaching finals, undergraduate neurology and neurosurgery examinations, and the Membership of Royal College of Surgeons (MRCS) examinations.\nIt provides a concise, structured approach to neurology and neurosurgery learning, covering key facts in a simple and memorable way:\nPart I - The Basics - features the basic principles and facts essential for a good understanding of neurology and neurosurgery and includes sections on relevant neuroanatomy; neurological history and examination; and investigations including neurophysiology and neuroradiology. MRI and CT scans are included throughout the text.\nPart II - Complaints: face to face with the patient - features OSCE-style and the viva-voce examination preparation and has chapters on presenting complaints with relevant and selected questions to ask for establishing the differential diagnoses (presented in a table) with basic investigations and management.\nPart III - Conditions: applying the basics - presents important clinical conditions with sections on definition; epidemiology; aetiology; associations/risk factors; pathology; history; examination; investigations; management; complications; prognosis and a list of differential diagnoses usually in a table with general clinical information and distinguishing information to exclude the alternative diagnoses.\n\nEach chapter also includes key points to remember and highlights key facts.\n\nRapid Neurology and Neurosurgery contains only the essential, core, and relevant facts in a concise, pocket-sized, 'rapid' refresher providing a thorough foundation of neurology and neurosurgery knowledge allowing you to excel in the examinations.","torrent":{"xt":"urn:btih:f1072dfbaf734576c74f7825f4bab8409a706ae1","amp;dn":"Rapid+Neurology+and+Neurosurgery+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1072dfbaf734576c74f7825f4bab8409a706ae1","infoHashBuffer":{"type":"Buffer","data":[241,7,45,251,175,115,69,118,199,79,120,37,244,186,184,64,154,112,106,225]},"announce":[],"urlList":[]}}