{"title":"Girlpool (2014) [FLAC]","uid":11565552,"size":83980696,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1466fff32416925cc093cb8bdd44f93df8c5976&amp;dn=Girlpool+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1416948031,"description":"\n  Girlpool (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Blah Blah Blah\n  02 Paint Me Colors\n  03 Love Spell\n  04 Plants and Worms\n  05 Jane\n  06 Slutmouth\n  07 American Beauty\n\n  On a dazzling debut EP worthy of its advance praise, teenaged L.A. duo Girlpool prove to be punk as fuck without drums or even a lot of volume. More understated than even Young Marble Giants' spare palette, Cleo Tucker and Harmony Tividad offer up seven songs on just electric guitar and bass, sounding far more confident than they have a right to be given their age, ability, and lack of experience. Frustrated by their male-dominated local indie scene, the two friends ditched their respective bands and joined forces, writing short, sharp-tongued songs about sexism, slut-shaming, raw angst, and the vulnerability of being young and female. But while fans and critics have been quick to identify them as bold new feminists, the young women of Girlpool chafe a bit under that mantle. Most of their songs are about sex in some way or another, from empowerment to rejection to discrimination, but their boldness comes from being frank and honest and connecting in a very straightforward way, regardless of their gender. The result is fun, gutsy, irreverent, brutal, and totally human. Being women is not the only important thing about Girlpool. Strangely, having no drummer is one of their best assets. With ten strings between them, they don't even use distortion, leaving listeners nowhere to hide from their full-bore vocal intimacy as they shout, scream, and plaintively harmonize on tracks like &quot;Blah Blah Blah,&quot; &quot;Slutmouth,&quot; and &quot;American Beauty.&quot; At just about 14 minutes long, it's hard to pick standout tracks on this brief release. Instead, think of it as their live set at some grungy D.I.Y. space where you're lucky enough to discover this great band before all of your friends do","torrent":{"xt":"urn:btih:f1466fff32416925cc093cb8bdd44f93df8c5976","amp;dn":"Girlpool+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1466fff32416925cc093cb8bdd44f93df8c5976","infoHashBuffer":{"type":"Buffer","data":[241,70,111,255,50,65,105,37,204,9,60,184,189,212,79,147,223,140,89,118]},"announce":[],"urlList":[]}}