{"title":"Handbook of Treatment Planning in Radiation Oncology, 2E [StormR","uid":11174388,"size":4484584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f18775ab05f3d4ae0d6674ccce365ad12920b162&amp;dn=Handbook+of+Treatment+Planning+in+Radiation+Oncology%2C+2E+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"0xmovva","files":2,"time":1412757172,"description":"TITLE/EDITIONHandbook of Treatment Planning in Radiation Oncology\nAuthor: Gregory Videtic MD CM FRCPC (Editor), Neil Woody MD (Editor)\nPaperback: 264 pages\nPublisher: Demos Medical; 2 edition (August 14, 2014)\nLanguage: English\nISBN-10: 1620700352\nISBN-13: 978-1620700358\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n_______________________________________________________________________________\n\n\nThis is a highly practical resource about the specific technical aspects of delivering radiation treatment. Pocket-sized and well organized for ease of use, the book is designed to lead radiation oncology trainees and residents step by step through the basics of radiotherapy planning and delivery for all major malignancies. This second edition retains the valued features of the first edition-comprehensive yet concise, practical, evidence-based-while incorporating recent advances in the field. This includes expanded and updated discussions of SBRT for prostate and GI tumors, intraoperative therapy for GI tumors, VMAT for brain tumors, and new coverage of MRI-based planning in simulation.\n\nChapters are the result of a joint collaboration between residents and staff radiation oncologists in the Department of Radiation Oncology at the Cleveland Clinic. Sections are organized by body site or system-whichever is best suited to consistency in presenting planning principles. Also included are such specialized topics as palliative therapy and pediatrics. More than 200 images help to clarify the steps of radiotherapy planning and delivery. Written by and for residents on the &quot;front lines&quot; of their training, it is also a valuable resource for training other professionals in the field such as technologists, nurses, dosimetrists, and others as well as a quick reference for practicing physicians.\n\nKey Features of Handbook of Treatment Planning in Radiation Oncology, Second Edition:\n\nProvides a consistent, step-by-step approach to effective radiotherapy planning and delivery\nPresents content in consistent, concise, bulleted format for easy review\nSupported by over 200 color images\nExplains specific technical aspects of delivering radiation treatment\nAddresses such specialized topics as palliative therapy and pediatrics\nNew to the Second Edition:\n\nSBRT (stereotactic body radiation therapy) for prostate and GI tumors\nIntraoperative therapy for GI tumors\nVMAT (volumetric modulated arc therapy) for brain tumors\nNew coverage of MRI based planning in simulation","torrent":{"xt":"urn:btih:f18775ab05f3d4ae0d6674ccce365ad12920b162","amp;dn":"Handbook+of+Treatment+Planning+in+Radiation+Oncology%2C+2E+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18775ab05f3d4ae0d6674ccce365ad12920b162","infoHashBuffer":{"type":"Buffer","data":[241,135,117,171,5,243,212,174,13,102,116,204,206,54,90,209,41,32,177,98]},"announce":[],"urlList":[]}}