{"title":"Mahler - The Complete Symphonies - Bernstein (Sony)","uid":4638280,"size":3729593630,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f18e282b40ea3f2ff85add26e0e0bf3c06ff25d4&amp;dn=Mahler+-+The+Complete+Symphonies+-+Bernstein+%28Sony%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"sheila6","files":258,"time":1231628707,"description":"Music : Classical : Lossless\n\n \n\n&quot;You cannot underestimate the influence of this first complete recorded Mahler cycle, but it would be inappropriate to overestimate it too. It had its greatest influence in the United States where it was recorded by CBS and released between 1960 and 1968 at the time when everywhere Mahler's music was going through a renaissance assisted by the widespread acceptance of LP and stereo recording in the home. \n\nThe advocacy by such a high profile conductor as Leonard Bernstein was a potent talisman and his recordings carried his name with Mahler's, far and wide. However, in some cases these were not the first recordings of these works to appear and outside the United States Mahler's music was forging paths under other hands, some of whom were recording and broadcasting, and in some countries he had always been in vogue. Had Bernstein never recorded this set Mahler's music would still have made it to its present level of popularity though it may have taken just a little longer, particularly in the USA. \n\nSome of these recordings waited years before they were issued in Europe - in one case as late as 1971. So when those appeared over here it was alongside other new recordings by conductors such as Kubelik, Solti, Haitink and Klemperer, so their impact was not quite as great as they had been back at home when they first came out. \n\nThere are two exceptions. Bernstein's recordings of the, then neglected, Third and Seventh Symphonies were real trailblazers, released almost simultaneously in Europe and the USA and their importance can still be felt. None of which really matters to today's collectors, of course. Historical context is interesting but all the present day buyer really needs to know is whether this set is worth acquiring against all existing recordings in a different world from the one that first beheld them. \n\nMany experienced Mahlerites will have them on their shelves already, or will have decided they are not to their taste. However a reissue like this gives the newcomer, and those who passed them up last time, the chance to buy them at one go as the bargain price Sony is asking makes them easily available to all but the most trenchant of Bernstein's detractors.\n\nThe Fourth Symphony from 1960 is the earliest recording, though it would be 1971 before it was released in Europe. As a statement of intent, if that is the way it was perceived at the time, it must have struck American collectors as quite a style change from this orchestra's previous recording of the work, also for CBS, under Bruno Walter from 1946. The first movement is sassy and sharp in its pointing up of every small detail, woodwinds especially cheeky, and is a sparky realisation of Mahler's happiest music. Though I think the development section is a shade too fast I can compliment the NYPO for holding on so well. This does betray what sounds like impatience on Bernstein's part though I'm sure that is not what he meant. The second movement is equally colourful and helped by a sound balance that is exemplary for home listening with only the top edge betraying age. The third movement starts serene and becomes volatile but only occasionally strays beyond the tasteful and full marks to Bernstein for the snappy tempo he adopts in the last movement. That must have sounded more controversial then than it does now. Reri Grist has a distinctive enough timbre but I cannot escape the impression that she doesn't really know what she is singing about.\n\nIn 1961 Bernstein recorded the Third Symphony and in it the playing of the NYPO has a wonderful sense of new paths being discovered. Not surprising because, at that time, this symphony was seldom played and so this was a trailblazer everywhere. Following the great trombone solos in the first movement Bernstein segues seamlessly into the main exposition material where the march of summer finds him in characteristically exuberant mood: more Fifth Avenue on St. Patrick's Day than Vienna's Ring on a May morning, but none the worse for that. This is a very exuberant performance all through but is a case of Bernstein responding to the exuberance already implicit in the music. The coda crowns the movement with power, grandeur and excitement combined. Lovely attention to detail follows in the second movement with a real sense of flight in the quicker passages. The posthorn in the third is sweet and mellow proving, as elsewhere, that Bernstein can relax when he needs to. The fourth movement's &quot;Oh Mensch&quot; brings some rapt playing and Martha Lipton, a veiled witness to the night's mysteries. Then the fifth movement with the boys and women comes over remarkably restrained for Bernstein though a bigger choir might have helped so maybe this is the only movement where I feel a sense of disappointment. Lastly Bernstein takes the final movement slowly and with dedication to round off what, after all this time, remains one of the best Mahler Thirds on record with sound that stands up very well.\n\nThe recording of the Second Symphony is Bernstein's first one from 1963. I mention this because when CBS or Sony have reissued Bernstein's Mahler in the past they have used a 1970s performance with the LSO in Ely Cathedral. Sony is right to go back to this earlier studio version as the later one is ruled out principally because of the problems of recording in a cathedral. With this first recording Bernstein again competed in the CBS catalogue with Bruno Walter. On that occasion it was with a fine stereo version that should be in all Mahler collections now and probably was then. Once again Bernstein's interpretation must have struck collectors as a real contrast to Walter's. Though Bernstein is not as extreme as Scherchen in his explorations of contrasts of tempo and dynamics possible in this work (which he demonstrated in another contemporary recording) he certainly makes the most of his chances where Walter was much less volatile. This does make the first movement something of a &quot;stop-go&quot; affair. In fact Bernstein's first movement reminds me in parts of Solti's 1964 version in its fierce, razor-sharp opening skirl and driving allegros. I suspect Bernstein himself became dissatisfied with this recording since, in his later recordings, he would carry his interpretative mannerisms to greater limits, especially in the last movement, nearly compromising the structural integrity of the piece. Here in 1963 the whole massive parade hangs together extremely well and the end is genuinely liberating whereas later Bernstein would pile on the emotion.\n\nThe Fifth Symphony was the first to be recorded in the new Lincoln Centre in 1963 and this may have something to do with it being such a disappointment. The hall's acoustics were problematic and it is as if the engineers haven't a clue how to cope with them. This doesn't sound like the New York Philharmonic with a sharp, brittle sound making their contribution a genuine trial. But that cannot be the whole story as a great performance will surmount the worst sound. The Fifth must surely be Mahler's most difficult work for a conductor and I don't think Bernstein was anywhere near penetrating it at this point on this evidence, and the orchestra probably took their cue from him. The first movement is poorly executed with the funeral march rhythm seeming to stutter and the trumpet solo sounding very odd. The second and third movements contain coarse playing in the louder passages and a general feeling that the conductor isn't sure where everything else fits. The feeling is of &quot;run through&quot; too many times. The Adagietto fourth movement is a slow and treacly eleven minutes and the last movement too fast, sounding even faster after such a slow Adagietto. It makes no real effect other than a shot at a cheap thrill or two and any hope of illustrating the important thematic link between the last two movements is lost. This recording is the one clear case in Bernstein's Mahler discography where his later recording for DG is to be preferred.\n\nBernstein was always one of the greatest exponents of the Seventh. His advocacy of it in a New York performance in 1962 and this subsequent recording in 1965 probably did more to establish this work around the world than anything else and it's still a benchmark. He steers his way through Mahler's treacherous tempo changes during the first movement exposition particularly well. The development is one of Mahler's greatest imaginative creations, one of those passages that see him forging new paths, and with what finesse Bernstein unfolds the huge vistas: imaginative and radical, but with complete confidence in the greatness and uniqueness, of the daring, of Mahler's vision. The open quality of the recording, allied to the close balances, help delineate the myriad colours of the opening of the second movement &quot;Nachtmusik I&quot; with horns calling each other and the woodwind trills interspersed. As the movement gets under way I also like the portly gait Bernstein adopts to what is another march, albeit in the dark. Then listen to the way he suggests that the dance is never far away. In the fourth movement &quot;Nachtmusik II&quot; Bernstein relaxes into the warmth of the piece with a touch of the &quot;Siegfried Idylls&quot; and maybe here he does indulge himself a little. Finally he crowns this superb performance with a last movement that is tingling with energy, verve and abandon. He seems to pull it off by having no doubts; an example that he set for others to follow. This is one of the great Mahler recordings, always a joy to return to and with depths still to explore. The playing of the NYPO is faultless and idiomatic and, by now, the engineers seemed to have tamed Lincoln Centre also.\n\nBernstein recorded the Ninth Symphony in the same week as the Seventh but it would wait until 1968 before European release when collectors, by then, had available to them recordings by Barbirolli, Klemperer and Solti, as well as Walter's CBS recording from 1961. I'm sure that one of the reasons why the recorded sound on this Bernstein recording is so good is because the producer John McClure was also responsible for Walter's. Working intensively with the old man must have prepared him well and Bernstein is the beneficiary with the sound the best in the whole cycle, rich in detail and immediacy. Listen to the bows of the cellos grinding into the strings and you feel you are there with them. Once again, however, it was a case of Bernstein and Walter appearing in Mahler on the same label and emerging differently. In the first movement Bernstein has a greater sense of the Andante comodo tempo than Walter does. This allows him to keep up a sense of movement even through the passages between the great climaxes. He also stresses the darker colours and the more forward-looking aspects of the work though he misses somewhat the sense of an elegy that is so important. The middle two movements are superbly played and recorded but are a touch brash, not really delving into their implications as much as Bernstein would in later recordings where he would significantly toughen up these movements to greater advantage. The last movement gets a searing account that gains from being quite simply presented though again the elegiac quality found by other conductors, Walter notably, is absent.\n\nEconomics were behind the fact that the complete Eighth Symphony was recorded in London following a televised performance at the Royal Albert Hall in 1966. This was the first of the &quot;modern era&quot; Eighths and another highly influential recording. But there is now a tendency, especially in the thickly scored sections, for the sound to become pinched. As I have said, great performances can override reservations over sound but Bernstein's is a little way short of that. The first passage for the soloists in Part I, &quot;Imple superna gratia&quot;, is surely rather slow, as is the early short orchestral passage. The more episodic Part II suits Bernstein's general approach better, of course. In fact there's something operatic to the way Bernstein interprets Mahler's setting of Goethe's &quot;Faust&quot;. The orchestral Prelude finds the LSO on fine form, though there are times where I find Bernstein's warmth innocuous in music meant to depict &quot;ravines, forest, great crags and wilderness.&quot; That is until Pater Profundis describes the storms where Bernstein pushes him too much. There is a fine team of soloists though I do feel the women sound too much alike. The choruses have their sticky moments as well. There had been problems in rehearsals and professionals had to be brought in. Later on, the arrival of Mater Gloriosa, the lovely passage for strings, harp and harmonium, brings us Bernstein at his most syrupy. But his solution is at least unashamedly romantic, Mascagni-like, and so stays in the mind if for the wrong reasons. He closes with a performance of the &quot;Chorus Mysticus&quot; and subsequent peroration that sums up his overall approach well. This recording is a good example of the inspirational approach to this work and is a fine achievement with parts that come off, parts that don't, and you can cherish it for the former if you can overlook the latter.\n\nThe First Symphony was recorded in late 1966 but not released in Europe until 1968 when it faced competition from new versions by Solti and Kubelik. Hearing it again I am convinced that Bernstein's later DG recording has unfairly eclipsed it. Comparing them is like looking at two TV sets showing the same movie but with one having all the colour and brightness controls turned up too high. Everything Bernstein does in the earlier recording is accentuated in the second. The tempi for the middle movements are a case in point. In the 1966 recording both are distinctive and add interest: rugged and trenchant in the second, moving forward in the third. In 1989, however, the second movement is too slow and the third too fast. It's as if Bernstein has to do something, anything, different from before and spoils what was fine in the first place. There are other examples. The opening of the last movement carries a legitimate amount of dramatic licence in 1966 within the bounds of taste. By 1989 these same effects have become hammy mannerisms. Later the final note in the whole work has Bernstein, possibly using a change in the NYPO score made by Mahler in his time with them, adds a bass drum thwack. In 1966 this underpins the close effectively but discreetly. In 1989 it sounds like a gratuitous effect designed to bring a cheer from the crowd. So this 1966 version is a fine performance that is lyrical, exciting, dramatic and filled with the ardour of youth. It is also excellently played and recorded.\n\nThe 1967 Sixth Symphony in this set is a favourite of many and the first one I ever owned. In spite of that I have doubts as to the conclusions Bernstein reaches, even though I can admire the way he reaches them. This is a formidable performance that comes out spitting fire with a quick-march opening movement that sets the tone for perhaps the most &quot;hyper&quot; version of the Sixth ever recorded this side of Hermann Scherchen. But this first movement is surely too quick. More weight is needed which Mahler's subsidiary marking demands and which Bernstein seems to ignore. Alma's theme takes off with great &quot;schwung&quot; but not even she can escape giving the impression of having inhaled something rather potent. This hyper-activity carries into the Scherzo, placed second. I do admire the passionate questing nature of the third movement even though the marked lack of bass in the sound recording brings a rather brash quality. The last movement is overwhelming and surely provides evidence of what I have often suspected: that Bernstein was much influenced in his interpretation by Dimitri Mitropoulos. Again, however, there needs to be more reflection in some of the valleys if only as a pause for breath before the next assault on the peaks. If you think that the Sixth should be the place where Mahler is &quot;in your face&quot; the whole time, then Bernstein in 1967 is for you.\n\nBernstein never conducted Deryck Cooke's performing version of the Tenth Symphony material left behind by Mahler. A number of times he even declared that Mahler would not have been able to complete the symphony even if he had lived and so rejected such scores. He did perform and record the Adagio first movement, however, in his last Mahler for CBS in 1975. He has the measure of the mixture of passionate yearning and spiky modernism and the NYPO give the impression that they would have been more than happy to go on and record the whole Deryck Cooke version even if Bernstein wasn't. The sound recording is rich in depth and detail reflecting Bernstein's apparently complete identification with this music in spite of his feelings.\n\nI remain convinced that the best way to acquire a set of Mahler symphonies is to buy individual versions by a number of conductors. My survey of Mahler recordings had this belief at its core. However, there are still valid reasons to own one conductor cycles and Bernstein is certainly one of those conductors whose complete view is worth considering. Along with Rafael Kubelik on DG he reaches an impressive level of consistency even though there are aspects I have disagreements with. In contrast with Kubelik, Bernstein is more emotionally engaged and there is frequently a &quot;life or death&quot; struggle that can be compelling when appropriate, if rather irritating when not. Bernstein's love and knowledge of these scores was always unrivalled.\n\nOne final question remains. Is this earlier Mahler set by Bernstein to be preferred to his later complete cycle made for DG in the 1980s and now also available as a single boxed set? On balance I believe it is but with my caveat regarding the Fifth Symphony. How broadly alike Bernstein's individual interpretations are after twenty or so years is proof of his consistency in Mahler, but I do find the younger Bernstein's energy, sense of wonder and discovery, as well as that of his orchestra, more compelling and rewarding, even if at times exasperating. There are also times in the later DG recordings where his infatuation with the music gets the better of him and leads him to exaggerate interpretative points and tip over into mannerism. I used the two First Symphony recordings as an example but you can find others.\n\nIn spite of all my reservations, hearing this music played by this orchestra under this conductor at this time is still thrilling.&quot;-Tony Duggan \n\n\n\n\nRECORDING DETAILS\n\nSymphony No.1: Oct 4 &amp; 22 1966 - Philharmonic Hall (now Avery Fisher Hall), Lincoln Center, New York.\n\nSymphony No.2: Sep 29-30 1963 - Manhattan Center, New York.\n\nSymphony No.3: April 3 1961 - Manhattan Center, New York.\n\nSymphony No.4: Feb 1 1960 - St. George Hotel, Brooklyn, New York.\n\nSymphony No.5: Jan 7 1963 - Philharmonic Hall (now Avery Fisher Hall), Lincoln Center, New York.\n\nSymphony No.6: May 2 &amp; 6 1967 - Philharmonic Hall (now Avery Fisher Hall), Lincoln Center, New York.\n\nSymphony No.7: Dec 14-15 1965 - Philharmonic Hall (now Avery Fisher Hall), Lincoln Center, New York.\n\nSymphony No.8: April 18-20 1966 - Walthamstow Assembly Hall, London.\n\nSymphony No.9: Dec 16 1965 - Philharmonic Hall (now Avery Fisher Hall), Lincoln Center, New York.\n\nSymphony No.10 Adagio: April 8 1975 - Columbia 30th Street Studio, New York.\n","torrent":{"xt":"urn:btih:f18e282b40ea3f2ff85add26e0e0bf3c06ff25d4","amp;dn":"Mahler+-+The+Complete+Symphonies+-+Bernstein+%28Sony%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18e282b40ea3f2ff85add26e0e0bf3c06ff25d4","infoHashBuffer":{"type":"Buffer","data":[241,142,40,43,64,234,63,47,248,90,221,38,224,224,191,60,6,255,37,212]},"announce":[],"urlList":[]}}