{"title":"Daft Punk Discography (1997-2011) {100.XY}","uid":8304650,"size":1370614708,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f1b8e2dbe9e1f4af2c618f1abb1e4aa74ede07cf&amp;dn=Daft+Punk+Discography+%281997-2011%29+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"100.XY","files":-1,"time":1364339246,"description":"Daft Punk is an electronic music duo consisting of French musicians Guy-Manuel de Homem-Christo (born 8 February 1974) and Thomas Bangalter (born 3 January 1975). Daft Punk reached significant popularity in the late 1990s house movement in France and met with continued success in the years following, combining elements of house with synthpop. The duo is credited with producing songs that are considered essential in the French house scene. It was managed from 1996 to 2008 by Pedro Winter (Busy P), the head of Ed Banger Records. Early in the group's career, the band members were strongly influenced by groups such as The Beach Boys and The Rolling Stones.\nBangalter and de Homem-Christo were originally in a band called Darlin', which disbanded after a short period of time, leaving the two to experiment musically on their own. The duo became Daft Punk, releasing its critically acclaimed debut album Homework in 1997. The 2001 release of Discovery was even more successful, driven by the club singles &quot;One More Time&quot;, &quot;Digital Love&quot;, and &quot;Harder, Better, Faster, Stronger&quot;.\nIn March 2005, the duo released the album Human After All to mixed reviews. However, the singles &quot;Robot Rock&quot; and &quot;Technologic&quot; achieved success in the United Kingdom. Daft Punk toured throughout 2006 and 2007 and released the live album Alive 2007, which won a Grammy Award for Best Electronic/Dance Album. The duo composed the score of the film Tron: Legacy and in 2010 released the soundtrack album of the film. In January 2013, Daft Punk left EMI Records for Sony Music Entertainment's subsidiary label Columbia to release its next album.\nDaft Punk is noted for its elaborate live shows, in which visual elements and effects are incorporated with the music. The group is known for its emphasis on visual and story components associated with their musical productions. Daft Punk is also known for its use of disguises, particularly the ornate robot costumes, while in public and/or performing\n\n\n\nCountry: France\nGenre: French house\nQuality: 320 kbps\n\nAlbum List:\n\n(1997) Daft Punk - Homework\n(2001) Daft Punk - Alive 1997\n(2001) Daft Punk - Discovery\n(2004) Daft Punk - Daft Club\n(2005) Daft Punk - Human After All\n(2006) Daft Punk - Human After All (Remixes)\n(2006) Daft Punk - Musique Vol.1 (1993-2005)\n(2007) Daft Punk - Alive 2007\n(2008) Daft Punk - Complete Reboot\n(2010) Daft Punk - Tron Legacy OST\n(2011) Daft Punk - Tron Legacy R3CONFIGUR3D (Remixes)\n","torrent":{"xt":"urn:btih:f1b8e2dbe9e1f4af2c618f1abb1e4aa74ede07cf","amp;dn":"Daft+Punk+Discography+%281997-2011%29+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b8e2dbe9e1f4af2c618f1abb1e4aa74ede07cf","infoHashBuffer":{"type":"Buffer","data":[241,184,226,219,233,225,244,175,44,97,143,26,187,30,74,167,78,222,7,207]},"announce":[],"urlList":[]}}