{"title":"Osman's Dream - The History of the Ottoman Empire - Caroline Fin","uid":9288444,"size":11410919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f295b2a6cfc3d035de05e377fa5fe94384f3e86e&amp;dn=Osman%27s+Dream+-+The+History+of+the+Ottoman+Empire+-+Caroline+Fin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386052660,"description":"According to the Ottoman chronicles, the first sultan, Osman, had a dream in which a tree emerged fully formed from his navel &quot;and its shade compassed the world&quot;-symbolizing the vast empire he and his descendants were destined to forge. His vision was soon realized: At its height, the Ottoman realm extended from Hungary to the Persian Gulf, from North Africa to the Caucasus. The Ottoman Empire was one of the largest and most influential empires in world history. For centuries, Europe watched with fear as the Ottomans steadily advanced their rule across the Balkans. Yet travelers and merchants were irresistibly drawn toward Ottoman lands by their fascination with the Orient and the lure of profit. Although it survived for over six centuries, the history of the Ottoman Empire is too often colored by the memory of its bloody final throes. In this magisterial work Caroline Finkel lucidly recounts the epic story of the Ottoman Empire from its origins in the thirteenth century through its destruction on the battlefields of World War I.","torrent":{"xt":"urn:btih:f295b2a6cfc3d035de05e377fa5fe94384f3e86e","amp;dn":"Osman%27s+Dream+-+The+History+of+the+Ottoman+Empire+-+Caroline+Fin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f295b2a6cfc3d035de05e377fa5fe94384f3e86e","infoHashBuffer":{"type":"Buffer","data":[242,149,178,166,207,195,208,53,222,5,227,119,250,95,233,67,132,243,232,110]},"announce":[],"urlList":[]}}