{"title":"Ludwig Wittgenstein - Philosophical Investigations, 4th edn.","uid":8705009,"size":3171025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2bc1e2d6b181b5e40c26c33406d7e753827c0b6&amp;dn=Ludwig+Wittgenstein+-+Philosophical+Investigations%2C+4th+edn.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"workerbee","files":-1,"time":1374127969,"description":"Ludwig Wittgenstein - Philosophical Investigations, 4th edition (Wiley-Blackwell, 2009).  Bilingual edition with English translation by G. E. M. Anscombe, P. M. S. Hacker and Joachim Schulte.\n\nISBN: 9781444307979 | 592 pages | PDF\n\n\nImmediately upon its posthumous publication in 1953, Ludwig Wittgenstein's Philosophical Investigations was hailed as a masterpiece, and the ensuing years have confirmed this initial assessment. Today it is widely acknowledged to be the single most important philosophical work of the twentieth century.\n\nIn this definitive new en face German-English edition, Wittgenstein experts Peter Hacker and Joachim Schulte have incorporated significant editorial changes to earlier editions of Philosophical Investigations in order to reflect more closely Wittgenstein's original intentions.  Notable revisions include the placement of Wittgenstein's notes -- Randbemerkungen -- into their designated positions in the text, some corrections to the originally published German text, and the numbering of all the remarks in what was Part 2 and is now named Philosophy of Psychology -- A Fragment. Extensive modifications and corrections have also been made to G. E. M. Anscombe's original English translation. Detailed editorial endnotes have been added to illuminate difficult translation decisions and to identify references and allusions in Wittgenstein's original text.\n\n","torrent":{"xt":"urn:btih:f2bc1e2d6b181b5e40c26c33406d7e753827c0b6","amp;dn":"Ludwig+Wittgenstein+-+Philosophical+Investigations%2C+4th+edn.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bc1e2d6b181b5e40c26c33406d7e753827c0b6","infoHashBuffer":{"type":"Buffer","data":[242,188,30,45,107,24,27,94,64,194,108,51,64,109,126,117,56,39,192,182]},"announce":[],"urlList":[]}}