{"title":"2046[2004]DvDrip.XVID[Cn][Eng.Sub].avi","uid":3654265,"size":732212942,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2c5fe29ae578a6bd2afb023e20cb01bd7973360&amp;dn=2046%5B2004%5DDvDrip.XVID%5BCn%5D%5BEng.Sub%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"gurumaster","files":1,"time":1175635418,"description":"Title: 2046\nYear: 2004\nGenre: Drama / Fantasy / Romance / Sci-Fi\nRuntime: 02:03:18\nIMDB URL: http://imdb.com/title/tt0212712/\nAudio: AC3 48000Hz\nLanguage: Chinese\nVideo: 768x432 XVID 25 FPS\nSubs: English\nFiles: 1\nSize: 698 MB\nSource: PAL DVD\n\nCountry: China\nDirector:Kar Wai Wong\nWriter: Kar Wai Wong\nCast: Tony Leung, Maggie Cheung, Gong Li, Zhang Ziyi, Faye Wong, Dong Jie, Carina Lau\n\nDirector Wong Kar-Wai has created in 2046 another visually stunning, atmospheric, and melancholy movie about unrequited love and loneliness.\n\nDirector Wong Kar-Wai&amp;#039;s style reaches its fullest expression in his stunning film 2046. Picture period sets and intricate costuming, finely wrought atmospheres, languid shots, glamorous cigarette smoke, lamplight and allusions to film noir. 2046 is a meditation on memory, eroticism, love, loss, and longing which surpasses the director&amp;#039;s beautiful, widely acclaimed IN THE MOOD FOR LOVE (2000) in terms of formal ambition and visual sumptuousness. With its intriguing, layered structure, the film follows the adventures of Chow Wo Man (Tony Leung), a womanizer who is writing a science fiction novel about a future year in which all memories are suspended. The film shuttles between the BLADE RUNNER-like world of Chow&amp;#039;s futuristic novel (complete with androids and other metaphors of emotional disconnection) and late-&amp;#039;60s Hong Kong--where Chow writes from a hotel room, and engages in relationships with a series of beautiful, complex women. The film also journeys to Singapore and through the increasingly mysterious corridors of the protagonist&amp;#039;s memory.\n\n2046 resists tidy plot summaries with its disjointed, zigzagging construction. Yet, coupled with Wong&amp;#039;s rich cinematography and dazzling formal techniques, it is as fluid, associative, and labyrinthine as memory itself. Sliding between keenly detailed realism (Wong&amp;#039;s camera can capture the subtlest flicker of emotion in a characters&amp;#039; eyes) and lavish, expressionistic metaphor, the film is a deeply entrancing experience. Even given its jumbled, sometimes chaotic narrative, 2046 creates a poignant, emotionally charged, and richly rewarding experience.","torrent":{"xt":"urn:btih:f2c5fe29ae578a6bd2afb023e20cb01bd7973360","amp;dn":"2046%5B2004%5DDvDrip.XVID%5BCn%5D%5BEng.Sub%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c5fe29ae578a6bd2afb023e20cb01bd7973360","infoHashBuffer":{"type":"Buffer","data":[242,197,254,41,174,87,138,107,210,175,176,35,226,12,176,27,215,151,51,96]},"announce":[],"urlList":[]}}