{"title":"Une Histoire de Fou FRENCH BluRay 1080p 2016","uid":14174185,"size":10568005777,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f2e48a0af194763e82cc821033e1a5114c3a0210&amp;dn=Une+Histoire+de+Fou+FRENCH+BluRay+1080p+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"annuaireweb","files":1,"time":1459790233,"description":"Une.Histoire.De.Fou.2015.FRENCH.1080p.BluRay.x264-Ryotox\r\n\r\nBerlin 1921, Talaat Pacha, principal responsable du génocide Arménien est exécuté dans la rue par Soghomon Thelirian dont la famille a été entièrement exterminée. Lors de son procès, il témoigne du premier génocide du 20ème siècle tant et si bien que le jury populaire l’acquitte.\r\nSoixante ans plus tard, Aram, jeune marseillais d’origine arménienne, fait sauter à Paris la voiture de l’ambassadeur de Turquie. Un jeune cycliste qui passait là par hasard, Gilles Tessier, est gravement blessé.\r\nAram, en fuite, rejoint l’armée de libération de l’Arménie à Beyrouth, foyer de la révolution internationale dans les années 80. Avec ses camarades, jeunes arméniens du monde entier, il pense qu’il faut recourir à la lutte armée pour que le génocide soit reconnu et que la terre de leurs grands-parents leur soit rendue.\r\nGilles, qui a perdu l’usage de ses jambes dans l’attentat, voit sa vie brisée. Il ne savait même pas que l’Arménie existait lorsqu’Anouch, la mère d’Aram, fait irruption dans sa chambre d’hôpital : elle vient demander pardon au nom du peuple arménien et lui avoue que c’est son propre fils qui a posé la bombe.\r\nPendant que Gilles cherche à comprendre à Paris, Anouch devient folle de douleur à Marseille et Aram entre en dissidence à Beyrouth… jusqu’au jour où il accepte de rencontrer sa victime pour en faire son porte parole","torrent":{"xt":"urn:btih:f2e48a0af194763e82cc821033e1a5114c3a0210","amp;dn":"Une+Histoire+de+Fou+FRENCH+BluRay+1080p+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2e48a0af194763e82cc821033e1a5114c3a0210","infoHashBuffer":{"type":"Buffer","data":[242,228,138,10,241,148,118,62,130,204,130,16,51,225,165,17,76,58,2,16]},"announce":[],"urlList":[]}}