{"title":"Spider-Girl Complete (1998-2010) [Marvel] (Requested)","uid":7998708,"size":1759255857,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f320e0bf258e68b1630186b0b5e05bb2d86fb64a&amp;dn=Spider-Girl+Complete+%281998-2010%29+%5BMarvel%5D+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"STFmaryville","files":-1,"time":1357690905,"description":"This torrent contains:\n\nWhat If 105\n(first appearance)\n\nSpider-Girl 001-100\n(and 1/2 issue, 1999 Annual, Battlebook)\n\nAmazing Spider-Girl 000, 001-030\n\nSpectacular Spider-Girl 001-011\n(Marvel Digital Exclusive series)\n(later reprinted in Amazing Spider-Man Family)\n\nSpectacular Spider-Girl 001-004\n(Limited Series)\n\nSpider-Girl: The End\n(One-Shot)\n\n------\n\nFrom Wikipedia:\n\nSpider-Girl first appeared in a one-shot story in the ongoing series What If. Following positive fan response to the concept, Spider-Girl and two other series (A-Next and J2) set in the same alternate future universe were launched under the MC2 imprint. Although each of these titles were slated to be 12-issue limited series, Spider-Girl's initial sales justified their continuation as ongoing titles.\n\nAfter initial interest, Spider-Girl drew low sales. However, the book's active fan base caused Marvel to revoke several cancellation announcements. Reprints of the series in digest size trade paperbacks sold well. Marvel Associate Editor Nick Lowe revealed in a November 2005 interview that &quot;Spider-Girl, for the first time, is completely safe from cancellation.&quot;\n\nHowever, despite Lowe's statement, Marvel announced that #100 would be the title's final issue. Although the Spider-Girl title was indeed canceled, the book was relaunched as The Amazing Spider-Girl, with issue #0 appearing in October 2006.\n\nOn October 11, 2008, Tom DeFalco announced that Amazing Spider-Girl would be canceled with issue #30, though he revealed that, due to the company's love of the character, she could possibly be given a sixteen-page back-up strip in Amazing Spider-Man Family. On November 8, 2008, Marvel EIC Joe Quesada confirmed that Spider-Girl would indeed become a feature in the monthly anthology magazine Amazing Spider-Man Family. The series would replace the feature Mr. and Mrs. Spider-Man, written by DeFalco, which served as a prequel series to the Spider-Girl universe.\n\nOn March 18, 2009, Marvel announced that Spider-Girl would continue publication as Spectacular Spider-Girl, a web-comic released through Marvel's Digital Comics Unlimited. The title would continue to be simultaneously published in paper form within Amazing Spider-Man Family. Amazing Spider-Man Family #5 (published April 2009) through #8 (July 2009) contained these Spider-Girl stories until the title's cancellation with issue #8.\n\nThe new &quot;Spectacular Spider-Girl&quot; stories were then contained in Web of Spider-Man. This lasted for 7 issues before being moved to its own eponymous 4-issue limited series, Spectacular Spider-Girl, which wrapped up most of the series plot threads. This was followed by one last Spider-Girl tale, Spider-Girl: The End.\n\nIn November 2010 a new Spider-Girl series started, but this series starred Anya Corazon and had nothing to do with the Mayday version of the character. It was cancelled after a mere 8 issues.","torrent":{"xt":"urn:btih:f320e0bf258e68b1630186b0b5e05bb2d86fb64a","amp;dn":"Spider-Girl+Complete+%281998-2010%29+%5BMarvel%5D+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f320e0bf258e68b1630186b0b5e05bb2d86fb64a","infoHashBuffer":{"type":"Buffer","data":[243,32,224,191,37,142,104,177,99,1,134,176,181,224,91,178,216,111,182,74]},"announce":[],"urlList":[]}}