{"title":"The Idea Factory: The Great Age of American Innovation","uid":7812097,"size":1440828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3433b87128346eec55249582133f9d5eaf2d0e6&amp;dn=The+Idea+Factory%3A+The+Great+Age+of+American+Innovation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352561111,"description":"The Idea Factory: Bell Labs and the Great Age of American Innovation by Jon Gertner\nPenguin | 2012 | ISBN: 1594203288 | English | 432 pages | EPUB \n\nA sweeping, atmospheric history of Bell Labs that highlights its unparalleled role as an incubator of innovation and birthplace of the century's most influential technologies.\n\nBell Laboratories, which thrived from the 1920s to the 1980s, was the most innovative and productive institution of the twentieth century. Long before America's brightest scientific minds began migrating west to Silicon Valley, they flocked to this sylvan campus in the New Jersey suburbs built and funded by AT&amp;T. At its peak, Bell Labs employed nearly fifteen thousand people, twelve hundred of whom had PhDs. Thirteen would go on to win Nobel prizes. It was a citadel of science and scholarship as well as a hotbed of creative thinking. It was, in effect, a factory of ideas whose workings have remained largely hidden until now.\n\nNew York Times Magazine writer Jon Gertner unveils the unique magic of Bell Labs through the eyes and actions of its scientists. These ingenious, often eccentric men would become revolutionaries, and sometimes legends, whether for inventing radio astronomy in their spare time (and on the company's dime), riding unicycles through the corridors, or pioneering the principles that propel today's technology. In these pages, we learn how radar came to be, and lasers, transistors, satellites, mobile phones, and much more.","torrent":{"xt":"urn:btih:f3433b87128346eec55249582133f9d5eaf2d0e6","amp;dn":"The+Idea+Factory%3A+The+Great+Age+of+American+Innovation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3433b87128346eec55249582133f9d5eaf2d0e6","infoHashBuffer":{"type":"Buffer","data":[243,67,59,135,18,131,70,238,197,82,73,88,33,51,249,213,234,242,208,230]},"announce":[],"urlList":[]}}