{"title":"Introduction to Tantra - Lama Thubten Yeshe.epub","uid":10123837,"size":1022825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f35a5ad0f4a741728079d137d38bfee3f1f8685f&amp;dn=Introduction+to+Tantra+-+Lama+Thubten+Yeshe.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"low_iq","files":-1,"time":1399730212,"description":"Introduction to Tantra: The Transformation of Desire\n\nWhat is tantra? Who is qualified to practice it? How should it be practiced? What are the results? According to Buddhism, every human being has the potential to achieve profound and lasting happiness. And according to the tantric teachings of Buddhism, this remarkable transformation can be realized very quickly if we utilize all aspects of our human energy - especially the energy of our desires.\n\nIntroduction to Tantra is the best available clarification of a subject that is often misunderstood. This new edition of this classic text includes a new foreword by Philip Glass and a new cover design, but leaves untouched Lama Yeshe's excellent original text, edited by Jonathan Landaw.\n\nTantra recognizes that the powerful energy aroused by our desire is an indispensable resource for the spiritual path. It is precisely because our lives are so inseparably linked with desire that we must make use of desire's tremendous energy not just for pleasure, but to transform our lives.\n\nLama Yeshe presents tantra as a practice leading to joy and self-discovery, with a vision of reality that is simple, clear, and extremely relevant to twenty-first century life.","torrent":{"xt":"urn:btih:f35a5ad0f4a741728079d137d38bfee3f1f8685f","amp;dn":"Introduction+to+Tantra+-+Lama+Thubten+Yeshe.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f35a5ad0f4a741728079d137d38bfee3f1f8685f","infoHashBuffer":{"type":"Buffer","data":[243,90,90,208,244,167,65,114,128,121,209,55,211,139,254,227,241,248,104,95]},"announce":[],"urlList":[]}}