{"title":"75 Floral Blocks to Crochet: Beautiful Patterns to Mix and Match","uid":9892306,"size":75231564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3892f160096c0fe3bc5e0fa1f2cc7dd3b596f85&amp;dn=75+Floral+Blocks+to+Crochet%3A+Beautiful+Patterns+to+Mix+and+Match&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"KnitLady","files":-1,"time":1396658642,"description":"Bring the beauty of the garden indoors with this floral themed collection 75 Floral Blocks to Crochet is a charming collection of square, triangular, diamond, and hexagonal blocks, all with a floral themeï¿½from traditional blanket squares with petals and rosebuds to colorful blocks with three-dimensional flowers and butterfliesï¿½there's something here to inspire every crochet fan. Great for crafters &quot;on the go&quot; itï¿½s easy to work a few blocks while traveling or commuting. Then when all the blocks are complete you can assemble a whole project at your leisure.The book includes: &quot;Useful Techniques&quot; offering directions on constructionï¿½in straight rows, in the round, or corner-to-cornerï¿½plus how to join blocks and create edgings. The &quot;Block Directory,&quot; categorized by shape, showcases the designs which are cross-referenced to the row-by-row (or round-by-round) written instructions, as well as easy-to-follow charts. Additional information indicating the direction of working, skill level, and the number of colors needed is also included. Lastly, &quot;Creative Projects&quot; helps you make your own choice of blocks to create stunning projects including throws, afghans, shawls, and more!","torrent":{"xt":"urn:btih:f3892f160096c0fe3bc5e0fa1f2cc7dd3b596f85","amp;dn":"75+Floral+Blocks+to+Crochet%3A+Beautiful+Patterns+to+Mix+and+Match","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3892f160096c0fe3bc5e0fa1f2cc7dd3b596f85","infoHashBuffer":{"type":"Buffer","data":[243,137,47,22,0,150,192,254,59,197,224,250,31,44,199,221,59,89,111,133]},"announce":[],"urlList":[]}}