{"title":"Black Lips - Arabia Mountain 2011","uid":6877794,"size":304598390,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3acf68a89e519d54fa4dd55b3f4c4237dca324f&amp;dn=Black+Lips+-+Arabia+Mountain+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"barber9","files":-1,"time":1323478453,"description":"In the single Modern Art, bassist for the Black Lips, Jared Swilley, sings over a fuzzed out guitar: K-hole at the DalÃƒÂ­/Seeing the unknown/Well it might have been a molly/Cause my mind is being blown. Two things are clear about this band: 1) These hooligans quaff enough drugs that make Charlie Sheen look like he has been huffing Elmers glue out of a brown bag. 2) Its music sounds just like they are: debauched, offensive and slightly criminal, all of which translates into its most recent vinyl pressing.\n\nFamed for its notorious stage antics, such as making out with each other, flinging piss and whipping out their peters as well as their (legally questionable) lifestyle choices, the boys have cleaned up their act for its latest release, Arabia Mountain, on Vice Records. Well, sort of.\n\nProduced by the band with the help of Mark Ronson and Deerhunters Lockett Pundt, the bands sixth studio efforts veers towards a catchier, cleaner and somewhat sobered up sound from past releases, putting out song after song of hip-shaking garage goodness.\n\nThe album kicks off with Family Tree, a ditty featuring circus-like motif before switching into a cowpoke westernized groove with reverberating guitars before reverting to the furious yelping of its lead melody. Such a raucous becomes the bands signature fast-ride through its amalgamation of tracks and central medium for communicating their psychedelic riffs that will boogie-woogie on everybodys mind and spine. The rest of the album is a merry coalescence of machine-gun downstroke strumming punk guitar, some mild country chords and non-stop danceable garage beats.\n\nStripping it down to the skivvies, the Black Lips thrust rock n roll into the middle of the cold night and start playing grab-ass for around 42 minutes. Noc-A-Homa, an elegy for the Atlanta Braves, slightly un-PC mascot, is a hard hitting and sultry number about the insalubrious behavior of the hard-partying tribe of one. Good old fashion hip-shaking music is what pours from the record, and lots of it.\n\n- - -\n\nThe Black Lips have shown with its latest release that they are mature enough to crank out a steady array of tracks that prove that they are as good as its stage antics. Not necessarily a work of staggering beauty and might, Arabia Mountain is definitely a rock n roll safari that will blast the bad bones off your body and keep you grooving 'til you turn black and blue. It is not terribly complex, but it is terribly fun, and that is what rock n roll should be. (blogcritics.org)\n\n- - -\n\nBlack Lips - Arabia mountain 2011 \n(New York V2 Records)\n\n 1. Family tree\n 2. Modern art\n 3. Spidey's curse\n 4. Mad dog\n 5. Mr. Driver\n 6. Bicentennial man\n 7. Go out and get it\n 8. Raw meat\n 9. Bone marrow\n10. The lie\n11. Time\n12. Dumpster dive\n13. New direction\n14. Noc-a-homa\n15. Don't mess up my baby\n16. You keep on running\n\nCole Alexander (born on June 8, 1982) - vocals, rhythm guitar 1999-present\nJared Swilley (born on August 8, 1983) - vocals, bass guitar 1999-present\nJoe Bradley (born on February 3, 1984) - vocals, drums 1999-present\nIan Saint PÃƒÂ© Brown (born on October 12, 1977) - lead guitar 2004-present\n","torrent":{"xt":"urn:btih:f3acf68a89e519d54fa4dd55b3f4c4237dca324f","amp;dn":"Black+Lips+-+Arabia+Mountain+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3acf68a89e519d54fa4dd55b3f4c4237dca324f","infoHashBuffer":{"type":"Buffer","data":[243,172,246,138,137,229,25,213,79,164,221,85,179,244,196,35,125,202,50,79]},"announce":[],"urlList":[]}}