{"title":"Tony Judt - European History &amp; Culture (7 books)","uid":9094029,"size":111037342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f48ec5731111fa8e1e5d8a29202baa517edd5f31&amp;dn=Tony+Judt+-+European+History+%26amp%3B+Culture+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"workerbee","files":-1,"time":1382647738,"description":"\nTONY JUDT (1948-2010) was a British historian and essayist who specialized in European history.  He served as the Erich Maria Remarque Professor in European Studies at New York University and Director of NYU's Erich Maria Remarque Institute.\n\nJudt's early work focussed on the intellectual history and political culture of modern France.  In PAST IMPERFECT (1992), Judt castigated French intellectuals of the postwar era, above all Jean-Paul Sartre, for their &quot;self-imposed moral amnesia&quot; and blind faith in Stalin's communism.  THE BURDEN OF RESPONSIBILITY (1998) used the lives of the three French intellectuals (Leon Blum, Albert Camus, and Raymond Aron) to examine pivotal issues in the history of contemporary French society: antisemitism and the dilemma of Jewish identity, political and moral idealism in public life, the Marxist moment in French thought, the traumas of decolonization, the disaffection of the intelligentsia, and the insidious quarrels rending Right and Left.\n\nJudt later turned his attention to the wider issues of European history.  POSTWAR: A HISTORY OF EUROPE SINCE 1945 (2005) was acclaimed for its sweeping, encyclopedic scope and was a runner up for the 2006 Pulitzer Prize for General Non-fiction.  It was named as one of the ten best books of 2005 by the New York Times Book Review and won the 2006 Arthur Ross Book Award for the best book published on international affairs.\n\nIn REAPPRAISALS (2008), Judt argued that we have entered an &quot;age of forgetting&quot; and drew provocative connections between a dazzling range of subjects, from Jewish intellectuals and the challenge of evil in the recent European past to the interpretation of the Cold War to the displacement of history by heritage.\n\nThe last book published during his lifetime, ILL FARES THE LAND (2010), lamented the breakdown of the post-war Keynesian policy consensus as well as the rise of neo-liberal economics with its political manifestations under Thatcher, Reagan, and others.  It concludes with a passionate appeal for a return to social-democratic ideals.\n\nHe continued his work as a public intellectual right up until his death, writing essays for the New York Review of Books and composing and completing a synthetic intellectual history under the title THINKING THE TWENTIETH CENTURY (2012) with fellow historian Timothy Snyder.  He also wrote a memoir entitled THE MEMORY CHALET, which was published posthumously in November 2010.\n\n\nThe 7 books in this collection are a mix of PDF and/or EPUB &amp; MOBI formats, as specified below:\n\n* THE BURDEN OF RESPONSIBILITY: BLUM, CAMUS, ARON, AND THE FRENCH TWENTIETH CENTURY (University of Chicago Press, 1998).  [PDF]\n\n* ILL FARES THE LAND (Penguin, 2010).  [EPUB / MOBI]\n\n* THE MEMORY CHALET (Penguin, 2010).  [EPUB / MOBI]\n\n* PAST IMPERFECT: FRENCH INTELLECTUALS, 1944-1956 (University of Chicago Press, 1992).  [PDF]\n\n* POSTWAR: A HISTORY OF EUROPE SINCE 1945 (Penguin, 2005).  [PDF / EPUB / MOBI]\n\n* REAPPRAISALS: REFLECTIONS ON THE FORGOTTEN TWENTIETH CENTURY (Penguin, 2008).  [PDF / EPUB / MOBI]\n\n* THINKING THE TWENTIETH CENTURY [with Timothy Snyder] (Penguin, 2012).  [EPUB / MOBI]\n","torrent":{"xt":"urn:btih:f48ec5731111fa8e1e5d8a29202baa517edd5f31","amp;dn":"Tony+Judt+-+European+History+%26amp%3B+Culture+%287+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f48ec5731111fa8e1e5d8a29202baa517edd5f31","infoHashBuffer":{"type":"Buffer","data":[244,142,197,115,17,17,250,142,30,93,138,41,32,43,170,81,126,221,95,49]},"announce":[],"urlList":[]}}