{"title":"Hitler vs Stalin - The Second World War On The Eastern Front In ","uid":4647122,"size":47710508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4c7eec2361d5ae0e5d5e2e974a2cecfd53c9394&amp;dn=Hitler+vs+Stalin+-+The+Second+World+War+On+The+Eastern+Front+In+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"pokerrocket","files":1,"time":1231924926,"description":"Hitler vs Stalin - The Second World War On The Eastern Front In Photographs PDF\n\nHitler versus Stalin shows the brutality, horror and heroism of war on the Eastern Front as never before. Over 300 rare photographs, many recently released from the Russian archives and previously unpublished in the West, illustrate every phase and aspect of the Eastern Front campaigns, from the Nazis' early blitzkrieg successes, the battle for Moscow and the siege of Leningrad, through the street fighting for Stalingrad, and the Soviet successes at Kursk and Operation Bagration, to the climactic fall of Berlin and the link-up between Soviet and Western armies amid the ruins of the &quot;1000-year Reich&quot;. This is total war in its most barbaric form: nearly 30 million Soviet soldiers and citizens were killed during four years of struggle against their German invaders.\n\nAbout the Author\nThe late John Erickson was based at the University of Ednburge where he was Professor Emeritus and Honorary Fellow in Defence Studies. Ljubica Erickson spent many years acting in concert with her husband researching Russian military affairs, in particular the Soviet Army and the Soviet-German war.","torrent":{"xt":"urn:btih:f4c7eec2361d5ae0e5d5e2e974a2cecfd53c9394","amp;dn":"Hitler+vs+Stalin+-+The+Second+World+War+On+The+Eastern+Front+In+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4c7eec2361d5ae0e5d5e2e974a2cecfd53c9394","infoHashBuffer":{"type":"Buffer","data":[244,199,238,194,54,29,90,224,229,213,226,233,116,162,206,207,213,60,147,148]},"announce":[],"urlList":[]}}