{"title":"High Sierra (1941) Humphrey Bogart Eng (multisubs)","uid":5374957,"size":1033808713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f57995cf409d8caa2e1e5998b73840fcb20f5e03&amp;dn=High+Sierra+%281941%29+Humphrey+Bogart+Eng+%28multisubs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"johnefp","files":-1,"time":1266543480,"description":"Subtitles as TXT files (English, Spanish, Portuguese, French, Polish, Czech, Greek, Croatian, Slovenian, Hebrew) + subtitles in SUB/IDX files (Italian, German, Dutch, Arabic and Romanian) \n\n\n\nIn a manner of speaking, Humphrey Bogart had George Raft to thank for his ascendancy to stardom: after all, if Raft  hadn't turned down both High Sierra and The Maltese Falcon, Bogart  might have continued playing second-billed gangsters to the end of his days. Adapted from W. R. Burnett's novel by Burnett  and John Huston, High Sierra opens with gangster Roy Earle (Bogart) being paroled after a lengthy prison term. Though he enjoys the fresh air and sunshine of the outside world, Earle has no intention of giving up his criminal ways. In fact, his parole has been arranged by Big Mac (Donald MacBride), so that Earle can mastermind a big-time heist at a fancy California resort hotel. After a few unkind words with a crooked cop, Kranmer (Barton MacLane), in Big Mac's employ, Earle heads toward a fishing resort, where he is to commiserate with his inexperienced, hot-headed cohorts Babe (Alan Curtis) and Red (Arthur Kennedy). En route, he befriends a farm family, heading to LA in search of work. He falls in love with the family's club-footed daughter Velma (Joan Leslie)--though she never really gives him any encouragement--and makes a silent promise to finance an operation on her foot once he's gotten his share of the loot. At the mountain cabin rendezvous, Earle meets Marie (Ida Lupino), Babe's tough-but-vulnerable girlfriend. He angrily orders her to scram, but she stubbornly remains. Earle also finds himself the owner of a &quot;jinxed&quot; dog, whose previous masters have all met with early demises (a none-too-subtle foretaste of things to come). Marie is strongly attracted to Earle, but he refuses to have anything to do with her, reserving his affections for Velma. He arranges an operation for the girl with mob doctor Banton (Henry Hull), never suspecting that the self-serving Velma is planning all along to marry someone else. The robbery goes off without a hitch, save for the fact that &quot;inside man&quot; Mendoza (Cornel Wilde) panics and nearly gives the game away. While escaping, Babe and Red are killed in a car accident, but Earle and Marie escape. Having been disillusioned by Velma's indifference and by the fact that the untrustworthy Kranmer has taken over the late Big Mac's operation, Earle at last realizes that the only person he can truly depend upon is the faithful Marie. With the police hot on his trail, Earle tells Marie to look after herself, then heads alone into the High Sierras--where, in Greek Tragedy fashion, he &quot;busts out&quot; of life. As in Petrified Forest, Humphrey Bogart plays a burnt-out anachronism from an earlier era in crime in High Sierra; in the latter film, however, Bogart  has an innate nobility that allows the audience to empathize with him throughout. It is nothing short of amazing that, despite his superb performance in this 1940 film, he still had to wait until The Maltese Falcon for top billing in an &quot;A picture.&quot; High Sierra was remade in 1949 as Colorado Territory and in 1955 as I Died a Thousand Times. \n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0033717/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0033717/&lt;/a&gt;\n\n\n\nDirector:\nRaoul Walsh\n\n\n\n\tIda Lupino\t ... \tMarie\n\n\tHumphrey Bogart\t... \tRoy Earle\n\tAlan Curtis\t... \t'Babe'\n\tArthur Kennedy\t... \t'Red'\n\n\tJoan Leslie\t... \tVelma\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:35:40\nMovie complete : Yes\n\n[Video]\nResolution : 640x480  4:3\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 1333 Kbps\nQuality Factor : 0,18 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 1\nSample Rate : 48000 Hz\nBitRate : 96 Kbps\n\n\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks \n\nJohn\n","torrent":{"xt":"urn:btih:f57995cf409d8caa2e1e5998b73840fcb20f5e03","amp;dn":"High+Sierra+%281941%29+Humphrey+Bogart+Eng+%28multisubs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57995cf409d8caa2e1e5998b73840fcb20f5e03","infoHashBuffer":{"type":"Buffer","data":[245,121,149,207,64,157,140,170,46,30,89,152,183,56,64,252,178,15,94,3]},"announce":[],"urlList":[]}}