{"title":"Home of the Brave (1949) Xvid 1cd - War Drama - Lloyd Bridges, F","uid":10612286,"size":734081024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f57f756fe52febf9cf084a5678002605790a0b90&amp;dn=Home+of+the+Brave+%281949%29+Xvid+1cd+-+War+Drama+-+Lloyd+Bridges%2C+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"SaM","files":-1,"time":1406054551,"description":"Home of the Brave (1949) Xvid 1cd - War Drama - Lloyd Bridges, Frank Lovejoy [DDR]\n\nHome of the Brave is a 1949 film based on a 1946 play by Arthur Laurents. It was directed by Mark Robson and stars Douglas Dick, Jeff Corey, Lloyd Bridges, Frank Lovejoy, James Edwards, and Steve Brodie. The original play featured the protagonist being Jewish rather than black.\n\nThe National Board of Review named the film the eighth best of 1949.\n\nHome of the Brave utilizes the recurrent theme of a diverse group of men being subjected to the horror of war and their individual reactions, in this case, the hell of jungle combat against the Japanese in World War II.\n\nCAST:-\nFrank Lovejoy\nJames Edwards\nLloyd Bridges\nDouglas Dick\nSteve Brodie\nCliff Clark\n\nDirected by Mark Robson\nProduced by Stanley Kramer\nMusic by Dimitri Tiomkin\n\nSYNOPSIS:- Home of the Brave (1949)\nUndergoing psychoanalysis by an Army psychiatrist (Corey), paralyzed Black war veteran Private Peter Moss (Edwards) begins to walk again only when he confronts his fear of forever being an &quot;outsider.&quot;\n\nThe film uses flashback techniques to show Moss, an Engineer topography specialist assigned to a reconnaissance patrol who are clandestinely landed from a PT boat on a Japanese-held island in the South Pacific to prepare the island for a major amphibious landing. The patrol is led by a young major (Dick) and includes Moss's lifelong white friend Finch (Bridges), whose death leaves him racked with guilt; redneck-bigot corporal T.J. (Brodie); and sturdy but troubled Sergeant Mingo (Lovejoy).\n\nWhen the patrol is discovered Finch is left behind and captured by the Japanese who force him to cry out to the patrol. The dying Finch escapes and dies in Moss's arms. In a firefight with the Japanese, Mingo is wounded in the arm and Moss is unable to walk. T.J. carries Moss to the returning PT boat that covers the men with its twin .50 calibre machine guns.\n\nIn the film's crucial scene, the doctor forces Moss to overcome his paralysis by yelling a racial slur. From this point on, Moss will never again kowtow to prejudice. Mingo and Moss decide to go into business together.\n\nPRODUCTION NOTES:-\nArthur Laurents spent World War II with the Army Pictorial Service based at the film studio in Astoria, Queens and rose to the rank of sergeant. After his discharge he wrote a play called Home of the Brave in nine consecutive nights that was inspired by a photograph of GIs in a South Pacific jungle. The drama about anti-semitism in the military opened on Broadway on December 27, 1945 and ran for 69 performances.\n\nWhen Laurents sold the rights to Hollywood, he was told that the lead character would be turned from Jewish into black because &quot;Jews have been done&quot;.\n\nProducer Stanley Kramer filmed in secrecy under the working title of High Noon. The film was completed in thirty days for the cost of US$525,000 with Kramer using three different units at the same time. The majority of the film was made on indoor sets except for the climax that took place on Malibu beach with a former navy PT boat. Associate Producer Robert Stillman financed the film with the help of his father without the usual procedure of borrowing funds from banks.\n\nHome of the Brave managed to combine three of the top film genres of 1949: the war film, the psychological drama, and the problems of African-Americans. It was the first Hollywood movie to be allowed to use the word &quot;nigger&quot; after The Emperor Jones (with the 1934 establishment of the Hays Code, the word had been forbidden by censors).\n\nDirector Robson, who had begun his directing career with several Val Lewton RKO horror films brings a frighting feeling to the claustrophobic jungle set with Dimitri Tiomkin providing an eerie choral rendition of Sometimes I Feel Like a Motherless Child performed by the Jester Hairston choir as the patrol escapes their Japanese pursuers.\n\nIn the movie's final scene, Sergeant Mingo recites Eve Merriam's 1943 poem The Coward to Private Moss in friendship: &quot;Divided we fall, united we stand; coward take my coward's hand.&quot; The New York Herald Tribune reported that a man named Herbert Tweedy imitated the sound of twelve different birds native to the South Pacific for the film.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 86 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 86 mins","torrent":{"xt":"urn:btih:f57f756fe52febf9cf084a5678002605790a0b90","amp;dn":"Home+of+the+Brave+%281949%29+Xvid+1cd+-+War+Drama+-+Lloyd+Bridges%2C+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57f756fe52febf9cf084a5678002605790a0b90","infoHashBuffer":{"type":"Buffer","data":[245,127,117,111,229,47,235,249,207,8,74,86,120,0,38,5,121,10,11,144]},"announce":[],"urlList":[]}}