{"title":"Freddi Fish and the Missing Kelp Seeds","uid":5539502,"size":395718656,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f580f0de87cfe0e88ff68be6564d00d471a4f52a&amp;dn=Freddi+Fish+and+the+Missing+Kelp+Seeds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"cezen","files":-1,"time":1273179354,"description":"Ages 5-8 appx\n\nHere is the Amazon link\n &lt;a href=&quot;\nhttp://www.amazon.com/FREDDI-FISH-CASE-MISSING-KELP/dp/B00002S6FV&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/FREDDI-FISH-CASE-MISSING-KELP/dp/B00002S6FV&lt;/a&gt;\n\n\nDescription:\n\nGrandma Grouper's kelp seeds are missing. All of the ocean creatures are becoming increasingly hungry since the disappearance of Grandma Grouper's treasure chest filled with kelp seeds. Join Freddi Fish and her friend, Luther, in this undersea sleuthing adventure. The high-quality animation and high-energy soundtrack will entice children and encourage hours of learning play. Since no reading is involved, this is a great game for young learners to play on their own.\n\nSummary\n\t\tFreddi Fish is a cute story with engaging and very well done animations. It is pure entertainment and is more of an interactive video than a game, since much of the play time is spent watching the animations. Overall, the title is well done and each time it's played, it's a different game so it can be played again and again.\nEducational\nValue\n\t\tFreddi Fish is more entertainment than education. While there are some puzzles and math problems to do, the real purpose is to have fun and to be entertained. Children have to think about how they are going to help Freddi Fish find the missing seeds, so it does help them with general problem solving skills. However, its strength is in its entertainment value, so buy it for that reason.\nFun Factor\n\t\tThis is a fun, entertaining adventure game for young children. Children will be constantly entertained while they look for hidden objects. If they are too young to find the objects, then the animations and stories will keep them amused as they point and click. Older children will enjoy trying to figure out where the objects are hidden this time.\nLasting Value\n\t\tEvery time a child plays with Freddi Fish, the treasures and tools are hidden in different places so your child can have a different experience each time they play. For the various math problems, there are several difficulty levels so children of different abilities can be equally challenged.\nQuality\n\t\tThe animations and music are very well done and flow together nicely. Children will be entertained by watching and listening to Freddi Fish and his friends. The story has a nice ending and children will feel good that they helped save the day for Freddi and his grandmother.\nDescription\n\nKids will immerse themselves in this fun-filled adventure.\n\nIn Freddi Fish And The Case of The Missing Kelp Seeds, Grandma Grouper's kelp seeds are missing, and someone has to find them or the fish in the ocean will go hungry. Kids ages 3 to 8 will enjoy helping Freddi Fish and her sidekick Luther find the missing seeds-in one of 40 places! Over the journey, there are many items to help: click on the wooden plank, or the purple sea urchins; the fishing pole may be needed. Don't overlook anything-every item you see could be important.\n\n    * Rich feature film-quality animation\n    * Over 40 places to explore\n    * More than 15,000 hand-drawn frames of animation\n    * More than 500 secret click points\n\n\nFor Windows 3.1/Widnows 95/MACintosh\n\n1996 Humongous Entertainment Inc","torrent":{"xt":"urn:btih:f580f0de87cfe0e88ff68be6564d00d471a4f52a","amp;dn":"Freddi+Fish+and+the+Missing+Kelp+Seeds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f580f0de87cfe0e88ff68be6564d00d471a4f52a","infoHashBuffer":{"type":"Buffer","data":[245,128,240,222,135,207,224,232,143,246,139,230,86,77,0,212,113,164,245,42]},"announce":[],"urlList":[]}}