{"title":"Gettysburg-The Confederate high tide (Time-Life The Civil War)","uid":11754527,"size":30893143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5810b74a37c10fe9f876ebdd285ee6e51a83ce0&amp;dn=Gettysburg-The+Confederate+high+tide+%28Time-Life+The+Civil+War%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"STBGD","files":1,"time":1426294159,"description":"Gettysburg - The Confederate high tide (Time-Life The Civil War Series, US History Ebook).pdf\n\nPdf / English / 1985 Time-Life / 176 pages / 29.4 MB / ISBN10 0809447584\n\nTime-Life's Civil War series devotes an entire volume to the Battle of Gettysburg, a topic which many books have been written either in part or on one aspect of the fight. In this case they have done a great job of concentrating on this one campaign which culminated in the so-called &quot;high tide of the Confederacy.&quot;\n\nDuring the Summer of 1863 Lee's Army of Northern Virginia had defeated the federals at Fredericksburg in the Winter and Chancellorsville in the Spring. Now it was time to take his army, which was short of supplies, to the North in order to allow his men the opportunity to live off the rich farmlands untouched by war. His invasion might cost Lincoln politically and the French and the British might extend diplomatic recognition to the Confederacy... an act which might lead to a negotiated peace.\n\nHooker managed to get himself replaced as the Army of the Potomac shadowed the Confederates on their march into Maryland and then Pennsylvania. It seemed as if the rebels might even take the Pennsylvania capital of Harrisburg when circumstances redirected them to the town of Gettysburg.\n\nThree days of epic fighting permanently engraved the names of Seminary Ridge, Cemetary Ridge, the Peach Orchard, the Devil's Den, Little Round Top and Culp's Hill. In the end General Lee would have to return his army to Virginia. Meade, for his part, failed to keep Lee from safely returning to his own territory and missed the opportunity to destroy him while crossing the Potomac.\n\nA great book with some excellent photos, artwork and maps, although the maps in some places could have been easier to find while reading the text. Sidebars include A Prussian Giant for the Confederacy, A Clash of Sabers at Loudoun Valley, Soldiering on Horseback, Jeb Stuart's Untimely Ride, a piece on the Gettsyburg cyclorama, and Images of the Aftermath.\n\nAmazon","torrent":{"xt":"urn:btih:f5810b74a37c10fe9f876ebdd285ee6e51a83ce0","amp;dn":"Gettysburg-The+Confederate+high+tide+%28Time-Life+The+Civil+War%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5810b74a37c10fe9f876ebdd285ee6e51a83ce0","infoHashBuffer":{"type":"Buffer","data":[245,129,11,116,163,124,16,254,159,135,110,189,210,133,238,110,81,168,60,224]},"announce":[],"urlList":[]}}