{"title":"50 books by Wyatt North: Biographies, History, Scripture, Saints","uid":15687828,"size":57066876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5bc451e3035d953cb468a249d1970996039323d&amp;dn=50+books+by+Wyatt+North%3A+Biographies%2C+History%2C+Scripture%2C+Saints&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"catholicstuff","files":150,"time":1472362445,"description":"50 books by Wyatt North about Catholic Saints, Scripture, Prayer, Popes, History, Biographies, Christian Authors in EPUB/MOBI/PDF\r\n\r\n\r\nThe Life and Prayers of Saint Francis of Assisi\r\nA History of the Popes: Complete Series\r\nA History of the Popes: Volume I: Origins to the Middle Ages\r\nA History of the Popes: Volume II: Middle Ages to the Protestant Reform\r\nA History of the Popes: Volume III: The Protestant Reformation to the Twenty-First Century\r\nC.S. Lewis: A Life Inspired\r\nCatholic Prayer Book: An Anthology and Introduction to Prayer\r\nChristian Writing Decoded: On Grace and Free Will\r\nChristian Writing Decoded: The Didache\r\nChristian Writing Decoded: The Way of Perfection\r\nDavid and the Psalms\r\nJ.R.R. Tolkien: A Life Inspired\r\nMother Teresa: A Life Inspired\r\nPope Benedict XVI: Protector of Faith or Opponent of Progress?\r\nPope Francis (Pastor of Mercy)\r\nPope John XXIII: The Good Pope\r\nPrayers by Catholic Saints\r\nSaint Francis of Assisi: A Life Inspired\r\nSaint Padre Pio: In the Footsteps of Saint Francis\r\nSaint Therese of Lisieux: A Model for Our Times\r\nThe Catholic Cookbook: A Collection of Recipes From Our Family to Yours\r\nThe Dark Night of the Soul (Annotated)\r\nThe History of Christmas\r\nThe Life and Legacy of Pope John Paul II\r\nThe Life and Prayers of Mother Teresa\r\nThe Life and Prayers of Saint Anthony of Padua\r\nThe Life and Prayers of Saint Augustine\r\nThe Life and Prayers of Saint Benedict\r\nThe Life and Prayers of Saint Ignatius of Loyola\r\nThe Life and Prayers of Saint Joan of Arc\r\nThe Life and Prayers of Saint John of the Cross\r\nThe Life and Prayers of Saint John the Baptist\r\nThe Life and Prayers of Saint Joseph\r\nThe Life and Prayers of Saint Jude\r\nThe Life and Prayers of Saint Lucy of Syracuse\r\nThe Life and Prayers of Saint Luke\r\nThe Life and Prayers of Saint Mary\r\nThe Life and Prayers of Saint Michael the Archangel\r\nThe Life and Prayers of Saint Padre Pio\r\nThe Life and Prayers of Saint Patrick\r\nThe Life and Prayers of Saint Paul\r\nThe Life and Prayers of Saint Teresa of Avila\r\nThe Life and Prayers of Saint Therese of Lisieux\r\nThe Life and Prayers of Saint Thomas Aquinas\r\nThe Life and Times of Jesus: From His Earthly Beginnings to the Sermon on the Mount (Part I)\r\nThe Life and Times of Jesus: The Messiah Behind Enemy Lines (Part II)\r\nThe Life and Words of GK Chesterton\r\nThe Life and Writings of Saint John of the Cross\r\nThe Lives and Prayers of Catholic Saints: Volume I\r\nThe Lives and Prayers of Catholic Saints: Volume II\r\n\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:f5bc451e3035d953cb468a249d1970996039323d","amp;dn":"50+books+by+Wyatt+North%3A+Biographies%2C+History%2C+Scripture%2C+Saints","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5bc451e3035d953cb468a249d1970996039323d","infoHashBuffer":{"type":"Buffer","data":[245,188,69,30,48,53,217,83,203,70,138,36,157,25,112,153,96,57,50,61]},"announce":[],"urlList":[]}}