{"title":"Evergrey - Greatest Hits (Best Of) (2015)ak","uid":11675637,"size":150269056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6a43e2e3f647895af12fac46dc97fbe29461a1f&amp;dn=Evergrey+-+Greatest+Hits+%28Best+Of%29+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"analogkid6103","files":13,"time":1422853121,"description":"\nProgressive/power metal from Sweden, best of compilation released in 2015.\n\nimage\n\n\n\nFor decades, Sweden has continued to produce the top names in heavy metal, regardless of sub-genre. Although debuting back in '98, this Gothenburg outfit is only now receiving the international acclaim due them. Molding the various pedigrees of their countrymen into one distinctive sound: supreme musicianship prized by perfectionists, yet intense enough to win the blackened hearts of those more primordial, EVERGREY offer fans something truly different.\n\nIn these days of paint-by-numbers releases, where everyone mimics the elite purveyors of a particular style, EVERGREY's music is something unique. Reviewers, and fans alike, typically use other bands as a reference point when discussing music. &quot;They sound like X,&quot; is a common refrain. Not so, EVERGREY. Built on a solid foundation of progressive metal, the multi-dimension voice of guitarist Tom S. Englund is what separates these Swedes. The lanky frontman possesses both a coarse, rasp and silky voice, equally suited for the band's diverse repertoire. Regardless of which set of vocal chords he employed, Englund delivers an emotional performance, from pained, heart wrenching agony to bitter aggression. On their fourth opus, Recreation Day, the band has graduated to the next level, constructing eleven elaborately layered songs, which highlight this passion soaked voice. Paradoxically, as lovely as the piano accompanied title track and the sultry female wails on 'Darkest Hour' are, EVERGREY excel onstage, still a weak point for most prog-metal acts. The live intensity is shared by the likes of 'Visions' and the opener, 'The Great Deceiver'.\nimage\n&quot;It's not a concept album,&quot; explains Englund, &quot;but the title deals with death. It's something we (in the band) have all had to deal with, one way or another, be it grandparents or more severe things, like friends. After that, you need something to get away, a recreation day.&quot; The title cut mimics that sentiment, lyrically and through the music. &quot;The (aggressive) way it starts, that's sort of a mad at God thing,&quot; he confesses. &quot;The song begins really 'metal,' the most down tuned song we've ever done. Then it goes into a slower paced. The music is representative of what EVERGREY is about, the diversity we have in most of our songs: piano, my vocals, guitar solos, all that crap. I've had that melody line stuck in my head, since the last album. I never quite got it together, as I wanted it, until now. My idea was to make it really beautiful and hard hitting.&quot;\n\nEnglund, and guitar partner Henrik Danhage, produced Recreation Day, along with the talented Fredrik Nordstrom (In Flames/HammerFall). The results are stellar, the best sounding EVERGREY disc to date. The guitarist agrees. &quot;To be honest, this album has been such hard work on us: two and half months of pre-production, nine weeks in the studio. I'm quite fucking fed up with it,&quot; he jokes. &quot;In the studio, it got to the point we worked 36 hours in a row, without sleep. It was very hectic. The only time we had off was Christmas.&quot;\n\nDespite slavish labors, the guitarist finds time to enjoy the varied sounds it offers. &quot;I like the acoustic song, 'Madness Caught Another Victim.' It really differs from what we've done before. It's not the vocal melodies I usually use. It stands out. I promised the promoter from ProgPower USA, Glen Harveston, that I'd do an acoustic song again, only guitars and vocals. We had 'As Light Is Our Darkness' on the first album and he really loved that song. I tried to get something together for the album during pre-production, but couldn't. In the studio, I de-tuned the guitar into a really strange chord, that I don't even remember now, which is sad, because in France, they want us to go on an acoustic tour, and I can't even play the song! I actually recorded the whole song in my kitchen, guitars and vocals. Same with 'I'm Sorry,' the keyboards and vocals as well. I have a great kitchen! I like 'Recreation Day' a lot, but 'Here I Lie Bleeding' is probably my favorite on the album, because it's so direct and a very short piece of music.&quot;\n\nThe aforementioned 'I'm Sorry' is another tune that's over quickly. Although it fits snuggly in the midst of Recreation Day, most have no idea it's not an EVERGREY original. &quot;It's actually a cover of the Swedish artist, Dilba,&quot; confesses Englund. &quot;It's was a big hit. One of the most played songs on Swedish radio, ever! I always thought it was a fantastic song. It's quite old, like eleven years now, but it feels very fresh. I've always wanted to do it. This time I felt we had to do it, lest someone else come along and do it first. The original was a real pop song, a ballad. We've taken it to a different level, tougher, I think.&quot;\n\nSpeaking of tough stands, 'Unforgivable' is a diatribe, reviled by the problems of child molestation within the Catholic church. &quot;The cover art reflects that too. We were planning to do a whole album about that idea,&quot; he admits, &quot; but we felt we needed to do some research first, to be able to convey our opinion. I know it would cause a hell of a lot of problems for everyone involved in the project, especially in America. I'm not saying we won't do it, because it upsets me like nothing else.&quot;\n\nThe disc closes with 'Trilogy Of The Damned', previously available solely as a Japanese bonus on In Search Of Truth. &quot;We had so many e-mail requests and demands that we put the song on the web, or re-release it, because people can't afford to buy Japanese CDs for $35. We figured we'd put it on this time. It's a nine minute song, piano and vocals only. The songs are 'As Light Is Our Darkness', 'Words Mean Nothing' and 'The Shocking Truth'.&quot;\n\nWith Recreation Day, EVERGREY have created a cerebral masterwork which rocks. Kick back and enjoy the sounds!\n\n\nEvergrey At MySpace\n\n\n\n\n\n2015 Greatest Hits (Best Of)\n\n\nTracklist:\n\n01. Monday Morning Apocalypse\n02. King Of Errors\n03. Solitude Within\n04. The Great Deceiver\n05. Nosferatu\n06. I'm Sorry\n07. At Loss For Words\n08. Shadowed\n09. Hymns For The Broken\n10. More Than Ever\n11. These Scars\n12. The Aftermath\n13. Words Mean Nothing\n\nimage\nGenre: Progressive\nSubgenre: Progressive / Power Metal\nBitrate: 320 k\nSize: 143.31 MB\nShow/Hide Files:\n13 files","torrent":{"xt":"urn:btih:f6a43e2e3f647895af12fac46dc97fbe29461a1f","amp;dn":"Evergrey+-+Greatest+Hits+%28Best+Of%29+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a43e2e3f647895af12fac46dc97fbe29461a1f","infoHashBuffer":{"type":"Buffer","data":[246,164,62,46,63,100,120,149,175,18,250,196,109,201,127,190,41,70,26,31]},"announce":[],"urlList":[]}}