{"title":"Relativity for Everyone: How Space-Time Bends (2013) pdf","uid":8926393,"size":1654875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6a4ea47c85a981e51266aef63a971aa06891505&amp;dn=Relativity+for+Everyone%3A+How+Space-Time+Bends+%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1379374443,"description":"This book explains the theory of special and general relativity in detail, without digressions such as information on Einstein's life or the historical background. However, complicated calculations are replaced with figures and thought experiments, the text being formulated in such a way that the reader will be able to understand the gist intuitively. The first part of the book focuses on the essentials of special relativity. Explanations are provided of the famous equivalence between mass and energy and of why Einstein was able to use the theory of electrodynamics as a template for his &quot;electrodynamics of moving bodies&quot;, simply because besides the speed of light, the electric charge itself is also absolute, leading to the relativity of other physical quantities. General relativity is then introduced, mainly with the help of thought experiments. Reference is made to the previously introduced special relativity and the equivalence principle and, using many figures, it is explained how space-time is bending under gravity. The climax of the book comes with the Einstein equations of gravity that describe the way in which matter bends space-time. The reader is shown how to obtain the famous Schwarzschild solution. There follows a numerically correct and yet intuitive explanation of the classic effects such as light bending or the movement of the perihelion. The book concludes by explaining the Friedmann model of the big bang and why the theory of gravity does not fit with quantum theory.","torrent":{"xt":"urn:btih:f6a4ea47c85a981e51266aef63a971aa06891505","amp;dn":"Relativity+for+Everyone%3A+How+Space-Time+Bends+%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a4ea47c85a981e51266aef63a971aa06891505","infoHashBuffer":{"type":"Buffer","data":[246,164,234,71,200,90,152,30,81,38,106,239,99,169,113,170,6,137,21,5]},"announce":[],"urlList":[]}}