{"title":"The Rolling Stones - Let It Bleed (1969) WMA320","uid":6307724,"size":109506902,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7134902d41769dbd21aafb5460eec2602bca27c&amp;dn=The+Rolling+Stones+-+Let+It+Bleed+%281969%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302410495,"description":"There was only one version of Let It Bleed. This is it. It was released simultaneously in the UK and US on Dec 5, 1969. The Stones had the guts to leave off their July megahit Honky Tonk Woman and instead (much to the chagrin of record company execs) put a countrified satire of their own hit on the album. The Let It Bleed sessions also produced 3 of their finest works that are not on the album (Honky Tonk Woman, Sweet Virginia, and Sister Morphine).\nThe album contains a huge chunk of the work that made the band famous for this era....Gimme Shelter, Love in Vain, Let It Bleed, Midnight Rambler, and You Can't Always Get What You Want have all pretty much defined not only the Stones but this era of English-speaking history to the world. The album is a staple in every serious rock collection.....it's that simple.\n\nThe album has several notable facts:\n.....Brian Jones died the same day the last tracks were recorded in London\n.....M.C. Escher and photographer Man Ray were both invited to design the cover (they declined)\n.....it includes the 1st song not sung by Mick - You Got The Silver, sung by Keith (Mick's version was left in the can)\n.....Gimme Shelter was written by Keith while he waited in his car for girlfriend Anita Pallenberg who was starring with Mick (and actually making love instead of only acting) on the set of Performance\n.....the Stones have long been accused of stealing many of the song bits from Ry Cooder who was involved in the early sessions and laid down basic tracks that developed into many of the songs\n\nThe tracks were recorded between Feb 9 and Jul 2, 1969 at Olympic Sound, London, with final mixing done at Sunset Sound and Elektra Studios in L.A. between Oct 18 and Nov 3. You Can't Always Get What You Want dates slightly earlier, first recorded on Nov 17, 1968 at Olympic with Al Kooper on French horn, producer Jimmy Miller on drums instead of Charlie, and the 35 member London Bach Choir. In addition to the 9 tracks that made the album, the Let It Bleed sessions also produced:\n.....the entire jam session on April 23, 1969 that became the album Jammin' With Edward\n.....Honky Tonk Woman (released as a single - Mick Taylor's 1st session with the band)\n.....All Down The Line (released on Exile On Main Street)\n.....Stop Breaking Down (released on Exile On Main Street)\n.....Sweet Virginia (released on Exile On Main Street)\n.....Shine A Light (released on Exile On Main Street)\n.....Loving Cup (released on Exile On Main Street)\n.....Sister Morphine (released on Sticky Fingers)\n\nThis information comes from &quot;It's Only Rock And Roll: The Ultimate Guide To The Rolling Stones&quot; by Karnbach and Bernson and from my own collection. \n\nHelp other customers find the most helpful reviews \nWas this review helpful to you? Yes No Report abuse | Permalink\nComment Comments (6)\n\n\n\n54 of 55 people found the following review helpful: \n5.0 out of 5 stars The Stones Best Album: Please follow instructions, PLAY LOUD, October 23, 2002 \nBy Lawrance M. Bernabo (The Zenith City, Duluth, Minnesota) - See all my reviews\n(TOP 10 REVIEWER)    (VINE VOICE)    (COMMUNITY FORUM 04)    This review is from: Let It Bleed (Audio CD) \nFor my money this is the best Rolling Stones album ever, even if it is really not a typical example of their work. I do not think you can find a better opening to a Stones album than &quot;Gimme Shelter&quot; with Mary Clayton providing awesome guest vocals to some apocalyptic lyrics. The catchy guitar lead suggests bad things are coming this way, a sentiment amplified by the high pitched, wordless vocals and the complimentary piano before the rest of the band crashes in and Mick Jagger starts singing. I also know you can not top &quot;You Can't Always Get What You Want&quot; as the big finale, what with the London Bach Choir lending their voices (not to mention Al Kooper providing the most memorable French Horn work on a sixties rock 'n' roll album). I understand the idea that this is the Stones' response to &quot;Hey Jude,&quot; but it certainly stands on its own as a classic pop tune, which makes it a most atypical Stones song on that grounds alone. Then there is the philosophical sentiments of the chorus, which again has you double-checking to make sure this is the same Stones who did &quot;Sympathy for the Devil&quot; and were the acknowledged bad boys of rock 'n' roll. \n\n&quot;Midnight Rambler,&quot; which originally began Side 2 in those days of vinyl, is another one of those most rare long Stones songs and featured Mick Jagger wailing on his harp. &quot;Monkey Man&quot; is my all time favorite non-Stones hit song with Jagger pointing out &quot; I hope we're not too messianic or a trifle too satanic&quot; (I used it for a class assignment once as the music background for a Pat Paulsen speech) and &quot;Country Honk&quot; is a countrified version of their hit &quot;Honky Tonk Woman.&quot; You also have a couple of acoustic blues tracks with &quot;You Got the Silver,&quot; which offers up the first lead vocals by Keith Richards, and a cover of Robert Johnson's &quot;Love in Vain.&quot; &quot;Live With Me&quot; is a solid Stone rocker and the title song is okay, but what is important is that title: it fostered an inherent comparison with &quot;Let It Be,&quot; but since that was the Beatles' weakest album, the Stones came out ahead on this one. Those were fun days in rock and roll, boys and girls, let me tell you. \n\nSpecial mention to the efforts of Nicky Hopkins on this album, who plays piano on most of the key tracks as well as the late Brian Jones, who appears on two of the tracks, as does his replacement, Mick Taylor. On top of all that, I love the way the back of the album deconstructs the front. &quot;Beggar's Banquet&quot; might be the more traditional Rolling Stones album, but &quot;Let It Bleed&quot; still holds the top spot for me and the last time I put together my Top 10 albums of all time list for my Pop Culture class &quot;Let It Bleed&quot; was on it. Finally, as it says at the bottom of the liner notes: THIS RECORD SHOULD BE PLAYED LOUD. It should also be played often. \n\nby Richard R. Carlton\n\nTRACKLIST:\n\n01 - Gimme Shelter.wma                                                \n02 - Love In Vain.wma                                                 \n03 - Country Honk.wma                                                 \n04 - Live With Me.wma                                                 \n05 - Let It Bleed.wma                                                 \n06 - Midnight Rambler.wma                                             \n07 - You Got The Silver.wma                                           \n08 - Monkey Man.wma                                                   \n09 - You Can't Always Get What You Want (Version 2).wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:f7134902d41769dbd21aafb5460eec2602bca27c","amp;dn":"The+Rolling+Stones+-+Let+It+Bleed+%281969%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7134902d41769dbd21aafb5460eec2602bca27c","infoHashBuffer":{"type":"Buffer","data":[247,19,73,2,212,23,105,219,210,26,175,181,70,14,236,38,2,188,162,124]},"announce":[],"urlList":[]}}