{"title":"Twenty One Pilots","uid":8705666,"size":91829273,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f73c2f1983b36a00ea35f9e41f7b6a3b92f6cbb7&amp;dn=Twenty+One+Pilots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"iParasite","files":12,"time":1374146782,"description":"  1 Ode To Sleep\n  2 Holding on to You\n  3 Migrane\n  4 House of Gold\n  5 Car Radio\n  6 Semi-Automatic\n  7 Screen\n  8 The Run and Go\n  9 Fake You Out\n  0 Guns For Hands\n  1 Trees\n  2 Truce\n\n  Columbus, Ohio-based pop duo Twenty One Pilots spent the few short years leading up to Vessel, their debut recording for Atlantic Records subsidiary Fueled by Ramen, touring ceaselessly and reaching out to their growing fan base on a grassroots level. The emphatic pop stylings with more-than-occasional rap interjections made by Tyler Joseph and Josh Dun -- two Midwestern high-school friends who worked hard enough to build up something some people took notice of, still young and full of enough energy to keep up with the twists and turns once the major labels came knocking -- sound custom-made for the trajectory of their career up to this point. The move from rough demo versions on self-released recordings like 2011's Regional at Best to the glossy, radio-ready production of Vessel (handled by Greg Wells, who's also responsible for hits by Adele, Kid Cudi, Katy Perry, and others) seems like an entirely natural progression for the band's dorky rhymes that always run out just in time for an epically hooky chorus. \n\n  Vessel is front-loaded with three relentlessly catchy single-ready standouts: the schizo-frenetic hip-hop via indie bounce of &quot;Ode to Sleep,&quot; the silky groove of &quot;Holding on to You,&quot; and the vocoder radio pop of &quot;Migraine.&quot; These three songs encapsulate the band's unique calling card, offering up the best examples of what makes their approach different from any number of bands working in similar territory, with enormous beats and full-force electro-pop running through hooks modeled for Top 40 radio, each element punctuated by Joseph's down-to-earth sentiments coming through in the form of caffeinated rap codas. The continuity of the album isn't as strong after those first three songs. The influence of dour emo-pop like Bright Eyes shows up in some of the vocal stylings, as on &quot;Semi-Automatic&quot; and the uncharacteristically folky &quot;House of Gold.&quot; \n\n  The entire ride is more of a party than an emo-fest, though, and a decidedly more commercial take on the parts of indie rock that appeal to a mass market, with banging tunes like &quot;Fake You Out&quot; leaning closer to Coldplay or Fun. than they do to MGMT, but with an eye toward both sides of the coin. Twenty One Pilots definitely have a formula for both songwriting and production that renders some of the songs here slightly redundant, but even that doesn't take away from the overall value of the album. Vessel is a lively, energetic, pulsing collection of candy-coated big-budget pop with just enough personality to make it more engaging than a large percentage of other groups out there at the moment doing something similar.\t\t","torrent":{"xt":"urn:btih:f73c2f1983b36a00ea35f9e41f7b6a3b92f6cbb7","amp;dn":"Twenty+One+Pilots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73c2f1983b36a00ea35f9e41f7b6a3b92f6cbb7","infoHashBuffer":{"type":"Buffer","data":[247,60,47,25,131,179,106,0,234,53,249,228,31,123,106,59,146,246,203,183]},"announce":[],"urlList":[]}}