{"title":"Supernatural.S10E02.720p.HDTV.X264-DIMENSION","uid":11218935,"size":814820965,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f7863e987f77fbf852e77ec00ba65d37b2f58769&amp;dn=Supernatural.S10E02.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Thhaque","files":1,"time":1413355481,"description":"[b]Supernatural\n\n[IMG]http://i.imgur.com/nC3fK18.jpg[/IMG]\n\nGenre: Comedy, Drama, Fantasy, Horror, Mystery, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Eric Kripke\nCast: Jensen Ackles, Jared Padalecki, Jim Beaver, Misha Collins\n\n.: Plot :.\nThis television drama is about two brothers, Sam and Dean, who were raised by their father, John, to hunt and kill all things that go &quot;bump in the night&quot; after his wife, Mary, was murdered by something supernaturally evil when the boys were young. 22 years later the brothers set out on a journey, fighting evil along the way, to find their recently missing father who, when they finally meet up with, reveals he knows what killed their mother, a demon, and has found a way to track and kill it. Meanwhile, Sam starts to develop frightening abilities that include death visions, visions of people dying before it actually happens. These visions are somehow connected to the demon who murdered his mother and it's mysterious plans that seem to be all about Sam. When their father dies striking a deal with the very same devil that had killed his wife, the brothers, now alone and without their mentor, are determined to finish the crusade their father started. But disturbing revelations about Sam's part in the demon's apocalyptic plans are presented when John's dying last words to Dean are revealed.[/b]","torrent":{"xt":"urn:btih:f7863e987f77fbf852e77ec00ba65d37b2f58769","amp;dn":"Supernatural.S10E02.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7863e987f77fbf852e77ec00ba65d37b2f58769","infoHashBuffer":{"type":"Buffer","data":[247,134,62,152,127,119,251,248,82,231,126,192,11,166,93,55,178,245,135,105]},"announce":[],"urlList":[]}}