{"title":"Soda Stereo - Dynamo (1992) WMA320","uid":6121257,"size":138902935,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f79de71d569c5eeed0743017eb9a993e5ae73c9f&amp;dn=Soda+Stereo+-+Dynamo+%281992%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1295751876,"description":"A partir de este momento los miembros de Soda tomaron conciencia de que se encontraban en el centro de la escena, por lo que decidieron dar lugar a la experimentaciÃƒÂ³n musical e impulsar abiertamente lo que serÃƒÂ­a conocido como la &quot;movida sÃƒÂ³nica&quot;. A fines de 1992 Soda Stereo lanzÃƒÂ³ su noveno ÃƒÂ¡lbum, Dynamo, presentado con seis recitales realizados en el Estadio Obras a fines de ese mismo aÃƒÂ±o. Cada show contÃƒÂ³ con una banda distinta como invitados y asÃƒÂ­ estuvieron de soporte BabasÃƒÂ³nicos, Juana La Loca, Martes Menta y TÃƒÂ­a Newton. La &quot;movida sÃƒÂ³nica&quot;, de la que tambiÃƒÂ©n formarÃƒÂ­an parte Demonios de Tasmania y Los Brujos, por ejemplo, derivarÃƒÂ­a luego hacia el llamado &quot;Nuevo Rock Argentino&quot;, con Attaque 77, Massacre o El Otro Yo.\n\nLuego viene Dynamo (1992) que consistiÃƒÂ³ en tomar CanciÃƒÂ³n Animal y destruirlo. Es como si a CanciÃƒÂ³n Animal lo hubiÃƒÂ©ramos metido dentro del agua. Y, a nivel sonoro, quisimos producir eso, las canciones tenÃƒÂ­an mÃƒÂ¡s que ver con algo hipnÃƒÂ³tico. La idea era remixarlo, mezclarlo con algo mÃƒÂ¡s dance e incluir algo mÃƒÂ¡s trance en nuestra mÃƒÂºsica. SÃƒÂ© que quienes adoptaron ese disco lo quieren y a mÃƒÂ­ me pasa lo mismo. (Gustavo Cerati)\nDynamo no vendiÃƒÂ³ como se esperaba, en gran medida porque el grupo decidiÃƒÂ³ cambiar de compaÃƒÂ±ÃƒÂ­a discogrÃƒÂ¡fica inmediatamente despuÃƒÂ©s de grabado. Sony entonces, no tenÃƒÂ­a intenciones de apoyar un grupo que emigraba y BMG no podÃƒÂ­a promocionar un producto de otra empresa.\n\nEn noviembre de 1992 los Soda fueron protagonistas de un hecho inÃƒÂ©dito en la Argentina: la transmisiÃƒÂ³n de TV en stereo. Los tres mÃƒÂºsicos mÃƒÂ¡s Tweety GonzÃƒÂ¡lez (teclados) y Flavio Etcheto (trompeta) tocaron casi todo el ÃƒÂ¡lbum en el programa Fax en Concierto, conducido por NicolÃƒÂ¡s Repetto por el Canal 13 de Buenos Aires. Con una puesta de luces y un sonido impecables Cerati cantÃƒÂ³ sobre pistas previamente grabadas de las canciones y reforzaron en vivo guitarras, bajo y baterÃƒÂ­a.\n\npor WIKIPEDIA\n\n01 - Secuencia Inicial.wma                                       \n02 - Toma La Ruta.wma                                            \n03 - En Remolinos.wma                                            \n04 - Primavera 0.wma                                             \n05 - Camaleon.wma                                                \n06 - Luna Roja.wma                                               \n07 - Sweet Sahumerio.wma                                         \n08 - Ameba.wma                                                   \n09 - Nuestra Fe.wma                                              \n10 - Claroscuro.wma                                              \n11 - Fue.wma                                                     \n12 - Texturas.wma    \n\nWMA 320Kbps 44100Kbps STEREO","torrent":{"xt":"urn:btih:f79de71d569c5eeed0743017eb9a993e5ae73c9f","amp;dn":"Soda+Stereo+-+Dynamo+%281992%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f79de71d569c5eeed0743017eb9a993e5ae73c9f","infoHashBuffer":{"type":"Buffer","data":[247,157,231,29,86,156,94,238,208,116,48,23,235,154,153,62,90,231,60,159]},"announce":[],"urlList":[]}}