{"title":"virtual audio cable 4.0.1 full","uid":4360101,"size":154057,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f7c633d52963c1559d8f70309255ca27ee9310d3&amp;dn=virtual+audio+cable+4.0.1+full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"UltraLeetJ","files":1,"time":1219606252,"description":"This was something which lurked around the private file sharing places. I am uploading this with the intention of making such software easier to find. The torrent is relatively small and installing it is very easy. Just open the zip file with winrar or extract it to the folder of your convenience, then just run the setup program. This program has several useful features. One of them is to record from any program without getting any soundcard interference or interferences with any other sounds from other programs. For example, you could set the virtual audio cable driver from skipe to be your output device. If you want to hear whats coming out of the virtual audio cable, use the audio repeater that comes with the program (more on this in the documentation). I would recomend the following settings for the audio repeater: Total buffers (ms) = 200; buffers = 6; priority = normal. Everything else shoudl remain as it is, with the devices of your choice (input = audiio cable; output = your soundcard or any other soundcard). THis setting should work for most of you; leaving everything to the defaults and hitting start will most likely give you a really annoying blasting speaker noise and bring your computer to its knees and then crash it. This functionality produces an unexpected advantage, which is the independent volume control for skipe&amp;#039;s output. You can additionally set this as the input recording device in your audio recording program and record your calls that way, ETC. There are lots of possibilities. if anyone can find the description and won&amp;#039;t mind putting it up I&amp;#039;ll very much apreciate this. There are No reg keys, no serials, no needed patches or cracks; this is fully authorized. If you hear the word demo or trial every 5 seconds after using it then obviously you&amp;#039;d not be having the full version. Enjoy!","torrent":{"xt":"urn:btih:f7c633d52963c1559d8f70309255ca27ee9310d3","amp;dn":"virtual+audio+cable+4.0.1+full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c633d52963c1559d8f70309255ca27ee9310d3","infoHashBuffer":{"type":"Buffer","data":[247,198,51,213,41,99,193,85,157,143,112,48,146,85,202,39,238,147,16,211]},"announce":[],"urlList":[]}}