{"title":"Slow.Train.Through.Africa.With.Griff.Rhys.Jones.2of5.North.Afric","uid":11900154,"size":1115644395,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f8254963395c5fabf150c8be7b6c72175d4762cd&amp;dn=Slow.Train.Through.Africa.With.Griff.Rhys.Jones.2of5.North.Afric&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"artistharry","files":1,"time":1431287262,"description":"Slow Train Through Africa: With Griff Rhys Jones\n\nTravel Documentary hosted by Griff Rhys Jones, published by ITV in 2015 - English narration\n  &lt;a href=&quot;\nhttp://docuwiki.net/images/8/8e/Slow-Train-Through-Africa-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/8/8e/Slow-Train-Through-Africa-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nSlow Train Through Africa\nOn five great rail adventures, Griff Rhys Jones explores Africa, home to astonishing wildlife, mighty rivers, the driest deserts and a billion people. This unforgettable journey takes Griff along the coast of North Africa, over the savannahs of Kenya and Tanzania, through the forests of Zambia and Zimbabwe, across the deserts of Namibia and, finally, to the tip of South Africa. Griff highlights incredible landscapes and introduces us to some remarkable people. Progress isn't always smooth as he contends with closed borders and missed trains. He takes it all in good humour and revels in this amazing trip of a lifetime. Africa truly is like nowhere else on earth. ..\n\n\n1)  Namibia \nNamibia has the least rainfall in sub-Saharan Africa and is home to what is considered to be the oldest desert in the world. Griff begins his journey in the far Northern town of Oshikango, where a brand new railway was built just two years ago. Passengers are still an uncommon occurrence and he is surprised to find he is the only person in his carriage during most of the seven-hour journey. Fewer than 200 passengers a day use the freight-oriented trains, in the whole of Namibia. Griff says: &quot;I'm hoping on this journey that I'll meet people, although that may not be as easy as it sounds because Namibia is one of the most sparsely populated places on Earth. There are about two million people here and they're living in an area the size of France and Germany combined.&quot;\n\n2)  North Africa \nIn episode two, Griff begins a 1700-mile journey across North Africa in Morocco. His North African train ride takes him east on a line that links the great trading cities of Morocco, Algeria and Tunisia with the Mediterranean on one side and the Sahara on the other. From Tunis, Griff will head south towards the desert and final destination of Tozeur. He begins his journey in the city of Marrakech, where he stocks up for his trip with items from the souk, including some traditional Berber medicines. Griff says: &quot;I love Morocco. I love the feeling of being on the cusp of Africa here. What could be more authentic, you see? What could be more Moroccan, than a cup of mint tea? Except that tea was introduced by the English when they took over Tangiers and it comes all the way from China. So, whenever you're in Africa, the idea that we are coming here on this huge journey to look for the 'real' Africa is nonsense. You never find the real Africa, what you find is the mix that created Africa from way back.&quot;\n\n3)  Kenya and Tanzania \nIn episode three, Griff attempts to zigzag his way 1200 miles through Kenya and Tanzania. The journey proves a challenge, with large parts of the railways being relics, leftover from colonial days. Neither tracks nor trains work as well as they used to. Boarding Nyaturu, a vintage steam locomotive made in Glasgow, Griff begins his journey on the high plateau in southwest Kenya. Griff says: &quot;These are areas where equatorial Africa presents itself in an extraordinary variety of ways. We have snow-capped mountains, we have forests, we have desert and we have wild animals.&quot; Built by the British, this railway created a colony and Griff visits a cattle farm established by an aristocrat a century ago. Donning a pair of overalls, he joins the Kenyan workers as they bathe over 2000 cattle to ward off parasites and biting flies.\n\n4)  Zambia and Zimbabwe \nIn episode four, Griff takes the train through Zambia and Zimbabwe, via one of the natural wonders of the world, the Victoria Falls. He begins the 1100-mile trip in Kasama in northern Zambia, where the train arrives, just 33 hours late. After setting off on the six-hour journey, he attempts to drink a cup of tea. Griff says: &quot;I've been on slow trains, I've been on more appointed trains but I've not been on a train that's like being in the North Atlantic in a storm before!&quot; Along the tracks, the town of Mpika is the location of a college that trains young Zambians to become locomotive drivers. Over three years, they learn not only how to drive the train, but how to fix it if it breaks down and how to deal with elephants and buffalo on the track. Griff joins a class and meets Annie, one of the first female train drivers in the country, and Hendrix, who shows Griff his sideline, dancing like Michael Jackson. Griff then attempts to operate a 200-ton locomotive, but struggles to remember how to brake.\n\n5)  South Africa \nIn episode five, the last of Griff's epic adventures through Africa by train, he crosses a thousand miles of South Africa, reaching the most southerly passenger railway station on the continent. Griff begins in Pretoria, catching Africa's most modern train on a short journey south, to Johannesburg. On board he almost finds himself in trouble with the security guards for attempting to eat his breakfast, which is against the strict train rules, which also include no singing. Johannesburg is home to over four million people across a vast, sprawling city that grew because of the amounts of gold found underground. The goldmines needed workers and railways were built to transport them. Griff continues on to the little coastal settlement of Simon's Town, on the edge of the Atlantic. It is the most Southerly passenger station in Africa and Griff surveys the coast from the very tip of the African Continent, Cape Point, as his African adventure comes to an end.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;cc84a5aba48c80f8e2fd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3180 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 46mins\n * Framerate: 25 fps\n * Number of Parts: 5\n * Container Mp4\n * Part Size: 1.02 GB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:f8254963395c5fabf150c8be7b6c72175d4762cd","amp;dn":"Slow.Train.Through.Africa.With.Griff.Rhys.Jones.2of5.North.Afric","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8254963395c5fabf150c8be7b6c72175d4762cd","infoHashBuffer":{"type":"Buffer","data":[248,37,73,99,57,92,95,171,241,80,200,190,123,108,114,23,93,71,98,205]},"announce":[],"urlList":[]}}