{"title":"Batman Chronological Compiled in reading order","uid":11697552,"size":23091800147,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f83d6f402dd89f39927367a5ca8dea6f4a76e005&amp;dn=Batman+Chronological+Compiled+in+reading+order&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":9,"uploader":"Bonecrusherr","files":879,"time":1423778703,"description":"Reupload of old collection.\n\nOld info:\n\nMANY, MANY THANKS TO ALL THE SCANNERS WHO MADE THIS TORRENT A POSSIBILITY \n\nBatman in a Contemporary Chronological AND COMPILED Reading Order.....\n\nIt can be a nightmare trying to find the correct reading order for some characters, and Batman is one of them! What with all the 'Event' stories, etc. While trying to find the reading order for 'No mans Land' (and other epics) I 'found' this list by someone called 'Batmite'. It appears to be a great list that has had plenty of time put into making it. I say 'appears' because I have read very little from the list so I can't say for sure. I have started reading it from the 1st story and the 'list' so far has proved very, very good. Thank you VERY much Batmite (Should you be reading this!).\n\nIf you are new to 'The Batman Saga' this torrent is a good place to start.\n\nThis torrent does NOT include every Batman comic ever published but is does include virtually all the modern day classics. I have compiled everything in an easy to approach way - fans of my 2000AD Compiled torrents will know the care and effort I put into such things!\n\nThe list finished in June 2007 and I have done my best to compile the rest of the stories until the 'Whatever Happened To The Caped Crusader' story from April 2009. So download and enjoy Batman from Year One to until just after the RIP storyline.\n\nIf anyone can suggest the correct order from that point onwards I would be most grateful (A list that includes ALL the Batman related titles).\n\nThe list is below in the comments section \n\nNOTES FROM BATMITE'S LIST:\nWHAT THIS LIST IS:\nA compilation of about 2000 Batman-related issues, miniseries, graphic novels, and one-shots, listed in a sequential reading order, representing the bulk of the contemporary Batman mythos, as well as that of directly related characters. Complete with writer, penciller and inker credits, as well as publication dates.\nIn many ways, this is my &quot;personal&quot; Bat-continuity. It is not &quot;the&quot; only way of reading these stories in chronological order, but a very straightforward and logical one that should not contain any major logical / chronological conflicts with anyone else's. Yes, many one-shots or graphic novels or issues (LODK) can/could be moved around, but others can't, or not that significantly. And since it's &quot;my&quot; continuity, I've also excluded some of the very few stories that are in continuity but that I really disliked and could do away with. (Superman/Batman: Public Enemies, Zero Hour... see below).\nAs far as I'm concerned, the &quot;Contemporary&quot; Batman mythos &quot;begins&quot; with Batman #217 (Dec. 1969) and Detective #395 (Jan. 1970). Earlier stories / issues will not be listed here.\nMost (90%) of the stories in this list are Post-Crisis on Infinite Earths stories published since 1986, but it also contains a few pre-COIE stories that are IMO essential to provide a logical continuity, and/or were still held as &quot;canon&quot; after that event (Tales of the Demon for example). Aside from recent DCU developments (IC, 52, Countdown), no mention is made of Pre-COIE continuity.\n\nWHAT THIS LIST IS NOT:\n&quot;The official&quot; Batman continuity. To my knowledge, there is no such official list, and DC and writers/editors themselves don't seem to have, or be aware of, such a definitive continuity.\n(Especially since it now seems, with the return of the Multiverse, that pretty much everything that was at one point in continuity, is again).\nAn index of all Batman titles' issues in numerical order; or &quot;just&quot; a list of TPBs in reading order.\nA DCU-wide chronology. I did include some DC Crossovers, JLA story lines, Superman titles and a few other books here and there, but only because of they contain Batman or related character appearances, and/or play an integral part of this Batman &quot;continuity.&quot;\nA &quot;let's-shove-it-all-in-approach&quot; or attempt to list ALL stories published/reprinted from 1986 onwards according to what period of the Batman's fictional history they fit in. The goal for me was to compile a list that would provide fans and readers with a comprehensive Batman &quot;history.&quot; I was willing to overlook some very minor discrepancies (such as Gordon's rank in a few early days stories), but &quot;redundant&quot; takes on the same event and/or conflicting stories were eliminated (tough some of these might still be very good or interesting).\n\nHOW THIS LIST WORKS:\nI've grouped every issue under its story arc, TPB (for those that were collected) or crossover name, and given a &quot;part&quot; number to each individual story.\nThat being said, those part numbers don't necessarily correspond to the part numbers that were sometimes (rarely) written on the issues (Contagion, Legacy, Knightfall, etc.), so don't use my part numbers to try and find an issue. Instead, search using the actual title's (series) issue number.\nAlso, some of these story arc names do not necessarily correspond to existing TPBs (when issues were never collected), so I've attributed a name to the story arc (usually the name of the first issue's story) or chosen one that made sense.\nFor my convenience, I've also attributed taglines as titles, or downright made-up some, for stories from early Batgirl issues (which only started having actual titles with issue #30 or something), at least one issue of Nightwing (#124, which was untitled), and maybe a few others here and there.\nIn a few cases, I've &quot;split&quot; the content of corresponding TPBs (Nightwing, Catwoman, BOP and Batgirl stories mostly), because I preferred a more logical reading order (at least to me) within a continuity, to the way issues were sometimes actually collected in TPBs.\nThe dates of all Graphic Novels, Annuals &amp; Prestige books are release dates (as opposed to cover dates, since most of them don't have a cover date).\nThe dates of all Issues, Mini &amp; Maxi-series are the actual cover dates (usually dated 2 to 3 months AFTER their actual release dates)","torrent":{"xt":"urn:btih:f83d6f402dd89f39927367a5ca8dea6f4a76e005","amp;dn":"Batman+Chronological+Compiled+in+reading+order","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f83d6f402dd89f39927367a5ca8dea6f4a76e005","infoHashBuffer":{"type":"Buffer","data":[248,61,111,64,45,216,159,57,146,115,103,165,202,141,234,111,74,118,224,5]},"announce":[],"urlList":[]}}