{"title":"Ed Greenwood - Forgotten Realms Elminster Series 1-6","uid":14116177,"size":2231011899,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f8489022935577179267876c9c550bce36edec87&amp;dn=Ed+Greenwood+-+Forgotten+Realms+Elminster+Series+1-6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Horisarte","files":127,"time":1459417821,"description":"Ed Greenwood - Forgotten Realms Elminster Series 1 - 6\r\n\r\n1. The Making of a Mage\r\n\r\nIn ancient days, sorcerers sought to learn the One True Spell that would give them power over all the world and understanding of all magic. . . .The One True Spell was a woman, and her name was Mystra -- and her kisses were wonderful.Priest Havilon TharnstarTales Told to a Blind WizardIt is the time before Myth Drannor, when the Heartlands are home to barbarians, and wicked dragons rule the skies. In these ancient days, Elminster is but a shepherd boy, dreaming of adventure and heroics. When a dragon-riding magelord sweeps down upon him, though, the boy is thrust into a world of harsh realities, corrupt rulers, and evil sorcerers.With patience and grit, Elminster sets about to change all that. The result of his labors is a world reborn and a mage made. \r\n\r\n2. Elminster in Myth Drannor\r\n\r\nIt is the time of the great elven city of Cormanthor, when the Heartlands are home to barbarians, wicked dragons rule the skies, and the elven people trust no one. Wizards and warriors alike threaten their civilization in vain, arrogant, and ignorant quests for glory.\r\nThus it was that Elminster was guided to Cormanthor, the Towers of Song, where Eltargrim was Coronal. There he dwelt for twelve summers and more, studying with many mighty mages, learning to feel magic and know how it could be bent and directed to his will . . . . It is recorded that when the Mythal was laid, and Cormanthor became Myth Drannor, Elminster was among those who devised and spun that mighty magic. \r\n\r\n3. The Temptation of Elminster\r\nFrom a dark and dusty tomb, Elminster emerges, seeking the guidance of Mystra, and finds only silence. He is drawn into the clutches of the mysterious and sinister Lady of Shadows. The path he takes will lead to a Realms-shaking confrontation where Elminster has to make the most important choice of his long life.Whatever he decides, the Realms will be forever changed . . . \r\n\r\n4. Elminster in Hell\r\n\r\nHell Hath Such Fury\r\nOn the world of his birth he's all but a god, but when an ancient evil banishes him to the depths of the Nine Hells, he's just another lost soul. Elminster, Sage of Shadowdale, Chosen of Mystra, faces his most desperate struggle—to survive, to escape, to cling to his very sanity—and all the forces of the inferno are rallied against him.\r\n\r\n5. Elminster's Daughter\r\n\r\nEd Greenwood's newest Elminster novel chronicles the latest events in the life of the Sage of Shadowdale, Greenwood's signature character. This novel was a top seller in hardcover, and the audio edition has been eagerly awaited by Greenwood's fans.\r\n\r\n6. Spellstorm\r\n\r\nRumors race around Cormyr regarding the mythical Lost Spell, a powerful enchantment designed centuries ago by the presumed dead god of spells--a spell long thought lost to the ages. Found by some magic-less merchant, rumor has it the Lost Spell is to be auctioned off to the highest bidder. It is a powerful lure, and archwizards of every stripe descend upon the merchant, only to be trapped with him inside his manor by a vicious spellstorm--escape impossible, and their magic useless with the interference from the storm. Moreover--they find themselves faced with the infamous Elminster of Shadowdale, who claims he's just there to decide who gets the Lost Spell, but who clearly has an agenda of his own.But before Elimster can put whatever plan he has in motion, archwizards start dying","torrent":{"xt":"urn:btih:f8489022935577179267876c9c550bce36edec87","amp;dn":"Ed+Greenwood+-+Forgotten+Realms+Elminster+Series+1-6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8489022935577179267876c9c550bce36edec87","infoHashBuffer":{"type":"Buffer","data":[248,72,144,34,147,85,119,23,146,103,135,108,156,85,11,206,54,237,236,135]},"announce":[],"urlList":[]}}