{"title":"All.Aboard-The.Country.Bus--BBC-2016-w.subs-540p","uid":15712362,"size":1514825936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f84e2d5ceba5f6a39eb067c8cc18354412feb4f5&amp;dn=All.Aboard-The.Country.Bus--BBC-2016-w.subs-540p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"uggauga","files":2,"time":1472589989,"description":"All Aboard! The Country Bus\r\n\r\nFollowing the success of previous BBC Four 'slow TV' programmes, including All Aboard! The Sleigh Ride &amp; Canal Trip, and Slow Week, BBC4 is inviting viewers aboard for a very special journey through one of the most spectacular and beautiful bus routes in Britain.\r\nThe 'Northern Dalesman', as the bus on the route is called, has been rigged with specialist cameras as it travels on its journey, snaking across the iconic landscape of the Yorkshire Dales. Filmed in real time, the cameras capture the road unfurling, the passing scenery and the occasional chatter of local passengers.\r\nThe bus route begins in Richmond in North Yorkshire and takes viewers on a lush and varied ride, along a river valley thronged by blossoming hawthorn trees, through ancient mining villages and wild flower-filled meadows.\r\nThe bus climbs high into the Dales, vast and peaceful. As it slows down to allow sheep and their lambs to cross the road, the only sounds are the wind and the cry of curlews. And then the final stretch across cotton-grass covered moorland. With the mountain range known as the Three Peaks in the distance, the bus descends towards the striking 24-arch Ribblehead viaduct, one of the great engineering achievements of the 19th century.\r\nThe programme features captions integrated into the landscape to provide details about the dramatic countryside through which the bus is passing - from aspects of the natural or geological environment to specific highlights of Britain's agricultural or industrial heritage, from the ancient stone hay barns that dot the landscape to the scars left behind by the lead mining of previous centuries.\r\n\r\nBBC (2016) - 120mins\r\n \nhttp://www.bbc.co.uk/programmes/b07r2s1r\r\n_______________________________________\r\n\r\n'Warning' - there isn't much talking or action in this video - it's sloooow TV !!\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles (not that there's much talking ;-)\r\n\r\nEnjoy !!","torrent":{"xt":"urn:btih:f84e2d5ceba5f6a39eb067c8cc18354412feb4f5","amp;dn":"All.Aboard-The.Country.Bus--BBC-2016-w.subs-540p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f84e2d5ceba5f6a39eb067c8cc18354412feb4f5","infoHashBuffer":{"type":"Buffer","data":[248,78,45,92,235,165,246,163,158,176,103,200,204,24,53,68,18,254,180,245]},"announce":[],"urlList":[]}}