{"title":"Catch Me If You Can - Frank W.Abagnale.epub","uid":8841058,"size":539779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f852d8197d8b33fcb37be67274a2efec7660cb26&amp;dn=Catch+Me+If+You+Can+-+Frank+W.Abagnale.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1377245869,"description":"&quot;I stole every nickel and blew it on fine threads, luxurious lodgings, fantastic foxes and other sensual goodies. I partied in every capital in Europe and basked on all the world's most famous beaches'.&quot;\n\nFrank W Abagnale, alias Frank Williams, Robert Conrad, Frank Adams and Ringo Monjo, was one of the most daring con men, forgers, imposters and escape artists in history. In his brief but notorious career, Abagnale donned a pilot's uniform and co-piloted a Pan Am jet, masqueraded as a member of hospital management, practised law without a licence, passed himself off as a college sociology professor, and cashed over $2.5 million in forged checks all before he was twenty-one. Known by the police of twenty-six foreign countries and all fifty states as 'The Skywayman', Abagnale lived a sumptuous life on the run - until the law caught up with him. Now recognised as the nation's leading authority on financial foul play, Abagnale is a charming rogue whose hilarious, stranger-than-fiction international escapades and ingenious escapes - including one from an aeroplane - make CATCH ME IF YOU CAN an irresistable tale of deceit.\n","torrent":{"xt":"urn:btih:f852d8197d8b33fcb37be67274a2efec7660cb26","amp;dn":"Catch+Me+If+You+Can+-+Frank+W.Abagnale.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f852d8197d8b33fcb37be67274a2efec7660cb26","infoHashBuffer":{"type":"Buffer","data":[248,82,216,25,125,139,51,252,179,123,230,114,116,162,239,236,118,96,203,38]},"announce":[],"urlList":[]}}