{"title":"Brenton Wood's 18 Best-(1992)-CBKS","uid":5055316,"size":39534848,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8b2f2cccc0e706af3d437e3d4f5074f3de03313&amp;dn=Brenton+Wood%5C%27s+18+Best-%281992%29-CBKS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Das_Hoff","files":-1,"time":1250379656,"description":"Brenton Wood (born Alfred Jesse Smith; July 26, 1941) is an American singer and songwriter, best known for his two 1967 hit singles: &quot;The Oogum Boogum Song&quot; and &quot;Gimme Little Sign&quot;Wood was born in Shreveport, Louisiana. When he was a child his family moved west to San Pedro in Los Angeles, California. He attended San Pedro High School for part of his freshman year before moving to Compton. In his high school years his family relocated to nearby Compton, where Brenton became a member of the Compton High School track team and received several awards for his athletic achievements\n\n\n Name\t Size\n01 Gimme Little Sign Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.14 MB\n02 Oogum Boogum Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.31 MB\n03 Baby You Got It Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.75 MB\n04 I Think You've Got Your Fools Mixed up Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.87 MB\n05 Great Big Bundle of Love Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.93 MB\n06 I'm the One Who Knows Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.21 MB\n07 Lovey Dovey Kind of Love Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.83 MB\n08 Can You Dig It Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.46 MB\n09 Whoop It on Me Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.14 MB\n10 Take a Chance Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.14 MB\n11 Catch You on the Rebound Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.01 MB\n12 Me and You Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.43 MB\n13 I Like the Way You Love Me Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.24 MB\n14 Darlin' Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.34 MB\n15 Where Were You Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.79 MB\n16 Two Time Loser Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t1.92 MB\n17 Sad Little Songs Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.05 MB\n18 Good Night Baby Brenton Wood Brenton Wood's 18 Best Rock 96kbps.mp3\t2.14 MB","torrent":{"xt":"urn:btih:f8b2f2cccc0e706af3d437e3d4f5074f3de03313","amp;dn":"Brenton+Wood%5C%27s+18+Best-%281992%29-CBKS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8b2f2cccc0e706af3d437e3d4f5074f3de03313","infoHashBuffer":{"type":"Buffer","data":[248,178,242,204,204,14,112,106,243,212,55,227,212,245,7,79,61,224,51,19]},"announce":[],"urlList":[]}}