{"title":"Star Trek Enterprise - Tutti i Torrent Serie Completa [DVDrip IT","uid":6609387,"size":1474908,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f8b6499cd35720a5d760233cd3696a2d94c9addc&amp;dn=Star+Trek+Enterprise+-+Tutti+i+Torrent+Serie+Completa+%5BDVDrip+IT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"l.diliberto","files":9,"time":1313529817,"description":"Star Trek Enterprise - Tutti i Torrent Serie Completa [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=262262&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=262262&lt;/a&gt;\n\nStar Trek: Enterprise ÃƒÂ¨ la quinta serie televisiva ambientata nell'universo fantascientifico di Star Trek (la sesta, considerando anche la serie animata). Il primo episodio fu trasmesso dal network statunitense UPN il 26 settembre 2001, inizialmente con il semplice titolo di Enterprise, mentre a partire dalla terza stagione la serie assunse la definitiva denominazione di Star Trek: Enterprise, similmente a quelle che l'avevano preceduta. La serie, prodotta per quattro stagioni, ha vinto vari premi, tra cui quattro Emmy.\n\n.: Trama :.\n\nLe vicende di Enterprise sono ambientate circa un secolo prima di quelle della serie classica, nel momento in cui l'umanitÃƒÂ  comincia ad esplorare lo spazio. L'astronave al centro della serie ÃƒÂ¨ infatti l'Enterprise NX-01, la prima nave terrestre ad essere costruita al fine di esplorare lo spazio profondo. Questo ÃƒÂ¨ reso possibile dal miglioramento del motore a curvatura, fino a raggiungere velocitÃƒÂ  di curvatura (warp) 5. Il capitano designato per guidare questa nave ÃƒÂ¨ Jonathan Archer, figlio di uno dei principali progettisti del suo motore. Uno degli elementi che contraddistingue le trame ÃƒÂ¨ il rapporto conflittuale con i vulcaniani: questi, dopo aver compiuto il primo contatto con i terrestri, si oppongono costantemente a molti dei tentativi degli umani di affacciarsi nello spazio profondo, ritenendoli impulsivi ed inesperti, e quindi inadatti ad essere introdotti nel &quot;consesso interstellare&quot; (come, ad esempio, affermerÃƒÂ  esplicitamente l'ambasciatrice V'Lar nell'episodio La caduta di un eroe). Per questo motivo i vulcaniani, non essendo riusciti a fermare il varo dell'Enterprise, vi impongono come primo ufficiale T'Pol. Il suo rapporto costantemente problematico e conflittuale con il capitano Archer costituisce uno dei temi di fondo della serie. Un altro spunto fondamentale ÃƒÂ¨ la mancanza della Prima direttiva, che non ÃƒÂ¨ ancora stata promulgata, il che lascia piÃƒÂ¹ spazio ad esplorazioni e contatti con civiltÃƒÂ  aliene anche poco progredite. Un tema presente fin dal primo episodio ÃƒÂ¨ quello della guerra fredda temporale, un conflitto segreto ma decisivo che vede impegnate diverse fazioni operanti in epoche differenti. Il finale della seconda stagione introduce la minaccia degli xindi: dopo un loro primo attacco, l'Enterprise verrÃƒÂ  impegnata in una lunga missione per cercare di evitare la distruzione della Terra, che ÃƒÂ¨ narrata per l'intera terza stagione. \nLa quarta stagione presenta alcuni gruppi di episodi, in cui, tra l'altro, ÃƒÂ¨ presentata la prima alleanza tra terrestri, vulcaniani, andoriani e tellariti che diventerÃƒÂ  la Federazione.\nNella serie fanno la loro prima comparsa numerose nuove specie aliene, tra cui le piÃƒÂ¹ importanti sono i sulibani, gli xindi e i denobulani.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/3973/imgphpb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/3973/imgphpb.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPaese Stati Uniti d'America\nAnno 2001-2005\nGenere fantascienza\nStagioni 4\nEpisodi 98\nDurata 45 min (episodio)\nIdeatore Rick Berman, Brannon Braga\nProduttore Brannon Braga\n\nCast: Scott Bakula: Jonathan Archer\nJolene Blalock: T'Pol\nConnor Trinneer: capo ingegnere Charles &quot;Trip&quot; Tucker III\nDominic Keating: Malcolm Reed\nLinda Park: Hoshi Sato\nAnthony Montgomery: Travis Mayweather\nJohn Billingsley: Phlox\n\n0=============================0\n\n.: Dati tecnici del ripping medi per ogni episodio :.\n\nDimensione File: 360 Mb\nDurata: 40 Min.\nNome Codec Video: XviD 1.0.3\nLarghezza Frame: 624\nAltezza frame: 352\nFPS: 25.000\nVideo Bitrate: 1054 kbps\nQF: 0.192\n\nCodec audio: MP3\nFreq.audio: 44100 Hz\nBitrate: 160 kbps\nTipo: CBR\nCanali: 2","torrent":{"xt":"urn:btih:f8b6499cd35720a5d760233cd3696a2d94c9addc","amp;dn":"Star+Trek+Enterprise+-+Tutti+i+Torrent+Serie+Completa+%5BDVDrip+IT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8b6499cd35720a5d760233cd3696a2d94c9addc","infoHashBuffer":{"type":"Buffer","data":[248,182,73,156,211,87,32,165,215,96,35,60,211,105,106,45,148,201,173,220]},"announce":[],"urlList":[]}}