{"title":"Lynda.com - Insights on Photography: Business and Social Media w","uid":10594384,"size":347878483,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f908f5662f50bee035515081edfa32d3c5aa8593&amp;dn=Lynda.com+-+Insights+on+Photography%3A+Business+and+Social+Media+w&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"2boweb","files":5,"time":1405848968,"description":"Lynda.com - Insights on Photography: Business and Social Media with Derrick Story\n25m 51s Appropriate for all Uploaded in Jul 20, 2014 by 2boweb\n\nThe photographic landscape is always changing: new gear, shifting business models, and more ways to promote your work and your business. How do you keep up? There's no magic formula that works for everyone, but hearing how one photographer has built a career can help you develop a strategy that works for you. In this course, we visit with Derrick Story, a commercial photographer, educator, journalist, and blogger.\n\nIn a wide-ranging discussion, Derrick talks about his lifelong love of photography and how today's successful photographer needs to leverage multiple business opportunities, with each one feeding the others. For example, to keep up with changing gear, you can blog and/or podcast about new gear as you acquire it; to promote your work and your expertise, you can conduct workshops to teach the areas that you specialize in. He also shows how to take advantage of the social media landscape to build your brand.","torrent":{"xt":"urn:btih:f908f5662f50bee035515081edfa32d3c5aa8593","amp;dn":"Lynda.com+-+Insights+on+Photography%3A+Business+and+Social+Media+w","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f908f5662f50bee035515081edfa32d3c5aa8593","infoHashBuffer":{"type":"Buffer","data":[249,8,245,102,47,80,190,224,53,81,80,129,237,250,50,211,197,170,133,147]},"announce":[],"urlList":[]}}