{"title":"Project.2013.For.Dummies","uid":10264823,"size":27635984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f90d69501dde728e671d334b6e8828696ef345ff&amp;dn=Project.2013.For.Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"wildturkey00","files":3,"time":1401508428,"description":"\n\nAn easy-to-understand guide to the?latest version of Microsoft's enterprise project management software: Project 2013\n\nIf you've never used project management software before?or if?you're just getting up to speed on the new features in Project 2013, this is the book for you! With this easy-to-understand guide, you have a completely updated resource that covers the latest changes and newest enhancements to Project 2013 and shows you how to?make Project 2013 work for you. After an introduction to basic project management concepts, you'll discover the mechanics of using Project software to create and manage projects. Other topics covered include working with calendars, using and sharing resources, budgeting, formatting taskbars, gathering and tracking data, working with reports, and creating templates.\n\n    Shows you how to manage resources, share project information, perform scenario analysis, and standardize reporting processes\n    Presents completely updated coverage of the new Project 2013\n    Reviews formatting taskbars, gathering and tracking data, and working with reports\n    Addresses using and sharing resources, creating templates, and managing projects\n\nTake charge of your next project and ensure its success with a little help from Project 2013 For Dummies.\n","torrent":{"xt":"urn:btih:f90d69501dde728e671d334b6e8828696ef345ff","amp;dn":"Project.2013.For.Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f90d69501dde728e671d334b6e8828696ef345ff","infoHashBuffer":{"type":"Buffer","data":[249,13,105,80,29,222,114,142,103,29,51,75,110,136,40,105,110,243,69,255]},"announce":[],"urlList":[]}}