{"title":"Battle Beyond The Stars (1980) DVDRip (SiRiUs sHaRe)","uid":4289123,"size":734152015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f952b405243b9104190c4bdddbbdddfacbe5cd91&amp;dn=Battle+Beyond+The+Stars+%281980%29+DVDRip+%28SiRiUs+sHaRe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"zemetrius","files":3,"time":1215838769,"description":"Battle Beyond The Stars (1980)\n\nIn yet another film patterned on _The Seven Samurai_, a band of diverse heroes in outer space are assembled to defend a planet of peaceful colonists from an armada of aggressors. If the special effects look familiar, it is because you&amp;#039;ve the same space sequences recycled in other low budget SF films.\n\n\tRichard Thomas\t ... \tShad\n\tRobert Vaughn\t... \tGelt\n\tJohn Saxon\t... \tSador\n\tGeorge Peppard\t... \tCowboy\n\tDarlanne Fluegel\t... \tNanelia\n\tSybil Danning\t... \tSaint-Exmin\n\tSam Jaffe\t... \tDr. Hephaestus\n\tJeff Corey\t... \tZed\n\tMorgan Woodward\t... \tCayman of the Lambda Zone\n\tMarta Kristen\t... \tLux\n\nDirector: Jimmy T. Murakami\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0080421/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0080421/&lt;/a&gt;\n\nCodecs: DivX 3 / MP3\n\nI first saw this in the summer of 1981, just before I was due to go back to school for my second year in senior school (around the age of 12-13)\n\nNowadays, BATTLE BEYOND THE STARS is more familar to audiences as the film which helped launch the careers of James Cameron and James Horner, but the success of the film is more down to John Sayles excellent screenplay, one of the earliest he did along with PIRANHA for Roger Corman&amp;#039;s New World Pictures.\n\nSayles does some very creative things with the dialogue and Sybil Danning is the standout performance as the Valkyrie warrior St. Exmin. Darlanne Fluegel as Nanelia and Morgan Woodward as Cayman of the Lambda Zone provide adequate support to Richard Thomas and Robert Vaughn.\n\nAs with Howard Shore and his LOTR scores, Horner&amp;#039;s early works were to be found in low-budget film. The limited-edition soundtrack recently released also has the soundtrack to HUMANOIDS FROM THE DEEP. I have followed Horner&amp;#039;s career from BATTLE, through to his music for 48 HRS, BRAINSTORM and GORKY PARK, but BATTLE is undoubtedly one of the best scores he has ever done. As with John Williams&amp;#039; music for STAR WARS, it added a dimension to the film and gave me goosebumps when I first saw it.\n\nThe FX and design of the film do heighten the experience of watching this low-budget offering in a similar way to how ASSAULT ON PRECINCT 13 knew the limits of its setting.\n\nWorth catching at any time!\n\n.......................................................................................\n\nBATTLE BEYOND THE STARS, Roger Corman&amp;#039;s &amp;#039;take&amp;#039; of the STAR WARS saga, is a film justly recognized as a cult classic. Shot in his new studio (&quot;The paint was still wet,&quot; Corman has joked), in just five weeks, on a budget that would have paid for one of George Lucas&amp;#039; effects, the end result is proof that with the right talent, anything is possible!\n\nA remarkable array of future industry giants participated in the creation of the film; the screenplay was co-written by John Sayles, whose breakthrough film as a maverick writer/director, RETURN OF THE SECAUCUS 7, would be released the same year...young model builder James Cameron impressed Corman so much that he was promoted to Art Director for the film, and it would be the first step in a career that led to TERMINATOR, ALIENS, and eventually, the most Oscar-honored film since BEN-HUR, TITANIC...James Horner, with only three prior film credits, gave Corman the STAR WARS-quality music he wanted, with an orchestra a fraction of the size of John Williams&amp;#039; London Philharmonic; Horner would eventually score two STAR TREK films, and a wide variety of other &amp;#039;prestige&amp;#039; projects, culminating with two Oscars for TITANIC, and a place as one of America&amp;#039;s finest film composers. BATTLE BEYOND THE STARS would have a &amp;#039;look&amp;#039; and a &amp;#039;sound&amp;#039; unlike any &amp;#039;B&amp;#039;-movie ever made.\n\nBased on Akira Kurosawa&amp;#039;s THE SEVEN SAMURAI (which was also the source for the classic western, THE MAGNIFICENT SEVEN), Sayles tried to keep the film as faithful to the original as possible (a tiny, defenseless village hires warriors to defend them against a band of outlaws), even naming the beleaguered people the Akira, as a homage to the director. As warriors from different races ally to face down the nearly invincible forces of Sador (veteran actor John Saxon), Corman paid tribute to John Sturges&amp;#039; western, as well, casting Robert Vaughn in virtually the same role as he&amp;#039;d played in THE MAGNIFICENT SEVEN. Other terrific actors round out the cast; Richard Thomas, still appearing in &amp;#039;The Waltons&amp;#039; at the time, played young Shad, the film&amp;#039;s central character; George Peppard, who was about to achieve a MAJOR career resurgence with &amp;#039;The A-Team&amp;#039;, became boozy Earthman &amp;#039;Cowboy&amp;#039;; &amp;#039;B&amp;#039;-movie queen Sybil Danning portrayed Valkyrie-like Saint-Exmin; veteran TV and film &amp;#039;tough guy&amp;#039; Morgan Woodward was wonderful, if unrecognizable as Cayman of the Lambda Zone; and Darlanne Fluegel, beginning a long career as a popular character actress, was cast as Shad&amp;#039;s love, Nanelia. Corman then cast two long-time friends and Hollywood legends in cameo roles; Jeff Corey as blind Zed, who encourages the Akira to fight; and 89-year old Sam Jaffe as the robotics expert who introduces Shad to Nanelia.\n\nA note about director Jimmy T. Murakami...a veteran animator, BATTLE BEYOND THE STARS marked his directorial debut, and he does an exceptionally good job, considering his budget restraints. After working on HUMANOIDS FROM THE DEEP, he married an Irish girl and settled in Europe, limiting his subsequent film career to an occasional project that interested him. Roger Corman&amp;#039;s &amp;#039;family&amp;#039; of filmmakers were NEVER dull...\n\nWhile some of the FX are shaky, the overall production is very impressive, and holds up remarkably well, today. Roger Corman has called BATTLE BEYOND THE STARS one of his favorite films, and he has every right to be proud...the movie is a terrific SF adventure!\n\n.......................................................................................\n\nIgnore the negative comments and the usual pathetic &quot;cheesy&quot; wisecracks. This movie has more heart and soul than &quot;Star Wars&quot; or any of the big budget space operas floating around at the same time. The characters are more memorable, the dialogue is better and there is nothing &quot;fairytale&quot; about the ending. A lot of the characters we wind up liking die in this one.\n\nIt&amp;#039;s yet another update of the &quot;Seven Samurai&quot; story and just as effective in its milieu as &quot;Magnificent Seven&quot; was in its. A ghoulish galactic conqueror has targeted the peaceful planet Akir for his next attack. Sador and his band of mutants have access to a planet-destroying weapon. The pacifist Akiri have no skill or stomach for fighting except for a select few. Young Shad decides that if his people cannot fight, they will hire mercenaries to fight for them. Onboard a sentient spaceship with a crusty personality, Shad begins to assemble a ragtag collection of misfits. They include: Cowboy, an earthman transporting weapons who is obsessed with Western heroes and lifestyle.\n\nKayman of the Lambda Zone, a theatrical and sinister reptilian who has a score to settle with Sador. Kayman&amp;#039;s own crew is pretty off the wall, as well.\n\nNestor, a collection of alien clones who share the same mind and sensations. Nestor joins the battle strictly out of boredom.\n\nGelt, the deadliest and most feared assassin in the galaxy, who joins Shad because he offers &quot;a warm meal and a place to hide&quot;.\n\nSt. Exmin, a bodacious, oversexed Valkyrie who is spoiling for a fight to prove her mettle.\n\nThis is one of the coolest casts of characters ever assembled for an action film and I fell in love with all of them. The script of John Sayles really brings out the quirks and personality of the mercenaries. I loved it when one of the Nestors is captured by Sador and threatened with torture. &quot;This is Dr. Dako,&quot; Sador tells the Nestor. &quot;He is very expert in the art of administering pain.&quot; &quot;It is good to have skills,&quot; deadpans Nestor.\n\nJust as effecting but in a different way is Gelt&amp;#039;s final scene, as his ice-cold demeanor cracks at last and he reflects on a friendless and wasted life. Robert Vaughn succeeds once again with basically the same character he played in &quot;Magnificent Seven&quot;.\n\nEven Sador and his Malmori mutants have personality. John Saxon has a ball playing an evil villain that was different from his usually heroic characters. His second in command comes across as strangely reluctant. Even the scummy mutants Kalo and Tembo are more than mere cannon fodder.\n\nOther actors to watch for are Sam Jaffe as the half man/half machine/all crazy Dr. Hephaestus, Jeff Corey as the blind warrior Zed and Lost In Space&amp;#039;s Marta Kristen as an Akiri woman who falls in love with Cowboy. Richard Thomas does very well as Shad...not an experienced fighter, but with enough fire to avoid being a wimp.\n\nOne does wish the effects budgets would have been better. The ship design and make-up is cool, but the space battles were not visually engaging and the sound effects that accompanied them really grated on my nerves.\n\nThe triumph of this movie, though, is in its characterization and in the nobility of sacrifice. There&amp;#039;s nothing cheesy about that. This is pure entertainment and a little bit more.\n\n    *  &amp;#039;Robert Vaughn (I)&amp;#039; plays essentially the same character he played in The Magnificent Seven (1960).\n\n    * The main character, Shad, hails from the planet Akir. The natives of Akir are known as the Akira. This is no doubt a tribute to legendary director Akira Kurosawa (whose film &quot;The Seven Samurai&quot; served as the inspiration for &quot;Battle Beyond The Stars&quot;).\n\n    * Gelt is modeled closely after the character Lee from &quot;The Magnificent Seven&quot; (both of whom were played by Robert Vaughn) and some of Gelt&amp;#039;s dialogue is lifted almost verbatum from &quot;The Magnificent Seven&quot;.\n\n    * Most of the model shots were reused in another sci-fi movie &quot;Space Raiders&quot;.\n\n    * Screenwriter John Sayles had originally envisioned the character of Cayman as a brooding dark humanoid, not the lizard alien seen in the final product.\n\n    * This was Roger Corman&amp;#039;s most expensive feature costing $2 million. Most of the budget was spent paying actors Robert Vaughn and George Peppard who both had high asking prices.\n\n    * The main body of the Hephastus space station was made from a plastic terrarium salvaged from a garbage dumpster\n\n    * Not only are the effects re-used in Space Raiders, but the entire James Horner score is used as well.\n\n","torrent":{"xt":"urn:btih:f952b405243b9104190c4bdddbbdddfacbe5cd91","amp;dn":"Battle+Beyond+The+Stars+%281980%29+DVDRip+%28SiRiUs+sHaRe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f952b405243b9104190c4bdddbbdddfacbe5cd91","infoHashBuffer":{"type":"Buffer","data":[249,82,180,5,36,59,145,4,25,12,75,221,219,189,221,250,203,229,205,145]},"announce":[],"urlList":[]}}