{"title":"Descendents - Hypercaffium Spazzinate (2016) [16.44 FLAC]","uid":15413447,"size":248560312,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9630dc43afd66cea7c0def5aedc58e346efaf89&amp;dn=Descendents+-+Hypercaffium+Spazzinate+%282016%29+%5B16.44+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"politux","files":17,"time":1469573253,"description":"\n  Descendents - Hypercaffium Spazzinate (2016) [16.44 FLAC]\r\n\r\n  Genre: Rock\r\n  Style: Punk\r\n  Source: WEB\r\n  Codec: FLAC\r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Feel This\r\n  02 Victim of Me\r\n  03 On Paper\r\n  04 Shameless Halo\r\n  05 No Fat Burger\r\n  06 Testosterone\r\n  07 Without Love\r\n  08 We Got Defeat\r\n  09 Smile\r\n  10 Limiter\r\n  11 Fighting Myself\r\n  12 Spineless and Scarlet Red\r\n  13 Human Being\r\n  14 Full Circle\r\n  15 Comeback Kid\r\n  16 Beyond the Music\r\n\r\n  Fueled by &quot;rejection, food, coffee, girls, fishing and food,&quot; the Descendents sprang up during the halcyon days of the Los Angeles punk scene; fusing the blind rage of hardcore with an unexpectedly wry, self-deprecating wit and a strong melodic sensibility that set them distinctly apart from their West Coast brethren, they gradually emerged as one of the most enduring and adored bands of their time. Formed in 1979, the Descendents' first lineup consisted of vocalist/guitarist Frank Navetta, vocalist/bassist Tony Lombardo, and drummer Bill Stevenson; initially sporting an edgy power pop sound inspired by the Buzzcocks, the group issued a debut single, &quot;Ride the Wild,&quot; and then promptly vanished from sight.\r\n\r\n  When the Descendents resurfaced in 1981, they were a four-piece fronted by vocalist Milo Auckerman, a beloved figure within the hardcore community who infused the group's identity with both unmitigated teen angst and a healthy dose of goofball humor. Amid a relentless, caffeine-powered touring schedule, the Descendents found time to record the 1981 EP Fat, a collection spotlighting both Auckerman's affection for fast food (&quot;Weinerschnitzel,&quot; &quot;I Like Food&quot;) and distaste for parental guidance (&quot;My Dad Sucks&quot;). A year later, the group issued its debut LP, Milo Goes to College; despite the considerable levity of tracks like &quot;Bikeage&quot; and &quot;Suburban Home,&quot; the title was no joke -- Auckerman was indeed headed off to study biochemistry, and when Stevenson joined the ranks of Black Flag, the Descendents went on sabbatical.\r\n\r\n  In 1985, the group re-formed, with SWA alum Ray Cooper replacing Navetta on guitar; after the release of the more pop-flavored album I Don't Want to Grow Up, ex-Anti bassist Doug Carrion assumed Lombardo's duties. A sunnier perspective informed 1986's Enjoy!, as evidenced by the inclusion of a cover of the Beach Boys' &quot;Wendy,&quot; but after 1987's All, the group split again; after Stevenson formed a new group, also dubbed All, the only Descendents products to appear for a number of years were a pair of live releases, 1987's Liveage! and 1989's Hallraker. Somewhat surprisingly, Auckerman and Stevenson re-formed the Descendents in 1996 with All bassist Karl Alvarez and guitarist Stephen Egerton; in addition to mounting a tour, the group recorded a new album, Everything Sucks. Following the tour, Auckerman once again returned to his life in the chem lab until 2004 when the guys were back with two new releases, both issued on Fat Wreck -- February brought the EP 'Merican, and the full-length Cool to Be You followed a month later","torrent":{"xt":"urn:btih:f9630dc43afd66cea7c0def5aedc58e346efaf89","amp;dn":"Descendents+-+Hypercaffium+Spazzinate+%282016%29+%5B16.44+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9630dc43afd66cea7c0def5aedc58e346efaf89","infoHashBuffer":{"type":"Buffer","data":[249,99,13,196,58,253,102,206,167,192,222,245,174,220,88,227,70,239,175,137]},"announce":[],"urlList":[]}}