{"title":"The Zombie Movie Encyclopedia","uid":11905475,"size":5770408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f98b530ef47d544117aae46dfe458151f1e91017&amp;dn=The+Zombie+Movie+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1431384206,"description":"Zombies are cautionary forms of humankind's most universally cherished ideal--life after death. Often ragged, unkempt, ill-spoken, rotting individuals, zombies (or the post-dead) seem socially awkward in comparison to the more popular and more aristocratic, undead, like Count Dracula and his peers. And so, the humble zombie remains, for the most part, unappreciated and unacknowledged--until now. No longer will films devoted to them be buried in the last pages of horror movie guides. The exhumation of zombie films from obscurity is accomplished in terrifying detail in The Zombie Movie Encyclopedia. The first exhaustive overview of the subject, this book evaluates over 200 movies from 16 countries over a 65-year period starting from the early 1930s. It mostly treats feature-length films, covering everything from large studio productions to backyard videography, but also touches on memorable episodes of television series and miscellaneous shorts. Lengthy entries point out interesting or innovative features of the zombie portrayal in each movie, while an introduction traces the evolution of the genre and interprets the broader significance of the zombie in contemporary Western mythology. Productions credits, a brief plot summary, and alternate titles accompany each entry","torrent":{"xt":"urn:btih:f98b530ef47d544117aae46dfe458151f1e91017","amp;dn":"The+Zombie+Movie+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98b530ef47d544117aae46dfe458151f1e91017","infoHashBuffer":{"type":"Buffer","data":[249,139,83,14,244,125,84,65,23,170,228,109,254,69,129,81,241,233,16,23]},"announce":[],"urlList":[]}}