{"title":"The Complete Dangerous Davies Mystery Collection","uid":11023568,"size":476362181,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fa3fcb40becbdd9a0bbb5e2021f05c876de40096&amp;dn=The+Complete+Dangerous+Davies+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"davieboy1966","files":34,"time":1410634200,"description":"Audio Books : Mystery and Suspense : Other quality : English\nAll from Cassettes. (32 kbps / 22 kHz Hz Mono Fraunhofer CBR)\n\n\n\n#1. Dangerous Davies - The Last Detective (1976) [8 hours 43 mins] Read by Alexander John\nDavies is a low-ranked CID officer in the London borough of Willesden. He is nicknamed &quot;Dangerous&quot; ironically because he is the member of the department least likely to get into a dangerous situation. He is called &quot;The Last Detective&quot; from his superior's assessment of him as &quot;the last detective you'd ever send out on a case&quot;. Despite this, Davies is by no means a poor detective, and although he can take longer than his colleagues, and is dogged by bad luck, he does usually &quot;get his man&quot; in the end. In the first book we find him drifting into the 25 year-old unsolved case of the disappearance of young Celia Norris, a local girl with a dark side. With his friend, the perpetually unemployed and well-read Welshman &quot;Mod&quot; Lewis (he spends all his time at the library to save on heating) he tracks down the culprit, collecting plenty of cuts, bumps and bruises along the way at the hands of the local villains.[\n\n#2. Dangerous In Love (1987) [7 hours] Read by Bernard Cribbins\nDetective Constable Davies has two things on his mind: Jemma Duval, the beautiful, black social worker, and 'Lofty' Brock, the harmless old eccentric who drowned in the canal. To prove that Lofty's death was no accident, our hero sets out to do some undercover detective work. He soon discovers that something sinister is going on. Something that requires intuition, dedication, brilliant deduction - and a timely blow with a blunt instrument!\n\n#3. Dangerous By Moonlight (1993) [8 hours] Read by Gregory Yorke\nLeslie Thomas' third novel featuring Dangerous Davies, who this time pursues a gang of petty cheque-thieves and is injured in a case of mistaken identity. While recuperating, he's hired to investigate a murder 15 years before, and this moonlighting is the start of a series of outlandish adventures.\n\n#4. Dangerous And The Lonely Heart (1998.) [9 hours 24 mins] Read by Gregory Yorke\nDangerous Davies has retired from the Metropolitan Police and set up an office in North London in order to carry on as a private eye. The murder of a woman who answers lonely hearts advertisements,and the disappearance of a young girl student, bring him as just about much work as he can handle.\n\nPlease be aware that these rare recordings are all from old cassette tapes, thus the sound quality is not pristine, but they are reasonably hiss free and clear.\nNo CD or eDownload versions are available to my knowledge. (I have improved the sound quality of books 3 and 4 since the last time these were posted.)\nThis fun and heartwarming British mystery series is one of my all-time favorites.\n\nI'm sad at the passing of this, one of my favorite authors, Leslie Thomas who died at the age of 83 this year.\nI'm uploading this series again, in commemoration of him and for those who missed it previously.\nLeslie Thomas was an immensely popular author with a huge gift for storytelling and a wonderful sense of humour.\n &lt;a href=&quot;\nhttp://www.mirror.co.uk/news/real-life-stories/obituary-author-leslie-thomas-died-3509802&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mirror.co.uk/news/real-life-stories/obituary-author-leslie-thomas-died-3509802&lt;/a&gt;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:fa3fcb40becbdd9a0bbb5e2021f05c876de40096","amp;dn":"The+Complete+Dangerous+Davies+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3fcb40becbdd9a0bbb5e2021f05c876de40096","infoHashBuffer":{"type":"Buffer","data":[250,63,203,64,190,203,221,154,11,187,94,32,33,240,92,135,109,228,0,150]},"announce":[],"urlList":[]}}