{"title":"Henri-Georges Clouzot - Le Corbeau (1943)","uid":3555941,"size":1469584333,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa44a1b2677c4aa95157392a3fb127b1443dd685&amp;dn=Henri-Georges+Clouzot+-+Le+Corbeau+%281943%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"IggyPop","files":5,"time":1163329684,"description":"Le Corbeau\nDirected By : Henri-Georges Clouzot\nYear : 1943\nLanguage : French\nSubtitles : English\n\n\n\nFile Name .............: Le Corbeau (Henri-Georges Clouzot, 1943).avi\nFile Size (in bytes) ..: 1,464,494,080 bytes\nRuntime (# of frames) .: 01:31:27 (164451 frames)\n\nVideo Codec ...........: DivX 5.0\nFrame Size ............: 608x448 () [=] [=1.357]\nFPS ...................: 29.971\nVideo Bitrate .........: 1935 kb/s\nBits per Pixel ........: 0.237 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[N-VOP]...[]...[]\n\nAudio Codec ...........: 0x2000(AC3, Dolby Laboratories, Inc) AC3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 192 kb/s [1 channel(s)] CBR audio\nInterleave ............: 33 ms\nNo. of audio streams ..: 1\n\n\n\n\\&quot;Beware! I see all and tell all.\\&quot; So quoth the Raven, the pen name of the mysterious writer of poison pen letters that has plagued a small town in France with suspicion, fear and anxiety. Since this film was made by a Frenchman under a German controlled studio during Nazi occupied France in 1943, there is a subtext not necessarily explicit in the film itself, but nonetheless pervades its very essence. In Le Corbeau, Dr. Remy Germain becomes a victim when letters start circulating that accuse him of having an affair with a married woman and of being an abortionist. Both of these accusations are false but do contain half-truths, and it is the unfortunate tendency for groups of people, usually motivated by fear, to assume the worst. Furthermore, Germain is an outsider, in that he refuses to participate in gossip and avoids social clicks, which ironically makes him a target. Soon he will find himself under suspicion and alienated. Since virtually every member of the community has some skeleton in their closet, they would much rather turn their ire on the accused than risk having their own affairs aired by The Raven. And so the drama escalates to a crisis where Clouzot does not even spare the victim of blame. By assuming a position of detachment, Germain has turned a blind eye and thereby contributing to ignorance which only provides fuel for the Raven and the lies and deceit spread like a plague.             - IMDB\n\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde. \n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\t\t\t\twww.freakyflicks.tk\n\n\\\\\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\\\\\&amp;#039;","torrent":{"xt":"urn:btih:fa44a1b2677c4aa95157392a3fb127b1443dd685","amp;dn":"Henri-Georges+Clouzot+-+Le+Corbeau+%281943%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa44a1b2677c4aa95157392a3fb127b1443dd685","infoHashBuffer":{"type":"Buffer","data":[250,68,161,178,103,124,74,169,81,87,57,42,63,177,39,177,68,61,214,133]},"announce":[],"urlList":[]}}