{"title":"My Name is Bill W. DVD ISO","uid":5196590,"size":4338194432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:faea03d66c6577860875adb635da60d9cd2059da&amp;dn=My+Name+is+Bill+W.+DVD+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Huggybaby","files":-1,"time":1259950599,"description":"Here is the DVD of My Name is Bill W. This was a made for TV movie starring one of my favorite actors, James Woods, as Bill Wilson, the founder of Alcoholics Anonymous. In 1989 he won an Emmy for &quot;Outstanding Lead Actor in a Miniseries or a Special&quot; for the role.\n\nIt also stars JoBeth Williams as Lois 'Lo' Wilson, James Garner in a small role as Dr. Robert 'Dr. Bob' Holbrook Smith, and Gary Sinise as Ebby, Bill's best friend.\n\nThe other torrent out there is stuck at 97%. I don't know why the seeders for that don't let the swarm finish it, but screw them, I'm upping this one.\n\nThis DVD is 100% full quality, no compression applied. It's English with French and Spanish subtitles. I had to remove the extras to get the movie to fit on one single layer DVDR. Dual layers are just too damn expensive IMO and the extras aren't worth it.\n\nI used CloneDVD and AnyDVD to get the job done, so this is Region Free and CSS Free. Burn the ISO with IMGBurn or CDBurnerXP and you should be good to go. Or mount it with Daemon Tools or Virtual Clone Drive or similar and watch it on your PC.\n\nIf you want a 700 MB avi, there's a well seeded torrent out there already.\n\nI hope this helps my Friends of Bill here at holiday time.\n\nFrom http://www.rottentomatoes.com/m/my_name_is_bill_w/:\n\nSynopsis: James Woods gives an unforgettably moving Emmy-winning performance as Bill Wilson, the cofounder of Alcoholics Anonymous, in director Daniel Petrie's poignant true story that chronicles one man's heroic struggle against alcohol addiction. Bill is a WWI veteran with a doting wife, Lois (JoBeth Williams), who enjoys a triumphant return from the war and great success on Wall Street during the Roaring 1920s. However, the stock market crash of 1929 ruins Bill's career and sends him spiraling into a deep alcoholic depression. Bill doesn't realize the seriousness of his disease until he hits bottom and meets another recovering alcoholic, Dr. Robert Smith (James Garner). As the two men become close and relate their experiences, they come up with an interesting way to stay sober. By making friends and sharing stories with other alcoholics, Bill and Robert continue to fight the battle against alcoholism and go on to found Alcoholics Anonymous, based on their own triumphant friendship. The work these two men began continues to help millions throughout the world who are in recovery and coping--one day at a time.","torrent":{"xt":"urn:btih:faea03d66c6577860875adb635da60d9cd2059da","amp;dn":"My+Name+is+Bill+W.+DVD+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faea03d66c6577860875adb635da60d9cd2059da","infoHashBuffer":{"type":"Buffer","data":[250,234,3,214,108,101,119,134,8,117,173,182,53,218,96,217,205,32,89,218]},"announce":[],"urlList":[]}}