{"title":"Teaming with Microbes: The Organic Gardener's Guide ","uid":8261835,"size":9129220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb4482b8a6dfbc39c872c5c7c2ca55e5579dd998&amp;dn=Teaming+with+Microbes%3A+The+Organic+Gardener%27s+Guide+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363399326,"description":"Jeff Lowenfels, Wayne Lewis, &quot;Teaming with Microbes: The Organic Gardener's Guide to the Soil Food Web, Revised Edition&quot;\nISBN: 1604691131 | 2010 | EPUB\n\nThe 2011 Garden Writers of America Gold Award for Best Writing/Book proves soil is anything but an inert substance. Healthy soil is teeming with life -- not just earthworms and insects, but a staggering multitude of bacteria, fungi, and other microorganisms. When we use chemical fertilizers, we injure the microbial life that sustains healthy plants, and thus become increasingly dependent on an arsenal of artificial substances, many of them toxic to humans as well as other forms of life. But there is an alternative to this vicious circle: to garden in a way that strengthens, rather than destroys, the soil food web -- the complex world of soil-dwelling organisms whose interactions create a nurturing environment for plants. By eschewing jargon and overly technical language, the authors make the benefits of cultivating the soil food web available to a wide audience, from devotees of organic gardening techniques to weekend gardeners who simply want to grow healthy, vigorous plants without resorting to chemicals.\n","torrent":{"xt":"urn:btih:fb4482b8a6dfbc39c872c5c7c2ca55e5579dd998","amp;dn":"Teaming+with+Microbes%3A+The+Organic+Gardener%27s+Guide+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb4482b8a6dfbc39c872c5c7c2ca55e5579dd998","infoHashBuffer":{"type":"Buffer","data":[251,68,130,184,166,223,188,57,200,114,197,199,194,202,85,229,87,157,217,152]},"announce":[],"urlList":[]}}