{"title":"Ultimate Pokemon Collection!","uid":11775179,"size":1419113294,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:fb58f0a4c59997ac6a526cfffeacf6288b64d652&amp;dn=Ultimate+Pokemon+Collection%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Shinigamizzz","files":46,"time":1427253678,"description":"I have for you, ALL, MAIN games in the series, the adventuring ones with the &quot;GOTTA CATCH THEM ALL&quot; goal. From old GameBoy, all the way up to DS! No console games here, with the only exception of generation 1 + 2 ones, the 2 Pokemon Stadiums. For 2 reasons, mostly; 1) Nostalgia Passion 2) Inability to initiate trades and communication, in emulation, between GBA/DS games and their respective generation's console games.\n\nThe main dog here are the first 2 generations. Emulation is good enough now to let you trade between all 6 gameboy color games and even have them connected to N64 emulation. I did not include the emulator for trading in GameBoy (since you can use Stadium emulation for this), there is no need. You only install the N64 one, *use the transfer pack plugin* (you don't know how, search google for it, has tutorial), insert game rom and saved file with correct settings and you do whatever you want. Emulation beats normal games, here battery will never die, you can rename red save to blue and catch that version's exclusives WITHOUT need to start a new game (same applies to all same version pairs, like gold-silver, ruby-sapphire, fire red-leaf green, diamon-pearl, heart gold-soul silver), you can keep a back up save-file between stadium and gb cartridge saved games so you can manually DUPLICATE (and multiply) items or pokemon stored inside and MANY, many other interesting things, glitches, exploits, without even the need to use a cheat (which also carries a risk of faqing your poor game/system).\n\nThen, in the GBA, you can trade using the GBA Link emulator, even from the very same PC. It works. Trading works normally up until AND 3d generation of pokemon games (in emulation).\n\nIn DS, things start getting awry. I included the Desmume WiFi version, but it needs CABLED Wi-Fi connectivity to real router. And besides, Nintendo closed down the service of gen 4 wi-fi connectivity online. I can verify and confirm the following FACTS:\n1) You CANNOT trade in generation 4 in emulation.\n2) You CAN connect to WIFI and official Nintendo servers in emulation, i don't know the settings, the procedure, the details if you will, but Y.O.U C.A.N; still, there is no reason to!\n3) Only way to evolve trade-only evolutions, is by using 3d party programs, like POKESAV.\n4) YOU CAN ACTUALLY USE THE PAL PARK SERVICE, BY USING THE GBA BIOS AND THE ROMS/SAVES FROM GEN 3! WHICH MEANS, IN EMULATION, YOU ACTUALLY CAN TRANSFER POKEMON FROM GEN 3 TO GEN 4! (If you don't figure out how, google it, there are tutorials about).\n\nAnd the infamous gen 5, which is considered by MANY, the WORST disgrace to have ever plagued our beloved series. Black and White come from a piratebay torrent, they are already FIXED (antipiracy measures removed, experience works correctly, crashes got eliminated). It is the work of a group. I trust them, i tried their stuff, it works like a charm. Due to nintendo's aggressive stance against emulation, the patched/fixed versions of BLACK and WHITE 2 vanished from the internet. So i got their clean roms instead, found the patch and the program to apply it, and manually, *myself* fixed them. I didn't play them thoroughly, but at least, i can guarantee that EXPERIENCE WORKS CORRECTLY! Most of you are here for the generation 5 games, correct?\n\nNow the troubleshooting...\n\n1) I included the FIXED versions of Heart Gold, Soul Silver, Black 2 and White 2. WITH their respective CLEAN roms (unfixed) and individual patches (fixing, anti-piracy features removal). Why? In case i botched something up, you can manually patch them up and fix them up yourselves. So, the clean roms and antipiracy patch folders are to be left alone, they are to be tampered ONLY as a last resort.\n\n2) You can trade inbetween Generation 1 and 2 and then, using the stadium games, the transfer pack plugin, and above all, CORRECT SETTINGS! You can also trade in generation 3 on the same pc, even! And you can send generation 3 pokemon to 4, using the pal park features, GBA BIOS and once again, correct DESMUME settings! You cannot TRADE in GEN 4 and 5. You can connect to WIFI, it is a bitch, now it is closed anyway, you don't need to stress over it anyway.\n\n3) To remedy the inability to trade, use cheat codes for encountering pokemon and make eggs out of them to get legit ones, use POKESAV or similar editors, rename the saved game to switch gameplay between different versions of the same game (pairs presented above), and so on. Use google search and cheat listing sites to find everything you want.\n\n4) Legendaries and events. Yes, you get those in emulation, too! Just search for the appropriate cheat code! Also, events like Arceus one (gives one out of three legendaries for gift in soul silver), have codes for completing them multiple times (so you can get ALL rewards). There are codes for ALL events and giveaways, search well and miss none!\n\n5) Google is your friend. As well as tutorials from emulation sites! Don't be afraid to search! You can find ANYTHING!\n\nGood luck, happy gaming! Being a master with 251 pokemon and 251 moves was kinda easy... I pity you modern youngsters, you have to gather almost 1000! Try not to burn something in the process while trying hard, kay?!? :P","torrent":{"xt":"urn:btih:fb58f0a4c59997ac6a526cfffeacf6288b64d652","amp;dn":"Ultimate+Pokemon+Collection%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb58f0a4c59997ac6a526cfffeacf6288b64d652","infoHashBuffer":{"type":"Buffer","data":[251,88,240,164,197,153,151,172,106,82,108,255,254,172,246,40,139,100,214,82]},"announce":[],"urlList":[]}}