{"title":"An Idiot Abroad Season 1, 2 + Extras HDTV DVDRip TSV","uid":6811793,"size":6809375783,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb5da426267aa7711cb66700691055dd0bfd4ce4&amp;dn=An+Idiot+Abroad+Season+1%2C+2+%2B+Extras+HDTV+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":3,"uploader":"TSV","files":-1,"time":1321058311,"description":"All 8 episodes from both seasons 1 and 2 + Meet Karl Pilkington, A Guide To... etc. Please seed at a decent speed.\n\n\n\n\n\n\n\nAn Idiot Abroad charts Pilkington's reactions when visiting the New Seven Wonders of the World, as well as the situations he's placed in and cultural differences and idiosyncrasies in the countries he visits. It was stated by the show's producers that Pilkington has no prior warning about these situations. Gervais commented: &quot;This is a (more real) documentary than most others you'll ever see on television. We don't plan it, he doesn't know what's going to happen.&quot;\n\nThough the New Seven Wonders of the World include the Colosseum in Rome, this is not one of Pilkington's destinations because Ricky and Stephen thought that Rome would have been too familiar to what he is used to; instead he visits the Great Pyramids in Egypt. The show was originally going to be called Karl Pilkington's Seven Wonders, but, as noted in the show, not many people would actually know who Karl Pilkington is, hence the more comical title.\n\nThe second series premise shows Karl having to do &quot;The Bucket List&quot; (things to do before you die). Pilkington agreed to do a second series on the condition that he was to choose what he would do and that he got proper toilets. However to make sure the series stayed interesting, Ricky Gervais and Stephen Merchant went behind Karl's back and have made surprises for him to make him hate it even more, so like the first series he had no idea about what was going to happen.\n\nIn series 2, he visits more places than he did in the first series after making several detours through the course of the series.\n\nThe ongoing theme of both the television series and the book is that Karl Pilkington indicates he has no interest in global travel and so Merchant and Gervais make him travel, for the purposes of the documentary, while they themselves stay in London and monitor his progress. There is an official podcast, to accompany the programme and book of An Idiot Abroad.\n\nIn October 2011 on Gervais' online blog he commented on the idea of the show coming back for a Christmas special but said it would only happen if he could come up with a good enough idea in time for a Christmas broadcast.\n","torrent":{"xt":"urn:btih:fb5da426267aa7711cb66700691055dd0bfd4ce4","amp;dn":"An+Idiot+Abroad+Season+1%2C+2+%2B+Extras+HDTV+DVDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5da426267aa7711cb66700691055dd0bfd4ce4","infoHashBuffer":{"type":"Buffer","data":[251,93,164,38,38,122,167,113,28,182,103,0,105,16,85,221,11,253,76,228]},"announce":[],"urlList":[]}}