{"title":"Rushmore - Original Motion Picture Soundtrack (1999)","uid":3698887,"size":71087254,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fbcf4188dc3310ff613ca20442a408217dfc38bf&amp;dn=Rushmore+-+Original+Motion+Picture+Soundtrack+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Temptation","files":22,"time":1180305944,"description":"Rushmore - Original Motion Picture Soundtrack (1999)\n\nMusic : Soundtrack : MP3/192Kbps\n\n\n[b]REVIEWS[/b] - [url=http://www.amazon.com/Rushmore-Original-Motion-Picture-Soundtrack/dp/B00000HZPY]Amazon.com[/url]\n\n[b]Editorial Review[/b]\nThe Rushmore soundtrack manages to pleasantly skirt the line between sentiment and sentimentality with a nuanced, eminently listenable combo of score and song. The songs mostly blend raw, adolescent urges and insecurity with an awkward grace. Though composed primarily of popular music from the 1960s, none of the selections is a hit of the expected Big Chill variety. In fact, compiler Randall Poster proves himself a &amp;#039;60s pop connoisseur, including little-known gems such as Cat Stevens&amp;#039;s buoyant, hummable &quot;Here Comes My Baby&quot; (covered by Yo La Tengo on Fakebook) and the Who &amp;#039;s revved-up, intentionally silly proto-opera &quot;A Quick One While He&amp;#039;s Away.&quot; The bossa nova folk-pop of Unit 4+2&amp;#039;s &quot;Concrete &amp; Clay&quot; is lovingly contrasted by the Creation&amp;#039;s blistering, feedback-enhanced hit-that-never-was &quot;Making Time.&quot; Devo founder Mark Mothersbaugh&amp;#039;s incidental music is nothing short of delightful, but the Rugrats composer clearly comes by whimsy easily. The intriguing thing about Mothersbaugh&amp;#039;s score--seven snippets from which are sprinkled throughout the disc--is that it complements the archival tunes while combining Beethoven-lite flourishes and jazzy instrumentation with percolating mod keyboards. Like the film itself, this soundtrack is an inspired, left-field effort, and it&amp;#039;s difficult to plot out its many charms. --[i]Mike McGonigal[/i]  \n\n------\n\n[b][i]User Reviews[/i][/b]\n\n[b]***** One of the Most Diverse and Pleasing Soundtracks Ever,[/b] November 12, 2004\nBy [b]K. Brown &quot;El Rudo Lucky Pierre!&quot;[/b] (Walnut, Ca USA)\n\nFirst off, the first track on this album, &quot;Hardest Geometry Problem in the World&quot; is what turned me on to the awesome musical talent of former Devo member Mark Mothersbaugh. It&amp;#039;s a short but beautiful instrumental piece that introduces the film. Call me crazy, but the brief instrumentals by Mothersbaugh by themselves are worth the price of this CD. But in case you aren&amp;#039;t into Mark Mothersbaugh, the rest of this CD is top notch, no filler!\n\nThis is a diverse collection of songs ranging from mellow to mid-energizing, ranging from folk-pop artists like Chad &amp; Jeremy and Cat Stevens to classic British rock The Who &amp; The Kinks. I could probably best describe this as a great rainy day album. This collection is simultaneously relaxing and stirring. Tracks like &quot;Concrete and Clay&quot; pick up the relaxed pace, but never go into a Ramones-paced overdrive (though Ramones are great for when you want to jumpstart your senses!)\n\nLastly, if you have never seen the movie &quot;Rushmore,&quot; it is a must see!\n\n***** [b]great, unique soundtrack for a great, unique movie,[/b] September 16, 2006\nBy [b]Scott B. Saul &quot;opinionated, yet truthful, mu...[/b] (COOPER CITY, FL USA) \n\nThis accomplishes what a great soundtrack should do... enhance the movie, offer an interesting collection of songs and intoduce the listener to works that you would not have otherwise listen to.\n\nThe theme of the music seems to be 60&amp;#039;s style, very Brittish pop.\n\n&quot;Making Time&quot; by the Creation is a raw, punkish song from a group long forgotten. It is used commercially all of the time and often misunderstood for the Kinks. Its a rock and roll rave up that will rock your stereo off.\n\nChad and Jeremy&amp;#039;s &quot;Summer Wind&quot; is a wimpy, melodic chestnut that you would never own up to liking but is a certain guilty pleasure.\n\nCat Stevens has 2 cuts. &quot;The Wind&quot; a fine short song on many compilations and the more interesting &quot;Here comes my baby&quot; which was done before he established his trademark sound.\n\n&quot;Oh Yoko&quot; is a song that never did anything for me until I saw it used in the movie. Oh the power of film!\n\n&quot;Ooh La la&quot; by the Faces is an uplifting song which is used in the same manner in the close of the film.\n\nThere are in between ditties by former Devo man Mark Mothersbaugh. This music was more effective in the film than listening to it in your car.\n\nOverall, this soundtrack is a top notch soundtrack.\n\nAnother good soundtrack by the same director is the &quot;Royal Tannenbaums&quot; \n\n\nTrack Listing\n-------------\n 1. Mark Mothersbaugh - Hardest Geometry Problem In The World             (1:29)\n 2. Creation - Making Time                                                (2:55)\n 3. Unit 4 Plus 2 - Concrete &amp; Clay                                       (2:17)\n 4. The Kinks - Nothing In This World Can Stop Me Worrin&amp;#039; Bout That Girl  (2:42)\n 5. Mark Mothersbaugh - Sharp Little Guy                                  (0:42)\n 6. Mark Mothersbaugh - The Lad With The Silver Button                    (0:59)\n 7. Chad &amp; Jeremy - A Summer Song                                         (2:37)\n 8. Mark Mothersbaugh - Edward Appleby (In Memoriam)                      (0:42)\n 9. Cat Stevens - Here Comes My Baby                                      (2:54)\n10. The Who - A Quick One While He&amp;#039;s Away                                 (8:41)\n11. Mark Mothersbaugh - Snowflake Music From Bottlerocket                 (0:37)\n12. Mark Mothersbaugh - Piranhas Are A Very Tricky Species                (1:19)\n13. Zoot Sims - Blinuet                                                   (4:34)\n14. Mark Mothersbaugh - Friends Like You, Who Needs Friends               (1:23)\n15. Yves Montand - Rue St Vincent                                         (3:22)\n16. Mark Mothersbaugh - Kite Flying Society                               (1:18)\n17. Cat Stevens - The Wind                                                (1:39)\n18. John Lennon - Oh Yoko                                                 (4:16)\n19. The Faces - Ooh La La                                                 (3:28)\n20. Mark Mothersbaugh - Margaret Yang&amp;#039;s Theme                             (1:16)\n\nTotal Playing Time: 49:21 (min:sec)\nTotal Size        : 67,8 MB (71.084.752 bytes)\n\n-----\n\nEnjoy this great rocking soundtrack from a great movie.  This is the official soundtrack and is unfortunately missing some tracks, including a great track by the Rolling Stones which plays in a very memorable scene in the film.  I have found 3 songs that were not part of the official soundtrack and will be uploading them as a separate torrent for those who want them. \n\nAs always, please buy the CD if you enjoy this album and can afford to do so.  And please help keep this alive by seeding.  \n\nFor fans of Wes Anderson, watch out for the Collector&amp;#039;s Edition of [b]The Royal Tenenbaums[/b] soundtrack, which I&amp;#039;ll be uploading next.\n","torrent":{"xt":"urn:btih:fbcf4188dc3310ff613ca20442a408217dfc38bf","amp;dn":"Rushmore+-+Original+Motion+Picture+Soundtrack+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbcf4188dc3310ff613ca20442a408217dfc38bf","infoHashBuffer":{"type":"Buffer","data":[251,207,65,136,220,51,16,255,97,60,162,4,66,164,8,33,125,252,56,191]},"announce":[],"urlList":[]}}