{"title":"Culinary Tea:  More Than 150 Recipes Steeped in Tradition from A","uid":6923785,"size":6791023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc72504297619a13363e9e26a9caa00faa4133b6&amp;dn=Culinary+Tea%3A++More+Than+150+Recipes+Steeped+in+Tradition+from+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1325364740,"description":"Cynthia Gold, Lise Stern, &quot;Culinary Tea: More Than 150 Recipes Steeped in Tradition from Around the World&quot;\n\nRunning Press | 2010 | ISBN: 0762437731 | 288 pages | EPUB | 6.48 mb\n\nVeteran tea experts Gold and Stern share over 150 unusual recipes certain to delight creative cooks, from novice to connoisseur. The medical benefits of tea-drinking are legion, yet, while &quot;Health can pique an interest,&quot; the authors know that &quot;taste can create a devotee.&quot; What better way for a devotee to express their ardor for the leaf than to cook with it? Equally at home on coffee table or countertop, this handsome book begins with a thorough history and &quot;flavor profile&quot; of every tea type, visiting estates in Japan, India, Sri Lanka, and points between. Readers are then immersed in methodology (brewing the perfect cup; best storage techniques; best teapot types for the desired outcome) before the recipes begin. Broken into sections, stand-out offerings include Seared Tuna with Tea Spice Crust, Spinach and Ricotta Scallop Rotollo with Ceylon Beurre Blanc, and other promising entrÃƒÂ©es, but it's the desserts, such as Earl Grey Cream Tea Cake and Flourless Keemun-Cherry Chocolate Torte, that are truly divine. Rounding out the book's usability factor is a glossary, detailed index, and source guide complete with international tea vendors willing to overnight fresh leaves to the reader's\n\n\n","torrent":{"xt":"urn:btih:fc72504297619a13363e9e26a9caa00faa4133b6","amp;dn":"Culinary+Tea%3A++More+Than+150+Recipes+Steeped+in+Tradition+from+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc72504297619a13363e9e26a9caa00faa4133b6","infoHashBuffer":{"type":"Buffer","data":[252,114,80,66,151,97,154,19,54,62,158,38,169,202,160,15,170,65,51,182]},"announce":[],"urlList":[]}}