{"title":"The Blues Magoos - Psychedelic Lollipop (1966) + Electric Comic","uid":8626009,"size":423134045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fca08601c55b8a0ea39cf7b32e1928fb90e89951&amp;dn=The+Blues+Magoos+-+Psychedelic+Lollipop+%281966%29+%2B+Electric+Comic+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":null,"files":41,"time":1372512653,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nThe Blues Magoos - Psychedelic Lollipop (1966) + Electric Comic Book (1967) [1999]\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes large folder.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nA Bronx-based quintet, denizens of the Greenwich Village club scene, and originally known by the tres psychedelic moniker the Bloos Magoos, the Blues Magoos made their mark in 1967 with a rousing, full-throttle, sub-literate, psychedelic garage rock single, &quot;(We Ain't Got) Nothin' Yet.&quot; It wasn't a spacy, pretentious song, nor did it contain vague attempts at hippie-era mysticism, but was rather the kind of simple, direct, infectious rock &amp; roll you could imagine five guys from the Bronx making. With a snotty lead vocal from keyboardist Ralph Scala and some wild-eyed guitar playing courtesy of then-16-year-old Emil &quot;Peppy&quot; Thielheim, America made the Magoos' debut single a Top Ten hit, sending it to number five in January 1967. With this impetus, the band used all the trappings of marketable psychedelia to promote their second album, Psychedelic Lollipop, which, despite the title's obvious pandering, was a fairly cool chunk of psych-garage rock. The album featured trebly, crappy-sounding guitars, a whiny Farfisa organ, yelled vocals, and a rhythm section that shelved nuance for thudding simplicity. But as the psychedelic era gave way to the hippie era's extended raga-rock proclivities, by 1969, the Magoos seemed anachronistic. Amazingly, they released a third album, with an equally absurd title, Electric Comic Book, that wasn't nearly as bad as it sounds. The original Magoos split up in 1969, but Thielheim couldn't resist beating a dead horse and led a mediocre blues-rock version of the band into 1972.\n\nTaken from: &lt;a href=&quot; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:d9ftxqr5ldte~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:d9ftxqr5ldte~T1&lt;/a&gt;\n\nAll Music Album Excerpt for Psychedelic Lollipop:\n\n... Psychedelic Lollipop is a solid and precious gem from the Nuggets vaults, the difference between this and other one-hit artists being that you can play the entire album repeatedly, quite an accomplishment coming from the era of the hit single. That such a tremendous smash like &quot;(We Ain't Got) Nothin' Yet&quot; kicks the whole thing off is just an added bonus.\n\nRead entire review here: &lt;a href=&quot;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:wzfpxql5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:wzfpxql5ld6e&lt;/a&gt;\n\nAll Music Album Excerpt for Electric Comic Book:\n\n... this recording will please those who can't get enough of this style of music. All due respect to bands like the Lyres who have spent a lifetime re-creating this sound, there's no point in going there when you can listen to this and hear the real thing.\n\nRead entire review here: &lt;a href=&quot;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3zfqxql5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3zfqxql5ld6e&lt;/a&gt;\n\nTrack List:\n\n01. We Ain't Got Nothin' Yet\n02. Love Seems Doomed\n03. Tobacco Road\n04. Queen Of My Nights\n05. I'll Go Crazy\n06. Gotta Get Away\n07. Sometimes I Think About\n08. One By One\n09. Worried Life Blues\n10. She's Coming Home\n\n11. Pipe Dream\n12. There's A Chance We Can Make It\n13. Life Is Just A Cher o' Bowlies\n14. Gloria\n15. Intermission\n16. Albert Common Is Dead\n17. Summer Is The Man\n18. Baby, I Want You\n19. Let's Get Totether\n20. Take My Love\n21. Rush Hour\n22. That's All Folks\n","torrent":{"xt":"urn:btih:fca08601c55b8a0ea39cf7b32e1928fb90e89951","amp;dn":"The+Blues+Magoos+-+Psychedelic+Lollipop+%281966%29+%2B+Electric+Comic+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca08601c55b8a0ea39cf7b32e1928fb90e89951","infoHashBuffer":{"type":"Buffer","data":[252,160,134,1,197,91,138,14,163,156,247,179,46,25,40,251,144,232,153,81]},"announce":[],"urlList":[]}}