{"title":"Lucinda Williams - Down Where The Spirit Meets The Bone (2014)","uid":13183249,"size":641952973,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fcd01dcd7fec94fac11315eb62a6fdec0006078d&amp;dn=Lucinda+Williams+-+Down+Where+The+Spirit+Meets+The+Bone+%282014%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"pucholoco","files":43,"time":1452343891,"description":"Lucinda Williams - Down Where The Spirit Meets The Bone (2014) [2CD] \r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 615 Mb \r\n                       Full Artwork @ 300 dpi (jpg) -&gt; 29 Mb\r\n\r\n\r\nLucinda Williams has never had a comfortable relationship with the commercial side of the recording industry – her battles with various major labels in the '90s are the stuff of legend – and even though she had a reasonably stress-free partnership with Lost Highway Records from 2001's Essence to 2011's Blessed, it seems fitting that she would eventually decide to strike out on her own. 2014's Down Where the Spirit Meets the Bone is Williams' first album for her own label, Highway 20 Records, giving her complete control over the creative process, and though this doesn't always sound like an album where Williams is challenging herself musically, for a musician who has long believed in the power of nuance, this is an album that feels unerringly right for her, full of sweet and sour blues, acoustic pondering, and simple, bare bones rock &amp; roll that slips into the groove with Williams' literate but unpretentious songs.\r\n\r\nLove and its infinite complexities have always been some of Williams' favorite themes, and they certainly pop up a few times on this double set, but she has just as much (if not more) to say about the world around her this time out, setting one of her father's poems to music as she pleads for &quot;Compassion,&quot; spits venom at a dilettante from the perspective of someone living in poverty in &quot;East Side of Town,&quot; recounts a real-life tale of justice gone wrong in &quot;West Memphis,&quot; and issues a call to action on &quot;Temporary Nature (Of Any Precious Thing).&quot; Williams also gives herself plenty of room to stretch out on Down Where the Spirit Meets the Bone, offering 20 songs spread out over two discs and running an hour-and-44-minutes, and despite its epic scale, there seems to be precious little filler here; if these songs sometimes take a while to find their spiritual and emotional center, they invariably get there, and the powerful litanies of &quot;Wrong Number,&quot; &quot;Something Wicked This Way Comes,&quot; and &quot;Big Mess&quot; mesh comfortably with the implacable rhythm of this music.\r\n\r\nWilliams produced the sessions with Tom Overby and Greg Leisz, and the performances are steeped in deep, satisfying grooves, with Pete Thomas and Davey Faragher of Elvis Costello's Imposters holding down the rhythm on most tracks and Leisz, Stuart Mathis, Bill Frisell, and Tony Joe White among the guitarists who lend their magic to these recordings. Down Where the Spirit Meets the Bone is the sound of Lucinda Williams doing what she does best and letting her muse do the speaking, and if that sounds simple, in practice it is and it isn't – this music is taut and soulful, but also a document of one woman baring her spirit and mind to the world, which has always been the case with her best music, and if this isn't a masterpiece, it's as pure, straightforward, and compelling as anything she's done since Essence.\r\n\r\n\r\n-------------------------------------------------------------------------\r\nTracklist:\r\n-------------------------------------------------------------------------\r\n\r\nDisc 1\r\n01 - Compassion\r\n02 - Protection\r\n03 - Burning Bridges\r\n04 - East Side of Town\r\n05 - West Memphis\r\n06 - Cold Day in Hell\r\n07 - Foolishness\r\n08 - Wrong Number\r\n09 - Stand Right by Each Other\r\n10 - It's Gonna Rain\r\n\r\nDisc 2\r\n01 - Something Wicked This Way Comes\r\n02 - Big Mess\r\n03 - When I Look at the World\r\n04 - Walk On\r\n05 - Temporary Nature (of Any Precious Thing)\r\n06 - Everything but the Truth\r\n07 - This Old Heartache\r\n08 - Stowaway in Your Heart\r\n09 - One More Day\r\n10 - Magnolia\r\n\r\n*2014 Highway 20 Records | H2 001\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks !\r\n\r\n\r\n\r\nLucinda Williams - Blessed (2011) [2CD] [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/13163588/Lucinda_Williams_-_Blessed_%282011%29_%5B2CD%5D_%5BEAC-FLAC%5D","torrent":{"xt":"urn:btih:fcd01dcd7fec94fac11315eb62a6fdec0006078d","amp;dn":"Lucinda+Williams+-+Down+Where+The+Spirit+Meets+The+Bone+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcd01dcd7fec94fac11315eb62a6fdec0006078d","infoHashBuffer":{"type":"Buffer","data":[252,208,29,205,127,236,148,250,193,19,21,235,98,166,253,236,0,6,7,141]},"announce":[],"urlList":[]}}