{"title":"Foundations of Coding: Compression, Encryption, Error Correction","uid":13241537,"size":2721523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd402fb8edfb5245fdd756d157409e49f09996d0&amp;dn=Foundations+of+Coding%3A+Compression%2C+Encryption%2C+Error+Correction&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"NoctDeath","files":2,"time":1453059859,"description":"Title: Foundations of Coding: Compression, Encryption, Error Correction \r\nAuthor: Jean-Guillaume Dumas, Jean-Louis Roch, Eacute;ric Tannier, Sébastien Varrette \r\nFormat: PDF \r\nHardcover: 376 pages \r\nPublisher: Wiley; 1 edition (January 27, 2015) \r\nLanguage: English \r\nISBN: 9781118881446 \r\n\r\n\r\nOffers a comprehensive introduction to the fundamental structures and applications of a wide range of contemporary coding operations\r\n\r\nThis book offers a comprehensive introduction to the fundamental structures and applications of a wide range of contemporary coding operations. This text focuses on the ways to structure information so that its transmission will be in the safest, quickest, and most efficient and error-free manner possible. All coding operations are covered in a single framework, with initial chapters addressing early mathematical models and algorithmic developments which led to the structure of code. After discussing the general foundations of code, chapters proceed to cover individual topics such as notions of compression, cryptography, detection, and correction codes. Both classical coding theories and the most cutting-edge models are addressed, along with helpful exercises of varying complexities to enhance comprehension. \r\n\r\n- Explains how to structure coding information so that its transmission is safe, error-free, efficient, and fast\r\n- Includes a pseudo-code that readers may implement in their preferential programming language\r\n- Features descriptive diagrams and illustrations, and almost 150 exercises, with corrections, of varying complexity to enhance comprehension\r\n\r\nFoundations of Coding: Compression, Encryption, Error-Correction is an invaluable resource for understanding the various ways information is structured for its secure and reliable transmission in the 21st-century world","torrent":{"xt":"urn:btih:fd402fb8edfb5245fdd756d157409e49f09996d0","amp;dn":"Foundations+of+Coding%3A+Compression%2C+Encryption%2C+Error+Correction","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd402fb8edfb5245fdd756d157409e49f09996d0","infoHashBuffer":{"type":"Buffer","data":[253,64,47,184,237,251,82,69,253,215,86,209,87,64,158,73,240,153,150,208]},"announce":[],"urlList":[]}}