{"title":"In Search of the Ninja: The Historical Truth of Ninjutsu (2012) ","uid":9522180,"size":4590459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fde5f611ad28ec510cd4745a6770135450ff64ec&amp;dn=In+Search+of+the+Ninja%3A+The+Historical+Truth+of+Ninjutsu+%282012%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"bookzilla","files":1,"time":1390663047,"description":"Who were the real Ninja, what skills did they possess and how were they employed in warfare? \n\n Lost in modern myth, false history and general misinterpretation, the ninja have been misrepresented for many years. Recently, a desire for a more historical view has emerged and here Antony Cummins fulfils that need. In Search of the Ninja is based upon the Historical Ninjutsu Research Team's translations of the major ninja manuals and consists of genuinely new material. Here for the first time the connection of the famous Hattori family warriors with the ninja is explained. The Samurai versus ninja myth is dispelled and the realities of ninja skills are analysed. The book explores newly discovered connections to ancient Chinese manuals, lost skills and the 'hidden' philosophy that the Ninja followed. In some ways the truth is more remarkable than the fantasy. The ninja were no myth, they were an important part of the military assets of warlords for centuries and their skills were prized and paid for across the country. In Search of the Ninja is the first and only historical look at the shinobi of ancient Japan.\n\n\nepub","torrent":{"xt":"urn:btih:fde5f611ad28ec510cd4745a6770135450ff64ec","amp;dn":"In+Search+of+the+Ninja%3A+The+Historical+Truth+of+Ninjutsu+%282012%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde5f611ad28ec510cd4745a6770135450ff64ec","infoHashBuffer":{"type":"Buffer","data":[253,229,246,17,173,40,236,81,12,212,116,90,103,112,19,84,80,255,100,236]},"announce":[],"urlList":[]}}