{"title":"Things That Matter - Charles Krauthammer - Audiobook MP3","uid":10289408,"size":337008885,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fe259c880bc3ed4986e9b195965e8d739fe5b244&amp;dn=Things+That+Matter+-+Charles+Krauthammer+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1401841264,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThings That Matter: Three Decades of Passions, Pastimes and Politics\n\nWritten by: Charles Krauthammer\nNarrated by: Charles Krauthammer, George Newbern\nLength: 11 hrs and 44 mins\nFormat: Unabridged\nRelease Date:12-11-13\nProgram Type: Audiobook\n\nFrom America's preeminent columnist, named by the Financial Times the most influential commentator in the nation, the long-awaited collection of Charles Krauthammer's essential, timeless writings.\n\nA brilliant stylist known for an uncompromising honesty that challenges conventional wisdom at every turn, Krauthammer has for decades dazzled readers with his keen insight into politics and government. His weekly column is a must-read in Washington and across the country. Now, finally, the best of Krauthammer's intelligence, erudition, and wit are collected in one volume.\n\nListeners will find here not only the country's leading conservative thinker, offering a passionate defense of limited government, but also a highly independent mind whose views - on feminism, evolution, and the death penalty, for example - defy ideological convention.\n\nThings That Matter also features several of Krauthammer's major path-breaking essays - on bioethics, on Jewish destiny, and on America's role as the world's superpower - that have profoundly influenced the nation's thoughts and policies. And finally, the collection presents a trove of always penetrating, often bemused reflections on everything from border collies to Halley's Comet, from Woody Allen to Winston Churchill, from the punishing pleasures of speed chess to the elegance of the perfectly thrown outfield assist.\n\nWith a special, highly autobiographical introduction, in which Krauthammer reflects on the events that shaped his career and political philosophy, this indispensable chronicle takes the listener on a fascinating journey through the fashions and follies, the tragedies and triumphs, of the last three decades of American life.","torrent":{"xt":"urn:btih:fe259c880bc3ed4986e9b195965e8d739fe5b244","amp;dn":"Things+That+Matter+-+Charles+Krauthammer+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe259c880bc3ed4986e9b195965e8d739fe5b244","infoHashBuffer":{"type":"Buffer","data":[254,37,156,136,11,195,237,73,134,233,177,149,150,94,141,115,159,229,178,68]},"announce":[],"urlList":[]}}