{"title":"Depeche Mode - Ultra 320cbr (Big Papi) 1997","uid":9438271,"size":146733086,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe34843467582a30646fae923ba208cea90bb442&amp;dn=Depeche+Mode+-+Ultra+320cbr+%28Big+Papi%29+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1388947152,"description":"Source: 1997 CD\n\nimage\n\nBy Ilker Yucel\nFirst of all, I am a very avid fan of both Depeche Mode and Alan Wilder (as in his work both in DM and Recoil), so do not make the assumption that I am not aware of Wilder's contributions to DM's repertoire in the past. I find him to be an impressive musical talent without whom DM probably could not have survived. But now both Wilder and the band have progressed to the point where they can now do things beyond anything they did together. Second of all, this album is perhaps the most musically mature DM have ever been, even including their previous two albums &quot;Violator&quot; and &quot;Songs of Faith and Devotion.&quot; &quot;Ultra&quot; is the best album DM have ever produced. Between Martin Gore's intelligent and thoughtful songwriting, and David Gahan's soulful vocals (with some help from Martin on a few songs), this collection of songs is the album that got me into Depeche Mode and to this day remains my favorite.\n-&quot;Barrel of a Gun&quot;: The opening track is perhaps the most edgy, and ranks up there with songs like &quot;I Feel You,&quot; and &quot;Rush.&quot; The guitars are very raw and the rhythm is very pulsing. This song is the kind of song to bang your head to in a goth club. The vocals punchy and aggressive, this is one of DM's best singles.\n\n-&quot;The Love Thieves&quot;: Now this is a very sad and kinda jazzy song. It was featured in the TV show &quot;La Femme Nikita&quot; and was used very expertly to portray a brooding character. Very appropriate, and the song just fits those moods of sad solitude. The kind of song to listen to after a bitter breakup. It's sadness is the type that just might uplift your spirits...\n\n-&quot;Home&quot;: Beautiful is all I have to say about this song.\n-&quot;It's No Good&quot;: The breakthrough single. When I first heard this song, I at first thought DM was some brand new band with that Zoo-TV image that U2 cultivate in the early '90's. Not too far off, except this song revels in its dancehall beats and sonic darkness. This is the song that started my obssession with DM, and it will forever remain my second favorite song by them (next to &quot;Enjoy the Silence&quot;).\n\n-&quot;Useless&quot;: Tin Simenon's influence can be heard especially on this track, as it is very reminiscent of Curve, another band Tim has worked with. A great song.\n\n-&quot;Sister of Night&quot;: Now this song is a guilty pleasure. It is perhaps Gahan's best vocal performance on the album, and ironically it is the last song he ever performed while still under the influence of drugs. While it is wonderful that his much publicized bout with heroin is over after this song, there is still something to be said about the passion in his voice on this song.\n\n-&quot;Freestate&quot;: Another favorite of mine. The guitars are very edgy, and the use of acoustic slide is just impressive. A very underrated song that should've been a single.\n\n-&quot;The Bottom Line&quot;: Gore's other vocal on the album, and probably the closest DM will ever get to recording a country song, and it's still based in their distinguishably gothic synthesized style. A qunadary of a song, but still worthy of DM's talents.\n\n-&quot;Insight&quot;: The return of that gospel sound that made &quot;Condemnation&quot; and &quot;Get Right With Me&quot; great, trimmed down to an inspirational closer that ends the album on an upnote towards DM's future without Wilder, without Gahan's drug problems, and without the obstacles of arrogant youth. Only the clear road of musical excellence and mature progression.\n\nThe instrumental breaks, &quot;Uselink,&quot; &quot;Jazz Thieves,&quot; and the hidden track, &quot;Junior Painkiller&quot; (which can be heard in it's full version as the B-side to &quot;Barrel of a Gun&quot;) are reminiscent of the interludes from &quot;Violator,&quot; but with that atmosphere that surrounds this album with musical passion. &quot;Ultra&quot; is without a doubt the best album DM have ever released, both in terms of the songs, the music, and the band itself. This album is one of the best ever produced...period. To those who miss Alan Wilder...listen to Recoil's albums...they're also great, but don't think he made DM what it was. DM was a combination of people, and when one person leaves, they readjust the combination into something else...and that something else is this jewel of an album. &quot;Ultra&quot; Cool!","torrent":{"xt":"urn:btih:fe34843467582a30646fae923ba208cea90bb442","amp;dn":"Depeche+Mode+-+Ultra+320cbr+%28Big+Papi%29+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe34843467582a30646fae923ba208cea90bb442","infoHashBuffer":{"type":"Buffer","data":[254,52,132,52,103,88,42,48,100,111,174,146,59,162,8,206,169,11,180,66]},"announce":[],"urlList":[]}}