{"title":"WxPython Application Development Cookbook (2015) Gooner","uid":13767467,"size":9181258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff6cab0f29b4332bdc3344367bcaace1c1a35587&amp;dn=WxPython+Application+Development+Cookbook+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1457260212,"description":"WxPython Application Development Cookbook (2015) (Pdf, Epub &amp; Mobi) Gooner\r\n\r\nPublisher: Packt Publishing - ebooks Account (December 24, 2015)\r\nLanguage: English\r\nISBN-10: 1785287737\r\nISBN-13: 978-1785287732\r\n\r\nKey Features:\r\n\r\n* This book empowers you to create rich cross-platform graphical user interfaces using Python\r\n* It helps you develop applications that can be deployed on Windows, OSX, and Linux\r\n* The recipes in the book involve real-world applications, giving you a first-hand experience of the practical scenarios\r\n\r\nBook Description:\r\n\r\nwxPython is a GUI toolkit for the Python programming language built on top of the cross-platform wxWidgets GUI libraries. wxPython provides a powerful set of tools that allow you to quickly and efficiently building applications that can run on a variety of different platforms. Since wxWidgets provides a wrapper around each platform's native GUI toolkit, the applications built with wxPython will have a native look and feel wherever they are deployed.\r\n\r\nThis book will provide you with the skills to build highly functional and native looking user interfaces for Python applications on multiple operating system environments. By working through the recipes, you will gain insights into and exposure to creating applications using wxPython. With a wide range of topics covered in the book, there are recipes to get the most basic of beginners started in GUI programming as well as tips to help experienced users get more out of their applications. The recipes will take you from the most basic application constructs all the way through to the deployment of complete applications.\r\n\r\nWhat you will learn:\r\n\r\n* Create full featured user interfaces\r\n* Design and develop custom controls\r\n* Deploy and distribute wxPython applications to Windows, Macintosh OS X, Linux, and other UNIX-like environments\r\n* Handle and respond to application events\r\n* Manage and display data using grids\r\n* Interact with web services from your GUI\r\n* Use Paint events to draw custom displays\r\n* Support the display of user interfaces in multiple languages\r\n\r\nAbout the Author:\r\n\r\nCody Precord is a software engineer based in Minneapolis, MN, USA. He designs and writes systems and application software for Windows, AIX, Linux, and Macintosh OS X using primarily C++, C#, C, Perl, Bash, and Python. The constant need for working on multiple platforms naturally led Cody to the wxPython toolkit, which he has used for several years. He is the author of wxPython 2.8 Application Development Cookbook, Packt Publishing and has also contributed to the development of the wxPython library. Cody is interested in promoting cross platform development practices and improving usability in software.\r\n\r\nTable of Contents:\r\n\r\n1. wxPython Starting Points\r\n2. Common User Controls\r\n3. UI Layout and Organization\r\n4. Containers and Advanced Controls\r\n5. Data Displays and Grids\r\n6. Ways to Notify and Alert\r\n7. Requesting and Retrieving Information\r\n8. User Interface Primitives\r\n9. Creating and Customizing Components\r\n10. Getting Your Application Ready for Release","torrent":{"xt":"urn:btih:ff6cab0f29b4332bdc3344367bcaace1c1a35587","amp;dn":"WxPython+Application+Development+Cookbook+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff6cab0f29b4332bdc3344367bcaace1c1a35587","infoHashBuffer":{"type":"Buffer","data":[255,108,171,15,41,180,51,43,220,51,68,54,123,202,172,225,193,163,85,135]},"announce":[],"urlList":[]}}