{"title":"EXPLOITED COLLEGE GIRLS - Jennifer - Huge Boobs First Hard Fuck","uid":9452800,"size":488075713,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ff8d0ace5bf38b190291b4683b8595ec3212dbcb&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Jennifer+-+Huge+Boobs+First+Hard+Fuck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"beta2008x","files":1,"time":1389207211,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=kdm5k_njr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=kdm5k_njr.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=t0lre_ecg_jennifer_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=t0lre_ecg_jennifer_s.jpg&lt;/a&gt;\n\n\nAt ECG we're starting 2014 off right with a curvy coed from our favorite diploma factory. Jennifer is 20 and in addition to a huge appetite for sex, she's sporting a pair of enhanced D cups that look like they cost more than a loaded Toyota Carolla.\n\nI start with Jennifer in the bathroom doing her hair (because, obviously with big bouncy tanned D cups, you will totally be staring at her hair, right?) and she's nervous and giggly but seems to have a great attitude. She quickly reveals that she's a borderline nympho and while nervous, she's turned on and excited to shoot with me. When I see her tits I'm excited to shoot ON them, so we have that in common.\n\nWhen I finally have her peel off her panties, she's already extremely wet and when I start fingering her she quickly gets into it. It hardly takes any time at all to get her off to a huge orgasm. You guys know what comes after fingers at ECG: the blowjob. I put Jennifer on her knees and a little sucking and a little face fucking lead to a rock hard boner, which I can tell she wants to ride. Back to the bed and I fuck her right into another big O. Then doggy and another O, then cowgirl and yet another big, real orgasm for Jenn. She's got an incredible O face and it's a real pleasure watching her get there over and over, but it's got to be my turn.\n\nI put her on her knees again for the pop shot and while I'm debating whether to cover her tits or her face, things kind of happen and I end up getting both equally gluey, so another classic ECG win-win.","torrent":{"xt":"urn:btih:ff8d0ace5bf38b190291b4683b8595ec3212dbcb","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Jennifer+-+Huge+Boobs+First+Hard+Fuck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff8d0ace5bf38b190291b4683b8595ec3212dbcb","infoHashBuffer":{"type":"Buffer","data":[255,141,10,206,91,243,139,25,2,145,180,104,59,133,149,236,50,18,219,203]},"announce":[],"urlList":[]}}