{"title":"Against Me! - Discography (2001-2014) [FLAC]","uid":9505879,"size":3266420936,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff98ebb0d1bca246733e999d23d4989d7b296255&amp;dn=Against+Me%21+-+Discography+%282001-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":7,"leechers":2,"uploader":"politux","files":-1,"time":1390317123,"description":"  Against Me! - Discography (2001-2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk, Indie, Alternative\n  Source: CD, vinyl\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  \n  2001 'Crime,' As Forgiven By EP\n  2001 The Acoustic EP\n  2002 Reinventing Axl Rose\n  2002 The Disco Before The Breakdown CDS\n  2003 As the Eternal Cowboy\n  2005 Searching For A Former Clarity\n  2006 Americans Abroad!!! Against Me!!! Live in London!!!\n  2006 From Her Lips To God's Ears (The Energizer) CDS\n  2007 New Wave\n  2008 Heart Burns (Tom Gabel)\n  2009 The Original Cowboy (Demos)\n  2010 White Crosses (Limited Edition)\n  2011 Total Clarity\n  2011 Black Crosses\n  2014 Transgender Dysphoria Blues\n\n  Before becoming a full-fledged punk band, Against Me! was an acoustic solo project spearheaded by Tom Gabel, who began playing shows as a 17-year-old in Gainesville, Florida. Starting in 1997, Gabel performed as a solo act wherever anyone would have him, drawing much influence from early acoustic protest music. By 2001, he'd beefed up his sound with the help of a full band -- including guitarist James Bowman, drummer Warren Oakes, and bassist Andrew Seward -- but there would always be some anarchism and Billy Bragg in the group's raucous braggadocio. After a few initial 12&quot; and 7&quot; releases, Against Me! issued the fan favorite Reinventing Axl Rose in 2002. The underground hit blended elements of punk, folk, and country into socially conscious and impassioned anthems. Continuing their reputation of always being on the road, the musicians logged countless tour dates around the country in support of their early material.\n\n  A slightly more polished album, As the Eternal Cowboy, was released in 2003 on the indie label Fat Wreck, followed by a compilation of that album's demos titled The Original Cowboy. After the release of a DVD (We're Never Going Home) and another 7&quot;, the band returned with its most mature effort to date, 2005's Searching for a Former Clarity. A subsequent headlining tour in support of the introspective, politically aggressive album saw Against Me! proudly hitting every U.S. state, and they signed with Sire Records in December 2005. Later they issued a rough version of Searching for a Former Clarity, titled Total Clarity. They were back on the road by spring 2006, this time opening for the Alkaline Trio, and spent the summer months playing the main stage at the Warped Tour. Though the guys were officially signed to Sire's roster, they released their last indie album in the form of Americans Abroad!!! Against Me!!! Live in London!!!, a concert album recorded while on tour in London with Murder by Death.\n\n  In July 2007, the band's major-label debut -- New Wave, a decidedly more rock-oriented record produced by Butch Vig -- hit shelves. New Wave was the first album by Against Me! with no acoustic tracks; it was also their first on a major-label's tab. Reviews were generally favorable, and the band toured heavily in support of its release. By the summer of 2009, drummer Warren Oakes had officially left the group to pursue an alternate career as a restaurateur, eventually opening up a Tex-Mex eatery in Gainesville. Hot Water Music's George Rebelo joined in his place, and the revised lineup re-enlisted Butch Vig to produce the White Crosses album, which appeared in mid-2010. White Crosses debuted at 34 on the Billboard 200 and the group was prepared to launch an international tour when they cancelled a planned leg through Australia and New Zealand in September of 2010. Two months later, the band parted ways with Sire, then they prepared for some end-of-the-year shows, with Jay Weinberg sitting in for Rebelo on drums, a move that was made permanent early in 2011. That spring, the demos collection Total Clarity appeared on Fat Wreck Chords, and as Against Me! started work on a new album, they launched their own record label called Total Treble Music; that year, Gabel also opened an Elkton, Florida-based recording studio bearing the same name.\n\n  In a May 2012 interview with Rolling Stone, Gabel went public with his gender dysphoria and his plans to transition to living as a woman with the name Laura Jane Grace. Against Me! began working on a new album called Transgender Dysphoria Blues in 2012 and, a few months after the interview, the band played their first dates since Grace's news. Toward the end of the year, Weinberg left the troupe and, the following May, Against Me! announced bassist Andrew Seward had left the band. Laura Jane Grace continued working with guitarist James Bowman and the band planned to release Transgender Dysphoria Blues in 2013.","torrent":{"xt":"urn:btih:ff98ebb0d1bca246733e999d23d4989d7b296255","amp;dn":"Against+Me%21+-+Discography+%282001-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff98ebb0d1bca246733e999d23d4989d7b296255","infoHashBuffer":{"type":"Buffer","data":[255,152,235,176,209,188,162,70,115,62,153,157,35,212,152,157,123,41,98,85]},"announce":[],"urlList":[]}}