{"title":"The Confidence Gap - A Guide to Overcoming Fear and Self-Doubt","uid":8944847,"size":1950540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffed39fbc41a6f5de637407529f0e375f8b17641&amp;dn=The+Confidence+Gap+-+A+Guide+to+Overcoming+Fear+and+Self-Doubt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"livhre","files":-1,"time":1379750422,"description":"Too many of us miss out on opportunities in life because we lack self-confidence. Whether it's public speaking, taking on a leadership role, or asking someone for a date, there are situations in which we just don't feel equipped to handle the challenges we face.\n\nRuss Harris offers a surprising solution to low self-confidence, shyness, and insecurity: Rather than trying to &quot;get over&quot; our fears, he says, the secret is to form a new and wiser relationship with them. Paradoxically, it's only when we stop struggling against our fearfulness that we begin to find lasting freedom from it.\n\nDrawing on the techniques of Acceptance and Commitment Therapy (ACT), a cutting-edge form of cognitive-behavioral therapy, The Confidence Gap explains how to: \n\nFree yourself from common misconceptions about what confidence is and how to build it\nTransform your relationship with fear and anxiety\nClarify your core values and use them as your inspiration and motivation\nUse mindfulness to effectively handle negative thoughts and feelings.","torrent":{"xt":"urn:btih:ffed39fbc41a6f5de637407529f0e375f8b17641","amp;dn":"The+Confidence+Gap+-+A+Guide+to+Overcoming+Fear+and+Self-Doubt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffed39fbc41a6f5de637407529f0e375f8b17641","infoHashBuffer":{"type":"Buffer","data":[255,237,57,251,196,26,111,93,230,55,64,117,41,240,227,117,248,177,118,65]},"announce":[],"urlList":[]}}